{"Type": "", "Time": "2021-06-13", "Headline": "4 young men in Singapore had heart inflammation after Covid-19 jabs, all have recovered, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Four young men in Singapore had heart inflammation after receiving their second dose of Covid-19 vaccine.The men - aged 18 to 30 - have all recovered from myocarditis (inflammation of the heart muscle) and pericarditis (inflammation of the lining outside the heart), said the country's expert committee on the Covid-19 vaccination in a statement on Friday night (June 11). Most of the cases were reported to have occurred within a few days after the second jab.This is out of a total of six such cases reported by the Health Sciences Authority (HSA). However, the benefits of getting a Covid-19 jab outweigh the risks, said the expert committee.As a precaution, the expert panel said vaccinated people, especially adolescents and younger men, should avoid strenuous physical activity for one week after their second dose.During this period, they should seek medical attention if they develop chest pain, shortness of breath or abnormal heartbeats, it said.\"Most cases are mild, recover without the need for significant intervention and do not suffer any long-term effects, although very rarely, severe cases may result in damage to the heart muscles,\" said the expert committee.\"Our assessment is that the benefits of receiving the mRNA Covid-19 vaccines - the reduction in Covid-19 infections and severe complications even if infected - continue to outweigh the risks of vaccination.\"The four cases reported by the HSA are aged between 18 and 30, and had their symptoms a few days after receiving the second dose of an mRNA-based vaccine.Both Covid-19 vaccines in Singapore - by Pfizer-BioNtech and Moderna - use such technology.All four men have recovered or have been discharged from hospital.The expert committee added that the four cases here are at \"the upper end of the expected range of this age group, based on background incidence rates\".\"While further studies and investigations are ongoing, the currently available data suggests that there may be a very small risk of myocarditis and pericarditis after the second dose of an mRNA vaccine, particularly in young men,\" it said.The expert committee also said that heart inflammation following the second dose of the vaccine has been observed in Israel and the United States in men below 25.The risk is estimated to be at 1.6 cases per 100,000 doses in the US.It added that there has been no increased risk associated with the first dose of the vaccine, and that the condition is generally more common in men than women.In May, it was reported that 20 cases of anaphylaxis - a severe life-threatening allergic reaction - had happened in Singapore in relation to the Covid-19 vaccine.In a separate update, the HSA said cases of myocarditis and pericarditis have been reported with Covid-19 vaccines both overseas and locally.Myocarditis and pericarditis have many causes and most are due to viral infections and immunological reactions, it said, and in most cases, the inflammation is mild.The authority has received six reports of myocarditis and pericarditis, of which four were in men younger than 30 years.\"HSA will continue to monitor this potential safety issue closely,\" it added.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/4-young-men-in-singapore-had-heart-inflammation-after-covid-19-jabs-all-have-recovered", "Source": "google"}