{"Type": "", "Time": "2021-06-13", "Headline": "\n        Emotional Denmark boss Hjulmand proud of response to Eriksen situation    ", "Text": "Date published: Saturday 12th June 2021 10:14               - Samuel Bannister Denmark manager Kasper Hjulmand said he could not praise his players enough after they showed unity in the wake of the crisis of the Christian Eriksen situation in their Euro 2020 opener.Eriksen collapsed towards the end of the the first half of their match against Finland and required CPR. The game was suspended as the medics attended to the 29-year-old. More than an hour later, they resumed play after their teammate awoke and was taken to hospital.What followed on the pitch was of little significance on an emotional evening. Denmark lost 1-0 as Finland won their first ever major tournament match.The important thing for everyone involved though was knowing Eriksen’s condition, which was described as stabilising upon his admission to hospital.Hjulmand was in tears at his post-match press conference as he reflected on a day that left the football world in shock.“First of all, if it gets emotional, it’s been a tough night,” said Hjulmand. “We are all reminded of what the most important thing in life is – to have valuable relationships, people we’re close to, our family and our friends.“We have a group of players that I cannot praise enough. I couldn’t be prouder of those people who took such good care of each other.“He is one of my very dear friends. The way the players talked in the dressing room to decide to not do anything before we knew Christian was conscious and OK.”Give our social media channels a follow – we’re on Facebook, Twitter and InstagramThe circumstances were tough for Eriksen’s teammates. But according to UEFA, both teams requested to complete the game after they knew Eriksen was in a stable condition.Hjulmand shed light on the situation behind play resuming.“We had two options to play the game [today] or tomorrow at 12pm and everyone agreed to play today,” he said. “You can’t play a game with such feelings.“We tried to win. It was incredible they managed to go out and try to play the second half.“Honestly, there were players out there that were completely done. Emotionally done and emotionally exhausted.”", "Section": "", "Writers": "", "URL": "https://www.teamtalk.com/news/denmark-boss-kasper-hjulmand-proud-response-christian-eriksen", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}