{"Type": "", "Time": "2021-06-13", "Headline": "COVID: 9 community cases among 18 new cases in Singapore", "Text": "SINGAPORE – The Ministry of Health (MOH) on Saturday (12 June) confirmed 18 new COVID-19 cases in Singapore, bringing the country's total case count to 62,263.The ministry said in a press release that there are nine new community cases, with four linked to previous cases. Among them, three have already been placed on quarantine, and one was detected through surveillance. The remaining five cases are currently unlinked. This updated number of new community cases – the ministry had said there were 12 such cases in the afternoon – is because the MOH withdrew three cases after they were verified to be negative for COVID-19 upon further tests.Additionally, there are nine imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore. All nine are returning Singaporeans or Singapore permanent residents.The five unlinked cases currently are: an 18-year-old female Singaporean who is a student at SIM Global Education, and was last in school on 24 Maya 27-year-old Myanmar woman who is a foreign domestic worker.a 57-year-old Malaysian man who works as a land rigger at Jurong Port Pte Ltd (fully vaccinated) a 45-year-old female China national who is employed by Hong Ye Group as a cleaner at ION Orcharda 68-year-old Singaporean man who works as a landscape gardener at Amozonia Landscape Pte Ltd (fully vaccinated)The MOH had earlier announced that ION Orchard will be closed to the public from Saturday to 15 June for deep cleaning, following the detection of three COVID-19 cases among those working at the mall.  The first case in this cluster is a 38-year-old Indonesian man who is employed by Marina Offshore Pte Ltd as a sea crew on board tugboat MARINA ARIEL. He was confirmed to have COVID-19 infection on 11 June. The two other cases in this cluster are workplace contacts of this case. They tested positive while on quarantine and were announced on Saturday: a 40-year-old Indonesia man who is employed by Marina Offshore Pte Ltd as an engineer on board tugboat MARINA ARIELa 38-year-old Indonesian man who is employed by Marina Offshore Pte Ltd as a sea crew on board tugboat MARINA ARIELThe other linked cases are: a 35-year-old female Malaysia national who works as an administrative staff at Ces Lamination Pte Ltdan 82-year-old Singaporean woman who regularly helps out at a sundry store at 115 Bukit Merah View Market & Hawker Centre (fully vaccinated)Among the nine imported cases, six are Singaporeans and three are Singapore permanent residents who returned from India, Portugal, Russia, Thailand, the UK and US.The ministry noted that the number of new cases in the community has decreased from 129 in the week before to 32 in the past week. The number of unlinked cases in the community has also decreased from 20 in the week before to 14 in the past week. Singapore currently has 46 active COVID-19 clusters.Authorities on Thursday said that Singapore will gradually move to Phase 3 (Heightened Alert) in two steps, with one set of measures taking effect from 14 June and another from 21 June.From 14 June, the size of social gatherings allowed in Singapore will be increased to five people, up from the current limit of two persons. Dining in at food and beverage establishments, however, can only resume from 21 June provided that the COVID-19 situation remains under control.In addition, work-from-home will remain the default work arrangement in Phase 3 (Heightened Alert).With 39 more patients discharged from hospitals or community isolation facilities on Saturday, 61,838 cases – or 99.3 per cent of the total – have fully recovered from the infection.Most of the 125 hospitalised cases are stable or improving, while one of them is in critical condition in the intensive care unit.A total of 266 patients – with mild symptoms or are clinically well but still test positive – are isolated and cared for at community facilities.Apart from the 34 patients who have died from COVID-19 complications, 15 others who tested positive for the virus were determined to have died from unrelated causes, including three whose deaths were attributed to a heart attack and another four, whose deaths were attributed to coronary heart disease.Among the 87 confirmed cases reported from 6 to 12 June, 46 cases have tested positive for their serology tests, 25 have tested negative, and 16 serology test results are pending.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeRelated stories:COVID: Social gathering size can increase to 5 per group from 14 June – MTFCOVID: Dine-in at F&B places can resume at max 5 per group from 21 JuneWork-from-home remains default arrangement in Singapore's Phase 3 (HA)4 COVID ART test kits on sale at 3 Singapore pharmacies from 16 June: MTFChina's quick rollout of a law against foreign sanctions has left European and American companies shocked and facing \"irreconcilable\" compliance issues, two top business groups said Friday, despite Beijing saying the move would unlikely impact investment.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Få flere penge i hverdagen ved at samle din gæld. Indsend en ansøgning her og få et tilbud. Indfri lånet når du ønsker det.A 24-year-old man who was seen naked in public in several photos and videos circulating online has been arrested by the police.Second Minister for Education Maliki Osman has taken to Facebook to express his shock and disappointment at alleged Islamophobic remarks made by a Ngee Ann Polytechnic (NP) lecturer.Newly-crowned French Open champion Barbora Krejcikova hailed her mentor and former Wimbledon champion Jana Novotna who died in 2017, saying: \"At the end of her life, I had to be there.\"Kia ProCeed er den frække familiebil, der imponerer med klassens måske flotteste design, rå kraft og en lang udstyrsliste.What if China were to cut off the United States and Europe from access to rare minerals that are essential to electric vehicles, wind turbines and drones?The Ministry of Health (MOH) on Friday (11 June) confirmed nine new COVID-19 cases in Singapore, bringing the country's total case count to 62,245.A firebrand Pakistani scholar has been detained for making death threats against Nobel prize laureate Malala Yousafzai over her comments on marriage, officials said Friday.En elektrisk tandbørste med kunstig intelligens? Oral-B har gjort din eltandbørste endnu smartere - og din tandbørstning sjovere.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.The US Food and Drug Administration said Friday it had told Johnson & Johnson that millions of doses of Covid vaccine produced at a troubled plant can't be used because of possible contamination issues.Agnes Chow hails from a generation of Hong Kong democracy activists who cut their teeth in politics as teenagers and are now being steadily silenced by China.Bedste sikkerhed i klassen. A+ forbrug 19,2 km/l, 117-118 g/km co2. Prisen gælder indregistrering senest 30/06/2021.Not sure what to do with that pile of credits you’ve banked up over the years? How about revisiting your National Service days with these top 10 buys from the SAF eMart. As you’re probably aware, the Singapore Armed Forces (SAF) consists of young male […] The post SAF eMart Shopping Guide – Best Things to Buy With Your NS Credits appeared first on SingSaver Blog - We Compare, You Save.Brazilian President Jair Bolsonaro was fined $100 Saturday for violating Covid-19 containment measures in Sao Paulo state by failing to wear a face mask and provoking huge crowds at a motorcycle rally for supporters.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Sådan investeres i aktier på 5 minutter via din telefon.A closer look at the reasons why Nong-O Gaiyanghadao is considered one of the greatest Muay Thai fighters of all time.An unnamed bidder paid $28 million at auction Saturday for a seat alongside Jeff Bezos on board the first crewed spaceflight of the billionaire's company Blue Origin next month.High coverage, no-fuss application and early benefit payout makes this a great plan for those seeking cancer protection. As many as 1 in 4 Singaporeans could develop cancer in their lifetimes. Hence, getting a protection plan specifically for cancer may be a prudent move, especially […] The post FWD Cancer Insurance (Review): Fuss-free Plan That Pays Out At All Stages appeared first on SingSaver Blog - We Compare, You Save.Folk født 1930-1980 søges til betalte spørgeundersPresident Vladimir Putin on Friday denied a US media report that Russia is set to deliver an advanced satellite system to Iran that will vastly improve its spying capabilities.A Taiwanese court on Friday handed prison terms to a dozen former presidential security agents and airline employees over their roles in a cigarette smuggling scandal on the island two years ago.Euro 2020 was still reeling Sunday after Denmark midfielder Christian Eriksen collapsed and had to be revived by medics on the pitch during his country's defeat to Finland.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/covid-12-community-cases-21-new-cases-singapore-080643377.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}