{"Type": "", "Time": "2021-06-13", "Headline": "Soccer-Denmark's Eriksen rushed to hospital after collapsing in Euro 2020 match", "Text": "By Philip O'Connor and Jacob Gronholt-PedersenCOPENHAGEN (Reuters) -Denmark midfielder Christian Eriksen was rushed to hospital after collapsing during his side's Euro 2020 opening match with Finland and being given CPR on the pitch on Saturday, with soccer officials later saying the player was stable and awake.Eriksen collapsed suddenly in the 42nd minute of the match while running near the left touchline after a Denmark throw-in.As a hush fell over the 16,000-strong crowd, his teammates gathered around him and one appeared to stick his fingers in Eriksen's mouth to clear his airway or check he hadn't swallowed his tongue.As medics arrived on the scene and pumped Eriksen's chest, his teammates formed a ring around him. Danish broadcaster DR cut the live TV feed, instead showing aerial footage of the stadium.The 29-year-old was taken to the nearby Rigshospitalet, where he regained conciousness.\"We have been in contact with him and the players have spoken to Christian,\" said Peter Moller of the Danish Football Association.Applause broke out in the Parken stadium among both Danish and Finnish fans, when it was announced that Eriksen had regained conciousness.\"He is doing well and they are playing the match for Christian,\" Moller said.The game was initially suspended but resumed an hour and 45 minutes later, Finland claiming a 1-0 victory when striker Joel Pohjanpalo headed in on the hour with his side's only attempt of the game.A visibly drained Denmark coach Kasper Hjulmand said after the match that the players were given the option to finish the game on Saturday evening or on Sunday.\"It was more manageable to go in again and honestly just get it over with,\" Hjulmand said.Several players, including captain Simon Kjaer, were too overwhelmed by emotions to finish the game, he said.\"I completely understand that you can't play a soccer match at this level, after watching one of your best friends fight for his life,\" Hjulmand said.Later in the day, Belgian striker Romelu Lukaku, a teammate of Eriksen at soccer club Inter Milan in Italy, ran to a TV camera and shouted \"Chris, Chris, I love you\" after scoring in his side's opening match against Russian.People gathered outside bars in central Copenhagen, many in tears, while Eriksen's condition remained unclear.The crowd at the Parken stadium in Copenhagen sang the Danish national anthem and chanted \"Christian Eriksen\" while they waited for news, until word finally came through that the player had regained consciousness.(Reporting by Philip O'Connor, Jacob Gronholt-Pedersen and Stine Jacobsen; Editing by Frances Kerry, Pravin Char and Hugh Lawson)China's quick rollout of a law against foreign sanctions has left European and American companies shocked and facing \"irreconcilable\" compliance issues, two top business groups said Friday, despite Beijing saying the move would unlikely impact investment.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Få flere penge i hverdagen ved at samle din gæld. Indsend en ansøgning her og få et tilbud. Indfri lånet når du ønsker det.A 24-year-old man who was seen naked in public in several photos and videos circulating online has been arrested by the police.Second Minister for Education Maliki Osman has taken to Facebook to express his shock and disappointment at alleged Islamophobic remarks made by a Ngee Ann Polytechnic (NP) lecturer.Newly-crowned French Open champion Barbora Krejcikova hailed her mentor and former Wimbledon champion Jana Novotna who died in 2017, saying: \"At the end of her life, I had to be there.\"Prøv Niro Plug-in Hybrid og kom med på den elektriske bølge. Kør på strøm til hverdag og hybrid, når du skal langtWhat if China were to cut off the United States and Europe from access to rare minerals that are essential to electric vehicles, wind turbines and drones?The Ministry of Health (MOH) on Friday (11 June) confirmed nine new COVID-19 cases in Singapore, bringing the country's total case count to 62,245.A firebrand Pakistani scholar has been detained for making death threats against Nobel prize laureate Malala Yousafzai over her comments on marriage, officials said Friday.En elektrisk tandbørste med kunstig intelligens? Oral-B har gjort din eltandbørste endnu smartere - og din tandbørstning sjovere.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.The US Food and Drug Administration said Friday it had told Johnson & Johnson that millions of doses of Covid vaccine produced at a troubled plant can't be used because of possible contamination issues.Agnes Chow hails from a generation of Hong Kong democracy activists who cut their teeth in politics as teenagers and are now being steadily silenced by China.Bedste sikkerhed i klassen. A+ forbrug 19,2 km/l, 117-118 g/km co2. Prisen gælder indregistrering senest 30/06/2021.Not sure what to do with that pile of credits you’ve banked up over the years? How about revisiting your National Service days with these top 10 buys from the SAF eMart. As you’re probably aware, the Singapore Armed Forces (SAF) consists of young male […] The post SAF eMart Shopping Guide – Best Things to Buy With Your NS Credits appeared first on SingSaver Blog - We Compare, You Save.Brazilian President Jair Bolsonaro was fined $100 Saturday for violating Covid-19 containment measures in Sao Paulo state by failing to wear a face mask and provoking huge crowds at a motorcycle rally for supporters.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Sådan investeres i aktier på 5 minutter via din telefon.A closer look at the reasons why Nong-O Gaiyanghadao is considered one of the greatest Muay Thai fighters of all time.An unnamed bidder paid $28 million at auction Saturday for a seat alongside Jeff Bezos on board the first crewed spaceflight of the billionaire's company Blue Origin next month.High coverage, no-fuss application and early benefit payout makes this a great plan for those seeking cancer protection. As many as 1 in 4 Singaporeans could develop cancer in their lifetimes. Hence, getting a protection plan specifically for cancer may be a prudent move, especially […] The post FWD Cancer Insurance (Review): Fuss-free Plan That Pays Out At All Stages appeared first on SingSaver Blog - We Compare, You Save.Folk født 1930-1980 søges til betalte spørgeundersPresident Vladimir Putin on Friday denied a US media report that Russia is set to deliver an advanced satellite system to Iran that will vastly improve its spying capabilities.A Taiwanese court on Friday handed prison terms to a dozen former presidential security agents and airline employees over their roles in a cigarette smuggling scandal on the island two years ago.Euro 2020 was still reeling Sunday after Denmark midfielder Christian Eriksen collapsed and had to be revived by medics on the pitch during his country's defeat to Finland.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/denmarks-eriksen-given-cpr-during-170251495.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}