{"Type": "Sport", "Time": "2021-06-13", "Headline": "Perfect start for Mancini's Italy in Euro 2020 quest", "Text": "ROME: Italy capped a perfect night in the Stadio Olimpico witha Euro 2020 opening win over Turkeybut coach Roberto Mancini warned that the road was long between Rome and Wembley.A 28-match unbeaten run has put Mancini two games short of Italy's two-time world Cup winning coach Vittorio Pozzo's record of 30 unbeaten games between 1935 and 1939.\"We still have six games ahead of us. It's a long way,\" said the 56-year-old former Manchester City manager who took over in 2018 after Italy failed to qualify for the World Cup that year.Amid the euphoria veteran defender Leonardo Bonucci called for \"cool heads, humility and a down to earth\" approach while maintaining \"hearts of fire\".In front of 16,000 fans, and preceded by a glittering opening ceremony, the spark was lit for a run which Mancini hopes will end with a second European title after 1968 in London on Jul 11.Italy have the advantage of playing their Group A matches at home and next meet Switzerland in Rome on Wednesday followed by Wales four days later.For Lazio forward Ciro Immobile, the group games at home are \"pure adrenaline\" as the 31-year-old scored his first international goal in his club stadium.Merih Demiral's own goal got the ball rolling in the second half before Immobile and Lorenzo Insigne completed the victory.\"We did what we had to do, it was our duty to win the first game on front of our fans,\" said Immobile, who has scored four goals in the last five matches.\"SPINE-CHILLING\"Mancini's front-line trio of Immobile, Lorenzo Insigne and Domenico Berardi proved efficient for an Italy who are without a stand-out star striker.Italy missed out on the 2018 World Cup, and the \"Azzurri\" had not hosted an international match since the 1990 World Cup.Tenor Andrea Bocelli's rousing performance to Nessun Dorma, popularised during that world tournament, set the tone for the night.\"There was an incredible emotion before the match, it was spine-chilling,\" said Roma midfielder Leonardo Spinazzola, UEFA's man-of-the-match after his performance in his club stadium.\"Then it was a perfect match, zero goals conceded and we played great football.\"We have a strong team, an incredible mix of strength and technique.\"Berardi had a role in all three goals against Turkey, and has scored five goals in his last seven games for Italy.\"Our secret is the group,\" said Napoli's Insigne.\"No one's place is guaranteed, those who play know what to do and we put ourselves at the service of each other.\"Veteran coach Claudio Ranieri praised Mancini's style which has proved so successful in reviving the four-time world champions.\"What lucidity Mancio has, he knows how to manage emotions,\" Ranieri wrote in La Gazzetta dello Sport on Saturday.\"The first game is always the most dangerous, there is the pressure of the debut, the desire to overdo it can sometimes lead you to make mistakes, but Roberto Mancini was really good.\"He managed emotions, the tactical plan, the most delicate moments of the match with clarity.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Italy,Euro 2020,football", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/perfect-start-for-mancini-s-italy-in-euro-2020-quest-15000728", "Source": "google"}