{"Type": "", "Time": "2021-06-13", "Headline": "Singapore employers cannot require staff to disclose Covid-19 vaccination status unless necessary, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Employers here have no legal power to force staff members to disclose their Covid-19 vaccination status or demand that they get inoculated.Experts and employers noted that while vaccination is strongly encouraged in Singapore, it remains voluntary, although there are several ways people can be encouraged to get a jab.These will come more into focus as Singapore begins rolling out Covid-19 vaccinations to the wider population, with bookings open to Singaporeans aged 12 to 39 from Friday (June 11).Singapore Human Resources Institute (SHRI) president Low Peck Kem told The Straits Times that unless there is a business need, employers should not compel staff to disclose if they have had a jab or take punitive action against those who do not get inoculated or refuse to update their vaccination status.\"Even if there is a strong business need, such as needing to know in order to determine if the employee can travel for business or to deploy to higher-risk front-line facing roles, do explain clearly why the company needs to know the status and generally, most employees will comply,\" she said.Institute for Human Resource Professionals (IHRP) chief executive Mayank Parekh said that bosses should not use non-vaccination as a reason to terminate employment as there could be medical reasons for why a staff member did not get a shot.Mr Tan Wei Ming, senior associate at law firm CMS Holborn Asia, said that if employers want to keep records on vaccinated employees that contain personal data such as names, they must do so in accordance with the Personal Data Protection Act and other applicable data protection laws.\"For these reasons, companies in Singapore are unlikely to make their employees declare their vaccination status at this juncture,\" he added.WongPartnership joint head of employment practice Jenny Tsin said staff members should not face discrimination arising from their vaccination status, given that its voluntary.However, there could be circumstances that warrant a different approach, such as for jobs involving higher risk of exposure to Covid-19, she added.In this instance, it could be more justified to limit return to the workplace to only vaccinated employees.Investment bank Goldman Sachs recently ordered its employees in the United States to report their Covid-19 vaccination status as part of their plans to return to the office, AFP reported on Thursday.ST understands that Goldman Sachs is not requiring staff here to report their vaccination status, and that most are still working from home.While professional services firm EY strongly encourages its eligible staff to get vaccinated, it does not require them to declare their status given that immunisation is not mandatory, said the Singapore and Brunei managing partner Max Loh.UOB human resources head Dean Tong said the bank has been encouraging staff in critical roles to get vaccinated since the Government announced its roll-out to essential workers in the financial sector in March.ST understands that UOB does not track the vaccination status of employees.Meanwhile, Sembcorp Industries has introduced an app that provides voluntary updates on a person's vaccination status.The app, which was developed in-house, is also used to obtain online approval for essential facility visits.An Amazon spokesman said that the company's employees and associates are generally not required to declare their vaccination status, except for staff members who are travelling to Singapore from overseas.The firm also provides a cash benefit to front-line employees and associates who are paid by the hour when they get their vaccination off-site.SHRI's Ms Low and Mr Parekh from IHRP said employers can encourage immunisation by communicating the benefits to their staff as well as incentivising vaccination through means such as time off after getting the jabs and giving workers a care package.Mr Samir Bedi, Asean workforce advisory leader at EY, noted that it would not be surprising to see employers including vaccination as a pre-requisite in job descriptions in future, particularly for front-line positions that require face-to-face interactions.\"This not only protects employees and their families, but also ensures the public's safety. Employees who travel for work may also need to comply with pre-travel vaccination travel regulations,\" he said.But companies must remain inclusive and consider the needs of individuals who may not be able to get vaccinated due to health reasons, Mr Bedi said.He added: \"This requires employers to continue with precautionary safe workplace measures while ensuring equal career opportunities for all.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/singapore-employers-cannot-require-staff-to-disclose-covid-19-vaccination-status", "Source": "google"}