{"Type": "World", "Time": "2021-06-13", "Headline": "Biden urges G7 leaders to call out and compete with China", "Text": "CARBIS BAY, England: Leaders of the world's largest economies unveiled an infrastructure plan Saturday (Jun 12) for the developing world to compete with China’s global initiatives, but they were searching for a consensus on how to forcefully call out Beijing over human rights abuses.Citing China for its forced labour practices is part of President Joe Biden’s campaign to persuade fellow democratic leaders to present a more unified front to compete economically with Beijing. But while they agreed to work toward competing against China, there was less unity on how adversarial a public position the group should take.Canada, the United Kingdom and France largely endorsed Biden's position, while Germany, Italy and the European Union showed more hesitancy during Saturday's first session of the Group of Seven summit, according to two senior Biden administration officials. The officials who briefed reporters were not authorised to publicly discuss the private meeting and spoke on condition of anonymity.The communique that summarises the meeting's commitments was being written and the contents would not be clear until it was released when the summit ended Sunday. White House officials said late Saturday that they believed that China, in some form, could be called out for “nonmarket policies and human rights abuses”.In his first summit as president, Biden made a point of carving out one-on-one-time with various leaders, bouncing from French president Emmanuel Macron to German chancellor Angela Merkel to Italian prime minister Mario Draghi as well as Japan's Yoshihide Suga and Australia's Scott Morrison, a day after meeting with British Prime Minister Boris Johnson as if to personally try to ward off memories of the chaos that his predecessor would often bring to these gatherings.Macron told Biden that collaboration was needed on a range of issues and told the American president that “it’s great to have a US president part of the club and very willing to cooperate”. Relations between the allies had become strained during the four years of Donald Trump's presidency and his “America first” foreign policy.Merkel, for her part, downplayed differences on China and the Nord Stream 2 pipeline which would transport natural gas from Russia to Germany, bypassing Ukraine.“The atmosphere is very cooperative, it is characterised by mutual interest,\" Merkel said. \"There are very good, constructive and very vivid discussions in the sense that one wants to work together.”White House officials have said Biden wants the leaders of the G7 nations — the US, Britain, Canada, France, Germany, Japan and Italy — to speak in a single voice against forced labour practices targeting China's Uyghur Muslims and other ethnic minorities. Biden hopes the denunciation will be part of a joint statement to be released Sunday when the summit ends, but some European allies are reluctant to split so forcefully with Beijing.China had become one of the more compelling sublots of the wealthy nations' summit, their first since 2019. Last year’s gathering was cancelled because of COVID-19, and recovery from the pandemic is dominating this year's discussions, with leaders expected to commit to sharing at least 1 billion vaccine shots with struggling countries.The allies also took the first steps in presenting an infrastructure proposal called “Build Back Better for the World”, a name echoing Biden's campaign slogan. The plan calls for spending hundreds of billions of dollars in collaboration with the private sector while adhering to climate standards and labour practices.It's designed to compete with China’s trillion-dollar “Belt and Road Initiative” which has launched a network of projects and maritime lanes that snake around large portions of the world, primarily Asia and Africa. Critics say China's projects often create massive debt and expose nations to undue influence by Beijing.Britain also wants the world’s democracies to become less reliant on the Asian economic giant. The UK government said Saturday’s discussions would tackle “how we can shape the global system to deliver for our people in support of our values\", including by diversifying supply chains that currently heavily depend on China.Not every European power has viewed China in as harsh a light as Biden, who has painted the rivalry with China as the defining competition for the 21st century. But there are some signs that Europe is willing to impose greater scrutiny.Before Biden took office in January, the European Commission announced it had come to terms with Beijing on a deal meant to provide Europe and China with greater access to each other’s markets. The Biden administration had hoped to have consultations on the pact.But the deal has been put on hold, and the European Union in March announcedsanctions targeting four Chinese officialsinvolved with human rights abuses in Xinjiang. Beijing responded with penalties on several members of the European Parliament and other Europeans critical of the Chinese Communist Party.Biden administration officials see an opportunity to take concrete action to speak out against China’s reliance on forced labour as an “affront to human dignity\".While calling out China in the G7 communique would not create any immediate penalties for Beijing, one senior administration official said the action would send a message that the leaders were serious about defending human rights and working together to eradicate the use of forced labour.An estimated 1 million people or more — most of them Uyghurs — have been confined in reeducation camps in China’s western Xinjiang region in recent years, according to researchers. Chinese authorities have been accused of imposing forced labor, systematic forced birth control, torture and separating children from incarcerated parents.Beijing rejects allegations that it is committing crimes.Johnson, the summit host, also welcomed the leaders from “guest nations\" South Korea, Australia and South Africa, as well as the head of the United Nations, to the summit to “intensify cooperation between the world’s democratic and technologically advanced nations”.The leaders planned to attend a barbecue Saturday night, complete with toasted marshmallows, hot buttered rum and a performance by a sea shanty troupe.India was also invited but its delegation is not attending in person because of the severe coronavirus outbreak in the country.Biden ends the trip Wednesday by meeting in Geneva with Russia’s Vladimir Putin. The White House announced Saturday that they will not hold a joint news conference afterward, which removes the opportunity for comparisons to the availability that followed Trump and Putin’s 2018 Helsinki summit, in which Trump sided with Moscow over his own intelligence agencies. Only Biden will address the news media after the meeting.Putin, in an interview with NBC News, said the US-Russia relationship had “deteriorated to its lowest point in recent years”.He added that while Trump was a “talented” and “colourful” person, Biden was a “career man” in politics, which has “some advantages, some disadvantages, but there will not be any impulse-based movements” by the US president.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Biden,G7,China", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/biden-g7-leaders-call-out-compete-with-china-15002014", "Source": "google"}