{"Type": "", "Time": "2021-06-13", "Headline": "Thailand prioritising AstraZeneca doses for itself, says Taiwan, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.TAIPEI • Thailand is prioritising AstraZeneca Covid-19 vaccines produced in the country for itself due to the severity of the pandemic there, which has delayed deliveries to Taiwan, President Tsai Ing-wen said.Taiwan is dealing with a spike in domestic infections and only 3 per cent of its 23.5 million people have received at least one shot of vaccination so far, with millions of doses on order that have yet to arrive.\"The problem is that the goods that were supposed to have arrived in June have not,\" Ms Tsai told a Taiwanese radio station yesterday.Taiwan has ordered 10 million doses from AstraZeneca, which is mainly producing the shots in Thailand, she said.\"Now Thailand's epidemic situation is serious and they are giving priority for vaccines to be used in Thailand,\" Ms Tsai added.Thailand has reported 189,828 infections, with more than 80 per cent of the new cases and fatalities coming since April.Neither AstraZeneca nor Thai government officials immediately responded to requests for comment.Taiwan's Health Minister Chen Shih-chung told lawmakers on Tuesday that orders from AstraZeneca would be delayed by a month due to production problems at the firm's Thai plant.Taiwan received 1.24 million AstraZeneca doses donated by Japan last week, and the United States has pledged 750,000 shots, but no details have been provided on that.Ms Tsai said the government has been having \"emergency\" talks with the US and Japan to see what other vaccines they may be able to give. The President has come under pressure to do more to speed up vaccine deliveries, and yesterday expressed apologies for the infections and deaths.Mr Chen told Parliament that government-run research centre Academia Sinica has made good progress on mRNA technology and contacted Moderna about working with it on vaccines.Moderna did not immediately respond to a request for comment.Taiwan has received just 150,000 Moderna doses of more than five million on order.REUTERSJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/thailand-prioritising-astrazeneca-doses-for-itself-says-taiwan", "Source": "google"}