{"Type": "", "Time": "2021-06-13", "Headline": "Moore's header rescues Wales, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Wales 1Switzerland 1BAKU • Striker Kieffer Moore is enjoying the \"big occasion\" after heading in an equaliser, as Wales snatched a 1-1 draw against wasteful Switzerland in their Euro 2020 Group A clash at the Baku Olympic Stadium yesterday.Moore, who had a first-half opportunity expertly saved by Swiss goalkeeper Yann Sommer, guided the ball into the net on 74 minutes from a Joe Morrell delivery as he ghosted into space left by the static Swiss defence.\"It's great personally, but it's a good start for us. We would have liked to have won, but a draw from the first game puts us in a good position,\" said Moore on the BBC.\"It's never good going a goal down, but to get one back and see the game out is a big positive for us. It was tough in the heat, but it's what we expect in a hot climate being here for a week now.\"I'm enjoying it. It's a big occasion. I'm loving every second of it.\"Breel Embolo had terrorised the Welsh defence and put Switzerland ahead when he showed impressive strength to outmuscle defender Connor Roberts from a corner shortly after half-time.They also had a late goal by Mario Gavranovic correctly ruled out by the VAR (video assistant referee) for offside.The Swiss may blame themselves for not killing off the game earlier, having squandered several golden chances through Haris Seferovic in the first half and Embolo after the break.Defender Fabian Schar had tried to beat goalkeeper Danny Ward with a cheeky flick before Seferovic's 27th-minute curled shot sailed just over the bar.The forward squandered two more chances before half-time as the Swiss notched 11 attempts to Wales' two in the first half.What his teammates failed to achieve with finesse in the first half, Embolo did with sheer power and speed in the 49th minute, heading in from a corner for a deserved lead after his powerful run and shot was saved by Ward seconds earlier.\"We knew Switzerland would have a lot of the ball and that we'd have to be solid and organised defensively,\" said Wales' caretaker boss Rob Page told the BBC.\"We wanted a positive start and it feels like a win in the changing room. I'm so proud of the players for digging so deep.\"With captain Gareth Bale well-marked throughout, they gradually upped the pressure in search of an equaliser as the Swiss eased off and conceded some ground, and Moore found the space to beat Sommer with a glancing header.\"I feel a bit of frustration with the result, as we had the chances for the second goal but didn't take them,\" Embolo said on uefa.com.\"Perhaps we were too passive after the first goal. We deserved the win, but it turned out to be a draw and that's a pity.\"We have to take the positives, rest, focus on the next game and bring the good things from this match into the next.\"Italy lead the group after their impressive 3-0 victory over Turkey in the tournament opener on Friday and will host the Swiss in Rome in their second game on Wednesday.Wales stay in the Azerbaijan capital to face the Turks on the same day.REUTERSIt was tough in the heat, but it's what we expect in a hot climate being here for a week now. I'm enjoying it. It's a big occasion. I'm loving every second of it.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/moores-header-rescues-wales", "Source": "google"}