{"Type": "", "Time": "2021-06-13", "Headline": "South-east Asia's race to vaccinate more than 650 million people, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Last year, several countries in South-east Asia were among the poster boys for their deft handling of the Covid-19 pandemic.Now, they are battling a resurgence in infections.Case numbers are still low compared with other hot spots like India and Brazil but governments in the region, nonetheless, have initiated lockdowns and ramped up testing.They have also accelerated vaccination drives by rolling out public awareness campaigns, ironing out flaws in previous policies, scaling up inoculation efforts and dangling incentives - all of which are part of the effort to protect their people and open up economies battered by the pandemic.\"South-east Asia has done a wonderful job during the first wave of the pandemic but people later lowered their guard and this gave the virus free rein on the ground. The governments have tried to ramp up their vaccination campaigns but - with the exception of Singapore - they still have a long way to go,\" Dr Abhishek Rimal, Kuala Lumpur-based regional emergency health coordinator at the International Federation of Red Cross and Red Crescent Societies (IFRC), told The Straits Times.Singapore is the region's leader in vaccinations, with more than 30 per cent of the population fully vaccinated. It has allowed children from the age of 12 to be vaccinated and month-long restrictions put in place to combat a spike in cases look set to be eased from Monday (June 14).But many of Singapore's neighbours are hampered by slow progress in their vaccination campaigns, with most having inoculated less than 10 per cent of their population.Several countries are now working to speed up their efforts.Indonesia, which has given out more than 30 million shots - mostly to the elderly, health workers and those with disabilities - is allowing old folk to turn up at any designated facility for a jab without prior registration, while offering shots to the young if they help bring in those aged 60 years and above to be inoculated.Indonesia has asked China for technical assistance to help it become a regional production hub for the Covid-19 vaccine.\nA man receiving a dose of vaccine during a mass inoculation exercise in Banda Aceh, Indonesia, on June 9, 2021. PHOTO: EPA-EFE\nMalaysia, which is in the throes of another lockdown after registering record-high cases and deaths in recent weeks, has opened up mega vaccination centres to inoculate up to 8,000 people a day.Vaccine trucks have been deployed to areas where people might find it difficult to get to an immunisation centre.Close to four per cent of Malaysia's 32 million population - a total of 1.22 million - are now fully vaccinated.The government has said that 16 million vaccine doses will arrive in the next two months.Thailand has set a target to administer 500,000 shots per day from this month, five times more than the previous daily average. It has announced plans to open up the tourist resort of Phuket next month for fully vaccinated tourists.The Thai government has also allowed private and local administrative organisations to procure Covid-19 vaccines, but only through approved agencies such as the National Vaccine Institute and the Thai Red Cross Society.\nHealth workers attending to a woman about to receive a dose of Covid-19  vaccine at an inoculation centre set up at the Central Eastville shopping mall in Bangkok, on June 7, 2021. PHOTO: BLOOMBERG\nCambodia has mobilised the army to inoculate its citizens and the one millionth and two millionth vaccinated person received 10 million riel (S$3,244) each.Laos has banned the purchase of Covid-19 vaccines by private entities in order to stave off complaints about inequality in the country, while neighbouring Vietnam - once a model for its successful handling of the pandemic - has appealed to the public to donate to a Covid-19 vaccine fund as it struggles to contain a new wave of the disease.\nAn electrical box painted with a Covid-19 theme in Hanoi on June 7, 2021. About 16 electrical boxes in Ha Ba Trung district have been painted this way to promote hand washing and the wearing of face masks. PHOTO: EPA-EFE\nThe Philippines has extended vaccinations to children aged between 12 and 15, while private firms are allowed to procure vaccines for their workers without having to donate part of their shipments to the government.In order to help shore up confidence in the vaccine programme and tackle the issue of vaccine hesitancy, local celebrities were roped in to get their jabs publicly, while some cities and towns went a step further by offering everything from cattle to land to property in a bid to entice people to get their jabs.\nRegistration booths set up inside a cinema complex for citizens preparing to be vaccinated in San Juan City, Metro Manila, on June 1, 2021. PHOTO: REUTERS\nDespite their best efforts to bump up vaccinations, countries in the region still face various challenges, chief among them getting enough vaccines.It is estimated that the region will need some 1.4 billion doses to cover the entire population of more than 650 million, leading some analysts to caution that this would be a formidable challenge since the global demand for vaccines outstrips supply.Some countries are only receiving their first stocks now. Impoverished Timor Leste received its first batch of vaccine doses from Covax, comprising 24,000 AstraZeneca doses, only on April 5 this year. It received 100,000 doses of Sinovac vaccines from China on June 7.Covax is the World Health Organisation-led initiative to secure vaccine supplies for developing countries.\"Slow vaccine roll-out will have critical consequences for South-east Asia,\" Ms Hanh Nguyen and Mr James Borton wrote in the international intelligence publication, Geopolitical Monitor, on May 25.\"For a region that relies heavily on export and tourism, the low vaccine coverage plus closed border policy mean countries will not open their economies soon, thus missing out on economic opportunities as the West gradually reopens.\"Another issue has been competition between the West and China as Beijing expands its vaccine diplomacy in the region. Apart from sales, China has donated vaccines to Cambodia, Laos, Myanmar and the Philippines.\"As of right now, China stands out in its vaccine diplomacy efforts - a move that the global superpower will likely use to solidify its position within the South-east Asia,\" Mr Shazwan Mustafa Kamal, a senior associate with political risk and public consultancy Vriens & Partners, told ST.The United States has recently announced plans to donate seven million doses to South Asia and South-east Asia, while the G-7 is expected to donate one billion vaccine doses to the world's poorest countries. But Mr Shazwan said Western powers appeared to be playing catch-up to China.\"South-east Asian nations will be in an unenviable position in balancing China's overtures as well as their relationships with the US,\" he added.Dr Kevin S.Y. Tan, a visiting senior fellow at ISEAS-Yusof Ishak Institute who has written about vaccination efforts in the region, said it is too early to ascertain whether China's vaccine diplomacy will lead to any significant geopolitical shifts.\"If the pandemic drags on and if other vaccine sources are somehow limited, there will naturally be a greater dependency on Chinese vaccines. Such vaccine dependency, in the long run, may bolster China's standing among South-east Asian nations,\" he told ST.Logistics is another major issue in a region marked by vastly different terrain, from modern cities to rural mountainous areas and far-flung islands.This comes on top of poor infrastructure and limited resources to distribute and store vaccines, a significant roadblock for rapid deployment, especially for last-mile delivery.Experts fear that if this is not overcome, the overall recovery for any nation will be difficult and time-consuming, especially if coronavirus variants lead to new waves of infection.As such, it is important that governments ensure the necessary infrastructure is in place, said ISEAS' Dr Tan, especially for vaccines with ultra-cold storage requirements.\"But if such infrastructure is unrealistic at the moment, then a decision to use more 'logistically friendly' vaccines may be a pragmatic and feasible approach,\" said Dr Tan, who is also an adjunct faculty member at the School of Global Studies in Thailand's Thammasat University.Another issue that could hamper the region's success in tamping down the virus is the ongoing civil unrest in Myanmar. Political instability in the country has exacerbated an already overstretched healthcare system and observers fear it is in danger of turning into the next Covid-19 epicentre.Locals told ST the military government has set up vaccination centres but not many people are turning up for the jabs due to high distrust of the military junta's capability to administer, store and transport the vaccines.Many have also refused to get vaccinated as a mark of protest against the junta.\"I am not getting vaccinated as I do not trust the quality and efficacy of the vaccines after the coup. My friends and family pretty much hold the same view as well,\" investment analyst Ye Salween, 31, told ST.The jury is still out on whether the region can be fully vaccinated by the end of next year, a target set for the world by British Prime Minister Boris Johnson.IFRC's Dr Abhishek described it as an \"ambitious\" target while ISEAS' Dr Tan said to do so would require a \"colossal effort\" which can be achieved, but only with support from foreign countries.\"This is because not a single country in the region has come up with its own home-made vaccine against Covid-19 so far. As a region, we are still dependent on supplies and support from sources beyond South-east Asia and this is a glaring vulnerability that may need to be addressed,\" said Dr Tan.Professor Paul Tambyah, president of the Asia-Pacific Society of Clinical Microbiology and Infection, said locally manufactured vaccines were \"the obvious answer\", noting that middle-income countries such as Indonesia, Thailand and Malaysia had well established vaccine-manufacturing capacity.\"The key has to be the Trips waiver,\" he told ST, referring to the World Trade Organisation's (WTO) agreement on Trade-Related Aspects of Intellectual Property Rights that governs the transfer of property like movie rights or vaccine-manufacturing specifics.\"With the Trips waiver on patents, South-east Asian countries could rapidly scale up vaccine production.\"He added that, without the constraints of the patents, mass vaccination could be rolled out very quickly the way measles and polio vaccines, which were locally made, led to the virtual elimination of these diseases.As of now though, reports say Malaysia and the Philippines will experience delays in the delivery of the AstraZeneca vaccine manufactured in Thailand. That is going to exacerbate the situation in the Philippines, in particular, because some vaccination sites in the capital, Manila, have been closed due to the shortage of vaccines.Mr Jose Ma Luis Montesclaros, an associate research fellow at the S. Rajaratnam School of International Studies, has suggested that Asean should support the private sector to develop vaccine production capacity.\"I feel that expanding the supplies of vaccines is something that benefits not only the vaccine- producing/recipient countries, but the world over, given the interconnected nature of global trade and investments,\" he told ST.\"The sooner countries are able to solve the health problem, the sooner they can begin working on economic recovery,\" he added.• Allowing the elderly to go to any designated vaccination facility without prior registration.• Younger Indonesians are eligible for shots if they help bring in those aged 60 years and older to get vaccinated.• Aiming to become a regional production hub for Covid-19 vaccine.• Set up mega vaccination centres that can inoculate up to 8,000 people a day.• Deploying vaccine trucks to rural communities.• Government has pledged 16 million doses of vaccines in the next two months.• Targeting to administer 500,000 shots per day from this month, five times more than the previous daily average.• Shopping malls and supermarkets are among the 25 vaccination sites in Bangkok.• Aiming to open up Phuket for vaccinated tourists next month.• Approved vaccinations for children between the ages of 12 and 15.• Several towns and cities are offering cows, bags of rice, land and properties to entice people to get jabs.• Deploying vaccine buses to reach poorer, less accessible districts.• Residents sent text messages urging them to contribute to a Covid-19 vaccine fund.• Looking to buy Covid-19 vaccine production technology and build a plant to supply vaccines for the Covax programme.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/south-east-asia-steps-up-covid-19-vaccination-drive-as-cases-surge", "Source": "google"}