{"Type": "", "Time": "2021-06-13", "Headline": "Jho Low mounted secret lobbying campaign over 1MDB probe, US says, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.NEW YORK (BLOOMBERG) - A Malaysian financier and a former member of hiphop trio the Fugees were accused in a new indictment of illegally lobbying the Trump administration to drop an investigation tied to the 1MDB global bribery scandal and remove a Chinese dissident from the US.A federal grand jury on Thursday returned a superseding indictment against Low Taek Jho, also known as Jho Low, and Prakazrel “Pras” Michel, according to a Justice Department statement on Friday (June 11).Low and Michel’s aim was to influence then-President Donald Trump‘s Justice Department to abandon the probe of Low and others and extradite a wealthy Chinese exile who has criticised the government in Beijing. That exile has not been identified by the Justice Department, but a person familiar with the matter has said it is Guo Wengui.Both Low and Michel were charged with money-laundering conspiracy, while Michel was also accused of witness tampering and conspiring to make false statements to banks.“Pras intends to defend this case very vigorously and believes that when all of the facts are developed, a jury will conclude that this was a selective prosecution that has unfairly targeted Mr Michel and will exonerate him,” Michel’s lawyer, Benjamin Brafman, said in a statement.With Lauryn Hill and Wyclef Jean, Michel was a member of the Fugees, which had some of the biggest hits of the 1990s.Low and Michel were previously charged in 2019 with seeking to funnel millions of dollars of Low’s money into the US presidential election as legitimate campaign contributions while hiding the actual source of the funds.Prosecutors said the two men worked closely with Trump fund-raiser Elliott Broidy, who pleaded guilty last year to illegally lobbying the Trump administration to help Low squelch the 1MDB investigation and to seek the extradition of Wengui from the US Trump pardoned Broidy in January.The back-channel efforts failed. Low was indicted in 2018 on charges of conspiring to launder billions of dollars embezzled from 1MDB.Low has denied wrongdoing and is considered a fugitive. Low had been a little-known financier who built an US$8 billion (S$10 billion)  fund intended to develop the Malaysian economy. Authorities in the US and Malaysia allege he spent the pilfered money on parties, sports cars, luxury properties and priceless art.Goldman Sachs Group admitted its role in the scheme and its Malaysia unit pleaded guilty last year, agreeing to pay more than US$2.3 billion in financial penalties, the largest in American history for violating US anti-bribery laws. The unit was sentenced on Wednesday, triggering a US$1.26 billion payment for Goldman Sachs for the remaining fines.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/jho-low-mounted-secret-lobbying-campaign-over-1mdb-probe-us-says", "Source": "google"}