{"Type": "", "Time": "2021-06-13", "Headline": "Jho Low mounted secret lobbying campaign over 1MDB probe, says US | The Star", "Text": "\n                    Saturday, 12 Jun 2021\n                WASHINGTON D.C. (Bloomberg): Fugitive Malaysian financier Low Taek Jho and a former member of hip-hop trio the Fugees were accused in a new indictment of illegally lobbying the Trump administration to drop an investigation tied to the 1Malaysia Development Bhd (1MDB) global bribery scandal and remove a Chinese dissident from the United States.A federal grand jury on Thursday (June 10) returned a superseding indictment against Low, better known as Jhow Low, and Prakazrel \"Pras” Michel, according to a Justice Department statement Friday (June 11).Low and Michel’s aim was to influence then-president Donald Trump‘s Justice Department to abandon the probe of Low and others and extradite a wealthy Chinese exile who has criticised the government in Beijing. That exile has not been identified by the Justice Department, but a person familiar with the matter has said it is Guo Wengui.Both Low and Michel were charged with money-laundering conspiracy, while Michel was also accused of witness tampering and conspiring to make false statements to banks.\"Pras intends to defend this case very vigorously and believes that when all of the facts are developed, a jury will conclude that this was a selective prosecution that has unfairly targeted Mr Michel and will exonerate him, ” Michel’s lawyer, Benjamin Brafman, said in a statement.With Lauryn Hill and Wyclef Jean, Michel was a member of the Fugees, which had some of the biggest hits of the 1990s.Low and Michel were previously charged in 2019 with seeking to funnel millions of dollars of Low’s money into the US presidential election as legitimate campaign contributions while hiding the actual source of the funds.Prosecutors said the two men worked closely with Trump fundraiser Elliott Broidy, who pleaded guilty last year to illegally lobbying the Trump administration to help Low squelch the 1MDB investigation and to seek the extradition of Wengui from the United States.Trump pardoned Broidy in January.The back-channel efforts failed. Low was indicted in 2018 on charges of conspiring to launder billions of dollars embezzled from 1MDB. Low has denied wrongdoing and is considered a fugitive. Low had been a little-known financier who built a US$8bil (RM32.86bil) fund intended to develop the Malaysian economy. Authorities in the United States and Malaysia allege he spent the pilfered money on parties, sports cars, luxury properties and priceless art.Goldman Sachs Group Inc admitted its role in the scheme and its Malaysia unit pleaded guilty last year, agreeing to pay more than US$2.3bil (RM9.45bil) in financial penalties, the largest in American history for violating US anti-bribery laws. The unit was sentenced Wednesday (June 9), triggering a US$1.26bil (RM5.18bil) payment for Goldman Sachs for the remaining fines.- Bloomberg\nTags / Keywords:\nJhow Low\n                                                                ,\n                                                                                                1MDB\n                                                                ,\n                                                                                                United States\n                                                                ,\n                                                                                                Trump\n                                                                ,\n                                                                                                China\n                                                                ,\n                                                                                                Extradite\n                                                                ,\n                                                                                                Justice Department\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\n", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/news/world/2021/06/12/jho-low-mounted-secret-lobbying-campaign-over-1mdb-probe-says-us", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}