{"Type": "", "Time": "2021-06-13", "Headline": "SIM student and Ion Orchard cleaner among 5 unlinked Covid-19 cases on Saturday, Singapore News - AsiaOne", "Text": "A 45-year-old woman who is employed by Hong Ye Group as a cleaner at Ion Orchard is one of five unlinked cases among the nine new Covid-19 community infections reported on Saturday (June 12).The Chinese national was asymptomatic, and her infection was detected when she went for a Covid-19 test directed by her employer on Friday.Her test result came back positive on the same day. Her serology test result is pending.Cleaners from Hong Ye Group were also linked to earlier Covid-19 cases at Changi Business Park.Ion Orchard has been closed since Saturday for cleaning and disinfection after a number of cases were linked to the mall.It will reopen at 7am on Wednesday.The Ministry of Health on Saturday also revised its community case count from 12 to nine, as three cases were verified negative after further tests were done.Another unlinked case is an 18-year-old student at SIM Global Education.She was last in school on May 24. She developed a runny nose and fever on Thursday and sought medical treatment at a general practitioner (GP) clinic the next day, when she underwent both an antigen rapid test (ART) and a polymerase chain reaction (PCR) test.She was immediately isolated when her ART result came back positive.Her PCR test result also came back positive on Friday. Her serology test result is pending.A 68-year-old Singaporean man who had completed both vaccine doses is also among the unlinked cases.He works as a landscape gardener at a firm called Amozonia Landscape and developed a runny nose and cough on Tuesday.He sought medical treatment at a GP clinic on Friday.He went for an ART and a PCR test — both came back positive. His serology test result is pending.The two remaining unlinked cases are a 27-year-old maid from Myanmar, and a 57-year-old Malaysian man who works as a land rigger at Jurong Port. He was asymptomatic and his infection was detected as part of the rostered routine testing regime.One of the four linked cases — an 82-year-old Singaporean woman — was detected through surveillance.She regularly helps out at a sundry store at 115 Bukit Merah View Market and Hawker Centre.There were also nine imported cases.Six of them are Singaporeans and the remaining three are permanent residents.There were no new cases in workers' dormitories.The 18 new cases reported take Singapore's total Covid-19 tally to 62,263.There are 125 cases in hospital, with one in the intensive care unit.Another 266 cases are being isolated and cared for at community facilities.There have been 34 deaths in Singapore from Covid-19 complications, while 15 who tested positive died of other causes.This article was first published in The Straits Times. Permission required for republication. ", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/singapore/sim-student-and-ion-orchard-cleaner-among-5-unlinked-covid-19-cases-saturday", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}