{"Type": "", "Time": "2021-06-13", "Headline": "Britain’s Queen Elizabeth hosts Biden at G-7 reception, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.ST BLAZEY, ENGLAND (REUTERS) - Britain’s Queen Elizabeth met US President Joe Biden under the canopy of the world’s largest indoor rainforest on Friday (June 11) as she hosted a reception for leaders of the Group of Seven (G-7) richest nations, who are holding a three-day summit.The 95-year-old monarch was joined by the other senior members of the British royal family, with son and heir Prince Charles and his wife Camilla and grandson Prince William and his wife Kate also present.It was their first major public event together since the funeral in April of Prince Philip, the queen’s husband of more than seven decades.At the reception, held at the Eden Project, whose distinctive bubble-like Biomes house thousands of plant varieties, the queen met Biden as US President for the first time. He is 13th American leader she has met during her record-breaking 69-year reign.“Joe and I are both looking forward to meeting the queen,” Biden’s wife Jill, who joined him at the Eden Project event, had said on Thursday. “That’s an exciting part of the visit for us.”They are also due to have tea with the monarch at Windsor Castle on Sunday after the summit has concluded.Following a photocall with the queen, Prince Charles addressed the G-7 leaders about his Sustainable Markets Initiative, which aims to involve business and private sector investment in government efforts to combat climate change.“The fight against this terrible pandemic provides, if ever one was needed, a crystal-clear example of the scale, and sheer speed, at which the global community can tackle crises when we combine political will with business ingenuity and public mobilization,” the prince told them.“Ladies and gentlemen, we are doing it for the pandemic. So if you don’t mind me saying so, we must also do it for the planet,” said Charles, 72, who has spent much of his life campaigning on environmental issues.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/britains-queen-elizabeth-hosts-reception-for-g-7-leaders", "Source": "google"}