{"Type": "", "Time": "2021-06-13", "Headline": "Euro 2020: Belgian minds on Denmark's Christian Eriksen after easy win over Russia, Latest Football News - The New Paper", "Text": "Belgium eased to a 3-0 win over Russia in their Euro 2020 opener on Sunday morning (June 13, Singapore time), but considered the victory a footnote after the frightening collapse of Denmark playmaker Christian Eriksen, a long-time teammate and friend of several Belgian players.Eriksen, 29, was earlier rushed to hospital after collapsing during the match with Finland and being given CPR on the pitch, with football officials later saying the player was stable and awake much to the relief of teammates and fans.“There were many tears before the match (against Russia). It was very hard for me to focus,” striker Romelu Lukaku, who plays with Eriksen at Italian champions Inter Milan, told Belgian TV.\n“It was very hard for me, for (Eriksen’s former Tottenham Hotspur teammates) Toby (Alderweireld), for Jan (Vertonghen), for Nacer (Chadli). We know him very well.“I am happy with our victory, but our thoughts are with Christian. I just hope he gets well soon. His children need him, we need him.”Lukaku had already paid tribute to his clubmate during the match, after scoring the first of his two goals, calling out “Chris, stay strong, mate, love you”, to a television camera.Defender Alderweireld, who played with Eriksen for years at Ajax Amsterdam and then Spurs, said the team heard the news during their final preparations in their hotel.“A few of us consider Eriksen a friend. Nobody was thinking about our match at all”, he said.Belgium coach Roberto Martinez said his team had given a solid performance, despite failing to score more goals in a tepid second half.“There were many positive aspects, especially to keep a clean sheet, he said.“It’s very important to be able to defend with the ball, to impose ourselves so we can hurt the opposition. We did that. We could have scored a few more, but it was very important to keep a clean sheet.”On the downside, Martinez said Euro 2020 was already over for Leicester City defender Timothy Castagne, who left the game in the first half with a broken eye socket after a clash of heads with Daler Kuzyayev.“He will probably need surgery, he will be out of the Euros”, he added. – REUTERSGet The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/sports/football/euro-2020-belgian-minds-denmarks-christian-eriksen-after-easy-win-over-russia", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}