{"Type": "", "Time": "2021-06-13", "Headline": "Biden urges G-7 leaders to call out and compete with China", "Text": "Keep up to speed at a glance with the Top 10 daily storiesKeep up to speed at a glance with the Top 10 daily storiesCARBIS BAY, England (AP) — Leaders of the world's largest economies unveiled an infrastructure plan Saturday for the developing world to compete with China’s global initiatives, but they were searching for a consensus on how to forcefully to call out Beijing over human rights abuses.Citing China for its forced labor practices is part of President Joe Biden’s campaign to persuade fellow democratic leaders to present a more unified front to compete economically with Beijing. But while they agreed to work toward competing against China, there was less unity on how adversarial a public position the group should take.Canada, the United Kingdom and France largely endorsed Biden's position, while Germany, Italy and the European Union showed more hesitancy during Saturday's first session of the Group of Seven summit, according to two senior Biden administration officials. The officials who briefed reporters were not authorized to publicly discuss the private meeting and spoke on condition of anonymity.The communique that summarizes the meeting's commitments was being written and the contents would not be clear until it was released when the summit ended Sunday. White House officials said late Saturday that they believed that China, in some form, could be called out for “nonmarket policies and human rights abuses.”In his first summit as president, Biden made a point of carving out one-on-one-time with various leaders, bouncing from French president Emmanuel Macron to German chancellor Angela Merkel to Italian prime minister Mario Draghi as well as Japan's Yoshihide Suga and Australia's Scott Morrison, a day after meeting with British Prime Minister Boris Johnson as if to personally try to ward off memories of the chaos that his predecessor would often bring to these gatherings.Macron told Biden that collaboration was needed on a range of issues and told the American president that “it’s great to have a U.S. president part of the club and very willing to cooperate.” Relations between the allies had become strained during the four years of Donald Trump's presidency and his “America first” foreign policy.Merkel, for her part, downplayed differences on China and the Nord Stream 2 pipeline which would transport natural gas from Russia to Germany, bypassing Ukraine.“The atmosphere is very cooperative, it is characterized by mutual interest,\" Merkel said. \"There are very good, constructive and very vivid discussions in the sense that one wants to work together.”White House officials have said Biden wants the leaders of the G-7 nations — the U.S., Britain, Canada, France, Germany, Japan and Italy — to speak in a single voice against forced labor practices targeting China's Uyghur Muslims and other ethnic minorities. Biden hopes the denunciation will be part of a joint statement to be released Sunday when the summit ends, but some European allies are reluctant to split so forcefully with Beijing.China had become one of the more compelling sublots of the wealthy nations' summit, their first since 2019. Last year’s gathering was canceled because of COVID-19, and recovery from the pandemic is dominating this year's discussions, with leaders expected to commit to sharing at least 1 billion vaccine shots with struggling countries.The allies also took the first steps in presenting an infrastructure proposal called “Build Back Better for the World,” a name echoing Biden's campaign slogan. The plan calls for spending hundreds of billions of dollars in collaboration with the private sector while adhering to climate standards and labor practices.It's designed to compete with China’s trillion-dollar “Belt and Road Initiative,” which has launched a network of projects and maritime lanes that snake around large portions of the world, primarily Asia and Africa. Critics say China's projects often create massive debt and expose nations to undue influence by Beijing.Britain also wants the world’s democracies to become less reliant on the Asian economic giant. The U.K. government said Saturday’s discussions would tackle “how we can shape the global system to deliver for our people in support of our values,” including by diversifying supply chains that currently heavily depend on China.Not every European power has viewed China in as harsh a light as Biden, who has painted the rivalry with China as the defining competition for the 21st century. But there are some signs that Europe is willing to impose greater scrutiny.Before Biden took office in January, the European Commission announced it had come to terms with Beijing on a deal meant to provide Europe and China with greater access to each other’s markets. The Biden administration had hoped to have consultations on the pact.But the deal has been put on hold, and the European Union in March announced sanctions targeting four Chinese officials involved with human rights abuses in Xinjiang. Beijing responded with penalties on several members of the European Parliament and other Europeans critical of the Chinese Communist Party.Biden administration officials see an opportunity to take concrete action to speak out against China’s reliance on forced labor as an “affront to human dignity.\"While calling out China in the G-7 communique would not create any immediate penalties for Beijing, one senior administration official said the action would send a message that the leaders were serious about defending human rights and working together to eradicate the use of forced labor.An estimated 1 million people or more — most of them Uyghurs — have been confined in reeducation camps in China’s western Xinjiang region in recent years, according to researchers. Chinese authorities have been accused of imposing forced labor, systematic forced birth control, torture and separating children from incarcerated parents.Beijing rejects allegations that it is committing crimes.Johnson, the summit host, also welcomed the leaders from “guest nations\" South Korea, Australia and South Africa, as well as the head of the United Nations, to the summit to “intensify cooperation between the world’s democratic and technologically advanced nations.”The leaders planned to attend a barbecue Saturday night, complete with toasted marshmallows, hot buttered rum and a performance by a sea shanty troupe.India was also invited but its delegation is not attending in person because of the severe coronavirus outbreak in the country.Biden ends the trip Wednesday by meeting in Geneva with Russia’s Vladimir Putin. The White House announced Saturday that they will not hold a joint news conference afterward, which removes the opportunity for comparisons to the availability that followed Trump and Putin’s 2018 Helsinki summit, in which Trump sided with Moscow over his own intelligence agencies. Only Biden will address the news media after the meeting.Putin, in an interview with NBC News, said the U.S.-Russia relationship had “deteriorated to its lowest point in recent years.”He added that while Trump was a “talented” and “colorful” person, Biden was a “career man” in politics, which has “some advantages, some disadvantages, but there will not be any impulse-based movements” by the U.S. president.___Lemire reported from Plymouth, England. Associated Press writers Danica Kirka and Sylvia Hui in Falmouth, England, contributed to this report.China's quick rollout of a law against foreign sanctions has left European and American companies shocked and facing \"irreconcilable\" compliance issues, two top business groups said Friday, despite Beijing saying the move would unlikely impact investment.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Du kan få flere penge i hverdagen, hvis du samler dine lån og kreditter i et samlelån. Indsend en uforpligtende ansøgning i dag.A 24-year-old man who was seen naked in public in several photos and videos circulating online has been arrested by the police.Second Minister for Education Maliki Osman has taken to Facebook to express his shock and disappointment at alleged Islamophobic remarks made by a Ngee Ann Polytechnic (NP) lecturer.Newly-crowned French Open champion Barbora Krejcikova hailed her mentor and former Wimbledon champion Jana Novotna who died in 2017, saying: \"At the end of her life, I had to be there.\"Kia ProCeed er den frække familiebil, der imponerer med klassens måske flotteste design, rå kraft og en lang udstyrsliste.What if China were to cut off the United States and Europe from access to rare minerals that are essential to electric vehicles, wind turbines and drones?The Ministry of Health (MOH) on Friday (11 June) confirmed nine new COVID-19 cases in Singapore, bringing the country's total case count to 62,245.A firebrand Pakistani scholar has been detained for making death threats against Nobel prize laureate Malala Yousafzai over her comments on marriage, officials said Friday.En elektrisk tandbørste med kunstig intelligens? Oral-B har gjort din eltandbørste endnu smartere - og din tandbørstning sjovere.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.The US Food and Drug Administration said Friday it had told Johnson & Johnson that millions of doses of Covid vaccine produced at a troubled plant can't be used because of possible contamination issues.Agnes Chow hails from a generation of Hong Kong democracy activists who cut their teeth in politics as teenagers and are now being steadily silenced by China.Bedste sikkerhed i klassen. A+ forbrug 19,2 km/l, 117-118 g/km co2. Prisen gælder indregistrering senest 30/06/2021.Not sure what to do with that pile of credits you’ve banked up over the years? How about revisiting your National Service days with these top 10 buys from the SAF eMart. As you’re probably aware, the Singapore Armed Forces (SAF) consists of young male […] The post SAF eMart Shopping Guide – Best Things to Buy With Your NS Credits appeared first on SingSaver Blog - We Compare, You Save.Brazilian President Jair Bolsonaro was fined $100 Saturday for violating Covid-19 containment measures in Sao Paulo state by failing to wear a face mask and provoking huge crowds at a motorcycle rally for supporters.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Sådan investeres i aktier på 5 minutter via din telefon.A closer look at the reasons why Nong-O Gaiyanghadao is considered one of the greatest Muay Thai fighters of all time.An unnamed bidder paid $28 million at auction Saturday for a seat alongside Jeff Bezos on board the first crewed spaceflight of the billionaire's company Blue Origin next month.High coverage, no-fuss application and early benefit payout makes this a great plan for those seeking cancer protection. As many as 1 in 4 Singaporeans could develop cancer in their lifetimes. Hence, getting a protection plan specifically for cancer may be a prudent move, especially […] The post FWD Cancer Insurance (Review): Fuss-free Plan That Pays Out At All Stages appeared first on SingSaver Blog - We Compare, You Save.Folk født 1930-1980 søges til betalte spørgeundersPresident Vladimir Putin on Friday denied a US media report that Russia is set to deliver an advanced satellite system to Iran that will vastly improve its spying capabilities.A Taiwanese court on Friday handed prison terms to a dozen former presidential security agents and airline employees over their roles in a cigarette smuggling scandal on the island two years ago.Euro 2020 was still reeling Sunday after Denmark midfielder Christian Eriksen collapsed and had to be revived by medics on the pitch during his country's defeat to Finland.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/biden-urge-g-7-leaders-060006601.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}