{"Type": "CommentaryCommentary", "Time": "2021-06-13", "Headline": "Commentary: A precious chance to see my ageing mother in Germany after being separated by COVID-19", "Text": "The pandemic has been particularly cruel to families separated by distance – with borders closed and travel tedious and costly, some never have the chance to hold their loved ones. Greg Lim-Lange is glad he had the chance.SINGAPORE: It is not normal for a son to ask: “When is my mother going to die?” or “Will I be able to see her before the inevitable fate that awaits us all sooner or later?”But I have had to ask this difficult question because like many people, I live thousands of miles away from my mother.I have lived here for 12 years, while my mother, who turns 85 this year, lives in Germany.Since the beginning of the pandemic, my Singaporean wife and I had been waiting for countries to control the virus, for travel to “normalise”, and to able to fly and meet her.But by May 2021, I hadn’t seen her in almost two years.For those of us separated from families, there were windows of hope that could have enabled a trip home - relatively low COVID-19 numbers in Singapore, a potential travel bubble via Hong Kong where business opportunities there mean we can avoid a lengthy quarantine after spending some time there, and vaccines being rapidly developed.But not only did numbers increase, the travel bubble burst twice, dashing many hopes. The fluidity in the COVID-19 situation has meant unpredictable changes to travel restrictions since last year.At the height of the pandemic for instance, Singapore closed its borders to all short-term visitors. This year, when the mutant strains raised infection numbers again, Singaporeans and Permanent Residents had to test negative before flying back.Even if we took the risk to travel, there was a nagging fear – what if during my travel, I catch the virus and then bring it home to my mum? Or what if I pass it on to my wife? How long should I wait before it is safe – knowing that there would never really be a “right time”?TAKING THE RISK TO TRAVELThe good news is vaccinations became available and my mother was first in line to receive her shots in Freiburg, a small city nestled in the Black Forest in the south of Germany. I myself got fully vaccinated by May.The possibility of a trip came into sharper focus. However, there were still logistical challenges and uncertainties involved in making the trip.It looks like the email address you entered is not valid.Should I go alone or go together with my wife?  What if there is another outbreak and Singapore changes entry re-entry requirements? How about work – we could not be away indefinitely and needed contingency plans.My wife and I decided to travel together. It helped that we are self-employed and could do some work remotely.Yet, shortly after we booked our tickets and just days before our departure, things took a turn for the worse. Germany went into a hard lockdown as numbers there spiralled. The new and more contagious variants of the virus also arrived in Singapore.Germany required a negative pre-flight COVID-19 test no earlier than 48 hours before arrival.With PCR tests taking up to two days to process, we scheduled not one but two tests to be taken just in case of a rare false positive. It would be terrible to have come this far and then be turned around at the airport before we could enter Germany.Meanwhile the new restrictions in Germany to stop transmission meant that all restaurants, shops, and hotels were closed and there was even a curfew in place from 10pm to 6am every night. So again, there was the concern of being infected and the thought of whether we should still go or postpone came to mind.We had just 12 hours to decide. All our COVID-19 tests had come back negative and we stuck to what mattered most – using this opportunity to see my mother, who had been waiting for two years to be reunited with us.AN EERIE JOURNEYIt was an eerie journey through empty hallways at Changi Airport with personnel in full PPE, and always a niggling concern in the back of my mind whether we would be let through the immigration controls in Germany.With a pandemic that throws up spikes in cases without warning, what was the chance of new regulations mid-flight barring all visitors or new quarantine requirements which so far had not been the case in Germany?Perhaps it was good that our anxieties were also hidden behind our masks that we were required to wear for the entire flight except for mealtimes.  This clearly wasn’t joyful travelling as it used to be.In the end, the journey there went smoothly, the immigration officer glanced at our test results and apologised for the new restrictions and we got through immigration within minutes. After a two-and-a-half-hour ride on a strangely empty Autobahn, we arrived at my mother’s home.She burst into tears of joy hugging me tightly after being separated for so long and my wife caught this moment of pure joy on camera.Our journey to Germany really brought home the point that we are wired to connect with our loved ones physically. No video call can ever replace the feeling of being held by a loved one or the taste of a mother’s meal.My mother had already been cooking our favourite dishes for a week before we arrived in anticipation.THE RETURN JOURNEYOnly a few days after arriving in Germany, the compulsory 14-day quarantine in Singapore was changed to 21 days.Then there was a big cluster at Changi Airport and we started to worry if the airport might be closed under a new circuit breaker. The following week we learned that non- Singaporeans or PRs would not be allowed to re-enter Singapore until August.For some of our international friends currently travelling, that meant that they could not even return to their business or loved ones in Singapore.My wife and I remained apprehensive about our journey home – our children were waiting for us. We kept checking online if any new requirements cropped up before boarding our flight home.We made it back safely and Changi Airport was even emptier than we remembered. Well-organised as always, immigration and testing upon arrival went quite smoothly as a small army of helpful guides walked alongside us and directed us to every station we needed to pass, from immigration to swab test to our shuttle bus.Was this arduous journey filled with twists, turns and worries worth it?I would say yes – my time with my mother was so very precious. The two weeks we were there went by so quickly. I didn’t have the courage to tell her how much death was on my mind or how my fears of uncertainty were bothering me.I simply stayed with her, listened to her, ate all her lovingly prepared dishes and held her tight.I know we are very privileged to be able to spend the time and the money needed to see our loved ones.My heart goes out to the many more who are stuck in this pandemic limbo with one lockdown after another, still connecting using technology and yearning for the time they can take a trip to finally hold each other again.Dr Gregor Lim-Lange is the Co-founder and Chief Psychologist of Forest Wolf an expert on clinical and positive psychology, social emotional intelligence and mental health.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,Travel,Quarantine", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/commentary/covid19-homesickness-separated-visiting-ageing-mother-14978892", "Source": "google"}