{"Type": "", "Time": "2021-06-13", "Headline": "For Scott Morrison of Australia, G7 in Cornwall Is a Homecoming of Sorts - The New York Times", "Text": "AdvertisementBy Marc SantoraMore than two centuries after his ancestor was cast out of Cornwall for stealing and sent to Australia with hundreds of other convicts, Scott Morrison returned to the area on Friday as prime minister of Australia.“It’s a long time since one of my family was in Cornwall,” Mr. Morrison said in a speech in Perth on Wednesday before traveling to meet with other world leaders at the Group of 7 conference. While the issues of the day were at the center of his agenda as an invited guest at the summit, it was also an unusual homecoming of sorts.The main location of the gathering, Carbis Bay, is about 60 miles from the market in Launceston where his ancestor, William Roberts, stole “five pound and a half-weight of yarn” in 1786, according to the Australian Associated Press.Mr. Morrison said Mr. Roberts was his “fifth great-grandfather.”“He stole some yarn in Cornwall, and the rest is history,” Mr. Morrison said. “More than 200 years of it, so it’ll be interesting to be going back there.”Mr. Roberts was part of a group of over 1,400 people who set sail in 11 ships from Portsmouth, England on May 13, 1787 — part of the infamous “First Fleet” — transporting military leaders, sailors and convicts across the world.“A wide variety of people made up this legendary ‘First Fleet,’” according to the National Geographic Society. “Military and government officials, along with their wives and children, led the group. Sailors, cooks, masons and other workers hoped to establish new lives in the new colony.”The First Fleet included more than 700 convicts — the start of what would be more than 80 years of Britain’s shipping off convicts to serve out their sentences in New South Wales, now a state in southeastern Australia. Britain sent more than 160,000 convicts to Australia in that time, and it is estimated that about 20 percent of present-day Australians can trace their ancestry to them.Mr. Morrison is not the first Australian leader to trace his roots back to a convict.Genealogists traced former Prime Minister Kevin Rudd’s family line to an English woman who barely escaped the hangman’s noose. In 1788, Mary Wade — Mr. Rudd’s paternal fifth-great-grandmother — was convicted at the Old Bailey in London of having robbed an 8-year-old girl of her dress and underwear in a bathroom.Ms. Wade is said to have declared at her trial: “I was in a good mind to have chucked her down” the toilet. “I wish I had done so.”She was sentenced “to be hanged by the neck til she be dead,” but her sentence was commuted and she was shipped off to Australia.Advertisement", "Section": "", "Writers": "", "URL": "https://www.nytimes.com/2021/06/11/world/australia/australia-scott-morrison-cornwall.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}