{"Type": "", "Time": "2021-06-13", "Headline": "\n            Belgium 3-0 Russia: Lukaku brace seals Red Devils win - Football365        ", "Text": "Home  All The News  Belgium 3-0 Russia: Lukaku brace seals Red Devils winDate published: Saturday 12th June 2021 10:02                 - News Desk Belgium started Euro 2020 with a 3-0 win over Russia with Romelu Lukaku dedicating the first of two goals to Inter Milan team-mate Christian Eriksen.The Group B fixture had appeared in doubt when the other match in the group between Denmark and Finland – taking place two hours earlier – was suspended after Eriksen collapsed in the first half.A lengthy delay occurred but after the Inter playmaker was able to regain consciousness and was taken to hospital, where he is in a stable position, the first match in the group resumed and Belgium were able to take on Russia, which ended in a routine victory for Roberto Martinez’s men.Semi-finalists at the World Cup in Russia three years ago, Belgium went top of the group thanks to a brace by Lukaku that sandwiched Thomas Meunier’s goal.26 – Romelu Lukaku has been directly involved in 26 goals in his last 19 appearances for Belgium in all competitions, scoring 22 and assisting four. Phenomenal. #EURO2020 #BEL #RUS pic.twitter.com/euKRMLZZAV— OptaJoe (@OptaJoe) June 12, 2021Eden Hazard was left on the bench in St Petersburg and there was an unsavoury start when the Belgium players were booed as they took the knee before kick-off.Lukaku was able to respond in the perfect fashion after 10 minutes when he put the number one ranked team in the world ahead.Dries Mertens’ cross was not dealt with by Andrey Semenov and former Everton and Manchester United striker Lukaku fired the ball in with his left foot before he grabbed the pitchside camera saying, “Chris, I love you” in a message to team-mate Eriksen.A nasty clash of heads between Timothy Castagne and Daler Kuzyaev resulted in both being substituted midway through the first half and it was the former’s replacement who made it 2-0.Thorgan Hazard’s ball into the area was pushed out into a dangerous position by Russia goalkeeper Anton Shunin and substitute Meunier slotted home from 10 yards.It had not been a good half for Stanislav Cherchesov’s team and he was forced into another change when former Chelsea player Yuri Zhirkov limped off before the break.Russia came out with more intent after the interval but despite using all five of their substitutions by the 63rd minute, including taking off Kuzyaev’s replacement Denis Chershev, Thibaut Courtois remained largely untroubled in the Belgian goal.Captain Eden Hazard was able to play the final 18 minutes and there was time for the goalscorers to combine for a third.Meunier played Lukaku through on goal and he drilled the ball low into the corner for his second of the night to ensure one of the favourites started on a positive note.\n                                                                                                                                                    It took a long time for Jordan Henderson to be appreciated at Liverpool. The wait goes on with England.                                                                    \n                                                                                                                                                    Finland's first ever tournament win was overshadowed by Eriksen's collapse. He is thankfully in a stable condition.                                                                    \n                                                                                                                                                    None of those players or officials should have been asked to play on so soon after fearing for Christian Eriksen's life...                                                                    \n                                                                                                                                                    UEFA have announced Belgium versus Russia will go ahead despite worrying scenes in the other Group B tie. Follow it here...                                                                    \n                                                                                                                                                    Wales kept their qualification hopes alive by avoiding defeat to Switzerland in their opening game.                                                                    \n                                                                                                                                                    Robert Page said the draw with Switzerland 'felt like a win'. A passive point might not look so good later in the group...                                                                    \n                                                                                            Any man who can mellow Roy Keane while bringing some much-needed sunshine into all our lives is alright by Johnny...                                                                                    \n                                                                                            No longer is the English game \"all about heart\". Foden is king of a new breed that would suit other countries.                                                                                    \n                                                                                            Arsenal want a fairly young deep-lying playmaker with Premier League experience to replace Xhaka. Righto.                                                                                    \n                                                                                            With added Buendia, Brentford, Norwich and Watford. Would you back anyone but Chelsea and City to go again this summer?                                                                                    \n                                                                                            It took a long time for Jordan Henderson to be appreciated at Liverpool. The wait goes on with England.                                                                                    Update your browser to view this website correctly.Update my browser now×", "Section": "", "Writers": "", "URL": "https://www.football365.com/news/euro-2020-report-belgium-3-0-russia-romelu-lukaku", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}