{"Type": "", "Time": "2021-06-13", "Headline": "Xherdan Shaqiri Provides An Assist As Switzerland Draw With Wales - The Liverpool Offside", "Text": "We use cookies and other tracking technologies to improve your browsing experience on our site, show personalized content and targeted ads, analyze site traffic, and understand where our audiences come from. To learn more or opt-out, read our Cookie Policy. Please also read our Privacy Notice and Terms of Use, which became effective December 20, 2019.By choosing I Accept, you consent to our use of cookies and other tracking technologies.Filed under:The Liverpool player delivered a great corner kick that was headed home by Breel Embolo. Harry Wilson and Neco Williams were unused substitutes for Wales.The EUFA Euro 2020 tournament (being played in 2021) is finally in full swing, with Saturday being the first full day of matches. There was a large contingent of Liverpool players suiting up for their national teams in the first match of the day as Switzerland took on Wales.Xherdan Shaqiri started for Switzerland, while Harry Wilson and Neco Williams were both named to the bench for Wales. Shaqiri played in the hole behind Haris Sefervic and Breel Embolo. The vertically challenged dynamo was a creative spark for his side, leading the team with four key passes, including an assist for Switzerland’s only goal on the day. Shaqiri delivered a driven corner kick that was headed home by Embolo.Shaqiri assist, Embolo goal, #SUI 1-0 up pic.twitter.com/bqq48mGoMlShaqiri was subbed off in the 66th minute with his team leading 1-0. It was a good showing for the player who is likely auditioning for a transfer. Wales, for their part, would manage to claw a goal back in the 74th minute to earn a 1-1 draw. Both Harry Wilson and Neco Williams were unused substitutes.In the next round of Group A, Wales will take on Turkey in Baku, while Switzerland will have the difficult task of trying to get points off of Italy in Rome.", "Section": "", "Writers": "", "URL": "https://liverpooloffside.sbnation.com/liverpool-fc-international-duty/2021/6/12/22531000/liverpool-xherdan-shaqiri-assist-switzerland-draw-1-1-wales-harry-wilson-neco-williams-euros-2020", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}