{"Type": "Sport", "Time": "2021-06-13", "Headline": "Football: Denmark's Christian Eriksen 'awake' in hospital after collapse in Euro 2020 game", "Text": "COPENHAGEN: Denmark star Christian Eriksen was awake in hospital, the Danish Football Union said on Saturday, after he collapsed on the pitch during the Euro 2020 game against Finland in Copenhagen.\"Christian Eriksen is awake and is undergoing further tests\" at the hospital, the Danish federation said on Twitter, after the player was carried off the field having received CPR by medical personnel.A Reuters photographer at the game saw Eriksen raise his hand as he was carried from the pitch on a stretcher.Eriksen collapsed suddenly in the 42nd minute of the match while running near the left touchline.Teammates Martin Braithwaite and Thomas Delaney rushed to assist him, with Delaney beckoning furiously for medical assistance.The midfielder's teammates formed a ring around him as medics pumped his chest just before halftime in their Group B clash with the Finns.Both teams subsequently left the field with officials holding up sheets to hide the stricken player from view.\"The UEFA EURO 2020 match in Copenhagen has been suspended due to a medical emergency,\" UEFA said in a short statement.About half an hour later, the organisation tweeted that Eriksen \"has been transferred to the hospital and has been stabilised\".\"A crisis meeting has taken place with both teams and match officials,\" it added.The match restarted at 2.30am Singapore time. UEFA said that it had agreed to restart the match \"following the request made by players of both teams\".Finland won 1-0 with their only goal attempt of the match.Eriksen was later able to speak to his teammates.\"We've been in contact with him, and the players have spoken to Christian. That's the great news. He's doing fine, and they are playing the game for him,\" DBU director Peter Moeller told Danish television.Eriksen was voted man of the match in a gesture of support.\"Moments like this put everything in life into perspective,\" said UEFA president Aleksander Ceferin.The previously raucous crowd at the Parken Stadium in the Danish capital fell silent after the 29-year-old fell to the ground near the end of the opening period, with his teammates gathering around him.Team doctor Morten Boesen said at the press conference that Eriksen received life-saving cardiac massage on the pitch.After around 15 minutes Eriksen was stretchered off the field followed by the rest of the Denmark team, while Finland's players also left the pitch.The fans in the stadium, who were celebrating the chance to see their national team again live at the stadium, sat silently in their seats waiting for news of Eriksen's condition to filter through.However soon after stadium-wide chants of \"Christian\" and \"Eriksen\" from both sets of supporters began to ring out as his status began to filter through to supporters.They were brought to their feet when stadium announcers said that Eriksen was \"stable\".It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Euro 2020,Denmark,Christian Eriksen", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/euro-2020-denmark-christian-eriksen-awake-hospital-collapse-15002388", "Source": "google"}