{"Type": "", "Time": "2021-06-13", "Headline": "Explainer: An eye for an eye? China's new anti-foreign sanctions law", "Text": "By Yew Lun TianBEIJING (Reuters) - China passed a wide-ranging law to counter foreign sanctions on Thursday, in an apparent move to legalise its tit-for-tat retaliation against punitive actions taken by foreign countries over issues from human rights to Hong Kong.The law, effective immediately, builds upon previous administrative counter-measures against foreign sanctions issued by the Chinese foreign and commerce ministries. It also lays out the scope of China's counter-sanctions.WHO'S THE TARGET?Individuals or entities involved in the making or implementation of discriminatory measures against Chinese citizens, or interfering with China's internal affairs could be put onto a blacklist, according to the full text of the law published on Thursday.Blacklisted individuals could find their relatives, and the organisations of which they are senior managers or have control over placed on the list.\"Relevant departments\" in the Chinese government can decide who to put on or remove from the blacklist.WHAT HAPPENS TO THOSE BLACKLISTED?Those blacklisted could be denied entry into China or deported from China. Their assets within China can be sealed, seized or frozen.Entities within China could be restricted from engaging in all forms of transactions or cooperation or other activities, potentially limiting the investment activities of blacklisted entities in China.Chinese citizens or organisations can sue in Chinese courts those who enforce foreign measures that discriminate against them.HOW IS THIS DIFFERENT FROM THE PAST?While the foreign ministry has previously announced sanctions mainly against individuals including Western politicians and scholars, it had not cited a specific law as the legal basis.It was also not always clear what those sanctions entailed.Although the commerce ministry has announced mechanisms targeted at foreign entities such as a so-called \"unreliable entity list\", there have been no known instances of companies being put on the list.The new law combines many features of these administrative orders by the foreign and commerce ministries, such as allowing Chinese companies to sue for compensation and denying entry to blacklisted persons.Beijing analysts say the new law makes China's sanctions appear less random, as it spells out who can be blacklisted and what the sanctions would entail.WHAT DO SUPPORTERS SAY?State media and experts in China said the new law was a long overdue \"legal weapon\" needed to deter the West from interfering in China's internal affairs.All 14 vice-chairpersons of China's legislature who passed the law have been under U.S. sanctions for passing the National Security Law last year that critics say has crippled political freedoms in Hong Kong.In other measures, the United States issued a ban on cotton and tomato imports from China's western Xinjiang region in January, citing human rights violations and the use of forced labour in the region.Wang Jiangyu, a law professor at City University of Hong Kong, said the European Union has a law - the \"blocking statute\" - to counter U.S. sanctions, so China should not be faulted for having a similar law.\"The new law is the stick part of the carrot and stick diplomacy. But it is defensive in nature, not offensive, and will only be used when other countries apply sanctions on us first,\" said Cheng Xiaohe, an associate professor of international studies at the Renmin University of China.WHAT DO CRITICS SAY?Foreign companies increasingly fear they will be used as sacrificial pawns in a game of political chess, said Joerg Wuttke, president of European Union Chamber of Commerce.Chinese experts say the law could dampen the climate for foreign investment, but that the Chinese government would have calculated this is a price worth paying to safeguard the country's interests.(Reporting by Yew Lun Tian; Editing by Frances Kerry)China's quick rollout of a law against foreign sanctions has left European and American companies shocked and facing \"irreconcilable\" compliance issues, two top business groups said Friday, despite Beijing saying the move would unlikely impact investment.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Få flere penge i hverdagen ved at samle din gæld. Indsend en ansøgning her og få et tilbud. Indfri lånet når du ønsker det.A 24-year-old man who was seen naked in public in several photos and videos circulating online has been arrested by the police.Second Minister for Education Maliki Osman has taken to Facebook to express his shock and disappointment at alleged Islamophobic remarks made by a Ngee Ann Polytechnic (NP) lecturer.Newly-crowned French Open champion Barbora Krejcikova hailed her mentor and former Wimbledon champion Jana Novotna who died in 2017, saying: \"At the end of her life, I had to be there.\"Prøv Niro Plug-in Hybrid og kom med på den elektriske bølge. Kør på strøm til hverdag og hybrid, når du skal langtWhat if China were to cut off the United States and Europe from access to rare minerals that are essential to electric vehicles, wind turbines and drones?The Ministry of Health (MOH) on Friday (11 June) confirmed nine new COVID-19 cases in Singapore, bringing the country's total case count to 62,245.A firebrand Pakistani scholar has been detained for making death threats against Nobel prize laureate Malala Yousafzai over her comments on marriage, officials said Friday.En elektrisk tandbørste med kunstig intelligens? Oral-B har gjort din eltandbørste endnu smartere - og din tandbørstning sjovere.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.The US Food and Drug Administration said Friday it had told Johnson & Johnson that millions of doses of Covid vaccine produced at a troubled plant can't be used because of possible contamination issues.Agnes Chow hails from a generation of Hong Kong democracy activists who cut their teeth in politics as teenagers and are now being steadily silenced by China.Bedste sikkerhed i klassen. A+ forbrug 19,2 km/l, 117-118 g/km co2. Prisen gælder indregistrering senest 30/06/2021.Not sure what to do with that pile of credits you’ve banked up over the years? How about revisiting your National Service days with these top 10 buys from the SAF eMart. As you’re probably aware, the Singapore Armed Forces (SAF) consists of young male […] The post SAF eMart Shopping Guide – Best Things to Buy With Your NS Credits appeared first on SingSaver Blog - We Compare, You Save.Brazilian President Jair Bolsonaro was fined $100 Saturday for violating Covid-19 containment measures in Sao Paulo state by failing to wear a face mask and provoking huge crowds at a motorcycle rally for supporters.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Sådan investeres i aktier på 5 minutter via din telefon.A closer look at the reasons why Nong-O Gaiyanghadao is considered one of the greatest Muay Thai fighters of all time.An unnamed bidder paid $28 million at auction Saturday for a seat alongside Jeff Bezos on board the first crewed spaceflight of the billionaire's company Blue Origin next month.High coverage, no-fuss application and early benefit payout makes this a great plan for those seeking cancer protection. As many as 1 in 4 Singaporeans could develop cancer in their lifetimes. Hence, getting a protection plan specifically for cancer may be a prudent move, especially […] The post FWD Cancer Insurance (Review): Fuss-free Plan That Pays Out At All Stages appeared first on SingSaver Blog - We Compare, You Save.Folk født 1930-1980 søges til betalte spørgeundersPresident Vladimir Putin on Friday denied a US media report that Russia is set to deliver an advanced satellite system to Iran that will vastly improve its spying capabilities.A Taiwanese court on Friday handed prison terms to a dozen former presidential security agents and airline employees over their roles in a cigarette smuggling scandal on the island two years ago.Euro 2020 was still reeling Sunday after Denmark midfielder Christian Eriksen collapsed and had to be revived by medics on the pitch during his country's defeat to Finland.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/explainer-eye-eye-chinas-anti-113023961.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}