{"Type": "Singapore", "Time": "2021-06-13", "Headline": "Board of Inquiry appointed to investigate death of SMRT technician pinned under bus", "Text": "SINGAPORE: A Board of Inquiry has been appointed to investigate the death of an SMRT technician who was pinned under a bus he was repairing.The inquiry will be chaired by an SMRT board member, Mr Quek Gim Pew,together with an independent mechanical engineering expert, Associated Professor Patrick Chua from the Singapore Institute of Technology, the public transport operator said on Friday (Jun 11).SMRT was also assisting the Singapore Police Force and Manpower Ministry in their separate investigations, it said in a Facebook post.The incident took place at the Ang Mo Kio depot of SMRT Automotive Services on the morning of Jun 6. The technician who died was a 43-year-old permanent resident.He was one of three technicians inspecting and repairing a loose steering wheel on a mini-bus, said SMRT on Friday.The technicians used two car jacks to lift the front of the mini-bus and two of them performed repair works under the vehicle, said the company.The two technicians were injured and immediately taken to the hospital, where one later died. The other injured worker has been discharged and was on medical leave, said SMRT.\"Our immediate priority has and continues to be to provide support to the deceased's family and to provide counselling and support to our recovering technician,\" said the company.After the incident, an immediate safety time-out was implemented at all Automotive Services workshops, it said.All lifting equipment was inspected and staff briefings on work instructions and safety guidelines were conducted, it added.A Workplace Safety and Health (WSH) Council alert on Jun 9 stated that the workers had raised a bus using two car jacks and were working under the vehicle when one of the jacks suddenly collapsed.The WSH Council said car jacks should not be used to lift heavy vehicles such as buses and lorries. Jacking equipment for heavy vehicles should be used instead.Vehicle stands and props should also be used to provide additional support. Where available, a vehicle maintenance pit or purpose-built vehicle ramp or lift should be used, it said.SMRT on Friday said it would provide further updates in due course.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "workplace safety,fatal accidents,SMRT", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/smrt-technician-die-repair-bus-board-of-inquiry-workplace-safety-14993752", "Source": "google"}