{"Type": "", "Time": "2021-06-13", "Headline": "G-7 adopts infrastructure plan to rival China's BRI, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.CARBIS BAY (Britain) • Leaders of the Group of Seven rich nations yesterday adopted a rival plan to oppose China's Belt and Road Initiative (BRI) by helping build infrastructure in poorer nations in a \"values-driven, high-standard and transparent\" partnership.The adoption of the United States-inspired \"Build Back Better World\" (B3W) project came after US President Joe Biden and other G-7 leaders met to address \"strategic competition with China and commit to concrete actions to help meet the tremendous infrastructure need in low-and middle-income countries\", the White House said.China has been widely criticised for saddling small countries with unmanageable debt as part of its trillion-dollar Belt and Road Initiative, which has seen money lent for projects stretching across Asia, Africa, Latin America and even Europe.President Xi Jinping launched the BRI in 2013 to significantly expand China's economic and political influence, with many of the infrastructure plans seen as helping to deliver its goods globally.China denies any ulterior motives in the vast investment project. But critics argue it uses the financial leverage arising from the scheme to boost its clout, in what they dub \"debt-trap diplomacy\".The White House said the G-7 initiative would be similarly global in scope, estimating that the developing world needs more than US$40 trillion (S$53 trillion) in infrastructure, a gap \"which has been exacerbated by the Covid-19 pandemic\".\"B3W will collectively catalyse hundreds of billions of dollars of infrastructure investment for low-and middle-income countries in the coming years,\" it said.Funding will emphasise the environment and climate, labour safeguards, transparency and anti-corruption, it added, in implicit contrast with China's opaque funding. Further details would come in the G-7 summit's final communique today, the White House added.The rival plan comes after the US and China clashed in rare talks on Friday, with Mr Biden's administration pressing Beijing on Covid-19, Taiwan and human rights.In a telephone call with China's top diplomat Yang Jiechi, US Secretary of State Antony Blinken renewed US pressure on China over the origins of the pandemic that has killed more than 3.7 million people.He \"stressed the importance of cooperation and transparency regarding the origin of the virus\", including allowing World Health Organisation experts back into China, State Department spokesman Ned Price said in a statement.Mr Biden has ordered US intelligence to report back by late August on whether the Sars-CoV-2 virus that causes Covid-19, which was first detected in late 2019 in the Chinese city of Wuhan, emerged from an animal source or a laboratory accident.B3W will collectively catalyse hundreds of billions of dollars of infrastructure investment for low-and middle-income countries in the coming years.Mr Yang told Mr Blinken that the laboratory theory was \"absurd\", according to the state-run China Global Television Network.\"We urge the US side to respect facts and science, not to politicise the origin tracing and to focus its attention on international cooperation on the fight against the pandemic,\" Mr Yang said.According to China Central Television, Mr Yang told Mr Blinken: \"Genuine multilateralism is not pseudo-multilateralism based on the interests of small circles.\"The leaders of G-7 nations - Britain, Canada, France, Germany, Italy, Japan and the US - are largely focused on \"building back better\" after Covid-19 wrecked economies and claimed millions of lives around the world.They were set yesterday to outline a joint declaration aimed at preventing another pandemic, as part of their wide-ranging talks on the second day of the summit in Britain. The leaders are also set to issue new commitments on climate change, including financial aid for the developing world.The agenda broadened yesterday to foreign policy issues, as they were joined by the leaders of Australia, South Africa and South Korea, with India taking part remotely.Mr Biden was expected to seek to address frayed relations with Moscow, in particular over its cyber activity.AGENCE FRANCE-PRESSEJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/g-7-adopts-infrastructure-plan-to-rival-chinas-bri", "Source": "google"}