{"Type": "", "Time": "2021-06-13", "Headline": "G-7 summit outlines health pact to stop future pandemics, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.CARBIS BAY, BRITAIN (AFP) - Leaders of the Group of Seven (G-7) rich nations were set on Saturday (June 12) to agree on a joint declaration aimed at preventing another pandemic, as they resume wide-ranging talks at their first in-person summit in almost two years.The “Carbis Bay Declaration” – named after the seaside town in Cornwall, south-west England, where United States President Joe Biden and other leaders are meeting this weekend – comprises a series of health policy commitments.The collective steps include slashing the time taken to develop and license vaccines, treatments and diagnostics for any future disease to under 100 days, while reinforcing global surveillance networks.It will be formally published on Sunday (June 13), alongside the G-7’s final communique.“The #CarbisBayDeclaration marks a proud and historic moment for us all,” British Prime Minister Boris Johnson said on Twitter, as he chaired the second day of the three-day summit.“Under this agreement, the world’s leading democracies will commit to preventing a global pandemic from ever happening again, ensuring the devastation caused by Covid-19 is never repeated,” he said.World Health Organisation chief Tedros Adhanom Ghebreyesus, criticised in some quarters for being too accommodating towards China where the coronavirus was first detected, welcomed the health pact.He also said the United Nations agency would examine a British proposal to create a “global pandemic radar” to send early warnings of future outbreaks.“The world needs a stronger global surveillance system to detect new epidemic and pandemic risks,” Dr Tedros said.However, aid charity Oxfam said the declaration “does nothing to address the fundamental problems that are preventing vaccines being accessible to the vast majority of humanity”.\nThe G-7 is meeting face-to-face for the first time since 2019 in Cornwall. PHOTO: NYTIMES\nThe G-7 – Britain, Canada, France, Germany, Italy, Japan and the United States – are largely focussed on “building back better” after Covid-19 wrecked economies and claimed millions of lives around the world.They are expected to pledge to donate one billion vaccine doses to poor countries this year and next – although campaigners say the rollout is much too slow to end the crisis sooner. The leaders are also set to issue new commitments on climate change, including financial aid for the developing world, in the buildup to the UN’s COP26 environmental summit in Scotland in November.\nBritain's Queen Elizabeth II with G-7 leaders during an evening reception at The Eden Project on June 11, 2021. PHOTO: REUTERS\nThe agenda broadened on Saturday to foreign policy issues, as the G-7 was joined by the leaders of Australia, South Africa and South Korea, with India taking part remotely. President Biden is expected to press allies to bolster cooperation in dealing with a resurgent China, from offering an alternative to its trillion-dollar “Belt and Road” infrastructure initiative to confronting its alleged forced labour practices including against the Muslim Uighur minority in Xinjiang region.“This is not just about confronting or taking on China,” a senior White House official said. “This is about providing an affirmative, positive alternative vision for the world.”He said Mr Biden would be urging “concrete action” on the forced labour accusations, calling them “an affront to human dignity, and an egregious example of China’s unfair economic competition”.China denies allegations that it is waging “genocide” by forcing Uighurs and people from other ethnic-Turkic minorities into internment camps in Xinjiang.The US President will also seek to address frayed relations with Moscow, in particular over its cyber activity. Most of the G-7 leaders will reconvene on Monday in Brussels for a Nato meeting, before Mr Biden heads on to his first summit with Russian President Vladimir Putin in Geneva, vowing to deliver a blunt message about Russian behaviour.In a rare interview with US media released on Friday, Mr Putin voiced hope that Mr Biden would be less impetuous than former US president Donald Trump, who infamously sided with the Russian leader against the views of his own intelligence chiefs.“It is my great hope that, yes, there are some advantages, some disadvantages, but there will not be any impulse-based movements on behalf of the sitting US president,” Mr Putin told NBC News. Closer to home for the G-7 hosts, Mr Johnson came under concerted pressure in separate meetings with the leaders of France, Germany and the European Union to respect his Brexit commitments over Northern Ireland. “The prime minister expressed confidence in the UK’s position in the Northern Ireland Protocol,” a defiant Downing Street responded, referring to special Brexit arrangements for the restive province. “He made clear his desire for pragmatism and compromise on all sides but underlined that protecting the Belfast Good Friday (peace) Agreement in all its dimensions was paramount.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/g-7-summit-outlines-health-pact-to-stop-future-pandemics", "Source": "google"}