{"Type": "", "Time": "2021-06-13", "Headline": "Israeli Parliament poised to vote on change to anti-Netanyahu coalition government, Middle East News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.JERUSALEM (AFP) - Israeli lawmakers are to vote on Sunday (June 13) on a change to the coalition government of bitter ideological rivals united by their determination to banish Prime Minister Benjamin Netanyahu from power.The crunch Knesset vote will either terminate the hawkish premier's uninterrupted 12-year tenure or return Israel to a stalemate likely to trigger a fifth general election since 2019.Mr Netanyahu, who is battling a clutch of corruption charges in an ongoing trial he dismisses as a conspiracy, has pushed Israeli politics firmly to the right over the years.On Saturday night, around 2,000 protesters rallied outside the 71-year-old's official residence to celebrate what they believe will be his departure from office.\"For us, this is a big night and tomorrow will be even a bigger day. I am almost crying. We fought peacefully for this (Mr Netanyahu's departure) and the day has come,\" said protester Ofir Robinski.A fragile eight-party alliance, ranging from the right-wing Jewish nationalist Yamina party to Arab lawmakers, was early this month cobbled together by centrist politician Yair Lapid.Last Friday, all coalition agreements had been signed and submitted to the Knesset secretariat, the Yamina party announced, a moment that party leader Naftali Bennett said brought \"to an end two and a half years of political crisis\".But the ever-combative Mr Netanyahu has tried to peel off defectors that would deprive the nascent coalition of its wafer-thin legislative majority.If the new government is confirmed, Mr Bennett, a former defence minister, would serve as premier for two years.Coalition architect Mr Lapid, who heads the Yesh Atid party and is a former television presenter, would then take the helm.The anti-Netanyahu bloc spans the political spectrum, including three right-wing, two centrist and two left-wing parties, along with an Arab Islamic conservative party.The improbable alliance emerged two weeks after an 11-day war between Israel and Hamas, the Islamist group that rules the Palestinian enclave of Gaza and following inter-communal violence in Israeli cities with significant Arab populations.\"We will work together, out of partnership and national responsibility - and I believe we will succeed,\" Mr Bennett said last Friday.Sunday's crucial Knesset session is due to open at 4pm local time (9pm Singapore time), with Mr Bennett, Mr Lapid and Mr Netanyahu all set to speak before the vote.Mr Netanyahu has heaped pressure on his former right-wing allies to defect from the fledgling coalition while attacking the legitimacy of the Bennett-Lapid partnership.He has accused Mr Bennett of \"fraud\" for siding with rivals and angry rallies by the premier's Likud party supporters have resulted in security being bolstered for some lawmakers.Mr Netanyahu's bombastic remarks as he sees his grip on power slip have drawn parallels at home and abroad to former United States president Donald Trump, who described his election loss last year as the result of a rigged vote.The Prime Minister has called the prospective coalition \"the greatest election fraud in the history\" of Israel.His Likud party said the accusations refer to Mr Bennett entering a coalition that \"doesn't reflect the will of the voters\".Sunday's vote arrives hot on the heels of police crackdowns on Palestinian protests over the threatened eviction of families from homes in Israeli-annexed east Jerusalem to make way for Jewish settlers, a month after similar clashes fuelled the latest war between Israel and Hamas.It also comes amid right-wing anger over the postponement of a controversial Jewish nationalist march.Mr Netanyahu favoured finding a way to allow the so-called \"March of the Flags\", originally scheduled to take place last Thursday, to proceed as planned.He took that position despite the original route envisaging the march unfolding close to flashpoint areas including the Al-Aqsa mosque compound, where clashes last month triggered the Gaza conflict.The premier's insistence saw his opponents accuse him and his allies of stoking tensions to cling onto power via a \"scorched earth\" campaign.If Mr Netanyahu loses the premiership, he will not be able to push through changes to basic laws that could give him immunity in regard to his corruption trial.The controversial flag march is now slated for Tuesday and ongoing tensions surrounding it could represent a key initial test for any approved coalition.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/middle-east/israel-parliament-poised-to-vote-on-anti-netanyahu-government", "Source": "google"}