{"Type": "", "Time": "2021-06-13", "Headline": "At least 700 people who visited Ion Orchard turn up for Covid-19 testing at two centres, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - At least 700 people who had visited Ion Orchard in the past two weeks turned up to get tested for Covid-19 at two medical centres on Saturday (June 12).About 600 people were tested at Fullerton Health Testing Centre in Raffles City, while about 100 went to Raffles Medical Centre in Shaw Centre. A Fullerton Health spokesman said: “Today was slightly busier than usual, but was well within our testing centre’s capacity, and we were able to accommodate smoothly.”Long lines formed outside and inside Shaw Centre as people waited for their turn to get swabbed at Raffles Medical Centre from 8.30am.On Friday, the Ministry of Health reported that a 57-year-old woman who works as a promoter at Guardian in Ion Orchard had tested positive for Covid-19. She is the third worker at Ion Orchard to test positive for the virus, prompting MOH to close the mall and offer testing to mall visitors and staff.Most of the people in the line said they were getting tested just to be safe. Others, like housewife Madam Aparna, 71, said she and her husband wanted to get tested for the safety of the people around them.“We are doing it more for the others,” she said.The couple had visited the Daiso outlet in Ion on Tuesday for about 30 minutes.Madam Aparna added that they have both been fully vaccinated and feel safe.Ms Margie Ceitom, 39, a maid who was at Shaw Centre with her employer, said she did not have any symptoms, but since she and her employer had visited Ion on May 27, the two of them decided to get tested. Another man in the line, who wanted to be known only as Mr Ng, 51, said he could not remember when he visited Ion but had received a message from the TraceTogether app a few days ago.He said: “The message said I may have been possibly exposed to a Covid-19 case.”Mr Ng, who is a manager, added that he did not feel nervous. He said that the decision to get tested was to be responsible and to make sure he was safe.\nPeople queueing to get tested for Covid-19 at Fullerton Health Testing Centre in Raffles City on June 12, 2021. ST PHOTO: ALPHONSUS CHERN\n\nA queue outside the testing centre at Raffles Medical Centre at Shaw Centre on June 12, 2021. ST PHOTO: JASON QUAH\nMr James Quan, 53, who owns leather goods store Bynd Artisan, said the level 8 carpark at Ion is being used as a testing site for the mall’s staff.In a letter to tenants dated June 11 and seen by The Straits Times, all store staff were told to register for a swab test before 12pm on Saturday using an online link. In the letter, Ion reminded store staff to be punctual for their appointed slot to avoid crowding.Mr Quan, who works from home, said his shop staff will be tested from 4pm on Saturday. He added that this is the weekend before Father’s Day, which falls on June 20, and stores may have been anticipating more sales because shoppers would have planned to buy gifts.Mr Quan said he was not worried that his business would be affected, as he has three other outlets, including an online site. His Ion outlet is the smallest one.He said: “One of my outlets is just next door, in Takashimaya. If I had only one store and no online site, it would have been a big blow to the business.”Attempts by ST to enter the Ion Orchard carpark were unsuccessful. A security guard at the entrance stopped a member of the media from going in.People were still using the Ion Paterson link to get to other malls or to exit Orchard MRT station.\nIon Orchard will be shut until 7am next Wednesday (June 16). ST PHOTO: JASON QUAH\n\nA closed Ion Orchard on June 12, 2021. ST PHOTO: JASON QUAH\nAt Raffles City Shopping Centre, Ms Annie Ang, who is in her late 50s, and her friend, Mrs Sharon Ho, who is in her 60s were queuing up to get tested at Fullerton Health Testing Centre.Ms Ang said: “We arrived here at about 2pm and it was very fast. I took only 20 minutes to complete everything.”The women, both of whom have received their Covid-19 shots, live near Ion Orchard and went there to buy food on June 7.Ion Orchard will be shut for four days - from 7am on Saturday until 7am next Wednesday - for cleaning and disinfecting works after the MOH confirmed a number of Covid-19 cases linked to the shopping mall.It is the first mall in the popular Orchard Road shopping belt to do so amid the pandemic.Members of the public who had visited the shops or used the services and facilities at Ion from June 3 to June 11 are being offered free Covid-19 testing from Saturday.Staff who worked at the mall from May 28 to June 11 will also be tested.Additional reporting by Alphonsus ChernJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/some-100-people-who-visited-ion-orchard-turn-up-for-testing-at-raffles-medical-in", "Source": "google"}