{"Type": "Sport", "Time": "2021-06-13", "Headline": "Tennis: After toppling Nadal, Djokovic hopes to be ready for Tsitsipas", "Text": "PARIS: After dethroning 'king of clay' Rafa Nadal at the French Open, Novak Djokovic will next face a first-time Grand Slam finalist in Stefanos Tsitsipas as the world number one bids to become the first man in the open era to win all four majors at least twice.Roy Emerson and Rod Laver are the only men to have won each of the four Grand Slams on two or more occasions but no one has achieved the feat since 1968, when the sport allowed professional players to compete at the majors.A second trophy at Roland Garros, after his 2016 triumph on the red clay, on Sunday will also give the 34-year-old Serbian his 19th Grand Slam title - one short of Nadal and Roger Federer's men's record.His challenger will be a 22-year-old who is bidding to become the first Greek to win a singles major.Tsitsipas has long been marked out as a future Grand Slam champion and has already collected trophies from the season-ending ATP Finals and a Masters 1000 tournament.But he had drawn a blank the three times he reached the last-four stage at a major before Friday's semi-final where he took down U.S. Open finalist Alexander Zverev in a thrilling five-set duel.The first Grand Slam finalist from Greece will arrive on Court Philippe Chatrier on Sunday with a 2-5 win-loss record against the Serbian but will draw inspiration from the fact that he has a Tour-leading win tally in 2021.\"I'm looking forward to that challenge,\" Tsitsipas said on Friday, looking ahead to his first major final.\"I'm looking forward to bring my game to kind of challenge myself to step it up.\"Nothing less than his 'A' game would suffice for the Greek as he has never managed to defeat Djokovic on clay though he took the Serbian to five sets in the semi-finals at the same venue last year.The emotions of Friday's fantastic win over 13-time French Open winner Nadal might leave a hangover for most players but that might not be a problem for Djokovic with his incredible mental strength.\"It's not the first time that I play an epic semi-final in a Grand Slam and then I have to come back in less than 48 hours and play finals,\" he said.\"My recovery abilities are pretty good, I must say, throughout my career ... I know what I need to do.\"Djokovic was happy to relax a bit and enjoy his semi-final win over his great rival but will not take anything for granted against the Greek.\"He's in great form,\" the Serbian said. \"I think he matured as a player a lot. Clay (is) arguably his best surface.\"We played an epic five-setter last year in the semis here. Yeah, I know it's going to be another tough one.\"I'm hoping I can recharge my batteries as much as I can because I'm going to need some power and energy for that one.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "finalist,sports,Serbian,Novak Djokovic,Rafa Nadal,Serbia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/tennis-after-toppling-nadal-djokovic-hopes-to-be-ready-for-15001652", "Source": "google"}