{"Type": "", "Time": "2021-06-13", "Headline": "SMRT appoints board of inquiry to look into death of technician crushed by bus, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - SMRT has appointed a board of inquiry to look into a fatal accident at its automotive services workshop in the Ang Mo Kio depot on Sunday (June 6).It is chaired by its board member Quek Gim Pew and an independent mechanical engineering expert, Associate Professor Patrick Chua from the Singapore Institute of Technology. In the Sunday incident, one technician was killed and another injured when a car jack supporting a minibus they were working on gave way.The transport operator said in a Facebook post on Friday that three technicians had attended to the inspection and rectification of  the vehicle's loose steering wheel. They used two car jacks to lift the front of the minibus and two of them proceeded with repair works under it.In a preliminary update on the workplace incident, SMRT said the two workers were injured and taken to hospital, where one of them died. The other has been discharged and is on medical leave.Police said they received a call at around 9.40am on Sunday.A 44-year-old man was conscious when taken to hospital, it added. Another man, 43, was unconscious.The two technicians were taken to Khoo Teck Puat Hospital in Yishun, said the Singapore Civil Defence Force, adding that one had serious head injuries while the other complained of chest pains.SMRT said its immediate priority is to provide support to the family of the dead worker, and offer counselling and support to the recovering technician.Following the incident, an immediate safety time-out was implemented at all automotive services workshops. All lifting equipment were inspected while staff briefings on work instructions and safety guidelines were held.SMRT said it is assisting the police and Ministry of Manpower in their separate investigations. The Workplace Safety and Health Council on Thursday said such accidents could be prevented if proper jacking equipment - designed for the load of the vehicle - were used. Car jacks designed to support a fraction of the weight of a bus should not be tapped.It added that additional stands or props should be used to provide further support when lifting heavy vehicles like buses, trucks and lorries.\"Where available, use a vehicle maintenance pit or purpose-built vehicle ramp or lift to safely access the bottom of a vehicle,\" the council stated.Sunday's incident is the second workplace fatality for SMRT in two years. In March last year, a technical officer died while working at the Bishan depot. Mr Muhammad Afiq Senawi, 30, was operating a hydraulic press machine when a 5kg rod flew out, broke through fencing and hit him in the face.These incidents followed other serious worksite mishaps at SMRT.In 2016, two trainees aged 24 and 26 were killed on a track near Pasir Ris MRT station.In 2018, a 59-year-old worker had his right foot amputated after it was crushed by a maintenance train.The 2016 tragedy was found to have been caused by a failure to impose safety protocols while the cause of the other incident has not yet been made known.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/smrt-appoints-board-of-inquiry-to-look-into-fatal-accident-at-ang-mo-kio-depot", "Source": "google"}