{"Type": "", "Time": "2021-06-13", "Headline": "China's attacks on 'foreign forces' threaten HK's standing: US envoy, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.HONG KONG • The top US diplomat in Hong Kong said the imposition of a new national security law had created an \"atmosphere of coercion\" that threatens both the city's freedoms and its standing as an international business hub.In unusually strident remarks to Reuters this week, US Consul-General Hanscom Smith called it \"appalling\" that Beijing's influence had \"vilified\" routine diplomatic activities such as meeting local activists, part of a government crackdown on foreign forces that was \"casting a pall over the city\".Critics of the legislation say the law has crushed the city's democratic opposition, civil society and Western-style freedoms.The foreign forces issue is at the heart of the crimes of \"collusion\" with foreign countries or \"external elements\" detailed in Article 29 of the security law, scholars say.Article 29 outlaws a range of direct or indirect links with a \"foreign country or an institution, organisation or individual\" outside Greater China, covering offences from the stealing of secrets and waging war to engaging in \"hostile activities\" and \"provoking hatred\". They can be punished by up to life in prison.Mr Smith is a career US foreign service officer who has deep experience in China and the wider region, serving in Shanghai, Beijing and Taiwan before arriving in Hong Kong in July 2019.He made his comments in an interview at the US diplomatic mission in Hong Kong on Wednesday, after Reuters sought the consulate's views on the impact of the national security law.In a response to Reuters, Hong Kong's Security Bureau said that \"normal interactions and activities\" were protected, and blamed external elements for interfering in the city during the protests that engulfed Hong Kong in 2019.\"There are indications in investigations and intelligence that foreign intervention was rampant, with money, supplies and other forms of support,\" a representative said. He did not identify specific individuals or groups.Government adviser and former security chief Regina Ip told Reuters it was only \"China haters\" who had reason to worry about falling foul of the law. \"There must be criminal intent, not just casual chat,\" she said.Fourteen Asian and Western diplomats who spoke to Reuters for this story said they were alarmed at attempts by Hong Kong prosecutors to treat links between local politicians and foreign envoys as potential national security threats.\"It's appalling that people would take a routine interaction with a foreign government representative and attribute something sinister to it,\" Mr Smith said.Hong Kong yesterday slammed a British government report that said Beijing was using the security law to \"drastically curtail freedoms\" in the city. The Hong Kong authorities also this week lambasted the European Union for denouncing Hong Kong's recent overhaul of its political system.Although local officials said last year that the security law would affect only a \"tiny minority\" of people, more than 100 have been arrested under the law.Retired judges said they were shocked at the broad use of foreign connections by prosecutors. One told Reuters he did not see how that approach would be sustainable, as the government accredits diplomats, whose job is to meet people, including politicians.Hong Kong's judiciary said it would not comment on individual cases.REUTERSJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/chinas-attacks-on-foreign-forces-threaten-hks-standing-us-envoy", "Source": "google"}