{"Type": "Sport", "Time": "2021-06-13", "Headline": "Football: Singapore lose 3-0 to Saudi Arabia in World Cup qualifier", "Text": "SINGAPORE: Singapore fell to a third straight loss in its second round World Cup qualifying campaign on Saturday (Jun 12) with a 3-0 defeat by Saudi Arabia in Riyadh.With this defeat, Singapore have conceded 12 goals in three matches in Group D since the resumption of its joint qualification campaign for the 2022 World Cup in Qatar and the 2023 Asian Cup in China, scoring none in reply.A5-0 defeat to Uzbekistanon Monday followed a4-0 loss to Palestinelast week.Following the rout against the Uzbeks, the Lions made three changes to their starting lineup and showed an improved defensive performance against the Saudis in the first half, with the match goalless at half-time.Saudi Arabia's Salem al-Dawsari broke the deadlock in the 83rd minute with a right-footed shot from the edge of the 6-yard box.Three minutes later, Fahad al-Muwallad made it 2-0 before Sahel al-Shehri finished off proceedings in the sixth minute of stoppage time.Also in Group D, Uzbekistan pipped Yemen 1-0 to keep the pressure on the Saudis. The table-toppers will be decided next week when both teams square off in Riyadh.The top-placed team from the eight second-round groups and the four best runners-up will progress to the third round of 2022 World Cup qualifiers. They will also qualify for the 2023 Asian Cup.“Today, our boys did very well and I am proud of them,” said Singapore coach Tatsuma Yoshida, whose remarks were carried on the Football Association of Singaporewebsite.“We changed our formation and they followed some (new) strategies … It was fantastic, but Saudi Arabia are very strong.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Singapore,Saudi Arabia,World Cup qualifier", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/singapore-lose-3-0-saudi-arabia-world-cup-qualifier-14998572", "Source": "google"}