{"Type": "", "Time": "2021-06-13", "Headline": "Singapore students optimistic about travel bubble letting them get to or come back from Australia, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Singaporeans studying in Australian institutions are looking forward to a proposed travel bubble between the two countries, as they may finally be able to return to their campuses there or spend holidays with their families here.Prime Minister Lee Hsien Loong and his Australian counterpart Scott Morrison said on Thursday that the two countries are working towards an air travel bubble. They hoped Singapore students in Australia, whose studies have been disrupted by the Covid-19 travel restrictions, would be the first to get the opportunity to travel under the arrangement.All six students The Straits Times spoke to on Friday (June 11) expressed optimism about the travel bubble.For first-year students like Mr Chris Gan, who is doing his bachelor's degree in politics, philosophy and economics at the Australian National University, it will be his first chance to set foot on its campus.The 21-year-old said he was not too concerned that the travel bubble may be one-way. \"I am confident Singaporeans will be able to travel to Australia too.\"Mr Sun Yuchen, 23, a third-year student at the University of Melbourne who is currently on a year's leave of absence, is looking forward to returning to campus. \"I see a chance for me to return to Australia to complete my studies and gain experience by using actual facilities the school provides,\" he said.Singaporeans who are currently in Australia, such as University of New South Wales student Joseph Tan, look forward to reuniting with family here.The 23-year-old, who has been in Australia since February last year, said he had been unable to return home, as his degree in aviation requires him to attend flying lessons there.He added: \"The travel bubble between Singapore and Australia comes as a relief to me as I have the opportunity to finally return home and see my family after being away for so long. Even if I can only return for a few days, it is comforting to return home again.\"Students who returned to Singapore when the Covid-19 pandemic worsened said the past year had been tough for them.Psychology student Audrey Chan, 23, is a final-year student at the University of Queensland. She has been continuing her classes remotely since returning to Singapore in March last year.She said: \"My Singaporean and Malaysian peers agree that we often feel like an outsider or a CCTV spying on the class via Zoom, and this makes class participation painfully awkward and hard for us. Some of us are stressed out, as we find it hard to keep up with the class, especially when technology fails us.\"University of Adelaide student Shalynn Tsai, 21, who is doing her bachelor's degree in dental surgery, had to take leave of absence because she was unable to return to campus by mid-September last year.\"It has been very stressful not knowing when or whether we can even continue with our degree courses,\" she said.\"With the travel bubble, we can finally go back and resume our studies.\"While the students understand that they may need to undergo pre-departure and arrival tests for the coronavirus, they hoped they would not have to incur hefty charges and would not have to be quarantined if already vaccinated.Mr Ryan Soh, 21, will be commencing his communication studies at Queensland University of Technology later this month. \"I hope that there will be no need for a quarantine once vaccination has been done and the Covid-19 test comes back negative. Kind of like what's going on between New Zealand and Australia,\" he said.\"Nevertheless, if there is a need for quarantine, then hopefully it would be more accessible or cheaper for students, as some of us may not be able to afford it.\"Mr Tan felt the same. \"Hopefully it will not be too expensive and there will not be a need to self-quarantine for too long once I arrive at either destination. I understand the need for the Covid-19 tests to ensure there are no imported cases and hope that both countries can maintain the safety of not only its residents but those travelling as well,\" he said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/singapore-students-optimistic-about-travel-bubble-letting-them-get-to-or-back-from", "Source": "google"}