{"Type": "", "Time": "2021-06-13", "Headline": "Djokovic conquers 'Everest,' eyes 52-year landmark at French Open", "Text": "published :\n\t\t\t\t\t\t\t\t\t\t\t\t\t13 Jun 2021 at 10:45\t\t\t\t\t\t\t\t\t\t\t\twriter: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAFP PARIS - Novak Djokovic can become the first man in 52 years to win all four Grand Slam titles twice in the French Open final on Sunday after conquering Rafael Nadal, the 'Mount Everest' of Roland Garros.World number one Djokovic takes on Greece's Stefanos Tsitsipas for the title with tennis history on the line.Victory for the Serb will take him alongside Roy Emerson and Rod Laver as the only men to capture the four majors more than once.It's an achievement that has proved even beyond the capabilities of Nadal and Roger Federer.It is so rare an accomplishment that it hasn't happened since 1969 when Laver completed his second calendar Grand Slam.Djokovic can pocket a 19th Slam with victory and move just one behind the record of 20 jointly held by Nadal and Federer.Djokovic insists there will be no letdown physically or emotionally after reaching the final in Paris for a sixth time with an epic triumph over 13-time champion Nadal.\"It's not the first time that I play an epic semi-final in a Grand Slam and then I have to come back in less than 48 hours and play finals,\" said the 34-year-old.\"My recovery abilities have been pretty good throughout my career.\"His four-hour, four-set battle with Nadal is already jostling for a prime spot in the list of \"greatest ever matches\" at the Slams.- 'Never believed' -It featured a lung-busting 92-minute third set and required government intervention to allow the 5,000 fans inside Court Philippe Chatrier to watch the match's conclusion despite it extending beyond the 11pm Covid-19 curfew.The 3-6, 6-3, 7-6 (7/4), 6-2 triumph gave Djokovic the honour of being the only man to have beaten Nadal in Paris more than once, having first achieved it in the 2015 quarter-finals.Nadal has only lost three times in 108 matches since his title-winning debut in 2005.Djokovic, the 2016 champion, said it was his best win in Paris and ranked it among his \"three greatest\" ever performances.\"It's hard to find words bigger than all the superlatives you can think of for Rafa's achievements at Roland Garros,\" said Djokovic who now leads their series 30-28 and had lost three finals in the French capital to Nadal.\"Each time you step on the court with him, you know that you have to kind of climb Mount Everest to win against this guy here.\"Djokovic has already admitted he's a fan of Tsitsipas, proclaiming him as a Grand Slam champion in the making.\"He is a hard worker, dedicated, nice guy,\" said Djokovic.\"He's very smart and wise. I love the fact that he is more than just a tennis player and he's always looking to learn from experience and to understand something new about himself.\"That's the trait of a champion.\"Djokovic will be playing in his 29th Slam final on Sunday.He holds a 5-2 record over Tsitsipas, a run which includes all three meetings on clay.At last year's Roland Garros, Djokovic won their semi-final over five sets.\"We played an epic five-setter last year in the semis here. I know it's going to be another tough one,\" added Djokovic who also defeated Tsitsipas in Rome on the eve of the French Open.\"I'm hoping I can recharge my batteries as much as I can because I'm going to need some power and energy for that one.\"Tsitsipas, 22, and 12 years younger than the Serb, is in his first Slam final having ended a run of three semi-final losses by defeating Alexander Zverev over five sets on Friday.Victory on Sunday would make him the first Greek player to win a Slam title.He would also become the youngest champion in Paris since Nadal in 2008 and overall at the Slams since Juan Martin del Potro at the 2009 US Open.\"I've never believed, have never really thought at what age this achievement might come,\" said Tsitsipas.\"But I'm really happy with myself. I think I've shown good discipline so far. I've been progressive.\"Tsitsipas is the hottest player on tour in 2021 with a season-leading 39 wins.Twenty-two of those have come on clay and have reaped a Masters title in Monte Carlo as well as Lyon.Tsitsipas also had a match point in the Barcelona final against eventual champion Nadal.\"There is the final on Sunday, which is exciting. I'm looking forward to leaving my entire body on the court,\" said the Greek who knocked out second seed Daniil Medvedev in the quarter-finals.Heavy to very heavy rain is expected in the North and Northeast of Thailand on Sunday due to tropical storm \"Koguma\", the Thai Meteorological Department announced in its 5am weather bulletin.PARIS: After flying into the financial turbulence of the Covid pandemic, the airline sector expects passenger traffic to take off despite concerns about the industry's impact on climate change.Most Thais lack confidence in govt's handling of Covid crisis and see political meddling in vaccine distribution, says Nida Poll.", "Section": "", "Writers": "", "URL": "https://www.bangkokpost.com/sports/2131627/djokovic-conquers-everest-eyes-52-year-landmark-at-french-open", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}