{"Type": "Asia", "Time": "2021-06-13", "Headline": "China's anti-sanctions law: What we know", "Text": "BEIJING: A new Chinese law against foreign sanctions is designed to boost Beijing's power against international pressure, but could spark compliance dilemmas for foreign businesses operating in the world's second-largest economy.It comes just a week after US President Joe Biden expanded a blacklist of Chinese companies in which Americans are not allowed to invest.Here is what we know about the law so far:WHAT IS IT?The anti-foreign sanctions law was rushed into force on Thursday (Jun 10). It aims to protect Chinese individuals or organisations in the event that a country \"uses various pretexts or its laws\" to take \"discriminatory\" action against them.No country is specifically named. But Beijing has accused Western nations of \"suppressing\" China's development, especially the United States. It has lashed out at \"illegal and unreasonable\" sanctions over human rights and flagged an urgent need to fight back.WHAT COULD IT DO?Countermeasures listed in the law include denying visas, deportation, or seizing assets of those who formulate or comply with sanctions against Chinese businesses or officials.It rules that authorities are not only able to target individuals and groups but can also take aim at their family members.The law is broad and \"significantly increases the punitive power of China's anti-sanctions measures\", said University of Hong Kong associate professor Angela Zhang.\"The broad scope of this framework means that lots of folks, like scholars, pundits, think tanks, could be sanctioned for supporting sanctions on China,\" warned Julian Ku, an expert on international law at Hofstra University.HOW COULD IT IMPACT BUSINESS?Senior executives of entities on a countermeasure list could also come under pressure, with potential implications for a large number of people and businesses.\"Affected businesses could lose entire access to the Chinese market, and Chinese citizens and institutions will need to cut ties with affected NGOs and think tanks,\" Zhang told AFP.The law could also create severe compliance issues for multinational companies.Part of the legislation prohibits those in China from going along with designated foreign sanctions. It acts in a similar way to a European blocking statute \"which nullified the effect of US Iran sanctions within the EU\", said Ku.This puts foreign businesses in a bind if they cannot legally comply with both US sanctions and Chinese prohibitions.WHY NOW?The law builds on earlier measures which prevent companies and individuals from complying with foreign sanctions targeting China.In an explainer on the National People's Congress website, an official said the law was passed in a short period of time because there was \"an urgent need to counter the hegemonism and power politics of certain Western countries\".The law will help \"counteract the containment and suppression\" China faces, the official added.Beijing has long complained about US sanctions and trade restrictions affecting Chinese companies. But in recent months Biden has stepped up US criticism over intellectual property theft and alleged human rights abuses in Hong Kong and the northwestern Xinjiang region.HOW MUCH OF A THREAT IS IT?Ku warned the law had \"some reasonable parts, and some troubling parts\".The section allowing for retaliatory sanctions \"is unprecedented compared to other countries' sanctions regimes\", he said.Foreign companies are regularly caught in the crosshairs of tension between China and Western nations, including recent nationalist attacks on fashion brand H&M for voicing concern about forced labour claims in Xinjiang.Zhang said she believes Chinese authorities will not immediately wield the new powers, given that anxiety among foreign businesses could lead to more decoupling.\"If, however, foreign governments continue to press on with aggressive sanctions, then I believe China will start deploying those anti-sanctions laws to demonstrate their coercive power,\" she said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "China,sanctions,US", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/china-anti-foreign-sanctions-law-explainer-us-blacklist-14993658", "Source": "google"}