{"Type": "", "Time": "2021-06-13", "Headline": "Football: Denmark players too overwhelmed to finish Finland game after Eriksen collapse, says coach, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.COPENHAGEN (REUTERS) - Denmark coach Kasper Hjulmand said several of his players were too overwhelmed with emotion to finish their opening Euro 2020 match against Finland on Saturday (June 12), after teammate Christian Eriksen collapsed on the pitch and was rushed to the hospital.Eriksen was surrounded by his teammates while being treated on the pitch and then stretchered away. The game was eventually restarted an hour and 45 minutes later after news came through that he had regained consciousness.Finland won 1-0 with their only goal attempt of the match.\"I completely understand that you can't play a soccer match at this level after watching one of your best friends fight for his life,\" a visibly drained Hjulmand told a press conference after the game.Players were given the option to finish the game on Saturday evening or on Sunday, Hjulmand said, adding there had been no pressure from Uefa to finish the match on Saturday.\"It was more manageable to go in again and honestly just get it over with,\" Hjulmand said.Several players, including captain Simon Kjaer who plays for Milan in Italy, were too upset to finish the game, he said.\"Simon Kjaer was deeply, deeply touched. He was in doubt whether he could continue and gave it a shot, but ultimately he couldn't. I completely understand that,\" Hjulmand said.A hush fell over the crowd of 16,000 fans while Eriksen received treatment on the pitch, and outside bars around central Copenhagen people gathered, many in tears, while the player's condition remained unclear.Hjulmand said the players came together in the dressing room, supporting each other and allowing themselves to show their emotions.\"I cannot be more proud of this group of people who take such good care of each other at this time, when a loved one is fighting for his life,\" he said.\"It was a very tough night and we were all reminded what's the most important in life.\"Team doctor Morten Boesen said at the press conference that Eriksen received life-saving cardiac massage on the pitch.Boesen added that he talked with Eriksen before he was taken to the hospital, while soccer officials said the player's condition was stable.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-denmark-players-too-overwhelmed-to-finish-finland-game-after-eriksen", "Source": "google"}