{"Type": "", "Time": "2021-06-13", "Headline": "Finland coach happy with win after 'emotional' but sombre night in Denmark", "Text": "published :\n\t\t\t\t\t\t\t\t\t\t\t\t\t13 Jun 2021 at 07:59\t\t\t\t\t\t\t\t\t\t\t\twriter: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tReutersCOPENHAGEN: Finland's 1-0 win over Denmark in their European Championship opener on Saturday will be remembered for several reasons, coach Markku Kanerva said after their historic result was overshadowed by Denmark's Christian Eriksen terrifying health scare.Playing in their first ever major international tournament, Finland claimed a shock 1-0 win after striker Joel Pohjanpalo headed home the winner on the hour, while keeper Lucas Hradecky saved a penalty in the 73rd minute.Finland had only that one attempt on goal, compared with Denmark's 22 shots on goal at the Parken Stadium.\"It was a very emotional night for us,\" Kanerva said. \"First time in a major tournament and an opening game against Denmark in their home stadium. When we heard the national anthems, it was very emotional for us.\"And then what happened with Christian Eriksen - a very dramatic and sad incident.\"And then finally, we get a good result from the game. Of course I am happy for that. Unbelievable, we are going to remember this for a long time for different reasons.\"Eriksen required CPR and emergency medical treatment after collapsing on the pitch, leading to the match being suspended for an hour and 45 minutes before it was restarted.The 29-year-old was rushed to hospital where his condition was stabilised.The Danes were clearly affected by the trauma of Eriksen's collapse, with some wiping away tears before the restart. Finland's Pohjanpalo also refused to celebrate after scoring the winner.\"I said to them that I understood the emotions of the game and how they would feel after what had happened to Christian,\" Kanerva added.\"I said to them, 'Try to focus as much as you can on the game'. I said 'I know it will be difficult to do that', but they coped really well.\"Heavy to very heavy rain is expected in the North and Northeast of Thailand on Sunday due to tropical storm \"Koguma\", the Thai Meteorological Department announced in its 5am weather bulletin.PARIS: After flying into the financial turbulence of the Covid pandemic, the airline sector expects passenger traffic to take off despite concerns about the industry's impact on climate change.Most Thais lack confidence in govt's handling of Covid crisis and see political meddling in vaccine distribution, says Nida Poll.", "Section": "", "Writers": "", "URL": "https://www.bangkokpost.com/sports/2131571/finland-coach-happy-with-win-after-emotional-but-sombre-night-in-denmark", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}