{"Type": "", "Time": "2021-06-13", "Headline": "Singapore-Australia travel corridor may take months to open | The Star", "Text": "\n                    Friday, 11 Jun 2021\n                The meeting between Australia's PM Scott Morrison and Singapore leader Lee Hsien Loong on Thursday (June 10) was the first in-person meeting between them in more than a year. - The Straits Times/ANNSINGAPORE, June 11 (Bloomberg): A planned quarantine-free travel corridor between Australia and Singapore may take months to open because of delays to Australia’s Covid-19 vaccination programme.The two countries are \"putting systems in place that will enable such a bubble to emerge between Singapore and Australia as it does now occur between Australia and New Zealand, ” Australia Prime Minister Scott Morrison said at a joint virtual press conference after meeting Singapore Prime Minister Lee Hsien Loong on Thursday.He cautioned that any corridor is still some time away.Such a bubble hinges on vaccination rates, Lee told reporters. \"Once the majority of the population is vaccinated, it becomes much easier for us to contemplate these openings up, ” he said.That means an operational air-travel corridor could be months away, at least.Only about 5.5 million out of 26 million Australians have had at least one jab, meaning some border restrictions are likely to remain well into next year. Morrison’s government has abandoned its original October target to inoculate the population.Singapore and Australia are among a handful of Asia-Pacific countries that have managed to contain the coronavirus and have been reluctant to ease border restrictions.Australia has largely closed its shores to non-citizens and residents since last year, while Singapore doesn’t allow most short-term visitors to enter, except for those under programs such as a green lane for business travelers.Australia’s strategy of eliminating Covid-19 cases within the community has come under increasing pressure due to leaks of the virus into the community from hotels used to quarantine Australians returning from overseas, triggering localised lockdowns. Melbourne, the second-most populous city with more than five million people, exited a two-week lockdown on Friday.Morrison said discussions between the nations have included giving priority to students from Singapore to return to Australia to complete their studies. That would be a \"first opportunity” for increased travel between the nations, he said.\"When all the preparations are ready, then we can start small with an air-travel bubble to build confidence, ” Lee said at the media conference.Morrison was on an official visit to the city-state, and is due in the U.K. to attend the Group of Seven leaders’ summit this weekend. - Bloomberg\nTags / Keywords:\nAustralia\n                                                                ,\n                                                                                                Singapore\n                                                                ,\n                                                                                                Travel Bubble\n                                                                ,\n                                                                                                Takes Time\n                                                                ,\n                                                                                                Few Months\n                                                                ,\n                                                                                                At least\n                                                                ,\n                                                                                                Morrison\n                                                                ,\n                                                                                                Lee\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\n", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/11/singapore-australia-travel-corridor-may-take-months-to-open", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}