{"Type": "Sport", "Time": "2021-06-13", "Headline": "Football: Eriksen's former cardiologist says he had no history of heart concerns", "Text": "Denmark midfielder Christian Eriksen, who was hospitalised after collapsing during his side's Euro 2020 opener against Finland on Saturday (Jun 12), had no prior heart issues during his time with Premier League club Tottenham Hotspur, his former cardiologist said.Eriksen, 29, collapsed in the 42nd minute of the match while running near the left touchline after a Denmark throw-in and was given life-saving cardiac massage treatment on the pitch, with officials later saying that the player was stable and awake.Dr Sanjay Sharma of St. George's University of London said Eriksen had returned normal tests since 2013, but the sight of the Inter Milan playmaker falling to the ground had briefly raised concerns that doctors had missed something.\"I thought, 'Oh my God? Is there something there that we didn't see?' But I have looked at all the test results and everything looked perfect,\" Sharma told The Mail on Sunday.\"From the day we signed him, it was my job to screen him and we tested him every year. So certainly his tests up to 2019 were completely normal, with no obvious underlying cardiac fault. I can vouch for that because I did the tests.\"Former Bolton Wanderers midfielder Fabrice Muamba said that Eriksen's collapse brought back painful memories of his cardiac arrest on the pitch in an FA Cup match in 2012. The ex-England under-21 midfielder had to retire soon after at the age of 24.\"It brought back stuff that I have put down in me, this emotion that's down there. To watch it from that distance and not know what was going to happen,\" Muamba told the BBC.\"It was scary, but credit to the medical staff. They have done an amazing job on Christian. I like how his team mates got together to protect him.\"I hope things turn out to be OK for him. I hope he will come through.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Christian Eriksen,Euro 2020,Denmark,football,health", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/football-eriksen-former-cardiologist-no-history-heart-15005020", "Source": "google"}