{"Type": "", "Time": "2021-06-13", "Headline": "What is it like to take a DIY Covid-19 test? ST reporter tries it out, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - From June 16, self-administered Covid-19 test kits will be sold in pharmacies here as increased testing becomes part of the \"new normal\" way of life with the coronavirus.Having previously undergone five different types of Covid-19 swabs, including one done by a robot, I decided to try one of these do-it-yourself test kits to see what the process was like, and how it compared with the other types of tests.The kit I tried was the Abbott PanBio Covid-19 Antigen Self-Test. Another test that will be available is the Quidel QuickVue At-Home OTC Covid-19 Test.These two will be sold at Watsons outlets for around $10 to $13 per test kit.Two more, the SD Biosensor Sars-CoV-2 Antigen Self-Test Nasal, and the SD Biosensor Standard Q Covid-19 Ag Home Test, have been approved for use here by the Health Sciences Authority.The Abbott PanBio sample kit came in a blue rectangular box the size of a pencil case. Inside, there were an instruction manual, a swab, a test device, a tiny bottle of solution, and a tube to hold the mixture. A resealable plastic bag was also provided for waste disposal.Before starting, I had to wash and dry my hands. Then, I had to squeeze liquid from the bottle into the tube, making sure it was filled up to a specific level.Setting the tube of liquid aside, I went on to the swab. Removing the stick from its sealed packaging, I took a deep breath and gently pushed it into my nostril.This was the most difficult step for me as I was not sure whether the swab had gone sufficiently deep inside.The instructions said to insert it about 2cm deep, until resistance was felt, but - being paranoid - I was not 100 per cent confident that I was feeling enough resistance. I should perhaps have done this in front of a mirror.I then rotated the swab five times as instructed, ensuring I felt it gently rub the insides of my nose.This step had to be repeated for the other nostril with the same swab. At this point, I was a little more confident of my abilities, and felt more relaxed.Next, I put the stick into the tube of liquid and swirled it, before breaking off the swab along a demarcated line and leaving it in the tube.I then squeezed five droplets from the tube into the test device. I did not need to worry about spilling as there was more than enough liquid in the tube.Almost instantly, the display face of the test device began to turn red. It felt like I was carrying out a science experiment at home.\nA single line on the control indicator means a negative result. ST PHOTO: ONG WEE JIN\nFifteen minutes later, I checked the device and saw that nearly all the redness had disappeared, leaving a single line on the control indicator - a negative result. A positive result would show two red lines.With a sigh of relief, I sealed the used equipment in the resealable bag and threw it in the bin. The entire kit can be used only once, and no, I didn't want to keep it as a souvenir.Overall, I found the test quick and simple to use. It was definitely much less uncomfortable than the polymerase chain reaction (PCR) swab tests I had taken in the past because the swab did not have to be put all the way up my nose, and - for me at least - it was completely painless.While I was initially surprised by the number of steps required, the manual was very detailed, contained helpful diagrams, and was easy to follow.\nThe Abbott PanBio sample kit had an instruction manual, a swab, a test device, a tiny bottle of solution, and a tube to hold the mixture. A resealable bag was also provided for waste disposal. ST PHOTO: ONG WEE JIN\nDr Ling Li Min, an infectious diseases specialist at Rophi Clinic, told me that although there may be some minor variations between the four approved kits, all are antigen rapid tests (ARTs) and should work the same way.Unlike PCR tests, which detect genetic material from the coronavirus, ARTs look for antigens, which are the protein shells that cover the virus, she explained.Dr Ling, who was previously a senior consultant at the National Centre for Infectious Diseases and Tan Tock Seng Hospital, said there are membranes in the test kit containing antibodies.When the solution is dripped on the test kit, it flows through the membranes. If there are antigens present, the antibodies will bind with them and form a line on the display.\nThe solution is dripped on the test kit. ST PHOTO: ONG WEE JIN\nWhile ARTs are faster and less uncomfortable than PCR tests, they are less sensitive. Dr Ling said that generally, PCR tests can detect the virus in someone who has symptoms in their first week of illness about 90 to 95 per cent of the time. ARTs can do this for an estimated 70 to 80 per cent of cases.However, Dr Ling noted that ARTs have a specificity rate of nearly 100 per cent, which means that a positive result is very likely correct.\"If it's positive, you must really quickly go and see a doctor. The chance of a false positive is very, very low,\" she said.She cautioned that those using DIY test kits must read and follow the instructions even if they have used a different brand before as there may be some variations, and the reliability of the result depends on people doing the test correctly.But while such kits may not be suitable for those who are unable to follow instructions or have trouble carrying out the test on their own, such as the very old or young, Dr Ling said they have an important part to play in the nation's overall strategy to combat Covid-19.This is because such kits can help increase the frequency of tests done here, potentially allowing cases to be detected and tackled before they turn into clusters.From a psychological point of view, they can also help give peace of mind to people who want to know if they are infected, she said.Dr Ling added: \"If we do it well and properly, and if enough people buy into it, it's one way to keep from needing heightened restrictions every now and then, and we can carry on with our lives… simply through more testing that people are going to be comfortable with.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/what-is-it-like-to-take-a-diy-covid-19-test-an-st-reporter-tries-it-out", "Source": "google"}