{"Type": "", "Time": "2021-06-13", "Headline": "Djokovic defeats 13-time champion Nadal in epic French Open semi-final - CGTN", "Text": " Share CopiedNovak Djokovic handed 13-time champion Rafael Nadal only his third defeat in 16 years and 108 matches at the French Open on Friday (June 11) to reach his sixth Roland Garros final in an epic showdown. In their 58th career clash, Djokovic triumphed 3-6, 6-3, 7-6 (7/4), 6-2 and stays on course to capture a 19th major and become the first man in over 50 years to win all four Slams twice. Nadal, 35, who would have been the oldest finalist at the French Open in the modern era, remains tied on 20 majors with Roger Federer. Rafael Nadal of Spain reacts after hitting a shot into the net during the third set tie break against Novak Djokovic of Serbia during the semi-final at the 2021 French Open in Paris, France, June 11, 2021. /CFP\"It was a privilege to face Rafa in such an incredible match,\" said Djokovic after four hours and 11 minutes of intense action. It was Nadal's first defeat in 14 semi-finals in the French capital. \"Probably it was not my best day today, even if I fought,\" said Nadal, \"sometimes you win, sometimes you lose. I had a big chance. There were some crazy points but there was fatigue there.\"The semi-final was even given permission to be concluded in front of spectators despite the tie exceeding an 11 p.m. COVID-19 curfew. Stefanos Tsitsipas of Greece (L) shakes hands with Alexander Zverev of Germany after winning the Men's Singles semi-final at the 2021 French Open in Paris, France, June 11, 2021. /CFPDjokovic, the 2016 champion in Paris who had also beaten Nadal at the 2015 tournament, will face Stefanos Tsitsipas in Sunday's final in what will be his 29th championship match at the Slams. Tsitsipas had earlier become the first Greek to reach a Grand Slam final with a 6-3, 6-3, 4-6, 4-6, 6-3 victory over Germany's Alexander Zverev. (With input from agencies)Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3", "Section": "", "Writers": "", "URL": "https://news.cgtn.com/news/2021-06-12/Djokovic-defeats-13-time-champion-Nadal-in-epic-French-Open-semi-final-111DQDdagog/index.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}