{"Type": "", "Time": "2021-06-13", "Headline": "Man who assaulted police officer 'did not like' his face", "Text": "SINGAPORE — A secret society member who brutally assaulted a police officer and caused him to suffer a traumatic brain injury with help from his twin brother was jailed for two years, nine months and four weeks on Friday (11 June).Muhammad Farhan Jaffri and his twin brother Muhammad Fiqkri Jaffri, both 26, attacked Sergeant Chong Jiawei, 27, a ground response officer who was on patrol duty on 23 February last year.The attack left Chong unconscious and incapacitated, and he was given 29 days of leave due to his injuries.Farhan, who pleaded guilty to five charges of causing grievous hurt and hurt to a public servant, vandalism, being a member of a secret society and using abusive language on a public servant, was also given three strokes of the cane and fined $3,500. Four charges of a similar nature were considered for his sentencing. Fiqkri's case is still pending before the courts. He faces seven charges, including causing grievous hurt to a public servant. On 23 February last year, at about 4am, Farhan, who was drunk, was having an argument with his wife at the void deck of Block 755 Jurong West Street 74 when a member of the public called the police over the commotion.Four police officers, including Chong, were dispatched to the location, and they saw Farhan’s wife in tears. A female police officer was checking on the wife when Farhan became defensive. At this point, Fiqkri arrived and approached the officers aggressively, pointing his finger at the officers and demanding to know why they were questioning his brother.Fiqkri asked Farhan and his wife to return to his unit and asked the police officers to “shut up”. Farhan left but verbally abused the female police officer first.Within minutes, Farhan returned and shouted that he did not like the faces of the officers. His twin asked Farhan whose face he did not like and Farhan gestured at Chong’s face.Fiqkri turned to Chong and swung his fist at the officer’s face. Chong fell to the ground and Farhan joined him in assaulting the police officer. Farhan and Fiqkri rained punches and kicks on the officer, despite attempts by the other officers to restrain the brothers.The brothers hurt another male officer, who was on reservist, during the struggle. Their violence prompted the female police officer to draw her baton and call for reinforcement. They finally managed to handcuff Fiqkri. Two other police officers arrived and handcuffed Farhan.After Farhan was escorted into the police vehicle, he yelled and knocked his head on the window repeatedly. He then kicked the window three times, causing the right rear window to shatter. At that point in time, one officer was standing guard beside the right rear seat of the vehicle. The damage cost $201. Farhan has since made full restitution.Chong was conveyed to hospital. His medical report, dated 9 March last year, stated that as a result for the attack, Chong slumped to the ground and briefly lost consciousness. He was diagnosed with abrasions over his eyelid, laceration over his ear, facial bruises, and a concussion. He was admitted for two days into the neurosurgery ward for monitoring.Due to his traumatic head injury, Chong was given 29 days of hospitalisation leave. The other officer who was injured had bruises and abrasion over his head. Both officers' medical bills were covered by service insurance.Deputy Public Prosecutor Chng Luey Chi sought a jail term of between 39 months and 4 weeks, and 39 months and 6 weeks, along with three strokes of the cane and a fine of $3,500 against Farhan.Citing Chong’s victim impact statement, DPP Chng told the court that the police officer was deployed to an administrative role for a month before returning to a frontline role.“This was to help the victim build up confidence in the execution of his duties as a frontline officer. Moreover, the incident had caused the victim worries about how his supervisors might perceive his abilities,” said DPP Chng.The manner of the attack was “sustained, brutal, and cruel”, said DPP Chng, who noted that Farhan had attacked the officer simply because he \"did not like” Chong’s face.Voluntarily causing grievous hurt to a public servant carries a jail term of up to 15 years, and fine or caning. Causing hurt to a public servant carries a jail term of seven years and fine or caning. Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeOther Singapore stories:HSA busts Vision Empire illegal mask manufacturing facilitySingapore and Australia to work towards air travel bubble, with priority on studentsSingapore-HK ATB review in July, no 'firm plans' for South Korea travel bubbleCyclist who punched lorry driver along Jalan Eunos fined $5,600Man assaulted private hire car driver in road rage incidentChina's quick rollout of a law against foreign sanctions has left European and American companies shocked and facing \"irreconcilable\" compliance issues, two top business groups said Friday, despite Beijing saying the move would unlikely impact investment.The Ministry of Health (MOH) on Friday (11 June) confirmed nine new COVID-19 cases in Singapore, bringing the country's total case count to 62,245.Få flere penge i hverdagen ved at samle din gæld. Indsend en ansøgning her og få et tilbud. Indfri lånet når du ønsker det.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Second Minister for Education Maliki Osman has taken to Facebook to express his shock and disappointment at alleged Islamophobic remarks made by a Ngee Ann Polytechnic (NP) lecturer.A 24-year-old man who was seen naked in public in several photos and videos circulating online has been arrested by the police.Kia ProCeed betager med flot design, imponerende udstyr og stor power.What if China were to cut off the United States and Europe from access to rare minerals that are essential to electric vehicles, wind turbines and drones?Newly-crowned French Open champion Barbora Krejcikova hailed her mentor and former Wimbledon champion Jana Novotna who died in 2017, saying: \"At the end of her life, I had to be there.\"A firebrand Pakistani scholar has been detained for making death threats against Nobel prize laureate Malala Yousafzai over her comments on marriage, officials said Friday.En elektrisk tandbørste med kunstig intelligens? Oral-B har gjort din eltandbørste endnu smartere - og din tandbørstning sjovere.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.Agnes Chow hails from a generation of Hong Kong democracy activists who cut their teeth in politics as teenagers and are now being steadily silenced by China.The US Food and Drug Administration said Friday it had told Johnson & Johnson that millions of doses of Covid vaccine produced at a troubled plant can't be used because of possible contamination issues.Bedste sikkerhed i klassen. A+ forbrug 19,2 km/l, 117-118 g/km co2. Prisen gælder indregistrering senest 30/06/2021.Not sure what to do with that pile of credits you’ve banked up over the years? How about revisiting your National Service days with these top 10 buys from the SAF eMart. As you’re probably aware, the Singapore Armed Forces (SAF) consists of young male […] The post SAF eMart Shopping Guide – Best Things to Buy With Your NS Credits appeared first on SingSaver Blog - We Compare, You Save.Brazilian President Jair Bolsonaro was fined $100 Saturday for violating Covid-19 containment measures in Sao Paulo state by failing to wear a face mask and provoking huge crowds at a motorcycle rally for supporters.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Sådan investeres i aktier på 5 minutter via din telefon.A closer look at the reasons why Nong-O Gaiyanghadao is considered one of the greatest Muay Thai fighters of all time.An unnamed bidder paid $28 million at auction Saturday for a seat alongside Jeff Bezos on board the first crewed spaceflight of the billionaire's company Blue Origin next month.High coverage, no-fuss application and early benefit payout makes this a great plan for those seeking cancer protection. As many as 1 in 4 Singaporeans could develop cancer in their lifetimes. Hence, getting a protection plan specifically for cancer may be a prudent move, especially […] The post FWD Cancer Insurance (Review): Fuss-free Plan That Pays Out At All Stages appeared first on SingSaver Blog - We Compare, You Save.Få den bedste forsikringspakke med hus, indbo, ulykke og bilPresident Vladimir Putin on Friday denied a US media report that Russia is set to deliver an advanced satellite system to Iran that will vastly improve its spying capabilities.Several thousand people joined an interfaith marched on Friday evening honoring the four members of a Muslim family who were killed in an attack that has shocked Canada.Euro 2020 was still reeling Sunday after Denmark midfielder Christian Eriksen collapsed and had to be revived by medics on the pitch during his country's defeat to Finland.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/man-assaulted-police-officer-did-not-like-his-face-072038712.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}