{"Type": "", "Time": "2021-06-13", "Headline": "'It doesn't get any better' - Immobile and Italy emotional after Euro-opening win following year battling 'this damn virus' | Goal.com", "Text": "Italy star Ciro Immobile basked in his goal against Turkey on Friday as he and his team-mates embraced fans returning to the stands after more than a year of battling the coronavirus.Immobile scored the second of Italy's goals, leading the way in a 3-0 win that also included a finish from Lorenzo Insigne and an unfortunate own goal from Merih Demiral.Italy's Euro 2020-opening win came at the Stadio Olimpico, home of Immobile's club team Lazio, making the striker's goal even sweeter.“Seeing the fans celebrate after all this time was wonderful, we finally got to come together after so long of this damned virus,” Immobile told RAI Sport.“I think we showed patience this evening. Turkey are a strong side and caused problems for many top teams. We tried to tire them out in the first half, moving the ball left and right, trying to spread them.“Unfortunately, we regularly hit their brick wall, especially as we’re not that good in the air. Turkey were more tired after the break, and after the goal they had to open up some spaces, so that’s when our quality emerged.“Scoring a goal on the Euros debut in my stadium, it doesn’t get better.”Immobile wasn't the only one moved by Friday's match, as Man of the Match Leonardo Spinazzola admitted it was an emotional day.Italy was one of the countries hit hardest by the coronavirus over the last year, and seeing fans in the stadium once again was something special to the Italy defender.“The emotions started on the bus towards the stadium, seeing all the people in the streets. It really did give us goosebumps,” he told Sky Sport Italia.“It was a perfect performance. We were patient, we moved the ball around well. Then afterwards I saw my son in the stands, it was emotional.”  Italy kickstarted the tournament in style with the 3-0 win in what was their first ever three-goal performance at the Euros.The Azzurri are seen by many as a contender to make a deep run into the tournament, although they haven't received the same attention as some of the other tournament favourites.Friday's result will no doubt give them some momentum heading through the rest of the group stages and perhaps even into the knockout rounds going forward.“When you start this adventure, you need some tension, some goosebumps, the desire to get out there. I imagined it’d be like this because of the path we took to get here,” defender Leonardo Bonucci told Sky Sport Italia.“Now this is the first in a long journey, so we keep our feet on the ground, as it’s going to be a run of very close games, the opponents will get to know us better, but we know that we can have our say.“With people around us in the stands, it’s a whole other style of football. They keep our hearts aflame throughout the match.“Now from tomorrow let’s cancel out the negative, take the positive and prepare for the next match.”", "Section": "", "Writers": "", "URL": "https://www.goal.com/en-sg/news/italy-stars-reflect-on-emotional-win-after-spending-over-a/1frnwamh2ugz318hgs241ogtyb", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}