{"Type": "", "Time": "2021-06-13", "Headline": "$15m set aside to give airport workers special allowance, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.A $15 million sum has been set aside to provide some 5,000 airport workers with a special monthly allowance for six months.The fund will also be used to cater meals for them during their shifts and to defray the cost of their personal protective equipment, the Civil Aviation Authority of Singapore (CAAS) and Changi Airport Group (CAG) said yesterday.It is meant to help the workers as they adjust to stricter safety protocols put in place at the airport, including segregating them into three zones. The 14,000 workers have to eat in their own zones.CAG and CAAS said the fund follows discussions with staff, unions and companies in the airport community. The enhanced measures were put in place after a Covid-19 cluster broke out at Terminal 3 last month.A total of 108 people - 43 of whom were airport workers - had been infected. The agencies said 42 airport workers have been discharged, with the remaining worker recovering in hospital without needing additional oxygen.Investigations traced the likely source of infection to staff working in the arrival halls and baggage claim areas, who likely caught the virus from incoming passengers.These workers likely transmitted the virus to members of the public while eating at the Basement 2 foodcourt in T3.As a result, all areas where some 4,400 workers encounter arriving passengers are regarded as the highest-risk zone - the departure and arrival gates, arrival immigration hall and baggage claim hall.These workers have to take an additional antigen rapid test between their routine polymerase chain reaction tests, and don full personal protective equipment at all times, except during meal times and toilet breaks. During their shifts, they are not allowed to leave their zone, and will not be cross-deployed to lower-risk zones.At the T3 foodcourt, which remains closed for now, plexiglass panels have been installed along with tape markings to restrict each table to one diner each.Transport Minister S.Iswaran yesterday said airport workers remain \"very resolute\". \"They understand the challenge, the need for many of the adjustments that they have to make. There is a certain optimism, that we can get through this.\"Asked if there could be more financial support for the sector, Mr Iswaran said the Government remains committed to help, but any aid will be based on an assessment of the situation going forward.Responding to queries, CAG also said tenants in airport terminals will continue to have their rental fees waived until they are allowed to reopen.Jewel Changi Airport will open from Monday, but the terminals will stay closed to the public for now to give the staff some time to get used to the new measures.Mr Iswaran said the change in operations at the airport is a major one. \"When we talk about the Changi experience, what it means is travellers from all over the world coming, and in fact, mingling as they experience Changi,\" he added.\"Now, we want to segment the passengers. We are taking a much more calibrated approach.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/15m-set-aside-to-give-airport-workers-special-allowance", "Source": "google"}