{"Type": "", "Time": "2021-06-13", "Headline": "India's daily coronavirus cases below one lakh for fifth consecutive day", "Text": "\n                        The daily COVID-19 count in India remained below the one-lakh mark for the fifth consecutive day with the country reporting 84,332 fresh cases, its lowest in 70 days, according to data updated by the Union Health Ministry on Saturday.\r\n\n                    \n                            Representational image\n                        The daily COVID-19 count in India remained below the one-lakh mark for the fifth consecutive day with the country reporting 84,332 fresh cases, its lowest in 70 days, according to data updated by the Union Health Ministry on Saturday.With the fresh cases, the infection tally has climbed to 2,93,59,155. The COVID-19 death toll climbed to 3,67,081 with 4,002 daily deaths, the data updated at 8 am showed.The number of active cases further declined to 10,80,690 accounting for 3.68 percent of the total infections, while the national COVID-19 recovery rate has improved to 95.07 per cent.\nIndia's active caseload declined to less than 11 lakh after 63 days while 84,332 new cases reported in 24 hours are the lowest in 70 days, the ministry said.Also, 20,44,131 coronavirus tests were conducted on Friday taking the total number to 37,42,42,384.The daily positivity rate was recorded at 4.39 percent. It has been less than 10 per cent for the 19th consecutive day, the ministry said, adding the weekly positivity rate has also declined to 4.94 per cent.Recoveries continue to outnumber daily new cases for the 30th consecutive day. The number of people who have recuperated from the disease surged to 2,79,11,384, while the case fatality rate has increased to 1.25 percent, the data stated.Other highlights- Seven-day moving average of new cases below 1 lakh after 66 days- Tamil Nadu reports 15.76k new cases, Kerala 14.23k, Maharashtra 11.76k- Maharashtra reports 2619 new deaths, Tamil Nadu 378, Karnataka 159- Five states/UTs report rise in active cases: Maharashtra, Bihar, West Bengal, Arunachal Pradesh, A&N Islands- Difference between new cases reported in the last 7 days and the preceding 7 days is -32percent (world average is -14 percent)- 34.34 lakh new vaccinations. 24.96 crore total. 31.08 lakh received their first dose yesterday, 3.26 lakh second dose- 19.20 lakh new tests. Test positivity rate: 4.39 percent (4.49 percent the previous day)- Test positivity rate below 5 percent for the 5th day- Test positivity rate: Kerala 13.45 percent, Sikkim 12.64 percent, Goa 12.52 percent. Uttar Pradesh 0.20 percent, Delhi 0.41 percent, Madhya Pradesh 0.55 percent- Active cases in India now less than in Brazil\n                Updated Date:\n                \n                    June 12, 2021 12:11:07 IST\n                \n\n                        TAGS:\n                    \n                Coronavirus updates: Maharashtra also reported less than 20,000 COVID-19 cases for the sixth consecutive on Saturday\n            \n                Coronavirus Live News Updates: The CM also reviewed the status of paediatric ICUs, which are being set up at various government hospitals, and functioning of 13 oxygen plants in the state\n            \n                Coronavirus News Updates: The tally of COVID-19 cases in Mumbai rose to 7,15,146, while the toll reached 15,146.\n\n\n\n\n\n\n\n\n\n            Sign up for a weekly curated briefing of the most important strategic affairs stories from across the world.FirstpostSectionPlusToolsAppsNetwork18 sites Copyright © 2021. Firstpost - All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.firstpost.com/india/india-reports-84332-new-cases-in-24-hours-its-lowest-in-70-days-positivity-rate-at-4-39-9709531.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}