{"Type": "", "Time": "2021-06-13", "Headline": "India cuts taxes on medicines and equipment to treat Covid-19, South Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.NEW DELHI (REUTERS) - India on Saturday (June 12) cut taxes on medical equipment such as oxygen concentrators and drugs used to treat Covid-19 infections, after widespread criticism over healthcare costs during a devastating second wave of the virus in April and May.The government cut taxes on medical grade oxygen, ventilators, the remdesivir antiviral drug, diagnostic kits, pulse oximeters and hand sanitisers to 5 per cent from 12-18 per cent with immediate effect.The new levies will be in place until the end of September, Finance Minister Nirmala Sitharaman said, adding it would include taxes on electric furnaces in crematoriums and ambulances.\"The rate cut has not be done with any cost implication (on government finances) in mind, it has been done so that people get some ease....the decision has been taken to provide ultimate ease to patients,\" Revenue Secretary Tarun Bajaj told a news conference.The government, however, would continue to tax vaccines at 5 per cent, he added.The world's second-most populous country, where coronavirus cases hit a peak of 400,000 a day in May, reported 84,332 new infections on Saturday, the lowest in more than two months, data from the health ministry showed. There were 4,002 deaths.The South Asian country's total Covid-19 cases stands at 29.4 million, with 367,081 fatalities.During the second wave of the virus many people resorted to costly private treatment in what is still a low-income country.Others paid twenty times the usual price for oxygen cylinders on the black market and huge sums to secure ambulances and hearses.Experts have said millions of people remain vulnerable to new surges of infections, particularly in the countryside where two-thirds of the population lives.Prime Minister Narendra Modi has said the government would take over the inoculation programme from Indian states and offer free doses to everyone over the age of 18.The government would allow private hospitals to have 25 per cent of all vaccine supplies, but not to charge more than 150 rupees (S$2.72) over the cost of the dose, he said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/south-asia/india-cuts-taxes-on-medicines-and-equipment-to-treat-covid-19", "Source": "google"}