{"Type": "Sport", "Time": "2021-06-13", "Headline": "Nearly two thirds of Brazilians oppose hosting Copa America amid pandemic - poll", "Text": "RIO DE JANEIRO:     Nearly two thirds of Brazilians oppose the country hosting the upcoming Copa America soccer tournament, a poll showed on Friday, amid concerns over the country's dire COVID-19 outbreak.The South American Football Confederation last week unexpectedly relocated the tournament, which kicks off on Sunday, with Brazilian President Jair Bolsonaro's backing.Brazil stepped up after co-hosts Colombia were dropped because of civil unrest and Argentina withdrew after a surge in coronavirus infections.Bolsonaro has played down the severity of the pandemic and fought against lockdowns to control an outbreak that has killed more than 480,000 Brazilians. Public health experts, Supreme Court justices and footballers questioned the wisdom of hosting the tournament with a pandemic raging, while high-profile sponsors have pulled out.According to an XP/Ipespe poll, 64per cent of respondents were against hosting the cup, while 29per cent were in favor. Among Bolsonaro's critics, 83per cent were against the tournament in Brazil, while 35per cent of his supporters also did not support the competition.Ahead of next year's elections, former leftist President Luiz Inacio Lula da Silva appears to be strengthening his lead over Bolsonaro, the poll showed. Although neither men have announced their candidacy, the 2022 election is widely expected to be a run-off between the two polarizing figures.In the first round vote, Lula saw his share rise to 32per cent, up three percentage points from a May poll. Bolsonaro's first-round support slipped one percentage point to 28per cent. In a simulated second-round matchup, Lula's support rose to 45per cent from 42per cent in the previous survey, while Bolsonaro's fell to 36per cent from 40per cent.The poll was based on 1,000 interviews, conducted from June 7-10, with a margin of error of 3.2 percentage points.(Reporting by Gabriel Stargardter; Additional reporting by Jamie McGeever; Editing by Brad Haynes and Nick Macfie)It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "business and finance,Jair Bolsonaro,Brazil,poll,Copa America", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/nearly-two-thirds-of-brazilians-oppose-hosting-copa-america-amid-pandemic---poll-14996228", "Source": "google"}