{"Type": "", "Time": "2021-06-13", "Headline": "Wider range of sports activities to be allowed as S'pore eases Covid-19 curbs in phases, Sport News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A wider range of sports activities will be allowed in the coming weeks when Singapore enters phase three (heightened alert) on Monday (June 14).Selected organised outdoor programmes with a cap of five people - up from two - may resume, while from June 21, sport competitions and tournaments without spectators will be given the green light as long as they do not exceed 50 persons in each facility.These were among the latest updates in Sport Singapore's (SportSG) advisory issued on Friday.The rules for outdoor training for youth and children aged 18 and under will be eased progressively. For the first week, low- and high-intensity activities will be kept to a maximum of five. From June 21, this will increase to 30 with multiple groups of five.For adults, the five-person cap for high-intensity activities will be relaxed from June 21 as well.Swimfast Aquatic Group founder David Lim welcomed the changes. His academy has been operating at 20 per cent for the past month during the heightened measures for Phase 2.High-intensity outdoor activities such as swimming, where masks have to be removed, were restricted to two people and no multiple groups of two are allowed. This includes the coach or instructor.As such, Lim had to suspend the academy's learn-to-swim sessions since the start of the current heightened phase began on May 16 and continued only his competitive swimming sessions.He said: \"It's a relief, we can legitimately carry on the classes. Now, we're only doing competitive swimming, so it's no different. We're just like a pool operator. Swimmers book a lane and swim by themselves.\"Now we don't have to juggle such small numbers. We can carry out lessons with four swimmers to one coach. That ratio is a huge difference to us because when it's one-to-one, we're definitely losing money.\"The multi-ministry task force on Thursday had indicated that mass participatory sports events such as runs could also be allowed to resume from June 21, with a maximum of 250 participants if pre-event testing is implemented.If participants are not tested before the event, only 50 people will be allowed to take part.National agency SportSG's latest update permitting sports competitions - as long as different sessions are adequately separated within a day or across multiple days to avoid congregation - was welcomed by organisers like LLD Sports Development and Management founder Lyn Yeo.Her company is hoping to get approval for the CarTimes Singapore Junior Development Tour Championship. The golf event at Laguna National was postponed from its original May 31-June 2 date.She said: \"June is typically the busiest tournament season for junior golfers and we are hoping with great excitement that we are able to resume.\"Some measures that organisers plan to have in place include temperature screening and safe entry protocols, as well as restricting each flight to two buggies, which have been installed with a full partition.Players and officials will also be required to wear masks throughout their rounds.For gyms and fitness studios, many of whom are closed due to current restrictions, they will be allowed to restart operations from June 21.Staff from these places where clients are unmasked will be required to undergo regular Covid-19 testing, which is part of the regular fast and easy testing regimen for staff involved in \"higher-risk mask-off\" activities. This will be introduced in July to reduce transmission during phase three (heightened alert).SportSG also announced that the occupancy limit for sport and recreational facilities will be increased to one person per 10 sq m from one person per 16 sq m, capped at 50 people.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/wider-range-of-sports-activities-will-be-allowed-in-the-coming-weeks-in-next-phase-of", "Source": "google"}