{"Type": "", "Time": "2021-06-13", "Headline": "Israel's Netanyahu poised to lose power to new government - BBC News", "Text": "Israel's parliament is expected to approve the formation of a new government later on Sunday, ending 12 years of rule by PM Benjamin Netanyahu.The prospective government - an unprecedented coalition of parties - has a razor-thin majority of one seat.It would also end more than two years of political paralysis in which three elections resulted in stalemate.Right-wing nationalist Naftali Bennett is poised to become PM in a power-sharing deal with a centrist leader.Under the coalition agreement, Mr Bennett, who heads the Yamina party, will hold office until September 2023, when he will hand over to Yair Lapid, leader of Yesh Atid, for a further two years.Mr Netanyahu - Israel's longest-serving leader, who has dominated its political landscape for years - would remain head of the right-wing Likud party and become leader of the opposition. He has railed against the likely new government, calling it a \"dangerous coalition of fraud and surrender\" and has vowed to \"overthrow it very quickly\".Meanwhile, his trial on charges of bribery, fraud and breach of trust - allegations he denies - continues.Mr Netanyahu has served a record-breaking five terms, first from 1996 to 1999, then continuously from 2009 to 2021.He called an election in April 2019 but failed to win enough support to form a new coalition government. Two more elections followed, each of which ended inconclusively. The third election resulted in a government of national unity where Mr Netanyahu agreed to share power with the then-opposition leader Benny Gantz. But the arrangement collapsed in December, triggering a fourth election.Although Likud emerged as the largest party in the 120-seat parliament, Mr Netanyahu was again unable to form a governing coalition and the task was handed to Mr Lapid, whose party had emerged as the second largest. Opposition to Mr Netanyahu staying in power had grown, not just among the left and centre but also among right-wing parties that are ordinarily ideologically aligned to Likud, including Yamina.Although Yamina came joint fifth in the election with only seven seats, its support was critical if any potential coalition government was to have a majority in parliament. After weeks of negotiations, Mr Lapid brought Yamina on board as part of a constellation of parties whose only common goal was to remove Mr Netanyahu from office.The agreement involving eight factions with the 61 seats required for a majority was signed on 2 June, just half an hour before a deadline was due to expire, effectively sealing Mr Netanyahu's fate.In appearance, Mr Bennett's government would be unlike any which has preceded it in Israel's 73-year history. The alliance contains parties which have vast ideological differences, and perhaps most significantly includes the first independent Arab party to be part of a potential ruling coalition, Raam. It is also expected to have a record number of eight female ministers.The inclusion of Raam and left-wing non-Arab Israeli parties means there could be friction on issues such as Israeli policies towards Palestinians - Yamina and another right-wing party, New Hope, are staunch supporters of Jewish settlement in the Israeli-occupied West Bank, for instance. There could also be difficulties over social policies - while some parties want to advance gay rights, such as recognising same sex marriages, Raam, an Islamist party, is against this. In addition, some parties want to relax religious restrictions more extensively than Yamina - a national-religious party - will likely allow.Mr Bennett has indicated his government would focus on areas where agreement was possible, like economic issues or the coronavirus pandemic, while avoiding more contentious matters.\"Nobody will have to give up their ideology,\" he recently said, \"but all will have to postpone the realisation of some of their dreams... We'll focus on what can be achieved, rather than arguing about what cannot.\" Netanyahu seeks block on deal to oust himThe coalition that could end 'King' Bibi's 12-year reignThe rise of Naftali Bennett, Israel's likely PMNetanyahu: Commando turned PMAttenborough: G7 faces historic climate decisionsSir David warns world leaders that humans may be \"on the verge of destabilising the entire planet\".Denmark's Eriksen 'awake' after collapsing in Euro 2020 gameNetanyahu faces end of rule in new government vote'It hit the valley floor like 15 atomic bombs''I miss airline meals so much I make them at home'The risqué business of selling underwear in PakistanNuts, wine and juice - the many joys of cashewsFrom Air Force One to Beast - Biden's travel kitThe new Dutch wellness trend taking the world by stormThe year in the life of a viral Delhi eatery ownerWhen can you trust statistics?Unearthing Joe Biden's unsung English rootsLyrics quizHave you been getting these songs wrong?Feeling hotWhat happens to your body in extreme heat?Biden gifts Johnson custom-made bike at G7 summit1Attenborough: G7 faces historic climate decisions2Eriksen 'awake' after collapsing3Disruption to shipping could last until Christmas4Netanyahu faces end of rule in new government vote5Swiss to vote in pesticide ban referendum6Bidder pays $28m for space trip with Amazon boss7From Air Force One to Beast - Biden's travel kit8E3 2021 kicks off with Avatar and Mario reveals9The risqué business of selling underwear in Pakistan10© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "Section": "", "Writers": "", "URL": "https://www.bbc.com/news/world-middle-east-57396990", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}