{"Type": "", "Time": "2021-06-17", "Headline": "Beijing’s top diplomat in Hong Kong doubles down on warnings to ‘foreign forces’ in first public appearance", "Text": "Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”.In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing need to fight back against hegemonism and power politics” and to safeguard national sovereignty and security.“Here is our solemn message to the small handful of anti-China forces: the dignity and legitimate rights of the Chinese people are not to be undermined. The historical trend towards the great rejuvenation of the Chinese nation under the CPC [Communist Party of China] leadership is not to be stopped,” he said on Wednesday.Do you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team.“Any attempt, open or underhanded, to interfere in China’s internal affairs and curb China’s development is doomed to fail.”Liu’s message was delivered at an international symposium celebrating the coming 100th anniversary of the Communist Party. Co-organised by Beijing’s liaison office in Hong Kong and the state-owned Bauhinia Culture Holdings, the forum was attended by more than 100 guests from the city’s political and business sectors, as well as by local and overseas academics who joined via video link.Earlier this month, Liu said he would work with Chief Executive Carrie Lam Cheng Yuet-ngor to safeguard China’s sovereignty and security and to oppose external interference, during a 40-minute meeting with the city’s leader at Government House.China’s top legislative body imposed a sweeping national security law on Hong Kong last June, then followed it with a radical shake-up of the city’s electoral system earlier this year intended to ensure that “patriots” would dominate the legislature and other key political institutions.Liu on Wednesday said those two decisions had delivered “a major transformation from chaos to stability” in Hong Kong.“‘One country, two systems’ has entered another stage of enduring success,” he said, referring to the governing principle in the city.“At this historical juncture, the commissioner’s office will … stay true to our founding mission as we forge ahead. We will more vigorously oppose external interference, serve the [city’s] development and put people at the centre, and join hands with the Hong Kong community to take diplomatic work related to Hong Kong to new heights.”Liaison office deputy director Tan Tieniu, speaking at the same forum, said the security law and electoral overhaul had helped protect the city’s constitutional order, prosperity and stability.In her own speech, Lam said that even though Hong Kong had faced unprecedented challenges since the 2019 social unrest, the central government and Communist Party had stayed true to the original intent of one country, two systems.“Now that Hong Kong has been put back on its right course under the party’s declared institutional strength of one country, two systems, we should make our contribution to the Chinese dream by embracing patriotism, national pride, team spirit and hard work and putting the people’s interest first,” she added.More from South China Morning Post:Beijing’s new chief diplomat in Hong Kong says battle against ‘foreign forces’ his top priority, dubs 2019 protests a ‘colour revolution’Beijing’s anti-sanctions law will give US, others ‘a taste of their own medicine’, Hong Kong leader Carrie Lam saysNational security law: Hong Kong, Beijing tell Britain to ‘abandon colonial nostalgia’ after report accuses authorities of stifling dissentThis article Beijing’s top diplomat in Hong Kong doubles down on warnings to ‘foreign forces’ in first public appearance first appeared on South China Morning PostFor the latest news from the South China Morning Post download our mobile app. Copyright 2021.Beijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityHong Kong police rounded up 79 people in a series of raids that shut down two underground casinos and an unlicensed pub in the span of two hours on Tuesday night. In one raid on a Ko Shing Street flat in Sai Ying Pun, officers found a baccarat table and two large televisions used to play online card games, seizing HK$215,000 (US$27,697) in cash, HK$410,000 in chips and five account books. Sixteen men and six women, aged 31 to 74, were inside the premises when officers from the Western special duIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Browsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.The freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Chinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiBurner phones, safehouses, sheltering with rebels and months away from loved ones -- Myanmar anti-coup activists have been driven underground by a brutal crackdown but have no regrets about choosing life on the run.Italy became the first team to reach the knockout stage of Euro 2020 as midfielder Manuel Locatelli scored twice in a 3-0 win over Switzerland in Rome on Wednesday, while Wales moved to the brink of joining them by beating Turkey.For Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.When 28 Chinese warplanes streaked through the skies around Taiwan on Tuesday – the largest such incursion this year – they followed a pattern that has generated alarm among US and Taiwanese military planners.Deposed Myanmar leader Aung San Suu Kyi went on trial for sedition in a junta court Tuesday, more than four months after her government was ousted in a coup that has thrown her country into turmoil.Los Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.China’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the buAustralia recommended that AstraZeneca's Covid-19 jab should not be given to people under 60 on Thursday, a fresh blow to the country's glacial vaccine rollout.The UN aviation agency said Wednesday it will release an interim report next week on the diversion of a Ryanair flight by Belarus that caused a global outcry.Megaworld Corp. is seeking to raise as much as P27.3 billion ($568 million) from an initial public offering of its office unit in what would be the Philippines’ biggest for a real estate investment trust.Prime Minister Boris Johnson warned Wednesday he will take \"necessary steps\" to unilaterally alter Britain's post-Brexit trade terms unless the EU changes the way it is implementing them in Northern Ireland.The European Union and United States launched a trade and technology council that seeks to “write the rules of the road” on the global economy, in the face of growing competition from China. It was the latest salvo against Beijing on US President Joe Biden’s whistle-stop European tour, which had seen him succeed in rallying support among the G7, Nato and now EU for a much-vaunted transatlantic coalition to face down China’s rising influence. A joint EU-US statement said the council would focus o", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/beijing-top-diplomat-hong-kong-080525629.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}