{"Type": "", "Time": "2021-06-17", "Headline": "Centuries-old shipwrecks discovered in Singapore waters; artefacts to be displayed in museums | The Star", "Text": "\n                    Wednesday, 16 Jun 2021\n                Both wrecks, bearing Chinese ceramics as their primary cargo, were found in the waters off Pedra Branca. - ISEAS - YUSOF ISHAK INSTITUTESINGAPORE (The Straits Times/ANN): Two shipwrecks - one dating possibly to the 14th century and the other to the 18th - have been excavated within Singapore's waters - a first for the nation and a groundbreaking development for its maritime heritage.Both wrecks, bearing Chinese ceramics as their primary cargo, were found in the waters off Pedra Branca, a rocky outcrop surrounded by shallow waters where ships throughout history have come to grief.The plan is to display the artefacts in museums here from the end of this year.Maritime archaeologist Michael Flecker, who supervised both excavations, described the first wreck as a \"pretty remarkable\" find, as it is contemporary with the Temasek period that spans the 1300s to 1600s.While research may never reveal the exact vessel that sank, as no remnants of its hull remain, the second wreck has been identified as the India-built merchant vessel Shah Munchah.It sank in 1796 as it was returning to India from China.How the wrecks were discoveredIt all started with an accident.A Singapore-registered barge carrying two bulk loader cranes encountered bad weather while on its way to Kuantan and ran aground at Pedra Branca on Dec 30, 2014.The two cranes were at risk of toppling onto Pedra Branca’s famous Horsburgh Lighthouse, which was built in 1851.To prevent this from happening, dynamite was attached to the two cranes, and they were blown up while two boats pulled them away from the lighthouse, scattering metal into the sea.Commercial divers were then hired to clear the area of these scraps.It was while diving to retrieve the scraps in 2015 that Ramdzan Salim, a project manager, and Ahmad Qamarulhazman, a diver, stumbled across stacks of old ceramic plates, said Dr Michael Flecker, a visiting fellow at the ISEAS-Yusof Ishak Institute’s archaeology unit.At around the same time, a 10-week-long archaeological dig was being carried out at a site in Empress Place.The divers, while following media coverage of the findings, realised that some plates retrieved near Pedra Branca looked very similar to artefacts retrieved in Empress Place, and decided to hand over the plates to the institute for further research and safekeeping.Upon the institute’s confirmation that the plates were high quality celadon ceramics dated to the 14th century, the National Heritage Board partnered the institute to conduct a survey at the Pedra Branca site, discovering a shipwreck in 2016.Following the end of excavation works for the first shipwreck, NHB and ISEAS conducted a survey around Pedra Branca and uncovered a second shipwreck dating to the late 18th century. Efforts were then made to excavate this shipwreck between 2019 and 2021.The first wreck was located about 100m north-west of the island, the National Heritage Board (NHB) and ISEAS announced on Wednesday (June 16). The second wreck was found 300m east of Pedra Branca.What was foundIn an interview with The Straits Times about the historic finds, Dr Flecker said various Chinese ceramics formed a large majority of the haul from the first wreck, with some matching those previously excavated in mainland Singapore.For instance, Longquan greenware dishes from the first wreck match those that had been unearthed earlier at Fort Canning, with both bearing a double fish motif.\"From Fort Canning, there is a plate that is so similar you might almost be tempted to think they used the same stamp (to produce the motif),\" said Dr Flecker, a visiting fellow at ISEAS.While research is ongoing, Dr Flecker said the find would be especially significant if it could be proven that the vessel was going to call at Singapore - something he believes to be true.Ceramics from the wreck are also similar to those excavated at Empress Place in 2015, and more research will be done to improve existing knowledge on maritime trading history in the region during the 14th century.Dr Flecker, who has about 30 years of maritime archaeology experience, added that the Yuan blue-and-white ceramic haul from the first wreck is also the largest that has been recovered from a shipwreck to date.\"There's only been three other (wreck) sites with Yuan blue-and-white porcelain anywhere in the world, and in much smaller quantities,\" he said, adding that it was clear from the primary cargo of both vessels - Chinese ceramics - that they were loaded in China.The Shah Munchah wreck site yielded a much wider range of artefacts, from instruments to cannons.Among the surprising finds were percussion instruments, including a tambourine and a coconut shaker with a handle, said Dr Flecker.Wooden frame parasols, metal betel nut cutters and a myriad of figurines were also retrieved by divers.The heaviest finds were four anchors - as long as 5m and weighing 2.5 tonnes each - and nine cannons, which required a craned vessel to remove them from the seabed.Dr Flecker said the anchors were designed in the admiralty style, adding: \"They are suitable for very large sailing vessels so it's a good find and it's well worth getting them up for conservation.\"The nine cannons, which Dr Flecker described as a \"representative set\" of what was used then, were typically mounted on ships employed by the East India Company in the 18th and early 19th centuries, and used for defence as well as signalling.Artefacts are currently being stored at facilities managed by both NHB and ISEAS, where they will be cleaned, conserved and catalogued.About the Shah Munchah, Dr Flecker said: \"Had she survived another 23 years, she would almost certainly have called at the re-established port of Singapore.\"Her incredibly diverse cargo provides great insights into the type of goods that would have been exchanged and purchased by the new inhabitants of this fledgling city.\"The two historical shipwrecks are the first to be found within Singapore's waters, and will contribute to a better understanding of the nation's maritime past. As there were no claims to the wrecks and their artefacts at the end of the stipulated notice period of a month, they have been claimed by Singapore.Although it is very likely there are more wrecks on the seabed in Singapore's waters, some of these have been covered by reclamation, while heavy maritime traffic in the Singapore Strait makes locating others a hazard.NHB's director of heritage research and assessment Yeo Kirk Siang said: \"As an island that has been serving as the gateway to Asia for centuries, Singapore today is the legacy of our rich maritime heritage.\"We will continue to research the significance of the artefacts and find ways to promote the knowledge, so as to enable more people to learn about them and Singapore's maritime history.\"NHB plans to display the artefacts in museums here from the end of this year, while ISEAS will likely publish findings progressively in reports and research papers. - The Straits Times/Asia News Network \nTags / Keywords:\nSingapore\n                                                                ,\n                                                                                                shipwreck\n                                                                ,\n                                                                                                artefacts\n                                                                ,\n                                                                                                museum\n                                                                ,\n                                                                                                Michael Flecker\n                                                                ,\n                                                                                                Shah Munchah\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/16/centuries-old-shipwrecks-discovered-in-singapore-waters-artefacts-to-be-displayed-in-museums", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}