{"Type": "", "Time": "2021-06-17", "Headline": "There's still no evidence of a Chinese lab leak. But here’s what's changed, scientists say.", "Text": "Alina Chan isn't saying the coronavirus definitely leaked from a lab in China. What she is saying is what more scientists have grown comfortable discussing publicly: There's no clear evidence either way.\"I know a lot of people want to have a smoking gun,\" said Chan, a postdoctoral associate at the Broad Institute of MIT and Harvard University who specializes in genetic engineering and has been vocal about the need to investigate the possibility of a lab leak. \"It's more like breadcrumbs everywhere, and they're not always leading in one direction. It's like the whole floor is covered in breadcrumbs.\"Chan was one of 18 scientists who published a letter in the journal Science last month calling for a more in-depth investigation into the virus's origin that takes into account theories about both natural occurrence and laboratory spillovers. The letter helped kick-start a new round of calls to investigate the \"lab leak hypothesis,\" including demands from President Joe Biden and several leading scientists.And while public discussion of a potential lab leak has shifted significantly in recent months, as more people pay attention to a theory that was originally promulgated by former President Donald Trump and his followers, the scientific evidence has remained unchanged, according to interviews with five virologists who have experience in microbiology, infectious disease ecology and viral evolution.The researchers offered near-uniform summations that few conclusions can be drawn based on the available scientific evidence, but they noted that the context and circumstances of the origin debate have changed, particularly as critics point out that China hasn't been fully transparent about the earliest days of the pandemic.The shift reflects how some scientists who previously avoided the topic or were quick to dismiss it are grappling with enduring uncertainties about the virus's origin, free from the politicization that clouded such discussions during the Trump administration.Chan said there had been trepidation among some scientists about publicly discussing the lab leak hypothesis for fear that their words could be misconstrued or used to support racist rhetoric about how the coronavirus emerged. Trump fueled accusations that the Wuhan Institute of Virology, a research lab in the city where the first Covid-19 cases were reported, was connected to the outbreak, and on numerous occasions he called the pathogen the \"Wuhan virus\" or \"kung flu.\"\"At the time, it was scarier to be associated with Trump and to become a tool for racists, so people didn't want to publicly call for an investigation into lab origins,\" she said.Now, more scientists are comfortable confronting the gamut of plausible theories — particularly given China's opacity about the topic — although many still caution that entertaining the idea of a lab leak requires clear scientific proof, which hasn't materialized.\"There has been no new evidence over the past 16 months that the virus had a lab origin,\" said Maciej Boni, an associate professor of biology at Penn State University, who specializes in tropical disease epidemiology and viral evolution.A number of theories about how the virus may have emerged have been thrown out. Most that remain fall under three possible scenarios:The virus evolved naturally before spilling over into humans from an infected animal.The virus evolved naturally, but an employee at the lab became infected from a sample and accidentally \"leaked\" it into the community.Scientists at the lab were manipulating virus samples and accidentally or intentionally released the pathogen.What makes the virus's origin a complicated matter is that the various threads can be difficult to reconcile. While most of the virologists who spoke to NBC News said the coronavirus probably evolved in nature, they agreed that it's reasonable to look into the possibility that it came from a lab.At the heart of those suspicions is the Wuhan Institute of Virology, a research facility founded in the 1950s that was the first in China to receive the highest level of biosafety clearance. The institute's lab has a biosafety level of 4 (known as BSL-4, the highest level), meaning it is equipped to study the world's highest-risk infectious agents and toxins, those that require the strictest biocontainment measures. It's that designation, and the lab's location in the city where the outbreak was first reported, that made the institute an early suspect.\"If we had a pandemic that was sourced near to a BSL-4 lab in the U.S., the first thing you would be asking is if they were working with that pathogen in that lab,\" said an expert on evolutionary genetics of infectious diseases, Andrew Read, a professor of biology at Penn State.Still, he cautioned that while a lab leak is plausible, that doesn't necessarily mean it's the most probable explanation.Boni said it's still more likely that the virus passed from an animal, such as a bat, into humans. He said his experiences conducting field epidemiology work on avian influenza in Vietnam from 2008 to 2016 showed how close contact with wildlife, such as in \"wet markets\" around the world where outdoor stalls sell meat, seafood and live animals for consumption, can create easy opportunities for pathogens to spill into human populations.\"Going back over the past 25 years of emerging viruses that have crossed species boundaries from animals to humans, the most common route is something like a wet market or farm or some other form of human and animal contact,\" he said. \"These are far more common than lab accidents.\"The first cluster of Covid-19 infections was traced to the Huanan Seafood Market in Wuhan, leading to early speculation that it may have been where the virus jumped from animals into humans. But Chinese researchers have since found that several of the earliest known cases of Covid-19 in the city were unrelated to the market, meaning the virus may already have been spreading in the community.A joint investigation this year by the World Health Organization and China focused on the possibility of a zoonotic, or animal, origin. The team's report, released in March, found that the virus probably emerged in bats and jumped to an intermediary animal before it spread to humans.The team also downplayed the theory that the virus leaked from the Wuhan institute, describing the scenario as \"extremely unlikely.\" But the WHO-led investigation was heavily criticized for not doing enough to review all plausible hypotheses. And the validity of the findings was questioned because the investigation hinged on China's cooperation, and the Chinese government didn't give researchers access to full records and raw data.Chan and 17 other scientists, including Ralph Baric, a virologist at the University of North Carolina, Chapel Hill; David Relman, a microbiologist at Stanford University; and Akiko Iwasaki, an immunologist at Yale University, signed the letter in Science in response to the shortcomings of the WHO report.Within the scientific community, the letter was seen as something of a turning point, lending credibility to the hypothesis that the virus may have escaped from the lab.\"I think it had a big effect,\" Chan said. \"I think It literally helped all the people who wanted to investigate this by saying: This is not bogus. Top scientists think this is plausible.\"Calls for a more in-depth investigation into both the natural origin theory and the lab leak hypothesis have been fueled, at least in part, by growing circumstantial evidence uncovered over the last year by a band of anonymous internet sleuths.Last year, a member of the amateur investigative team, which calls itself DRASTIC (short for Decentralized Radical Autonomous Search Team Investigating Covid-19), combed through online records and found a 2013 thesis by a postgraduate student at Kunming Medical University in China that described six workers at a mine in Yunnan province who fell ill with severe pneumonia caused by a \"SARS-like\" coronavirus.Three of the mine workers eventually died, but not much else is known about the situation. In research published in November by scientists at the Wuhan institute, serum samples from four of the mine workers were tested and showed no trace of SARS-CoV-2, the virus that causes Covid-19.Separately, a U.S. intelligence report disclosed that three researchers at the Wuhan institute sought treatment at a hospital after they fell ill in November 2019, as The Wall Street Journal first reported in May.During the WHO-led investigation this year, officials at the Wuhan institute said all staff members had tested negative for Covid-19 antibodies. Its leaders have been adamant that the virus didn't escape from the facility, but the Chinese government's reluctance to share records and test results has cast suspicion over what the lab's scientists knew — and when.Although they are far from conclusive, the intelligence report and the mine workers' mysterious illnesses have been presented as circumstantial evidence that scientists at the Wuhan institute were studying risky coronaviruses similar to SARS-CoV-2 and that the virus may have escaped from the lab, perhaps after an employee became infected.The mine incident also drew attention to a separate SARS-like virus that Chinese researchers collected from a bat in Yunnan province in 2013. Shi Zhengli, a prominent bat researcher who directs the Center for Emerging Infectious Diseases at the Wuhan Institute of Virology, co-wrote a paper published in February 2020 detailing the virus, known as RaTG13.The genomes of RaTG13 and SARS-CoV-2 were found to be 96.2 percent alike, prompting some to wonder whether the pandemic had been caused by lab experiments on RaTG13 that had gone awry. The similarities between the two viruses also raised questions about the possibility that Chinese researchers were conducting \"gain of function\" experiments, which involve manipulating viruses in a lab to make them more dangerous or more transmissible to understand their inner workings.Gain-of-function research isn't altogether uncommon in virology, but such experiments are controversial because of the risks. A scientist could, for example, unwittingly or by design create a pathogen that is better adapted to invade human cells or cause more severe infections. But there are real benefits to gain-of-function research, said Robert Garry, a virologist at Tulane University in New Orleans. For one, understanding the characteristics of a virus and its transmissibility is critical to developing vaccines and lifesaving drugs, he said.He said most virologists take the responsibility of such experiments seriously.\"It's not the Wild West,\" he said. \"It's very highly regulated.\"In 2014, the U.S. National Institutes of Health imposed a moratorium on gain-of-function research after two lab accidents involving anthrax and a strain of H5N1 bird flu occurred at the Centers for Disease Control and Prevention. Funding for gain-of-function experiments was paused for three years while the government conducted safety assessments. The ban was reversed in January 2017, during the Trump administration, after an independent science advisory panel found that the overall risk to public safety was low.While it's possible that scientists at the Wuhan institute were making genetic tweaks to samples, a coronavirus like RaTG13 that is 96.2 percent similar still can't easily be altered to create SARS-CoV-2, Garry said.\"Taking a virus that is 96 percent similar and sequencing and converting it to SARS-CoV-2 is impossible,\" he said. \"That kind of evolution takes maybe three to five decades in nature. You just can't force that in a lab.\"Dr. Charles Chiu, a virologist at the University of California, San Francisco, added that the differences between RaTG13 and SARS-CoV-2 exceed the capabilities of genetic engineering.\"The differences are scattered throughout the genome,\" he said. \"There's a big difference between 96 percent similar and 100 percent identical. We just don't have the ability to make those kinds of changes.\"In other words, the experts say, it's unlikely that scientists could snip and splice bits of a virus or tweak a pathogen's genome in such a way that would create SARS-CoV-2, even if researchers were using closely related coronaviruses.\"We're very good at imitating nature — we have, for instance, been able to synthesize polio virus — but our ability to manipulate or change the sequence of viruses is still limited,\" Chiu said.Chan, of the Broad Institute, wasn't ready to rule out the possibility of genetic engineering, saying that if minor tweaks were being made to virus samples, it could be difficult to detect the fingerprints of such work.\"You can do recombination without leaving a trace,\" she said. \"Basically, it's like you can 3D-print clothing with no seams, so it's difficult to tell if anything has been manipulated or stitched together in a lab.\"Chan acknowledged that it's \"definitely possible\" that the virus evolved in nature but added that all options should be kept on the table because neither the natural origins theory nor the lab leak hypothesis can be ruled out.\"All the evidence right now is circumstantial, and it's consistent with both lab and natural origins,\" she said. \"There's precedents for lab leaks, the genetic data could swing either way, and the epidemiological data, which is how it unfolded in Wuhan, can also swing either way. None of this is pointing in any one direction.\"And it may be years, or even decades, before scientists have any clarity on the topic. The Ebola virus, which was discovered in 1976, is thought to have spread to humans from bats or nonhuman primates, but scientists still haven't identified the origin from a specific animal host.\"The key issue here is that we simply don't have the information to make really firm conclusions,\" said Chiu, of the University of California, San Francisco, referring to Covid-19. \"Unless we know exactly what happened, we're simply making guesses.\"New documents and interviews show how the president and his senior aides cherry-picked evidence and sidelined the government’s own virus sleuths.Two House Republicans — including Conference Chair Elise Stefanik (R-N.Y.) — are introducing a bill Tuesday to sanction top Chinese health officials until they allow an investigation into whether the coronavirus originated in a Wuhan lab, according to a copy of the bill text obtained by Axios.Why it matters: The lab-leak theory has regained prominence in both the scientific and political worlds, after the Wall Street Journal reported that three scientists who worked at the Wuhan Institute of VirDiscussions that focus on countering a Chinese invasion of Taiwan risk overlooking a threat that doesn't require Beijing to storm any beaches.China's Shenzhou 12 mission carrying three astronauts launched into orbit on Thursday morning Beijing time.Why it matters: Astronauts Nie Haisheng, Liu Boming and Tang Hongbo are set to occupy China's new space station. This will be the country's longest crewed space mission ever and the first in almost five years.Get market news worthy of your time with Axios Markets. Subscribe for free.It marks another significant step in the space program drive of the ruling Chinese Communist Party, seen as aCalifornia has pursued a more measured approach to reopening than the hype would have it, seeking to balance the need to get businesses back on their feet while recognizing that the best way to lure customers and workers out of hibernation is by ensuring they feel safe from the virus itself.Note to self: Don’t leave beer in the car while in bear country.The Chinese mission to the European Union on Tuesday denounced a NATO statement that declared Beijing a “security challenge,” saying China is actually a force for peace but will defend itself if threatened.  The Chinese news release said the NATO statement was a “slander on China’s peaceful development, a misjudgment of the international situation and (NATO’s) own role, and a continuation of the Cold War mentality and organizational political psychology.”  NATO allies joined the United States on Monday in formally scolding Beijing as a “constant security challenge.”In just a few blink-and-you'll-miss-it moments, a future time-traveling baddie was revealed.Gov. Laura Kelly wanted another extension but Senate President Ty Masterson canceled the meeting.NFL Network's Nate Burleson sees the veteran receiver bouncing back from two subpar seasons.Gov. Ron DeSantis and the Florida Cabinet on Tuesday rejected a legal ruling that loomed as a massive roadblock to Miami-Dade County’s controversial plan to run a major highway through wetlands fringing the Everglades.Nestled in a recent press release from the Treasury Department announcing new staff appointments was a familiar name within the White House, the son of President Biden's counselor and longtime aide, Steve Ricchetti.Why it matters: J.J. Ricchetti will serve as a special assistant in Treasury's Office of Legislative Affairs. He's now the fourth immediate family member working in the Biden administration.Stay on top of the latest market trends and economic insights with Axios Markets. Subscribe forThree highly vaccinated countries have seen a surge in cases with the shots, prompting uncomfortable questions for their Chinese manufacturers.China launched the first piece of its new space station in April, and it's already sending astronauts up to live there.Chris Paul reportedly has entered the NBA's health and safety protocols, which could limit his availability for the Phoenix Suns in the Western Conference Finals.Roblox falls hard on Wednesday on disappointing user data. Here's the support level it has to hold and the resistance level it needs to reclaim.Former president insists he is working on a ‘much more important project’BOGOTA (Reuters) -The primary issue with lagging COVID-19 vaccinations in the Americas is access to doses, not acceptance of vaccine safety or efficacy, the Pan American Health Organization (PAHO) said on Wednesday, urging donor countries to send shots as soon as possible.  The Group of Seven rich nations said on Sunday they will provide 1 billion vaccine doses over the next year to help poorer countries inoculate their populations.  \"I want to be clear that the primary issue in the Americas is vaccine access, not vaccine acceptance,\" PAHO Director Carissa Etienne said during the organization's weekly news conference.(Bloomberg) -- North Korean leader Kim Jong Un said the country’s food situation is “getting tense” due to typhoons last year that wiped out crops, comments that underscored farm-sector shortfalls made worse by his decision to close borders to prevent Covid.Kim told a plenary meeting of the Central Committee of his ruling Workers’ Party of Korea “the agricultural sector failed to fulfill its grain production plan,” and now is “high time to give full play to the indomitable revolutionary spirit aSimple enough, now the tricky bit: diving four menus deep into the touchscreen to fettle with the traction control and stability control settings.  Yes, Volkswagen removed the age-old “TCS” hard button from the Mk 8 GTI’s interior.  Turning traction control and stability control off in the 2022 VW GTI requires that you first enter the “Vehicle” menu in the touchscreen, swipe one page over, tap the “Brakes” section, open a dropdown menu, and only then you are allowed to put ESC in Sport Mode, or turn it completely off.", "Section": "", "Writers": "", "URL": "https://news.yahoo.com/science-around-lab-leak-theory-204525152.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}