{"Type": "", "Time": "2021-06-17", "Headline": "Scammers switch from impersonating China officials to health officials | The New Paper", "Text": "Scammers have continued to target people in Singapore during the pandemic and are now weaving plots involving vaccines and vaccination drives into their narratives.They have recently switched from purporting to be Chinese officials to being Ministry of Health (MOH) officials.This is an extension of vaccine-related scams that the ministry had warned about earlier this year.MOH had said it was aware of websites, e-mails, SMS text messages and phone calls falsely claiming to offer registration for vaccination.Last month, a person reported receiving a robocall claiming to be from MOH to scamalert.sg, the anti-scam website operated by the National Crime Prevention Council.According to the report dated May 19, the call claimed MOH had been trying to contact the person to get a vaccine jab and instructed the person to press \"9\" to get in touch with the authorities.The automated message was in both English and Mandarin.The person who reported the call, however, had already received both doses of the vaccine and urged others not to fall for the scam.Ms Carolyn Misir, a principal psychologist at the Police Psychological Services Department, said scammers use several persuasion techniques that lead victims deeper into the scam's narrative.\"The process of the scam and persuasion techniques used are quite similar to the China officials impersonation scam, with some variation to include the Covid-19 vaccine,\" she said.\"Victims may be given a case reference number and the actual medical term of an antiviral medicine such as remdesivir, so that the victim believes the legitimacy and authority of the caller.\"The Straits Times understands that while vaccine-related scams are known to the police, there have been few victims who have lost money to such ruses.However, Mr Tom Kellermann, the head of cyber-security strategy at software company VMware, warned that the public should still be wary, as those behind such ploys may be after personal information which is then sold online.\"The vaccine has only put a larger target on the healthcare industry's back,\" he said.\"In Singapore... the accelerated vaccine roll-out has led to cyber criminals attempting to steal data and private information.\"He added that scams involving the healthcare industry and vaccines can have serious consequences, such as the hampering of the mass vaccination process and loss of confidence in the healthcare system.\"Taking the proper precautions is not only in your own interest, but also in the interest of those around you,\" he said.Get The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/scammers-switch-impersonating-china-officials-health-officials", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}