{"Type": "Sport", "Time": "2021-06-17", "Headline": "Football: Germany already on the back foot after losing opener to France", "Text": "MUNICH: Germany already have their backs to the wall at Euro 2020 after their opening loss to world champions France on Tuesday (Jun 16) but they are confident there will be no a repeat of their shock first round exit at the last World Cup.Defender Mats Hummels' first-half own goal gave France the 1-0 Group F win and leaves three-time champions Germany in need of points from their last two matches against holders Portugal on Saturday and Hungary next week, with both games in Munich again.\"This defeat is very painful, especially for me as my own goal decided the game,\" said Hummels, who was recalled to the squad for the tournament after having been dropped more than two years ago.\"We obviously know full well that there is room for improvement in our game. But you could see that we want to fight really hard in this tournament, that we want to excite you (the fans) and be successful.\"The Germans certainly lacked fighting spirit in Russia three years ago when they were sensationally eliminated in the first round of the World Cup after losing their opening game to Mexico and managing just one win from three group games.On Tuesday they were up against arguably the most complete team in the world and worked hard until the end to try to turn the game around and avoid a first ever defeat in a Euro opener.While they again struggled to carve out clear scoring chances they did deliver a solid second-half performance, earning some praise from German media.The tournament format with three group matches means that one win could be enough to advance to the knockout stage and midfielder Toni Kroos said there was no point dwelling on the defeat.\"We have to look ahead now,\" he said. \"Obviously when you lose the first game and you only have three then the pressure is always great.\"How coach Joachim Loew's team handle this pressure against Portugal might decide their fate.For midfielder Joshua Kimmich, Germany showed in the defeat to France that they can compete with the best.\"What we did was we showed that we can certainly keep up with top teams at this level,\" Kimmich said.\"France are one of the title contenders. In the next game we have to show that we also are one of the title contenders.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "sports,opener,France,Germany", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/football-germany-already-on-the-back-foot-after-losing-opener-to-15026052", "Source": "google"}