{"Type": "", "Time": "2021-06-17", "Headline": "PM Johnson delays UK's reopening over Delta virus variant, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.LONDON • Prime Minister Boris Johnson has pushed back by four weeks his plan to lift coronavirus restrictions as a more infectious variant spreads rapidly across Britain, threatening to undermine the country's effort to vaccinate its way out of the pandemic.The government in London was forced to act after modelling showed that hospital admissions could reach similar levels to the first wave of infections in the spring last year - a peak of more than 3,000 a day - if Mr Johnson stuck to his schedule to end social distancing rules next Monday.In a televised briefing last Monday, he said there was no choice but to delay his plan until July 19.The aim is to prevent a surge in hospitalisations and avoid adding thousands to what is already Europe's highest death toll by allowing more people to get their second Covid-19 vaccine dose.Mr Johnson said he is \"pretty confident\" there will not be another postponement, while some members of his governing Conservative Party hit out at the impact on the economy.Mr Johnson said: \"The objective of this short delay is to use these valuable, crucial weeks to save thousands of lives - lives that would otherwise be lost, I am afraid - by vaccinating millions more people as fast as we can.\"While Britain gained global attention with its rapid vaccine roll-out, the country is now emerging as a less enviable test case in Europe for dealing with the highly transmissible Delta variant first identified in India.The World Health Organisation's Europe director, Dr Hans Kluge, warned last week that the Delta variant was \"poised to take hold\" across the continent.The issue for Britain is that its inoculation programme lengthened the time between doses in an effort to get as many shots into as many people as quickly as possible.The new variant has changed the calculus after evidence emerged that two injections are required for protection. The government is now speeding up second shots.The revised lockdown timetable is expected to go to a vote in Parliament today, and Mr Johnson is likely to face anger from his colleagues for backtracking on what they dubbed \"Freedom Day\".The government also said it will not extend financial support for businesses despite the delay. A furlough programme is due to run until the end of September, though employers will have to contribute more from next month.Not extending the financial assistance is \"unjust, unconscionable and unsupportable\", Tory MP Bob Neill said in the House of Commons late on Monday.Economists, however, said the government's decision is unlikely to delay Britain's recovery from the worst recession in 300 years.Mr Johnson had planned to drop all legal limits on social contact this month, in the final step of his road map out of lockdown. That would have meant nightclubs reopening, people lining up at the bar again, full stadiums and big conferences back in the diaries.There was a reprieve for weddings: The 30-person limit will be lifted to allow an unlimited number of guests, as long as there is no dancing and social distancing is respected.Covid-19 cases have been rising rapidly. More than nine in 10 new cases in Britain are of the Delta variant, according to Public Health England, and these infections are doubling every 4.5 days in parts of the country.The Delta variant is 64 per cent more transmissible indoors than the previously dominant Alpha variant first identified in south-east England, the agency said, and early data showed \"a significantly increased risk of hospitalisation\".The government will review the data again on June 28, with the possibility of easing restrictions on July 5, though that is unlikely.Right now, infections in England are growing 64 per cent every week nationally, Mr Johnson said.The key is whether positive cases lead to more people in intensive care and ultimately more deaths, or whether vaccines have broken that link enough.In the meantime, all eyes are on the speed of vaccination. Almost 80 per cent of adults have received at least one dose, while 57 per cent have received two.The government aims to fully vaccinate two-thirds of adults in Britain by July 19. All over-18s will be offered a first dose by then, too.BLOOMBERGJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/pm-johnson-delays-uks-reopening-over-delta-virus-variant", "Source": "google"}