{"Type": "", "Time": "2021-06-17", "Headline": "Private clinics in S'pore offering Sinovac Covid-19 vaccine: Some centres getting 'non-stop' inquiries, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Some clinics have been receiving \"non-stop\" inquiries from people interested in taking Sinovac's Covid-19 vaccine following the Ministry of Health's (MOH) announcement late on Wednesday (June 16) that 24 private healthcare institutions were licensed to administer it.MOH said that anyone interested in taking the vaccine could contact the 24 selected providers directly from Friday for more details.But, as at Thursday afternoon, it appeared some of the providers were inundated by calls.The Straits Times contacted all 24 providers but 20 either did not answer the phone or could not be reached.The four that did respond said they had been dealing with calls about the Sinovac vaccine since morning.A clinic assistant at iCare Medical and Wellness Clinic said she had received \"too many calls to count\", even though the first batch of the vaccine - 200 vials - is scheduled to reach the clinic only on Friday.\"We've been taking calls from 8.30am till now, non-stop... hundreds of calls,\" said another clinic assistant at Little Cross Family Clinic when contacted by ST at around 1pm.She added that the vaccine would probably be delivered to her clinic this weekend.Icon Cancer Centre Farrer Park also faced a deluge of calls in the morning.\"We've received a lot of calls today - a few hundred, within even the first few hours of the morning,\" said chief executive Serena Wee.She added that her centre had been told their application was successful only on Wednesday night, so it is still working out certain administrative details.\"It's all very new to us right now, the process has been a little rushed,\" she said, but added that she believes her centre can make the necessary preparations by Thursday despite this.The vaccine will be distributed on an appointment-only basis so as to control the number of people at the centre, said Ms Wee.She added that her centre is expecting 200 vials of the vaccine to be delivered on Friday.Ms Wee said her centre was told that when half the vials had been used up, they could request for more from MOH.Dr Leong Hoe Nam of Rophi Clinic said he would likely be requesting more doses beyond the initial 200, as they had also received hundreds of calls on Thursday.MOH had earlier said that as the doses are being provided to the institutions for free, they should not charge people anything other than a vaccination administration fee, which is inclusive of consultation and 7 per cent goods and services tax.The charge for Sinovac's vaccine by the 24 approved providers differs, ranging from $10 to $25.Notably absent from the list of 24 providers were large healthcare chains such as IHH Healthcare, which had earlier expressed interest in being providers of the vaccine.Dr Lim Boon Hee, a general practitioner who is not involved in the distribution of any Covid-19 vaccine, described this as \"unusual\".\"I thought it was a bit unusual. All the major groups were interested, why were these smaller clinics chosen?\" he said, adding that he felt such clinics may not have the manpower or space to cope with the \"pent-up demand\" for the Sinovac vaccine.He tried to book a vaccination slot for one of his staff on Thursday morning, but found himself unable to get through to most of the clinics.\"We were hoping we could go to Raffles Medical Group or Healthway Medical as they have so many clinics... there could be a very chaotic situation if everyone rushes down on Friday,\" he said.ST has contacted MOH to find out why larger chains were not included in the list of providers, and whether healthcare institutions aside from the 24 are allowed to administer the Sinovac vaccine if they can obtain it through other means.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/some-clinics-receive-non-stop-enquiries-about-sinovacs-covid-19-vaccine", "Source": "google"}