{"Type": "Singapore", "Time": "2021-06-17", "Headline": "Dickson Yeo detained under ISA for trying to provide reports on Singapore for 'foreign state'", "Text": "SINGAPORE: Singaporean Dickson Yeo was detained under the Internal Security Act (ISA) on Jan 29 for acting as a paid agent for a \"foreign state\", the Internal Security Department (ISD) said on Tuesday (Jun 15).While ISD did not name the foreign state, Yeo, 40, was last year sentenced to 14 months' prison in the US for spying for China against the US.ISDarrested Yeo after he was deported to Singaporeon Dec 30 last year after he served his sentence. It interviewed him to establish if he had engaged in activities prejudicial to Singapore’s security.The department said on Tuesday that Yeo carried out intelligence activities against Singapore from 2016 until his arrest in the US in 2019. He was tasked to source for information and provide reports on issues of interest to his foreign handlers, including information relating to Singapore.\"Towards this end, he had approached various individuals in Singapore in an attempt to obtain information for the purpose of writing his reports,\" ISD said.Yeo also set up a front company in Singapore as a cover for his information-gathering activities as well as recruitment for his foreign handlers. He also tried, but failed, to get a job in the Singapore Government.\"ISD's investigations established that Yeo had worked for the intelligence apparatus of a foreign state and had carried out various taskings given to him by his foreign handlers in exchange for monetary gains.\"Yeo admitted to being fully aware that his foreign handlers were working for the intelligence apparatus of the foreign state.\"ISD said investigations are ongoing and that Yeo's \"continued detention is necessary to facilitate probes into the full extent of his activities\".Yeo was jailed in the US on Oct 9 last year after admitting to operating illegally as a foreign agent, which can bring up to 10 years in prison.He was given a relatively light sentence and credited for 11 months already spent in prison because of his cooperation with US authorities and the threat of contracting COVID-19 in jail, a US federal judge said then.In his plea, Yeo admitted to working between 2015 and 2019 for Chinese intelligence, spotting and assessing Americans with access to “valuable non-public information”.They included a civilian working on the US Air Force's F-35B stealth fighter project, a Pentagon army officer with Afghanistan experience, and a State Department official, all of whom were paid as much as US$2,000 to write reports for Yeo.Yeo told these people that the reports were for clients in Asia, without revealing that they were in fact for the Chinese government.Yeo also told US investigators that his previous intelligence work targeted other Asian countries before focusing on the US.MHA said on Jul 26 last year that its investigations into Yeo’s activities did not reveal any direct threat to Singapore's security.RECRUITED WHILE STUDYING AT LKYSPPYeo was recruited by Chinese intelligence operatives while studying for a PhD at the National University of Singapore’s Lee Kuan Yew School of Public Policy (LKYSPP) in 2015, according to US court documents. He went on to work for the Chinese after he visited Beijing to give a presentation on politics.Former top Singapore diplomat Bilahari Kausikan said that Yeo’s PhD supervisor at LKYSPP was Huang Jing. The professor was identified in 2017 as an “agent of influence for a foreign country” by Singapore’s Ministry of Home Affairs (MHA).Without naming the country, MHA said Huang \"knowingly interacted with intelligence organisations and agents of the foreign country, and cooperated with them to influence the Singapore Government’s foreign policy and public opinion in Singapore\".Huang gave what he claimed was “privileged information” about the foreign country to prominent and influential Singaporeans, including a senior member of LKYSPP, with the aim of influencing their opinions in favour of that country, MHA said.Huang was permanently banned from Singapore and had his permanent residency status revoked, MHA said. Huang left Singapore in 2017.LKYSPP told CNA on Tuesday evening that it has strengthened \"oversight and risk-awareness procedures\" in relation to its education and research.\"We maintain an enhanced oversight on academic collaborations and partnerships, both local and overseas, and will also continue to keep a heightened awareness among all our staff and students on the risks of foreign interference,\" a spokesperson said.The past incidents involving a former staff member and student showed how different sectors of society, including education, could be potential targets for \"foreign subversion\", the spokesperson added.\"The school will not tolerate any acts or activities of foreign interference that threaten the country’s national security or interests.\"On Tuesday, ISD said the Singapore Government takes a \"very serious view of anyone who enters into a clandestine relationship with a foreign government\".This includes those who engage in activities at the behest of the foreign power that may harm Singapore's national security and interests, including bilateral relations, it said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Internal Security Act,spying", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/dickson-yeo-isa-detained-singapore-china-15016860", "Source": "google"}