{"Type": "", "Time": "2021-06-17", "Headline": "Malaysia's King urges govt to reconvene Parliament soon despite PM's plan, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.KUALA LUMPUR - Prime Minister Muhyiddin Yassin's plan to convene Parliament as late as October was dented on Wednesday (June 16) after Malaysia's King called for the federal legislative to meet \"as soon as possible\" to debate emergency laws and the nation's exit strategy from its worst Covid-19 outbreak.This was swiftly followed by a joint statement from the Malay rulers - nine state monarchs who rotate five-year terms as the federation's king - expressing the view that the emergency, which suspends the need for legislatures to reconvene every six months, need not be extended beyond its Aug 1 expiry date.The statements were issued after a special meeting between Sultan Abdullah Ahmad Shah and eight other heads of state on Thursday afternoon, a culmination of a week-long series of audiences the King gave to 18 party chiefs and experts over the pandemic and the emergency.\"His Majesty expressed the opinion that a Parliament sitting must be held as soon as possible... Parliament is an important platform for elected representatives to discuss various issues relating to the Covid-19 pandemic,\" the palace said.His fellow sovereigns concurred, adding that they were of \"one mind\" that \"there is no need to place the nation under emergency rule after Aug 1\".However, it is the King who has to assent or reject the government's advice on an emergency, and Sultan Abdullah was silent on the matter of an extension in his statement.It is not known if Tan Sri Muhyiddin himself raised the issue in his audience with the King on Tuesday or in previous meetings.Nonetheless, a source close to one of the royal households noted \"the reason it's made that way is the issue (of an emergency) is not within the jurisdiction of the Council of Rulers, but the King\", hence the opinion is not expressed by Sultan Abdullah so that his discretion may be reserved.Both the King and the other rulers also issued separate statements last October, when the government's initial request for an emergency was rejected.While Sultan Abdullah said such a decree was not necessary then, he called on politicians to ensure the passage of Budget 2021 to ensure the nation's fight against Covid-19 would not be undermined. The other rulers, however, stressed on \"justice and limiting any element of abuse of power\".Parliament last sat in December to narrowly approve this year's budget and Mr Muhyiddin's tenuous grip on a legislative majority has not been tested since, raising questions over his legitimacy.The emergency, which came into effect on Jan 11, was imposed as Malaysia struggled to contain the coronavirus outbreak after a spike in September.But critics say it has only entrenched the Muhyiddin administration, whose parliamentary majority remains in doubt after a series of defections in both directions, as measures to tackle the disease did not require an emergency.The fact that May saw the most Covid-19 deaths in a month has further fuelled the view that the emergency has not helped the fight against the pandemic.Mr Muhyiddin had on Tuesday unveiled his National Recovery Plan, which outlines criteria in terms of daily infections, healthcare capacity and vaccination rates for the government to progressively loosen an ongoing lockdown.\"I pledge my commitment that the parliamentary session can convene... around the months of September or October, subject to stringent SOPs (standard operating procedures),\" he had said.\"My stance from the very beginning has always been that the democratic parliamentary system should be able to function once again after the Covid-19 cases are well under control and when we are close to achieving herd immunity.\"But both the King and his fellow rulers indicated the importance of \"a government that is stable and enjoys public confidence and support of the majority\".The royal statements have spurred opponents like Umno president Ahmad Zahid Hamidi, whose party wants to withdraw from government and force polls it believes will result in its return to dominance.\"Umno supports and views seriously His Majesty's call for the need to establish a stable and strong government that is capable of functioning effectively in addressing Covid-19 and reviving the economy,\" he said in an immediate response.Opposition leader Anwar Ibrahim said: \"I await the next step from the government led by Muhyiddin Yassin to call Parliament as soon as possible.\"• Additional reporting by Nadirah H. Rodzi and Hazlin HassanJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/malaysias-king-urges-govt-to-reconvene-parliament-as-soon-as-possible", "Source": "google"}