{"Type": "", "Time": "2021-06-17", "Headline": "Major Australian banks hit by website outage - BBC News", "Text": "Several Australian banks and US airlines suffered website crashes on Thursday, following an issue with the web services company Akamai.Customers reported problems with banks including ANZ, Westpac, St George, ME bank, Macquarie Bank, Allianz, and the Commonwealth Bank.Banking apps were likewise unavailable.The airlines affected suffered short outages. American Airlines, Southwest Airlines, United Airlines and Delta Air Lines were among them.The disruption began at about 14:10 Sydney time (05:10 GMT). Australia Post, the postal service, was hit too - as well as Virgin Australia, the country's second-biggest carrier.Akamai admitted it was the source of the problem, telling news agency AFP: \"We are aware of the issue and actively working to restore services as soon as possible.\"Akamai provides one of the world's largest content delivery networks (CDNs) - a service designed to speed up loading time for websites. Virgin said it used the technology for IT network authentication.Earlier in June, an internal problem at another large CDN, Fastly, prompted an hour-long outage at a number of high-profile websites including Amazon, Reddit, and the UK government site.At 16:15 local time, Commonwealth Bank tweeted that services were starting to return to normal and thanked customers for their patience. Websites begin to work again after major breakageFirst crew blasts off to new China space stationThree astronauts successfully take off for China's longest ever human spaceflight mission.Biden and Putin praise talks but discord remainsDecoding Biden and Putin's body language. VideoDecoding Biden and Putin's body languageWhy cyber gangs won't worry about US-Russia talks'I walked three days to find a hospital for my son'Covid threat to India's holiest river. VideoCovid threat to India's holiest riverThe vast European mine infuriating the neighboursDecoding Biden and Putin's body language. VideoDecoding Biden and Putin's body languageWhat's going on in Iran's election?‘Mindset shifting’ as more Australians ditch boozeBBC Worklife: The myth of a new digital-nomad movementCruising industry still in choppy watersFootball phrases15 sayings from around the worldKim Jong-un admits North Korea food concerns1First crew blasts off to new China space station2Eriksen to have heart-starting device3Major Australian banks hit by website outage4Botswana diamond could be world's third largest5‘Mindset shifting’ as more Australians ditch booze6World Bank rejects El Salvador Bitcoin request7The 32-year-old taking on Big Tech8The vast European mine infuriating the neighbours9Biden and Putin praise talks but discord remains10© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "Section": "", "Writers": "", "URL": "https://www.bbc.com/news/business-57508349", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}