{"Type": "", "Time": "2021-06-17", "Headline": "Timely tweaks did the trick against Hungary: Portugal coach Santos, Latest Football News - The New Paper", "Text": "Portugal coach Fernando Santos said a tactical tweak and timely substitutions helped the defending European champions unlock Group F opponents Hungary's defence in their 3-0 victory yesterday morning (Singapore time), after enduring plenty of anxious moments.Hungary soaked up the pressure from Portugal in front of a boisterous crowd of 67,000 at Budapest's Puskas Arena and looked set to grab a point, before Raphael Guerreiro broke the deadlock in the 84th minute and Cristiano Ronaldo netted a late double.With the clock ticking away, Santos brought on Rafa Silva who won the penalty that Ronaldo dispatched, while the energy of fellow substitutes Joao Moutinho, Andre Silva as well as Renato Sanches also made a difference late on.\"In the second half... we were a bit anxious as the clock was ticking and we wanted to win,\" Santos told reporters.\"I started subbing in some players to increase the pace of the game. I moved Ronaldo to the left a bit and released Raphael because I thought he wasn't getting close to the goal. He played a great game... so we let him move inside.  \"Sometimes you get things right and sometimes you don't get them right, but we always strive for the best. The players that came on did very well, and the ones that went off also did well.\"Ronaldo, who reached two milestones during the match, is already eyeing a victory in their next match on Saturday against Germany, who lost 1-0 to France in their Group F opener.\"It was essential to start on the right foot in order to gain confidence. Now, we have to continue and win the next game,\" said the Juventus forward, 36.Ronaldo, who was playing in a record fifth European Championship, has now scored 11 goals in the tournament, overtaking Michel Platini as its all-time leading scorer.He is also just three goals away from matching Iranian Ali Daei's all-time international scoring record of 109.Ronaldo started alongside Diogo Jota and Bernardo Silva up front, with the likes Bruno Fernandes pulling the strings in midfield, but the Hungarians held firm to repel their attacks.The hosts offered very little from open play, although they sent Portugal a warning shortly before half-time when Adam Szalai headed a free-kick too close to Rui Patricio. The best chance of the first half fell to Ronaldo in the 44th minute, only for the Portugal captain to plant the ball over from six metres after meeting Guerreiro's low cross.Portugal came out of the blocks quickly after the break but Hungary grew in confidence and thought they had taken a shock lead through substitute Szabolcs Schon, who was denied by the offside flag.But Santos' changes did the trick and his men are looking forward to facing Germany and France.He said: \"This is the group stage and we need to progress. It's 'Kill or be killed', like (former Portugal boss) Luiz Felipe Scolari used to say.\" - AFP, REUTERSGet The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/sports/football/timely-tweaks-did-trick-against-hungary-portugal-coach-santos", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}