{"Type": "", "Time": "2021-06-17", "Headline": "Covid latest: China claims virus started in US, should be considered bioweapon | World | News | Express.co.uk", "Text": "When you subscribe we will use the information you provide to send you these newsletters. Sometimes they'll include recommendations for other related newsletters or services we offer. Our Privacy Notice explains more about how we use your data, and your rights. You can unsubscribe at any time.After the World Health Organisations’s (WHO) inquiry into the origins of Covid, western leaders have called for another investigation into the theory the pandemic originated from a laboratory leak. Now, China’s state media outlet has published claims the virus started in the US and France, and was later found in Wuhan on December 2019.Zeng Guang, chief epidemiologist of the Chinese Center for Disease Control and Prevention, told the Global Times the US should be the focus of the research into the origin of the deadly virus. The scientist cited the US’ slow response to testing people during the first stages of the pandemic, and also alluded the pandemic may have been a bioweapon from Washington. He added: \"All bio-weapons-related subjects that the country has should be subject to scrutiny.” Mr Guang also said only China had invited the WHO to investigate where the virus began.READ MORE: Covid restrictions may remain after July 19, documents suggest    The National Institutes of Health (NIH) took samples from Americans and found seven people in Illinois, Massachusetts, Mississippi, Pennsylvania and Wisconsin had Covid before the first case was detected. The US reported its first Covid cases on January 21 last year. NIH data suggested Covid could have been present in the US as early as December 24 2019, with the cases said to be far away from expected points of entry. Zhao Lijian, spokesperson of China's Ministry of Foreign Affairs, cited the study and claimed it is supported by similar evidence seen in international scientific journals. He then added: “It is obvious that the outbreak had multiple origins.” Mr Zhao also citied chief Swedish epidemiologists who have suggested the virus was present in Sweden as early as November.    It comes as support for theories Covid originated in the Wuhan Institute of Virology continue to gain support in the West. US President Joe Biden has asked the intelligence community to investigate the theory, despite the WHO’s inquiry in February. At the G7 Summit over the weekend, world leaders also discussed the possibility Covid emerged from a lab leak according to Dr Tedros Adhanom Ghebreyesus, the WHO's director general. He then confirmed the WHO was preparing for the second phase of its investigation into the origins of COVID, which he said would need \"transparency\" and the \"cooperation\" of China. Dr Ghebreyesus added: “We believe that all hypotheses should be open and we need to proceed with the second phase to really know the origins.”DON'T MISS...Dr Shi Zhengli, a top virologist at the Wuhan Institute of Virology, has dismissed the lab leak there as “filth” being poured on an “innocent scientist”.She told the New York Times: “How on earth can I offer up evidence for something where there is no evidence?”In a recent letter in the journal Science, 18 scientists called for a transparent investigation to look into all possible scenarios, including the possibility of a lab leak.The letter also stresses the importance of a “dispassionate science-based discourse” on the origins of the Covid pandemic, with researchers noting the rise of “anti-Asian sentiment in some countries” in the midst of the pandemic.    The first reported case of Covid was in Wuhan, China in December 2019. As of writing, 177,781,705 cases and 3,847,985 deaths have been recorded from the virus.So far, more than 2.5 billion doses of coronavirus vaccine have been administered according to Our World In Data. The UK recorded 9,055 cases and 9 deaths within 28 days of a positive coronavirus test on Wednesday. See today's front and back pages, download the newspaper, order back issues and use the historic Daily Express newspaper archive.", "Section": "", "Writers": "", "URL": "https://www.express.co.uk/news/world/1450929/Covid-latest-china-scientists-global-times-usa-France-bioweapon-origins-lab-leak-ont", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}