{"Type": "", "Time": "2021-06-17", "Headline": "North Korean leader Kim says food situation 'tense' due to pandemic, typhoons, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SEOUL (REUTERS) - North Korean leader Kim Jong Un has said the country's economy improved this year but called for measures to tackle the \"tense\" food situation caused by the coronavirus pandemic and last year's typhoons, state media said on Wednesday (June 16).Kim chaired a plenary meeting of the ruling Workers' Party's central committee on Tuesday to review progress on major policies and craft measures to resolve economic issues, according to the official KCNA news agency.The committee set goals and tasks to achieve its new five-year economic plan outlined at its previous session in February, including increased food and metal production.Kim said the overall economy had improved in the first half of the year, with the total industrial output growing 25 per cent from a year before, KCNA said.But there was \"a series of deviations\" in the party's efforts to implement the plans due to several obstacles, he said, singling out tight food supplies.\"The people's food situation is now getting tense as the agricultural sector failed to fulfil its grain production plan due to the damage by typhoon last year,\" Kim said.The party vowed to direct all efforts to farming this year and discuss ways to tackle the Covid-19 pandemic, KCNA said.Kim called for steps to minimise impacts of natural disasters as a lesson from last year and key to attain this year's goal.In January, Kim said his previous five-year economic plan had failed in almost every sector, amid chronic power and food shortages exacerbated by sanctions, the pandemic and floods.He also the protracted pandemic required the party to step up efforts to provide food, clothing and housing for the people, KCNA said.North Korea has not officially confirmed any Covid-19 cases, a claim questioned by Seoul officials. But the reclusive country has imposed strict anti-virus measures including border closures and domestic travel restrictions.Covax, a global initiative for sharing Covid-19 vaccines with poor countries, has said it will provide nearly 2 million doses to North Korea but the shipment has been delayed amid protracted consultations.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/north-korean-leader-kim-says-food-situation-tense-due-to-pandemic-typhoons", "Source": "google"}