{"Type": "", "Time": "2021-06-17", "Headline": "\nCoronavirus | Daily average of jabs continues to improve - The Hindu\n", "Text": "\nPeople wait in large numbers to get vaccinated at Triplicane special camp for vaccination in Chennai on Wednesday, June 16,   | Photo Credit: RAGHUNATHAN SR India recorded 64,964 new COVID-19 cases and 2,261 new deaths till 9.30 p.m. on June 16. The country has so far reported a total of 2,96,97,263 cases and 3,81,863 deaths.Kerala reported 13,270 new infections, followed by Tamil Nadu (10,448) and Maharashtra (10,107). Maharashtra recorded 1,236 new fatalities, followed by Tamil Nadu (270) and Kerala (147). Maharashtra’s fatalities include backlog deaths which were missed in the previous reports.\nThe figures do not include cases and deaths from Punjab, Arunachal Pradesh, Chhattisgarh, Jharkhand, Tripura, Lakshadweep, and Ladakh. The data are sourced from the respective States’ health bulletins.Around 19.3 lakh samples were tested in the country on June 15 (the results for which were made available on June 16).About 28 lakh vaccine doses were administered in the country in the 24 hours ending 7 a.m. on June 16, which is 11.26 lakh doses fewer than what was recorded in the previous 24 hours. It is also 24,362 doses more than what was recorded during the corresponding period a week ago. The seven-day rolling average of daily vaccinations in the country continues to increase. It stood at 31.14 lakh on June 15, which is more than the 26.96 lakh recorded a week before (June 8). \nData | Daily COVID-19 vaccination picks up in the first 10 days of June\nIndia is also administering the highest number of average doses in the world, followed by the United States (1.14 million), Japan (1 million), and Brazil (0.92 million).About 22.8% of adults in India, 43% of those aged above 45, and 46.6% of people aged above 60, have been administered at least one dose of a COVID-19 vaccine, until 8 p.m. on Wednesday. While 15.7% of the country’s population has received at least one dose, only 3.5% are fully vaccinated. The figures are based on the estimated population in 2021.India continued to record the highest number of 7-day average daily deaths in the world with 3,721 deaths recorded on June 15. The two other countries with the highest fatality count after India were Brazil (1,986) and Colombia (577). Nearly 34% of the world’s new deaths were recorded in India on June 15.\n\n\n\n\n Our code of editorial valuesPlease enter a valid email address.\nPrintable version | Jun 17, 2021 11:19:18 AM | https://www.thehindu.com/news/national/coronavirus-daily-average-of-jabs-continues-to-improve/article34834311.ece\n\n© THG PUBLISHING PVT LTD.\n\nIt’s just one of series of attempts made by Nitish Kumar to bolster his party after its below par performance in 2020 Assembly polls\n\nRemigration of young, trained workers Bihar, Jharkhand workers at minimal levels\n", "Section": "", "Writers": "", "URL": "https://www.thehindu.com/news/national/coronavirus-daily-average-of-jabs-continues-to-improve/article34834311.ece", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}