{"Type": "", "Time": "2021-06-17", "Headline": "Even 30% pay raises can’t stop the junior banker exodus in Asia", "Text": "By Cathy Chan and John Cheng(Bloomberg) — They’ve raised salaries and promised quicker promotions.But the world’s biggest securities firms and banks are still struggling to retain junior investment bankers in Asia, challenging their expansion plans for a region that’s growing faster than almost anywhere else.Recruiters and executives say the exodus is in some ways more difficult to stem than in New York and London, where analysts and associates have rebelled against the industry’s work-till-you-drop culture.In Asia’s biggest hubs, young employees are more likely to leave because they think they can earn more — and climb the corporate ladder faster — at one of the many fintech and investment firms that have sprouted up to tap the region’s buoyant economies and swelling piles of wealth. The challenge is particularly acute in China and Hong Kong as foreign firms ramp up hiring to take advantage of a financial opening in Asia’s largest economy, competing with each other as well as the local startup scene.“The whole industry is running into a pretty big supply and demand issue, and I don’t think this is going to be alleviated any time soon,” Mark Leung, JPMorgan Chase & Co.’s chief executive officer for China, said in a Bloomberg Television interview. The U.S. lender is among banks including Goldman Sachs Group Inc., Credit Suisse Group AG and HSBC Holdings Plc. hiring hundreds of staff for their push into China.While it’s hard to quantify turnover with any certainty, an informal Bloomberg News poll of executives at four global securities firms found that anywhere between 13% to 15% of investment banking analysts and associates left their roles this year, roughly double the average in previous years. That’s in line with estimates for the U.S. and higher than the U.K., according to executives at recruiting firms.Exits have picked up despite annual pay raises of 25% to 30% since 2019 for Hong Kong-based bankers covering in-demand sectors like technology and health care, said executives who oversee groups or the region, asking not to be named discussing private information. The increments have been more subdued for Southeast Asia where attrition is also rising, one of them said.Jonathan Lam left HSBC Holdings Plc’s investment bank in Hong Kong in the middle of last year to join Butler, a home concierge company he helped start that offers personalised services ranging from housekeeping to fixing washing machines and hosting dinner parties. It was the feeling of making an impact and “owning something” that drove Lam to quit his debt capital markets job right after a promotion, he said. The prospect of a financial windfall also helped.“With banking you can make good money in the short term, but with startups, if you grind it through, it will lead to big fortunes,” said Lam, 30, who founded Butler with alumni of Goldman Sachs Group Inc. and Wells Fargo & Co. The startup completed a funding round last year and has 30 employees.Asia’s economic rise has made it one of the world’s most attractive regions for entrepreneurs. Its share of global startup investments rose to about 40% in 2015-2017, up from 10% a decade earlier, according to McKinsey. It’s home to more than a third of the world’s unicorns, the nickname for startups valued at US$1 billion or more.The attrition is made more acute by the fact that finance is still a growth industry in Asia and is smaller relative to the overall economy than in the U.S. and Europe. More than half of finance firms in mainland China surveyed by recruitment firm Michael Page expect to increase their headcount by about 11% this year, on average. Financial services will likely be the most-active recruiter in Hong Kong and the second most-active in Singapore, the poll showed.Some smaller hedge funds and money managers in Hong Kong are offering double the salary to lure talent, two quantitative trading analysts at a Wall Street bank said based on approaches from headhunters. Private equity firms, where employees get a share of profits, have also been active recruiters of junior talent in the past year, including Bain Capital, PAG and Hillhouse Capital, one of the people said.In Singapore, opportunities are sprouting at hedge funds and private equity firms as well as a new breed of fintech and digital banking firms, according to Lim Chai Leng, a senior director at recruiting firm Randstad Singapore.Startups and smaller boutique firms can offer flexible working and other benefits that established players have struggled to keep up with, said James Carss, managing director at executive search firm NRG in the U.K. The churn rate in the U.K. is three to four months behind Asia, but is likely to catch up, he said.Big technology firms are also drawing from the banks. Morgan Stanley Vice President Shiyi Lin last month left to join the strategic investment group at Alibaba Group Holding Ltd., according her LinkedIn page. In Singapore, Jack Ma’s Ant Group Co., Southeast Asia’s most-valuable startup Grab Holdings Inc. and its most valuable company Sea Ltd. are setting up digital banks.Daniel Yuan, a Yale-educated former analyst at Goldman Sachs, left in 2019 to become chief of staff at online finance company Futu Holdings Ltd. While he credits Goldman for teaching him everything he knows about finance, he found his ability to move up the ladder too rigid.“I knew exactly what I needed to do and how long I needed to keep doing this in order to advance my career at Goldman,” Yuan said. “At a leaner and more entrepreneurial corporate like Futu, there’s a lot of flexibility around what I can do, especially in my capacity as the chief of staff.”Banks are starting to notice. One example is Lam’s old firm, HSBC, which counts Hong Kong as its largest market. The lender, which is in a midst of a major pivot to Asia, last month promised a shorter career path for new associates, offering promotions after three years instead of four. It also pledged to boost pay. JPMorgan is also hiring more junior bankers and staff globally.Globally, lenders are raising pay for junior employees, enforcing curfews and hiring more to prevent defections and ease discontent as a jump in deals during the pandemic intensified the focus on work-life issues. Wall Street was set abuzz earlier this year by a leaked presentation from junior analysts at Goldman Sachs that detailed their grueling workload and punishing hours.Spokespeople for Goldman, HSBC and JPMorgan declined to comment for this story.“In Asia, junior bankers are more likely to leave for career opportunities that they see as more financially attractive,” said John Mullally, regional director at Robert Walters in Hong Kong. “The long hours and stress of banking careers are a factor, but just not as much as it is for their counterparts in Europe and the U.S.”For some beleaguered bankers, the exodus of their colleagues at the same time as dealmaking is thriving, is taking its toll. Over the past 12 months, mergers and acquisitions have jumped 30% in Asia Pacific, while initial public offerings have risen 44%, according to data compiled by Bloomberg.An associate at JPMorgan, who asked not to be named, said his workload doubled after a colleague quit for a financial technology firm in December, leaving him to work 18 hours a day, on average, without a break for almost two months.He’s now actively looking for a job at a buy-side firm, he said, looking for a place with less hierarchy and more opportunities for career advancement.© 2021 Bloomberg L.P.Furbatto, who will take the role of engineering director,  is expected to join the Silverstone-based team ahead of the 2022 season.  Aston Martin technical director Andrew Green will become chief technical officer with immediate effect.Though policymakers have yet to agree on a plan, most expect that by the end of 2023 they will have raised interest rates at least twice from the current near-zero level, forecasts published Wednesday show.  And though the Fed made no forecasts about its $120 billion monthly bond-buying program - which, along with rock-bottom interest rates, is keeping borrowing costs low and supporting economic growth - policymakers have said they will phase the program out before they begin raising rates.  Following the Great Financial Crisis, it was a full two years from the formal announcement in December 2013 of the bond-buying taper to the first interest rate increase.The 40-year-old actor will make his CBeebies debut on 25 June when he reads Supertato.The star's husband spent more than a year in hospital after getting the coronavirus.With the rising number of stakeholders playing a role in medical decision-making, pharmaceutical companies are looking for more effective ways to communicate the value of an innovative treatment. They are increasingly turning to actionable, evidence-based programs to convince these stakeholders of the value of the treatment. A comprehensive data set can help an analytics team map a treatment journey and quickly identify the patients and physicians who are most likely to benefit from a novel therU.S. Senate Democrats scrambled to unite around a sweeping election reform bill that they aim to bring to a vote next week, in the face of Republican opposition and state moves to pass laws placing new restrictions on voting.  Following a presidential election that saw a record 155 million Americans cast ballots, Democrats say action is necessary to protect democracy.  Republican-controlled legislatures in six competitive states https://www.reuters.com/world/us/republicans-erect-voting-barriers-across-number-politically-crucial-us-states-2021-06-15 have passed bills that voting rights advocates have denounced as partisan power grabs.Manuel Locatelli timed his run into the Italy team almost as well as he timed his run for the Azzurri's opening goal against Switzerland on Wednesday.  The midfielder swept a volleyed pass out to the right wing to Domenico Berardi, before racing half the length of the pitch to get on the end of his Sassuolo team mate's cross and fire home.  Locatelli followed that up with a superb left-footed strike from the edge of the box in the second half to top off a night in which he announced himself to a global audience.By Jarrett Banks A Goldman Sachs special purpose acquisition company will buy radiation detection company Mirion Technologies Inc. from London-based buyout veterans Charterhouse Capital Partners, Mirion said in a statement. The deal values Mirion at about $2.6 billion, or 13.3 times the company’s estimated 2022 adjusted EBITDA of approximately $192 million, the statement said. The […]Democratic Senator Kirsten Gillibrand has revived a bill that would establish a new U.S. federal agency to shield Americans from the invasive practices of tech companies operating in their own backyard.  Last year, Gillibrand (D-NY) introduced the Data Protection Act, a legislative proposal that would create an independent agency designed to address modern concerns around privacy and tech that existing government regulators have proven ill-equipped to handle.  \"The U.S. needs a new approach to privacy and data protection and it’s Congress’ duty to step forward and seek answers that will give Americans meaningful protection from private companies that value profits over people,\" Sen. Gillibrand said.Today, the 16th annual SOCAN Songwriting Prize celebrates the exceptional talent of the next generation of great Canadian music creators with 20 sensational songs.iWave, the industry's top-rated fundraising intelligence solution, is excited to announce the launch of their highly anticipated Foundation and Company Screening technology. While wealth screening for individuals has been available for decades, no technology provider has ever been able to provide a screening solution for institutional donors, until now.High Tide Inc. (\"High Tide\" or the \"Company\") (TSXV: HITI) (Nasdaq: HITI) (FRA: 2LYA), a retail-focused cannabis corporation enhanced by the manufacturing and distribution of consumption accessories, announced today that the Company will release its financial and operational results for the quarter ended April 30, 2021 after market close on Monday, June 28th, 2021. High Tide's second quarter 2021 financial and operational results will be available on SEDAR and on the Company's website at www.higEli Lilly CEO David Ricks joins 'Influencers with Andy Serwer' to discuss progress in the fight against COVID-19.The COVID-19 pandemic has shown us once again the importance of quickly developing and approving the use of innovative drugs. A publication launched today by the Montreal Economic Institute has two recommendations to help ensure that Canadians have quicker access to medications.The Honourable François-Philippe Champagne, Minister of Innovation, Science and Industry, will announce an important investment to support domestic manufacturing of personal protective equipment.Rokmaster Resources Corp. (TSXV: RKR) (OTCQB: RKMSF) (FSE: 1RR1) (\"Rokmaster\" or the \"Company\") is pleased to report on the continued success of its inaugural surface diamond drill program at the Revel Ridge Project.Members of the media are invited to attend an important announcement regarding public transit infrastructure with Andy Fillmore, Parliamentary Secretary to the Minister of Infrastructure and Communities and Member of Parliament for Halifax, on behalf of the Honourable Catherine McKenna, Minister of Infrastructure and Communities; the Honourable Kelly Regan, Deputy Premier of Nova Scotia, on behalf of Energy and Mines Minister Chuck Porter; and his Worship Mike Savage, Mayor of the Halifax RegionIn this episode of Influencers, Eli Lilly Chairman & CEO David Ricks joins Andy to discuss the latest in the pharmaceutical industry, new progress in the fight against COVID-19, and potential groundbreaking advancements for the treatment of Alzheimer’s.Brookfield zoo in Chicago uploaded video of their animals getting soaked to celebrate 'international bath day' on Monday (June 14).An eight-year-old anteater named Lupito, a six-year-old Emu named Echo and a 10-year-old black rhinoceros named Layla all got sprayed with water.The zoo said in a press release that the celebration was to honour Greek scientist and mathematician Archimedes who discovered purportedly while in the bath 'that an object's volume could be accurately measured by being submerged in water!' and promptly leapt out of the bath shouting 'Eureka'.The Loose Women panellist looks so chic", "Section": "", "Writers": "", "URL": "https://sg.finance.yahoo.com/news/even-30-pay-raises-cant-stop-the-junior-banker-exodus-in-asia-035029167.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}