{"Type": "Asia", "Time": "2021-06-17", "Headline": "COVID-19 pandemic sparks surge in Hong Kong 'devil's breath' cash druggings", "Text": "HONG KONG: A spiked drink, a puff of dust, missing memories, and an empty bank account.Hong Kong's entertainment district Wanchai has been battered by a coronavirus driven collapse in tourism and as times get desperate, several men have seen their night out turn into a nightmare.It took days for Stuart to recall a crucial memory. But after speaking with another victim, it suddenly came flooding back.A woman trying to spark a conversation outside a bar, and then a man approaching with a determined look in his eye.\"I thought he was going to punch me but he just blew something in my face,\" he recalled. \"I laughed. But that was it. No memories after that.\"It was a breakthrough for Stuart who, like the other victims interviewed for this piece, asked to use a pseudonym.He had been trying to figure out why post-match drinks with his cricket buddies in Wanchai, a popular hangout for white-collar foreign workers, had turned into one big blackout following his encounter outside the bar.Hours were missing alongside HK$80,000 (US$10,300) - taken in six separate transactions from nearby ATMs.\"It was a joint account with my missus and we have a baby on the way,\" the 36-year-old Brit, who moved to Hong Kong 18 months ago, told AFP.\"Police said maybe I was just drunk, but why would I empty that account? It wouldn't be worth my life doing that.\"OPPORTUNISTIC CRIMEWhatsApp groups used by Wanchai bar owners and regulars have lit up in recent months with similar stories.Most targets have no memory and awake to find accounts emptied by scammers who have drugged their unwitting victims - largely by tampering with their drinks - to keep them pliable and obtain their pin numbers.Victims have dubbed the scam \"Devil's Breath\" attacks - technically the nickname for the powerful anti-nausea drug scopolamine but in this case used more as a catch-all descriptor.Spiked drinks have previously posed a small risk in Hong Kong, a largely safe city, but the pandemic has exacerbated the issue.\"It's become a huge problem,\" one bar owner, who declined to be named, told AFP, saying multiple regulars had become victims.\"The police are up and down here all night, checking our licenses, making sure we abide by pandemic restrictions. But this seems to be something they just don't, or won't, tackle,\" he added.The jump in cases tracks with a general rise in opportunistic crime as Hong Kong experiences its worst recession in decades.Crime figures from last year showed a 26 per cent increase in robberies, a 237 per cent jump in blackmail and an 89 per cent rise in deception.The latter two categories include phone and online scams, which have filled local media in recent months. Cybercrime was up 55 per cent last year.In a series of pandemic themed reports the Global Initiative Against Transnational Organized Crime detailed how the coronavirus has transformed crime trends.Widespread lockdowns and travel restrictions, for example, have made break-ins and international drug smuggling harder but the pandemic has been a boon for human trafficking, extortion, counterfeiting and cybercrime.Police and bar owners in Hong Kong say the vast majority of robberies are carried out by teams of sex workers, an already vulnerable group, sometimes with the help of male accomplices.\"We've all struggled during the pandemic and that includes the girls,\" another Wanchai bar owner said. \"That doesn't excuse the crime, but it helps explain why.\"'PSYCHOLOGICAL DAMAGE'Three people interviewed by AFP, including Stuart, reported the robberies but said it was a struggle to get officers to treat them as victims.\"When I reported it, the officer sighed and said he already had some 90 case files on his desk,\" recalled James, a 41-year-old British school teacher who had HK$64,000 lifted from his account. \"I was like 'Well now you have 91 cases mate'.\"All three said they struggled to get crucial data from their bank HSBC to give to police. HSBC did not respond to multiple requests for comment.Police said such crimes had risen during the pandemic and that the force had ramped up operations, including deploying intelligence teams and specialist anti-triad officers.\"I think you can rest assured that we are putting a lot of resources now to fight these kinds of crimes,\" Acting Assistant District Commander Glenn Ho Siu-tung told AFP.He conceded there may be room for improvement on how police treat victims.\"I think we will have to spend some time educating frontline officers,\" Ho said, adding drinkers need to remain vigilant and not leave out any details when reporting crimes.Victims, meanwhile, say the trauma of what they experienced is worse than the lost money.\"It's the psychological damage it does to you,\" said Stuart. \"You just can't fathom how you could be so compliant\".Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Hong Kong,crime,drugs", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/covid-19-pandemic-crime-surge-hong-kong-devil-breath-cash-scam-15032056", "Source": "google"}