{"Type": "", "Time": "2021-06-17", "Headline": "China launches crewed spacecraft Shenzhou-12 in historic mission, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.JIUQUAN, CHINA (REUTERS, AFP, XINHUA) - China’s Shenzhou-12 manned spaceship has successfully docked with the space station core module Tianhe on Thursday (June 17), according to the China Manned Space Agency (CMSA).The spacecraft carrying three astronaut was sent to space by a Long-March 2F rocket, which blasted off at 9.22am on Thursday morning from the Jiuquan Satellite Launch Centre in north-western Gansu province. After about 10 minutes after the launch, Shenzhou-12 or \"Divine Vessel\" reached orbit and the space craft separated from the rocket, to loud applause in the control room among rows of blue-suited engineers.State broadcaster CCTV showed a live feed from inside the spacecraft, with the three astronauts lifting their helmet visors and one smiling and waving at the camera.Another floated a pen just off his lap in zero gravity as he browsed the flight manual.Shenzhou-12 is the third of 11 missions – four of which will be crewed – needed to complete China’s first full-fledged space station. Construction began in April with the launch of Tianhe, the first and largest of three modules.The astronauts Nie Haisheng, 56, Liu Boming, 54, and Tang Hongbo, 45, are to work and stay on Tianhe, the living quarters of the future space station, for three months - the longest stay in low Earth orbit by any Chinese national.During their sojourn on the cylinder-like Tianhe, slightly bigger than a city bus, the three men will test the module’s technologies, including its life-support system.The men will also be monitored for how they fare in space physically and psychologically for an extended period of time.An upcoming mission to the space station will last six months.\"This will be the first crewed flight in the space station (construction) phase, and I'm lucky to be able to have the 'first baton',\" Mr Nie told reporters in Jiuquan a day before the launch.The veteran astronaut has been hailed by his team as a bastion of stability and a teacher figure who constantly challenges others with tough questions.“As long as we have him in our hearts, we have nothing to fear,” fellow astronaut Wang Yaping, who is part of the Shenzhou-12 backup team, told state media previously.“In our crew, elder brother Nie is like the needle that stills the sea,” she said.Like Mr Nie, Mr Liu was from the first batch of astronauts selected in the 1990s for China’s space programme.Known for his intellect, Mr Liu is often addressed by his colleagues as “Little Zhuge”, the renowned military strategist who lived in China two millennia ago.On the Shenzhou-7 mission in 2008, Mr Liu famously used a crowbar to prise open the hatch after it refused to open.Mr Tang, a former air force pilot, 45, was from a later batch of astronauts, and trained for more than a decade before being selected for his first spaceflight on Shenzhou-12.“I’ve waited for 11 years, and finally I’m ready, and I can contribute my strength,” Mr Tang told reporters on Wednesday.Their Shenzhou-12 spacecraft will dock with the Tianhe main section of the space station, which was placed in orbit on April 29.The module has separate living spaces for each of them, a treadmill for exercise, and a communication centre for e-mails and video calls with ground control.It is China’s first crewed mission in nearly five years.The launch represents a matter of huge prestige in China, as Beijing prepares to mark the 100th anniversary of the ruling Communist Party on July 1 with a massive propaganda campaign.To prepare for the mission, the crew has undergone more than 6,000 hours of training, including hundreds of underwater somersaults in full space gear.The first crew will test and maintain the systems on board, conduct spacewalks and undertake scientific experiments.China’s space ambitions have been fuelled in part by a US ban on its astronauts on the International Space Station (ISS), a collaboration between the United States, Russia, Canada, Europe and Japan.It is due for retirement after 2024, even though Nasa said it could potentially remain functional beyond 2028.Tiangong will be much smaller than the ISS, and is expected to have a lifespan of at least 10 years.Since 2003, China has launched six crewed missions and sent 11 astronauts into space, including Mr Zhai Zhigang, who carried out China’s first space walk ever on the 2008 Shenzhou mission.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/chinese-rocket-carrying-first-crew-to-new-space-station-blasts-off", "Source": "google"}