{"Type": "", "Time": "2021-06-17", "Headline": "Fed Decision: Central Bank Satisfies Inflation Hawks Without Lifting a Finger - Bloomberg", "Text": "Central bankers projected interest-rate increases well into the future that could be changed easily depending on economic conditions.Fed Chair Jerome Powell would like to shelve “talking about talking about.”Photographer: Susan Walsh-poll/AFP/Getty ImagesThe Federal Reserve’s June decision was viewed overwhelmingly as hawkish across any number of measures. And yet, when it comes down to tangible policy actions, the central bank barely lifted a finger.The Federal Open Market Committee left the fed funds rate unchanged in a range of 0% to 0.25%, but, in a surprise to just about all market observers, policy makers signaled through their “dot plot” that they now expect two interest-rate increases by the end of 2023, up from a median expectation of zero in March. While the Fed’s statement didn’t tweak any wording around the pace of its asset purchases, it conspicuously  removed the second sentence that had been included since April 2020: “The COVID-19 pandemic is causing tremendous human and economic hardship across the United States and around the world.” That reflects the reality of progress of getting Americans vaccinated and suggests that the emergency measures that have been in place for more than a year — such as $120 billion of monthly bond purchases — may soon no longer be necessary.Meanwhile, Fed officials updated their economic projections for the first time since March, which was before some of the highest year-over-year inflation numbers  in decades. They boosted their expectations for core PCE to 3% in 2021, from 2.2% previously, but barely adjusted projections for inflation in 2022 and 2023, at 2.1%. Policy makers also didn’t change their views much on the unemployment rate, calling for it to likely fall to 4.5%, the same as in March, then 3.8% in 2022 and finally 3.5% in 2023. Some analysts speculated that the quirks in the labor market that have caused payroll gains to miss estimates in the past two months would lead officials to raise their jobless rate forecasts.Without question, it all appears hawkish and explains why the benchmark 10-year Treasury yield rose almost 10 basis points after the statement was released and the five-year yield surged more than 13 basis points. The S&P 500 Index swiftly retreated to a 1% decline on the day before paring losses. However, the Fed has gone to great lengths to emphasize that as part of its new policy framework, it will make outcome-based decisions, rather than adjusting interest rates based on projections. Given that guidance, why exactly do we care about the dot plot again?Treasury yields soar after more Fed officials expect rate hikes in 2023 Source: BloombergFed Chair Jerome Powell made clear yet again his view of the dot plot: “The dots are not a great forecaster of future rate moves,” he said. “These are of course individual projections, they’re not a committee forecast, they’re not a plan. And we did not actually have a discussion of whether liftoff is appropriate in any particular year, because discussing liftoff now would be highly premature — it wouldn’t make any sense.” Also, there’s no guarantee that Powell will still be in his position come 2023.Even when it came to the more pressing issue of reducing asset purchases, Powell was noncommittal. “You can think of this meeting that we had as the ‘talking about talking about meeting,’ if you like, and I now suggest that we retire that term,” he said. “I expect that we’ll be able to say more about timing as we see more data,” he said, adding, “we’re still a ways from our goal of substantial further progress.”In fact, the only policy move that didn’t involve projections and forecasts, which the Fed could easily sidestep when the time comes, was the central bank’s adjustments to its so-called administered rates, which dictate the interest paid on excess reserves and at the central bank’s reverse-repo facility, which has experienced  unprecedented use from money-market funds and other counterparties that are inundated with cash. It boosted both by five basis points: IOER is now 0.15% and the rate at its reverse-repo facility is 0.05%. This isn’t really “hawkish” per se, even if it was a surprise to many, as it’s mostly a technical tweak to avoid pressure on the zero lower bound.So where do we truly stand after this meeting? By and large, Fed officials still see inflation as transitory and settling back around its 2% target in the coming years. They haven’t changed their view on the trend lower in the unemployment rate, with Powell saying “I would expect that we would see strong job creation building up over the summer and going into the fall.” Meanwhile, the threshold for tapering hasn’t been reached, and Powell reiterated that policy makers will provide markets with a long runway before they get started. At best, traders learned that the majority of the Fed doesn’t seem willing to fall so far behind the curve that it’ll have to slam on the brakes later. With this hawkish tilt, the central bank has preserved its coveted “optionality” and shows it’s not entirely oblivious to robust economic growth, elevated price pressures, ultra-easy financial conditions and a glut of cash in the system. This column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners.To contact the author of this story:Brian Chappatta at bchappatta1@bloomberg.netTo contact the editor responsible for this story:Daniel Niemi at dniemi1@bloomberg.net", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/opinion/articles/2021-06-16/fed-decision-central-bank-satisfies-inflation-hawks-without-lifting-a-finger", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}