{"Type": "", "Time": "2021-06-17", "Headline": "Football: Activist lands on pitch before Germany-France match, 'injures several fans', Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.MUNICH, GERMANY (AFP) - A Greenpeace activist crash-landed on the pitch in Munich on Tuesday (June 15) before the Germany-France match at Euro 2020 after his powered parachute microlight struck spidercam cables at the Allianz Arena, with Uefa saying he had \"injured several people\".The pilot flew over the pitch just before kick-off in the Group F clash with \"Kick out oil\" written on the canopy of his parachute.However, when the pilot hit television cables above the pitch, it knocked his microlight off balance and he landed on the turf after clipping one of the stands.This is when Uefa said several people were injured and had to be hospitalised.\"This inconsiderate act - which could have had very serious consequences for a huge number of people attending - caused injuries to several people attending the game who are now in hospital and law authorities will take the necessary action,\" European football's governing body said in a statement.\"The staging of the match was fortunately not impacted by such a reckless and dangerous action, but several people were injured nonetheless.\"The activist seemed unhurt and was quickly arrested.The stunt was a protest against German car manufacturer Volkswagen, one of the sponsors of the European Championship, Greenpeace explained in a Twitter post.\"Uefa and its partners are fully committed to a sustainable Euro 2020 tournament and many initiatives have been implemented to offset carbon emissions,\" said Uefa.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-activist-lands-on-pitch-before-germany-france-match-injures-several-fans", "Source": "google"}