{"Type": "", "Time": "2021-06-17", "Headline": "Marjorie Taylor Greene leads conspiracy-heavy attack on Fauci", "Text": "WASHINGTON — One after another, some of the most conservative members of the House of Representatives took to the stage at the U.S. Capitol on Tuesday to denounce Dr. Anthony Fauci, the top medical adviser to President Biden, and to air other pandemic-related grievances.Rep. Marjorie Taylor Greene, R-Ga., who was introducing a bill to reduce Fauci’s salary to $0 and have him account for his handling of the coronavirus pandemic, led the attacks. The proposed legislation, called the Fire Fauci Act, stands no chance of passage in a House controlled by Democrats.Nevertheless, the highly vituperative affair — replete with reminders that Fauci was an “unelected bureaucrat” — was indicative of how the bespectacled, Brooklyn-born immunologist continues to be at the center of every ongoing debate related to the coronavirus, including the economic costs of lockdowns (low, says a new study, though there are, of course, social and psychic costs to isolation) and the efficacy of wearing masks (exceptionally high, the discomfort of masking aside).Bitter recriminations over the handling of the pandemic continue to fill the national discourse, even as that pandemic ends. Conservatives believe that restrictions were onerous and unnecessary, while liberals and progressives have criticized former President Donald Trump’s response. Trump frequently undermined and threatened Fauci, eventually making Dr. Scott Atlas, a controversial Stanford-affiliated physician, his top coronavirus adviser.Even as the pandemic ebbs in the United States, the attacks against Fauci have intensified. Critics have used his emails, released recently under a Freedom of Information Act request, to buttress their claims. Those show that he was uncertain about the efficacy of masks in the early stages of the pandemic. So were many others at a time early on when how the virus spread was poorly understood. One email Fauci received in January 2020 did raise the possibility of a lab escape, but there is no evidence he concealed critical information about the origins of the virus. Such information has been exceptionally difficult to come by for investigators outside China.“Please cover his emails,” Greene said. “Get the truth out.” The emails were extensively covered by the Washington Post and other outlets, but conservatives who have been suspicious of Fauci and the scientific establishment from the start insist that the messages merit more investigation.Taylor and her co-sponsors on the anti-Fauci bill (Republican Reps. Thomas Massie of Kentucky; Andy Biggs and Paul Gosar of Arizona; Mary Miller of Illinois; Buddy Carter of Georgia; Bob Good of Virginia; Matt Gaetz and Greg Steube of Florida; and Mo Brooks of Alabama) claim that Fauci knowingly funded research at the Wuhan Institute of Virology that made the virus more lethal. Although that laboratory did receive National Institutes of Health funding through a New York-based organization called the EcoHealth Alliance, both Fauci and NIH Director Francis Collins have explicitly said that Chinese grant recipients were prevented from using U.S. funds for so-called gain-of-function research, which makes a pathogen either more transmissible or more potent to see how it might then behave.Conservatives are unconvinced. Now that Fauci is associated with Biden, not Trump, their attacks are seemingly intended to imply that the new administration is incapable of holding China to account. Biden has, in fact, called for a more complete investigation of how the coronavirus originated.“Were we all victims of a bioweapon?” wondered Greene, a onetime adherent of the QAnon conspiracy theory who has also mused about “Jewish space lasers” and more recently dismissed evolution. She demanded “reparations” from the Chinese government, which has sought to distance itself from any responsibility for the origins of the virus, going so far as to call for investigations of bioweapons at American facilities. Yet scientists have become increasingly emboldened in arguing that the lab escape theory needs a harder look, with greater cooperation from China. The notion that China unleashed a bioweapon on the world, however, is not considered a credible hypothesis.Trump was sometimes irritated with Fauci’s media appearances, and by the high degree of trustworthiness he was afforded by the public. Those grievances plainly persist. “Dr. Fauci leveraged his position as a leading figure in the White House to become a celebrity,” charged Rep. Biggs.Greene and others spoke standing beside a placard that said: “Fauci lied. People died.” The words were accompanied by a photo of a masked Fauci, who is head of the National Institute of Allergy and Infectious Diseases. He has been in the federal government for 40 years and has served seven consecutive presidents, including Trump.Firing him would be difficult, since Fauci is a senior public servant, not an appointed official. Nor are congressional Democrats, or the president, bound to take personnel advice from the most radical members of the opposition party, some of whom called into question Biden’s legitimate victory in last November’s election.Among the participants in Tuesday’s anti-Fauci fusillade was Rep. Brooks, who last week was sued by Rep. Eric Swalwell, D-Calif., for his alleged role in inciting pro-Trump rioters on Jan. 6. In response to a question from Yahoo News, Brooks angrily denied that the anti-China rhetoric on display Tuesday could be fueling attacks against Asian Americans. He noted that Chinese Americans “are not necessarily members of the Chinese Communist Party.”The purpose of Tuesday’s rally was largely symbolic, more significant in what it says about how conservatives plan to litigate the pandemic in the coming months, ahead of the 2022 midterm elections. Even as life returns to normal in many parts of the country, there remain uncertainties about the upcoming school year, about how long white-collar workers will continue to work from home and just how much effort should go into investigating the origins of the coronavirus, not to mention how to prevent the next pandemic.“Let’s not divide people with politics,” said Greene, who less than 24 hours earlier had called a press conference to apologize for having compared pandemic restrictions to the horrific treatment of Jews by Nazis during World War II. A skilled cultural warrior with little interest in seeking legislative solutions, Greene understands that the pandemic remains a motivating issue for both sides of the nation’s gaping political divide.Fauci has been living under heightened security for months. That is likely to continue as long as he remains at the center of conservatives’ ire. Last month the National Review ran a cover story on what it deemed “the unforced errors of America’s political doctor,” mockingly depicting him as a would-be saint. And the anti-vaccine activist Robert F. Kennedy Jr. is set to release a book highly critical of Fauci in September. As of Monday evening, that book was among the bestselling on Amazon. ____Read more from Yahoo News:Airline travel horror stories mount as Americans pack the not-so-friendly skiesCalifornia and much of the American West face mega-drought brought on by climate changeYahoo News/YouGov poll: U.S. COVID worries fall to lowest level ever ahead of Memorial DayWill face masks be a regular part of life post-pandemic?Australia recommended that AstraZeneca's Covid-19 jab should not be given to people under 60 on Thursday, a fresh blow to the country's glacial vaccine rollout.When 28 Chinese warplanes streaked through the skies around Taiwan on Tuesday – the largest such incursion this year – they followed a pattern that has generated alarm among US and Taiwanese military planners.Los Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.The freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.If you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Israel's ultra-Orthodox parties were once viewed as political kingmakers, but now they have been pushed into opposition by a \"change\" government they fear will put secular values before theirs.The global infrastructure plan announced by G7 leaders aims to offer developing nations a credible alternative to China's much-criticized Belt and Road Initiative -- but it faces major hurdles on the ground, especially if Beijing's hiccups are any indication.The newly-formed Amihan Esports Wild Rift squad went from unknown to become the dark horses that took down Team Secret at the Wild RIft PPGL Summer Playoffs.If you’re wondering whether Ethereum is a good long term investment, keep reading.Purchases of new private units in Singapore declined about 30% to 891 in May from 1,268 in April, Urban Redevelopment Authority figures showed.For Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neItaly became the first team to reach the knockout stage of Euro 2020 as midfielder Manuel Locatelli scored twice in a 3-0 win over Switzerland in Rome on Wednesday, while Wales moved to the brink of joining them by beating Turkey.Burner phones, safehouses, sheltering with rebels and months away from loved ones -- Myanmar anti-coup activists have been driven underground by a brutal crackdown but have no regrets about choosing life on the run.Two experienced astronauts are among the first three-man crew for China’s first space station, with final preparations under way for their mission launch on Thursday. The Long March 2F rocket carrying them to the Tianhe module – the first part of the Tiangong space station – is expected to lift off at around 9.22am from the Jiuquan satellite launch centre in the Gobi Desert. Propellant refuelling for the rocket was under way on Wednesday morning, according to the China Manned Space Engineering OA former mayor in northern Mexico has been condemned to eight years in prison for his involvement in the 2017 murder of journalist Miroslava Breach, prosecutors said Wednesday.There was no talk of gazing into Vladimir Putin's \"soul\" and the Russian president didn't try to gaslight a rookie US leader.Blackstone Group is nearing an agreement to acquire office developer Soho China Ltd. in what would be its biggest real estate investment in China, people familiar with the matter said.Hong Kong police arrested the chief editor and four executives of pro-democracy newspaper Apple Daily on Thursday, raiding its newsroom for a second time in the latest blow to the outspoken tabloid.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/marjorie-taylor-greene-leads-conspiracy-heavy-attack-on-fauci-223635624.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}