{"Type": "", "Time": "2021-06-17", "Headline": "130 stallholders, cleaners at Telok Blangah Drive Food Centre undergo mandatory Covid-19 testing, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Testing for Covid-19 was quick and smooth at the void deck of Block 80D Telok Blangah Street 31, as stallholders and cleaners from the Telok Blangah Drive Food Centre and Market turned up for mandatory swabbing on Thursday morning (June 17).The temporary test site was set up after a second worker at the food centre was confirmed to be infected on Wednesday.When The Straits Times (ST) visited the site, there was some crowding at the entrance as hawkers showed up early for appointments scheduled from 9am, but it cleared quickly as testing commenced. The testing was to go on till 4pm.An MP for West Coast GRC, Ms Rachel Ong, who was present, told ST that around 100 stallholders and 30 cleaners were expected to be swabbed.The hawker centre is closed for deep cleaning and disinfection from Wednesday afternoon till Friday.Ms Ong told ST that the community has been understanding and supportive.\"I think everyone knows that this is the correct thing to do, and there was a lot of support,\" she said.She added that the hawkers were thankful for recent rental rebates. On further support for stallholders and hawkers, she said: \"We are still assessing it with our grassroots volunteers, and the president of our shopkeepers and stallholders association... So if we can help, we will do our best.\"Among those tested was 76-year-old hawker Lim Kwang How, who operates a yong tau foo stall at the market. He arrived at around 9am to get swabbed.\"The swab test was done quickly and smoothly and I did not experience any discomfort,\" Mr Lim said in Mandarin, adding that there were no queues inside the swab centre.Another hawker, Madam Ng Guek Eng, 56, who arrived early for her 10am appointment, expressed concerns about having to close for longer than three days.Madam Ng, who has been operating a carrot cake stall at the food centre for 26 years, said in Mandarin: \"We are also not sure when it will open, and hopefully there will not be a lot of cases. If there is an increase in cases, there will be a need to lock down or close for longer.\"Already, she will have to dispose of unused ingredients such as eggs, which have been delivered. \"We will definitely face a loss of income,\" she added.\nStallholders and cleaners from the Telok Blangah Drive Food Centre and Market turning up for mandatory swabbing on June 17. ST PHOTO: GAVIN FOO\nMr Manfred Tham, 31, who owns a fish stall at the wet market, said there was no queue in the swabbing centre when he arrived and that the whole process was conducted smoothly.He added that his stall will be closed for three days and he expects it to be back in operation by Saturday.“I was lucky that I didn’t buy a lot of  stock and sold most of it before the closure,” he said.Mr Tham added that he will be taking extra precautions, such as  staying at home during the closure and washing his hands frequently.The most recently detected case at the Telok Blangah Drive Food Centre was a 33-year-old Singaporean woman who works there part time.She is a household contact of an earlier case confirmed on Monday - a 42-year-old Singaporean man who is a hawker at the Telok Blangah Drive Food Centre. He has been linked to the cluster at the Bukit Merah View market.A 12-year-old Singaporean girl who attends CHIJ St Theresa's Convent is a family member and household contact of these two cases. The girl tested positive on Tuesday. All three were already in quarantine from Monday.There are 39 cases in the Bukit Merah View food centre cluster as at Thursday.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/mandatory-covid-19-testing-under-way-for-130-stallholderscleaners-at-telok-blangah-drive", "Source": "google"}