{"Type": "", "Time": "2021-06-17", "Headline": "Les bleus want more control , Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.MUNICH • Didier Deschamps was happy with France's commitment in Tuesday's 1-0 Euro 2020 Group F win over Germany but said the world champions must look to retain possession better through the rest of the tournament.France handed the Germans their first opening-game loss in an European Championship, courtesy of an own goal by Mats Hummels in the 20th minute.Statistics showed that Les Bleus had just over 40 per cent possession - and only four attempts on goal compared to Germany's 10 - but Deschamps said they were more clinical than Joachim Low's side in Munich.\"I wouldn't say that we did dominate them because we played against a good team in Germany who caused us problems,\" the France coach said.\"They had a lot of ball possession, more than us. We were defending very well. It was a match played on a very high level, two titans facing each other. We could have done things better, especially in ball possession.\"France midfielder Paul Pogba accused Antonio Rudiger of \"nibbling\" him on the shoulder during the game but said he was not looking for the Germany defender to face punishment.The two players clashed towards the end of the first half, with Rudiger caught on camera putting his face close to Pogba's back before reaching his arms around the Frenchman's chest. There was no action taken by the officials.\"He nibbled, I think, a little bit on me,\" Pogba said. \"I told the referee and he took a decision. It's over. We hugged each other and that's it.\"Pogba's sublime pass in the 20th minute unlocked Germany's defence, allowing Lucas Hernandez to drive in a cross that Hummels turned into his own net.He earned the Star of the Match award for his display but knows how lucky he is to play alongside N'Golo Kante.The 28-year-old delivered several other moments of quality as the link between France's midfield and the dream attacking trident of Antoine Griezmann, Kylian Mbappe and Karim Benzema. But it was Chelsea's Kante, 30, who knitted it together.When required as a defensive shield in the second half, as Germany tried to build some momentum, he was immense.Pogba's Manchester United career has spluttered at times, yet when playing for France alongside Kante, he looks like a world-beater. In the 28 games they have started together, Les Blues have won 22, drawn six and lost none.0France have not lost their opening game (W6 D3) since the inaugural European Championship in 1960.0Defeats for Les Blues in the 28 matches (W22 D6) that Paul Pogba and N'Golo Kante have started together.\"Pogba was absolutely immense tonight,\" France's Euro 2000 winner Robert Pires said. \"We know all about his technique. He's back to his best, physically.\"For Germany, there is much to ponder for Low. His strategy to strengthen his flanks in his 3-4-3 formation with Robin Gosens and Joshua Kimmich up in midfield only partially paid off.Dangerous gaps opened at the back when they tried to support the attacking game and could not return quick enough as part of a five-man back row.The midfield duo of Toni Kroos and Ilkay Gundogan, bogged down by defensive tasks, also failed to provide sufficient support for the front line.Kimmich, an established defensive midfielder at Bayern Munich, was then forced to play in right back due to the lightning pace of Mbappe, allowing France's midfield to dominate with one less German in the middle of the park.Germany also looked toothless in attack with Thomas Muller failing to gel with Kai Havertz and Serge Gnabry. But Low believes he can rectify the problems.\"We still have two games and we can fix it,\" he said. \"We tried to play from the wings. We knew they were crowded in the middle and were tough on the one-on-ones. So we had to operate with crosses. But we lacked the final punch in and around the box.\"There was also pre-match drama on the pitch as police in Munich said yesterday they were investigating a Greenpeace activist who parachuted into the stadium before kick-off, injuring two people.The activist flew into the stadium strapped to a yellow parachute microlight and apparently got tangled in overhead camera wires. He was thrown off course and narrowly avoided crashing into the stands before landing on the pitch among the players.The pilot, identified as a 38-year-old from Germany's Baden-Wurttemberg state, was detained by police.REUTERS, XINHUAJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/les-bleus-want-more-control", "Source": "google"}