{"Type": "", "Time": "2021-06-17", "Headline": "No illusions between the US and Russia", "Text": "\nBiden and Putin had a litany of grievances to get through, but their meeting produced some minor achievements\nThe question before yesterday’s summit in Geneva between Joe Biden and Vladimir Putin was whether the US president had much to gain from meeting face to face with his Russian counterpart. Mr Biden is not inexperienced in foreign policy matters. But the Russian president, whom Mr Biden once described as a “killer”, has a habit of using these occasions to outmanoeuvre less wily operators. His Helsinki summit with Donald Trump in 2018 was a fiasco for Mr Biden’s predecessor.Russia is also now set on a foreign policy course directly hostile to Western interests. Since Mr Putin’s illegal annexation of Crimea, and arguably before then, it has been difficult to discern much common ground between the Kremlin and the democratic world. The naive hopes entertained by previous administrations of a “reset” of relations between Russia and the US were dashed long ago.Mr Biden and Mr Putin had a litany of grievances to get through – everything from cyberattacks and sanctions to human rights abuses. Even so, the meeting resulted in some minor achievements, including the restoration of normal ambassadorial ties and an agreement for further dialogue, and no major embarrassments. But neither side appeared to be under any illusions about the nature of their relationship. The Russian president used a lengthy press conference to, among other things, defend his repressive rule.Mr Biden had said in advance that he wanted a “stable, predictable relationship” with Moscow. Few would consider that an unworthy aim. Given the character and record of the man who shows no sign of loosening his grip on the Kremlin, however, that may turn out to be wishful thinking. We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage.", "Section": "", "Writers": "", "URL": "https://www.telegraph.co.uk/opinion/2021/06/17/no-illusions-us-russia/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}