{"Type": "", "Time": "2021-06-17", "Headline": "The delta variant adds a speed bump to the covid-19 pandemic escape route - The Washington Post", "Text": "You’re reading an excerpt from the Today’s WorldView newsletter. Sign up to get the rest, including news from around the globe, interesting ideas and opinions to know, sent to your inbox every weekday.The coronavirus has the habit of upending the best-laid plans. And right now, the delta variant, the fast-spreading version of the virus first detected in India last year, is changing the rules of the game as the world tries to exit the pandemic.In Britain this week, Prime Minister Boris Johnson, fresh off the world stage at his Group of Seven summit, announced that a long-planned final lifting of all coronavirus restrictions in England on June 21 would be delayed by four weeks because of the fast-spreading variant, which now makes up an estimated 90 percent of new cases in Britain.“We know the remorseless logic of exponential growth,” said Johnson, who pointed to rising case numbers, adding that pushing back the full reopening of the country until July 19 would save thousands of lives.There was no greater evidence of that remorseless logic than just a few weeks earlier, when India experienced a devastating surge as the delta variant spread widely. Although new daily cases in India have fallen from their peak — a record-breaking roughly 400,000 a day in early May — they still remain alarmingly high, with around 62,000 new daily cases reported on Wednesday.Speaking at an online briefing Wednesday, Maria Van Kerkhove, the World Health Organization’s covid-19 technical lead, said that the delta variant had been detected in more than 80 countries around the world and that public health experts are keeping tabs on potential additional mutations to it.In the United States, where officials said last week that the delta variant accounts for around 6 percent of new cases, the Centers for Disease Control and Prevention has added delta to its list of “variants of concern.”The variant may not yet upend U.S. reopening plans, but combined with the slower than expected pace of vaccinations in recent weeks, some experts are urging caution.“If you’re living in a part of the country where there’s a low degree of vaccination or you yourself are not vaccinated, you’re clearly vulnerable because this is basically covid-19 on steroids,” Andy Slavitt, a former senior adviser on the coronavirus response for the Biden administration, told The Washington Post’s Yasmeen Abutaleb.The big problem is that the coronavirus has spread so far and wide that it has plenty of opportunity to mutate. The WHO has tracked more than 50 different strains. Though most are not considered of extra concern, four have been labeled as being of particular concern, one of which is B.1.617.2 — the scientific name of the delta variant.Since it was first detected in India last October, researchers have studied delta closely. They soon discovered that it has two mutations on the spike protein that help the coronavirus latch onto healthy cells. These mutations have helped make the variant more infectious.Delta is 60 percent more infectious than alpha, a variant first detected in Britain, according to U.K. officials. There are also some studies that suggest it causes greater rates of hospitalization, though the evidence there is still limited.The good news is that vaccinations still work well in protecting people who are fully vaccinated against the delta variant.The U.K. studies show that both the Pfizer-BioNTech and Oxford-AstraZeneca vaccines are highly effective at protecting against symptomatic disease when the full two-dose regime is administered (with efficacy rates of 88 percent and 60 percent, respectively). However, the efficacy of both vaccines drops to 33 percent if only one dose is administered.This is one reason governments are now pushing to ensure that people receive both doses. In Britain, where the government had previously favored delaying the second dose, residents are being encouraged to complete their immunizations.The U.K. is already seeing some results: Britain has now fully immunized roughly 45 percent of its population, slightly ahead of the United States.Although the delta variant emerged via natural processes, man-made factors have aided its spread. In Britain, the focus on prioritizing first doses may have come back to bite the country. Many critics of the government also say that restrictions on travel from India were put in place too late because of political concerns.In India itself, the wide spread of the variant this spring may have been helped by a combination of loosened government restrictions and a slow vaccine rollout (even now, India has fully vaccinated only 3.5 percent of its population, in part due to significant global supply problems).The delta variant has put a speed bump in the world’s path out of the pandemic. And Britain may not be the first country to take its foot off the accelerator of reopening and instead move to speed up vaccinations in the hope of outpacing it.But there will also have to be a broader debate about how to not just mitigate the delta variant’s short-term spread within national borders, but how to tamp down the global spread of the virus and stop even worse variants from proliferating in the first place.Cases are rising in many parts of the world. Across Africa, there has been a 44 percent increase in the number of weekly cases, WHO officials said Wednesday. The continent had received less than 2 percent of the world’s vaccine supply by May, according to the United Nations.Though wealthy nations pledged at the G-7 to do more to share doses, few experts believe that is enough to end the gap — and that shortfall runs the risk of creating even nastier variants than delta.As the WHO’s Van Kerkhove said Wednesday: “We don’t want to be in a situation where the virus changes enough that we go back to square one. This is why we need to prevent as many infections as we can right now.”Coronavirus maps: Cases and deaths in the U.S. | Cases and deaths worldwideVaccines: Younger teens | Tracker by state | Guidance for vaccinated people | How long does immunity last? | County-level vaccine dataWhat you need to know: Variants | Symptoms guide | Masks FAQ | Your life at home | Personal finance guide | Follow all of our coverage and sign up for our free newsletterGot a pandemic question? We answer one every day in our coronavirus newsletterAre you still deciding whether you’ll get a covid-19 vaccine? Let us know. The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/world/2021/06/17/delta-variant-global-concern/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}