{"Type": "", "Time": "2021-06-17", "Headline": "Xi Jinping Picks Top Lieutenant to Lead China’s Chip Battle Against U.S.", "Text": "(Bloomberg) -- Chinese President Xi Jinping is renewing his years-long push to achieve technology self-sufficiency by tapping a top deputy to shepherd a key initiative aimed at helping domestic chipmakers overcome U.S. sanctions.Liu He, Xi’s economic czar whose sprawling portfolio spans trade to finance and technology, has been tapped to spearhead the development of so-called third-generation chip development and capabilities and is leading the formulation of a series of financial and policy supports for the technology, according to people with knowledge of the matter.It’s a nascent field that relies on newer materials and gear beyond traditional silicon and is currently an arena where no company or nation yet dominates, offering Beijing one of its best chances to sidestep the hurdles slapped on its chipmaking industry by the U.S. and its allies. The sanctions, which emerged during Donald Trump’s presidency, have already smothered Huawei Technologies Co.’s smartphone business and will impede longer-term efforts by chipmakers from Huawei’s HiSilicon to Semiconductor Manufacturing International Corp. to migrate toward more advanced wafer fabrication technologies, threatening China’s technological ambitions.“China is the world’s largest user of chips, so supply chain security is of high priority,” said Gu Wenjun, chief analyst at research firm ICwise. “It’s not possible for any country to control the entire supply chain, but a country’s effort is definitely stronger than a single company.”The involvement of one of Xi’s most-trusted lieutenants in China’s chip efforts highlights the importance accorded by Beijing to the initiative, which is gaining urgency as rivals from the U.S. to Japan and South Korea scramble to shore up their own industries. The Chinese president has long called upon his Harvard-educated adviser to tackle matters of top national priority, making him the chief representative in trade negotiations with the U.S. as well as chairman of the Financial Stability and Development Committee, where Liu leads the charge to curb risks in the nation’s $5-trillion-plus financial sector.In May, Liu spearheaded a meeting of the technology task force that discussed ways to grow next-generation semiconductor technologies, according to a government statement. The 69-year-old vice premier, who has led the country’s technology reform task force since 2018, is also overseeing projects that could lead to breakthroughs in traditional chipmaking, including the development of China’s own chip design software and extreme ultraviolet lithography machines, one of the people said, asking not to be identified as they weren’t authorized to speak to media.The State Council and the Ministry of Industry and Information Technology didn’t respond to faxed requests for comment.During trade negotiations with the Trump administration, Liu emerged as one of the most visible advocates of Beijing’s agenda. He’s known Xi since childhood -- both are sons of veteran Communist Party leaders and were among masses of young people dispatched to work in impoverished rural areas during the Cultural Revolution. Now, Liu is leading the charge to reform the tech sector, which was identified in China’s latest five-year economic plan as a key strategic area in which the “whole nation system” should be used to mobilize any necessary resources.First introduced under Mao Zedong to help the then-fledgling Communist China industrialize, the approach was crucial to helping Beijing attain a number of top national priorities, from developing its first atomic bomb in the early 1960s to achieving Olympic sporting success. After that it was largely set aside as officials shifted to focus on economic growth. But following a series of U.S. sanctions that exposed the vulnerabilities of China’s chip capabilities, Xi is once again reactivating the mechanism to achieve breakthroughs in advanced chip development and manufacturing.About a trillion dollars of government funding have been set aside under the technology initiative, part of which will be used by central and local governments to jointly invest in a series of third-generation chip projects, according to people with knowledge of the matter. Top chipmakers and research institutes have submitted proposals to the ministries of science and information technology, all vying for a place in the national program and a share of the financing. The Ministry of Science and Technology is slated to inject 400 million yuan ($62 million) into some key “strategic electronics materials” including third-generation chips, according to a government document.Even moonshot chip programs are in line for government funding. The state-backed National Natural Science Foundation of China has pledged financial support for dozens of exploratory research programs, ranging from ultra-low power consumption to the development of a flexible chip that can collect and transmit nerve signals, as Beijing seeks to overcome “computing bottlenecks” when Moore’s Law -- the industry standard for predicting the pace of chip improvements -- finally stops working.Several subsidiaries of China Electronics Technology Group Corp. and China Railway Construction Corp. -- organizations already sanctioned by the U.S. -- are among the state-backed firms backing the effort, one of the people said. Another government-linked giant, China Electronics Corp., is one of the leaders in third-generation chip development, thanks to its investment in smaller firms including CEC Semiconductor Co. Using its own in-house technology, CEC Semiconductor makes silicone carbide-based power devices that can work at 200 degrees Celsius (360 degrees Fahrenheit) for a number of key industries from telecommunications to electric cars -- reducing China’s reliance on overseas suppliers such as Infineon Technologies AG, Rohm Co. and Cree Inc.Shares of chipmakers climbed, with SMIC rallying more than 8% in Shanghai, set for its biggest one-day gain since October. Shares of National Silicon Industry Group Co., Will Semiconductor Co. and Maxscend Microelectronics Co. also advanced. Sanan Optoelectronics Co. and Wingtech Technology Co. -- among firms seen as potential beneficiaries of China’s third-generation chip effort -- gained 10% and 8%, respectively.The task of coordinating that sprawling program now falls to Liu, who has to keep track of the relevant resources and drive the national strategy to help China achieve chip independence.“For our country, technology and innovation is not just a matter of growth,” Liu told a three-story auditorium packed with China’s top scientists in a separate meeting in May. “It’s also a matter of survival.”Read more: Biden Needs More Than $52 Billion to Counter China in ChipsXi is counting on his lieutenant to help China fend off growing threats from the U.S., which is seeking to take back chip industry supremacy. Under the Trump administration, sanctions were slapped on Chinese giants from Huawei to SMIC, cutting off their access to American technology and equipment crucial to designing and making advanced logic chips. President Joe Biden has also laid out a $52 billion plan to bolster domestic chip manufacturing, while calling on allies to join export controls aimed at curbing Beijing’s drive toward technology self-sufficiency.Rival powerhouse nations like South Korea and leading corporations such as Taiwan Semiconductor Manufacturing Co. have also responded with their own spending plans, fueling the race to take the lead in the sector.Read more: China Revs Up Grand Chip Ambitions to Counter U.S. BlacklistingsWith traditional chipmaking facing a series of challenges from technology development to heavy capital investment, third-generation chips -- which use compounds such as gallium nitride and silicon carbide to significantly improve the performance of semiconductors that power a wide range of industries and products -- may offer China its best chance to overcome rivals, senior academic Mao Junfa told an industry event in Nanjing earlier this month.“China couldn’t buy chips, even with cash in hand,” he said, referring to Washington’s sanctions on Chinese tech companies including Huawei. “The compound chip technologies could help China surpass rivals in the post-Moore’s Law era.”(Update with share performance of chipmakers in 13th paragraph.)More stories like this are available on bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2021 Bloomberg L.P.Related QuotesNadella, who took over as CEO in 2014 from Steve Ballmer, has been instrumental in scaling up its business including billion-dollar acquisitions like LinkedIn, Nuance Communications and ZeniMax.  The company said Thompson, who took over as chairman from the software giant's co-founder Bill Gates in 2014, will serve as lead independent director.World Bank said it could not assist El Salvador’s bitcoin implementation due to the environmental impact of bitcoin mining, and transparency drawbacks.(Bloomberg) -- FWD, the acquisitive Asian insurer backed by billionaire Richard Li, has filed confidentially for a U.S. initial public offering, moving ahead with preparations for a long-awaited listing.The holding company of FWD Ltd. and FWD Group Ltd. has confidentially submitted a draft registration with the U.S. Securities and Exchange Commission for the planned share sale, according to a statement on Thursday. The statement, which confirms an earlier Bloomberg News report, didn’t specify thWASHINGTON (Reuters) -The U.S. Justice Department filed a lawsuit on Wednesday aimed at stopping insurance broker Aon's $30 billion acquisition of Willis Towers Watson because it would reduce competition and could lead to higher prices.  The deal would combine the second and third largest of the \"Big Three\" global insurance brokers, the department said.  The third is Marsh McLennan.FA CENTER  Lumber prices have experienced one of their biggest and quickest plunges in history— with the spot futures contract dropping more than $670, or 40%, in just 25 trading sessions. It’s human nature to try to find meaning in this, since the alternative is to accept that price changes this momentous are nothing more than merely random fluctuations.Center for European Policy Analysis President and CEO Alina Polyakova, joined Yahoo Finance Live to break down Biden's meetings with the G-7 leaders.&nbsp;(Bloomberg) -- China is resorting to increasingly forceful measures to contain risks to the financial system, in moves that threaten to undermine President Xi Jinping’s pledge to give markets greater freedom.Authorities have in recent weeks ordered state firms to curb their overseas commodities exposure, forced domestic banks to hold more foreign currencies, considered a cap on thermal coal prices, censored searches for crypto exchanges and effectively banned brokers from publishing bullish equiFed Chairman Jerome Powell downplayed \"dot plots\" showing two rate hikes by the end of 2023.There's one group of borrowers that can count themselves as 'lucky' during periods of inflation.The money transfer business has opted for a direct listing with dual class share structure and a scheme to let customers become shareholders.Which stocks are analysts the most bullish on? Stocks with no ‘hold’ or ‘sell’ ratings - and a pure “Strong Buy” analyst consensus to boot. Using TipRanks database, we set out to pinpoint 3 stocks that command the unanimous support of the Street. Not to mention each ticker offers pretty serious upside potential. Let's take a closer look. iMedia Brands (IMBI) Let’s start in the digital world, the virtual universe that has wrought such enormous changes to every aspect of our lives in just the lastIn this article, we discuss the top Chinese companies on NASDAQ. If you want to skip our detailed analysis of these companies, go directly to the Top 5 Chinese Companies on NASDAQ. Chinese companies have taken the American stock market by storm in recent years as Beijing gradually opens up to investments from the outside […]GENEVA — President Joe Biden and Russian President Vladimir Putin have agreed to begin “working-level” discussions in a bid to strike a long-term bargain before the only major arms control on the books expires in 2026.Biotech stocks are surging in June on a raft of upbeat news from Biogen. It's a turnaround from a spring drubbing.BEIJING (Reuters) -ByteDance founder Zhang Yiming told staff on Thursday that he's already shifting away from chief executive's daily responsibilities and his work pace is less intense, according to two people who attended the meeting.  In May, Zhang unexpectedly announced that he will step down as CEO of the TikTok owner amid Chinese' regulators' tightened scrutiny of the country's biggest technology firms.  Zhang told staff he is currently studying other companies' organizational structures and managing styles, and doing research on the education industry.President Biden and Russian President Vladimir Putin plowed through a list of disputes during their Wednesday summit in Geneva, including cybersecurity and human rights. Nancy Cordes has the latest.China's market regulator has begun an antitrust probe into Didi Chuxing, three people with knowledge of the matter said, just as the ride-hailing giant is pushing ahead with what could be the largest initial public offering in the United States this year.  The probe, reported here for the first time, is the latest in a sweeping crackdown on China's so-called \"platform\" companies, including Alibaba Group Holding Ltd and Tencent Holdings Ltd.  China's market regulator, the State Administration for Market Regulation (SAMR), is investigating whether Didi used any competitive practices that squeezed out smaller rivals unfairly, two of the three sources said.Retirement planning is a multistep process that evolves over time.  To have a comfortable, secure—and fun—retirement, you need to build the financial cushion that will fund it all.  Planning for retirement starts with thinking about your retirement goals and how long you have to meet them.Worried about inflation, potential tapering, stagflation, speedy growth and strong earnings, and what all that might do to stocks? Calm down, says Credit Suisse's chief U.S. equity strategist.GM said it will report stronger than expected first-half earnings and will boost its investment in developing more EVs and building battery plants.", "Section": "", "Writers": "", "URL": "https://finance.yahoo.com/news/xi-jinping-picks-top-lieutenant-061713211.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}