{"Type": "", "Time": "2021-06-17", "Headline": "Shell and JTC plan solar farm the size of 112 football fields on Semakau Island, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A solar farm the size of 112 football fields, one of Singapore's largest yet, is being planned on Semakau Island.If completed, it will be more than twice the size of the Tengeh Reservoir solar farm announced earlier this year, and will generate more energy. With an intended capacity of 72 megawatt-peak (MWp), the planned farm on Semakau, which is one of the Southern Islands, will produce enough energy to power up to 17,500 households.The offshore farm is still being conceptualised, with Shell and government agency JTC Corporation signing a non-binding memorandum of understanding for it on Thursday (June 17).The Energy Market Authority (EMA) and the National Environment Agency (NEA) are supporting the project, which could bring Singapore closer to its target of producing enough solar energy to power 260,000 households by 2025.\"This multi-agency-corporate partnership is a great showcase of the creativity and collaboration that are vital to success in energy transition,\" said Ms Aw Kah Peng, chairman of Shell Companies in Singapore, at the signing ceremony. \"Shell has a significant carbon footprint in Singapore... (and) you can count on Shell to want to make this work.\"Semakau is Singapore's only remaining operational landfill, and the project will have to coexist with this primary function.With limited connectivity and infrastructure on the island, there will be challenges the stakeholders have to overcome. It is the first time such a large-scale solar project is being explored in such a setting.For now, most of Singapore's solar projects are smaller ones on rooftops - at more than 5,000 HDB blocks - or vacant industrial land. More recently, others have been developed as floating projects, where solar panels are installed on water bodies like reservoirs.An offshore floating project in the Johor Strait has a capacity of about 5MWp, while the capacity at Tengeh Reservoir is 60MWp.Shell, JTC, EMA and NEA said the Semakau Island farm will help to reduce carbon dioxide emissions by 37,000 tonnes a year. Its location, about 2km from Shell's Pulau Bukom energy and chemicals park, will also make it easier to integrate this renewable source of energy into its operations.In the long term, Shell hopes to pivot its Bukom park from its current focus on crude-oil and fuel-based products towards new, low-carbon value chains. It has pledged to cut its carbon dioxide emissions in Singapore by about a third within a decade, and be a net-zero emissions energy business by 2050, as the climate crisis becomes more urgent.\n\n(From left) EMA CEO Ngiam Shih Chun, JTC CEO Tan Boon Khai, Shell Companies in Singapore chairman Aw Kah Peng and NEA deputy CEO of environmental protection Ram Bhaskar at the signing ceremony. PHOTO: JTC\nJTC chief executive Tan Boon Khai said the partners were already talking about this project two years ago, and it is an example of JTC's efforts to maximise land use to increase renewable energy generation.\"This signifies the strong collaboration that public service and government agencies have with many important private stakeholders, but more importantly, it pushes the boundaries of where we can go in land-scarce Singapore,\" he said.\"It's quite amazing when you look at how small Singapore is, that not only are we looking at solar, but also other green and sustainable solutions.\"Last year, solar photovoltaic (PV) systems made up only 0.56 per cent of the total electricity generated nationwide. The Government wants solar energy capacity to reach 2 per cent by 2025.Already, the capacity of solar PV systems that have been contributing to the national grid has grown from 60MWp in 2015 to around 428MWp at the end of last year.An even larger project that is still being explored is the Economic Development Board's proposed 100MWp floating solar system for private sector consumption. The agency had launched a request for information in 2018, beginning with studies for it at Kranji Reservoir.JTC and Shell will jointly conduct a request for information exercise for this project on June 24 to source solutions from the market.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/shell-and-jtc-plan-solar-farm-the-size-of-112-football-fields-on-semakau-island", "Source": "google"}