{"Type": "", "Time": "2021-06-17", "Headline": "Spacesuit problems prevent astronauts from completing job - The Washington Post", "Text": "CAPE CANAVERAL, Fla. — Spacesuit problems prevented astronauts from completing the installation Wednesday of powerful, new solar panels outside the International Space Station.NASA astronaut Shane Kimbrough encountered a pair of spacesuit issues midway through the seven-hour spacewalk, forcing him to temporarily retreat back into the airlock to reset his equipment. The interruption put Kimbrough and French astronaut Thomas Pesquet an hour behind, then they had trouble trying to unfold the solar panel’s booms before time finally ran out.The two are supposed to venture back out Sunday. But it’s unclear whether that will be delayed, or whether the astronauts will wrap up work on the first solar panel or get started on a second one.NASA wants to reenergize the aging space station as demand to visit grows. But there’s no urgency to do so, said Mission Control commentator Rob Navias, with the old solar panels providing plenty of power for now. They’ll continue to operate in a degraded state, even after the new ones are up and running.Mission Control stressed that Kimbrough was safe the entire time, despite problems with his suit’s display control panel and a fleeting pressure spike in the cooling system. His control panel came back on, and Mission Control continued to monitor his suit’s cooling system.“We just want to be super safe here,” Mission Control radioed.It was the first of a series of spacewalks to equip the aging orbital outpost with six smaller but stronger solar wings. The electrical boost is needed to accommodate the paying passengers expected to drop by, beginning with a Russian film crew this fall.NASA put extra safety precautions in place as Kimbrough and Pesquet worked on the station’s primary power grid, to avoid an electrical shock. The duo conducted the most hazardous parts of the spacewalk on the nighttime side of Earth, to prevent the station’s old solar panels from soaking up sunlight and generating power. Metal surfaces on their spacesuits were covered to avoid any contact.Launched by SpaceX earlier this month, the first of these new solar panels will operate alongside the station’s oldest electricity-producing wings, in continuous operation for more than 20 years.The astronauts had to lug the bundled solar wing —10 feet long and 4 feet wide (3 meters long by 1 meter wide) — to the work site on the far left end of the station. They managed to bolt it into place, but could not unfold the booms because of a problem in the mounting bracket.Once properly installed, the solar panel is designed to roll out like a red carpet 63 feet (19 meters) in length.NASA wants to keep the space station churning out science research through this decade, and space tourists will further tax the power system. A Russian movie director and actress are due to visit in October for filming, followed by wealthy entrepreneurs launching from Kazakhstan and Cape Canaveral as part of a push to open up the private space market.___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/health/spacewalking-astronauts-boosting-stations-solar-power/2021/06/16/329227fa-ce9e-11eb-a224-bd59bd22197c_story.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}