{"Type": "", "Time": "2021-06-17", "Headline": "S'poreans now better educated across age, ethnic groups, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Residents in Singapore across different age and ethnic groups have attained higher educational qualifications over the past decade, according to a population census released yesterday.The first of two reports issued by the Department of Statistics (DOS) also revealed that in education, female residents have made more significant progress.Disparities remain between ethnicities, particularly in obtaining university degrees.The census - conducted every 10 years - surveyed 150,000 households last year for its latest iteration. It focuses mainly on the resident population, which comprises citizens and permanent residents.Singapore's total population rose from 5.077 million in 2010 to 5.686 million last year.For residents aged 25 and above, close to six in 10 had post-secondary, diploma and professional qualifications or university-level credentials - up from less than half the population in 2010.The largest increase here was in the proportion of university graduates, which jumped 9 percentage points from 23.7 per cent in 2010 to 33 per cent last year.These findings include residents upgrading themselves through part-time courses.All age groups registered an increased share of residents with at least post-secondary qualifications. Last year, this proportion was nine out of 10 among those aged 25 to 34, and more than eight in 10 for the 35-to 44-year-olds.But over the decade, it was those aged 45 to 54 who saw the most significant improvement in educational profile. In 2010, the largest proportion of this group - 37.4 per cent - were those with qualifications below secondary level. Last year, this had changed to university graduates (35.5 per cent).Over the years, female residents have also narrowed the education gap with males.Among women aged 55 and above last year, 22.8 per cent had post-secondary or higher qualifications, compared with 34 per cent for men.For 35-to 44-year-olds, the corresponding figures were 81.8 per cent for women and 84.2 per cent for men.The proportion for younger women, aged 25 to 34, was 90.2 per cent, marginally higher than for their male counterparts (90 per cent).DOS noted, however, that in this age group, some men could still be pursuing higher education, after completing their national service.The three major ethnic groups also saw positive changes, with the proportion of university graduates increasing across the board last year for the Chinese (34.7 per cent), Malays (10.8 per cent) and Indians (41.3 per cent).For the Chinese, this education profile registered the largest jump, up from 23.2 per cent in 2010.The Malays and Indians were most improved in the area of below-secondary qualifications, with a drop from 41.4 per cent to 28.9 per cent for the Malays and from 23.8 per cent to 18.3 per cent for the Indians.Census data also showed that business and administration continued to be the most common university field of study, attracting 31.2 per cent of male graduates and 39 per cent of females last year.For men, the next largest group (27.2 per cent) majored in engineering sciences, while the corresponding group for women (14.9 per cent) opted for the humanities and social sciences.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/sporeans-now-better-educated-across-age-ethnic-groups", "Source": "google"}