{"Type": "", "Time": "2021-06-17", "Headline": "Kremlin pleased with Putin-Biden summit, hails pledge to never wage nuclear war , World News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.MOSCOW (REUTERS) – The Kremlin said on Thursday (June 17) it was pleased with what it called a positive summit between Russian President Vladimir Putin and his US counterpart Joe Biden, singling out a joint statement that reiterated the need to avoid nuclear war as significant.Biden and Putin agreed to launch arms control and cyber-security talks at a Geneva summit on Wednesday, recording small gains and big differences at a meeting which they both described as pragmatic rather than friendly.They also agreed to return their respective ambassadors to their posts after a rupture in ties earlier this year.Putin’s spokesman said on Thursday that the summit had also laid the ground for what he described as really tough technical talks on a potential prisoner swap between Russia and the United States.Dmitry Peskov, the spokesman, said the lists of prisoners to be potentially exchanged still needed to be sorted out but was much wider than those publicly discussed.He said negotiations would obviously have to be conducted quietly and in secret.Peskov, who attended the summit himself, said it had broadly unfolded as Russia had expected and that the meeting, from a Kremlin viewpoint, had gone smoothly. “It went off rather well, with a plus sign,” Dmitry Peskov told the Ekho Moskvy radio station.  “It was productive in the sense that the two leaders had the chance to directly explain their positions, more or less understand where they can cooperate, and where right now they can’t cooperate because of categorical differences in their views. That also happened and that’s also a plus,” he said. Peskov singled out a joint statement that reaffirmed the two countries’ belief that a nuclear war cannot be won and must never be fought.“It may be a short statement but...it reflects the special responsibility of our two countries not only before our own peoples but, as pretentious as it may sound, before the whole world,” said Peskov.Russia’s deputy foreign minister said separately that Moscow expected arms control talks with the United States, that were agreed at the summit, to start within weeks.He said Moscow felt reassured by the joint statement on the need to never wage nuclear war and to start arms control talks.“The confirmation of the formula that there can be no winner in a nuclear war and that one must not be waged is a significant achievement,” Ryabkov told the Kommersant daily newspaper. “Frankly speaking, we had growing concerns in recent years about Washington’s readiness to support this. This is not a figure of speech or lofty words but simply a reflection of reality.”Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/moscow-hails-putin-bidens-commitment-to-arms-control", "Source": "google"}