{"Type": "", "Time": "2021-06-17", "Headline": "Xi Jinping Picks Top Lieutenant to Lead China’s Chip Battle Against U.S.", "Text": "412,000 Americans filed, more than expected 360,000(Bloomberg) -- Chinese President Xi Jinping is renewing his years-long push to achieve technology self-sufficiency by tapping a top deputy to shepherd a key initiative aimed at helping domestic chipmakers overcome U.S. sanctions.Liu He, Xi’s economic czar whose sprawling portfolio spans trade to finance and technology, has been tapped to spearhead the development of so-called third-generation chip development and capabilities and is leading the formulation of a series of financial and policy supports for the technology, according to people with knowledge of the matter.It’s a nascent field that relies on newer materials and gear beyond traditional silicon and is currently an arena where no company or nation yet dominates, offering Beijing one of its best chances to sidestep the hurdles slapped on its chipmaking industry by the U.S. and its allies. The sanctions, which emerged during Donald Trump’s presidency, have already smothered Huawei Technologies Co.’s smartphone business and will impede longer-term efforts by chipmakers from Huawei’s HiSilicon to Semiconductor Manufacturing International Corp. to migrate toward more advanced wafer fabrication technologies, threatening China’s technological ambitions.“China is the world’s largest user of chips, so supply chain security is of high priority,” said Gu Wenjun, chief analyst at research firm ICwise. “It’s not possible for any country to control the entire supply chain, but a country’s effort is definitely stronger than a single company.”The involvement of one of Xi’s most-trusted lieutenants in China’s chip efforts highlights the importance accorded by Beijing to the initiative, which is gaining urgency as rivals from the U.S. to Japan and South Korea scramble to shore up their own industries. The Chinese president has long called upon his Harvard-educated adviser to tackle matters of top national priority, making him the chief representative in trade negotiations with the U.S. as well as chairman of the Financial Stability and Development Committee, where Liu leads the charge to curb risks in the nation’s $5-trillion-plus financial sector.In May, Liu spearheaded a meeting of the technology task force that discussed ways to grow next-generation semiconductor technologies, according to a government statement. The 69-year-old vice premier, who has led the country’s technology reform task force since 2018, is also overseeing projects that could lead to breakthroughs in traditional chipmaking, including the development of China’s own chip design software and extreme ultraviolet lithography machines, one of the people said, asking not to be identified as they weren’t authorized to speak to media.The State Council and the Ministry of Industry and Information Technology didn’t respond to faxed requests for comment.During trade negotiations with the Trump administration, Liu emerged as one of the most visible advocates of Beijing’s agenda. He’s known Xi since childhood -- both are sons of veteran Communist Party leaders and were among masses of young people dispatched to work in impoverished rural areas during the Cultural Revolution. Now, Liu is leading the charge to reform the tech sector, which was identified in China’s latest five-year economic plan as a key strategic area in which the “whole nation system” should be used to mobilize any necessary resources.First introduced under Mao Zedong to help the then-fledgling Communist China industrialize, the approach was crucial to helping Beijing attain a number of top national priorities, from developing its first atomic bomb in the early 1960s to achieving Olympic sporting success. After that it was largely set aside as officials shifted to focus on economic growth. But following a series of U.S. sanctions that exposed the vulnerabilities of China’s chip capabilities, Xi is once again reactivating the mechanism to achieve breakthroughs in advanced chip development and manufacturing.About a trillion dollars of government funding have been set aside under the technology initiative, part of which will be used by central and local governments to jointly invest in a series of third-generation chip projects, according to people with knowledge of the matter. Top chipmakers and research institutes have submitted proposals to the ministries of science and information technology, all vying for a place in the national program and a share of the financing. The Ministry of Science and Technology is slated to inject 400 million yuan ($62 million) into some key “strategic electronics materials” including third-generation chips, according to a government document.Even moonshot chip programs are in line for government funding. The state-backed National Natural Science Foundation of China has pledged financial support for dozens of exploratory research programs, ranging from ultra-low power consumption to the development of a flexible chip that can collect and transmit nerve signals, as Beijing seeks to overcome “computing bottlenecks” when Moore’s Law -- the industry standard for predicting the pace of chip improvements -- finally stops working.Several subsidiaries of China Electronics Technology Group Corp. and China Railway Construction Corp. -- organizations already sanctioned by the U.S. -- are among the state-backed firms backing the effort, one of the people said. Another government-linked giant, China Electronics Corp., is one of the leaders in third-generation chip development, thanks to its investment in smaller firms including CEC Semiconductor Co. Using its own in-house technology, CEC Semiconductor makes silicone carbide-based power devices that can work at 200 degrees Celsius (360 degrees Fahrenheit) for a number of key industries from telecommunications to electric cars -- reducing China’s reliance on overseas suppliers such as Infineon Technologies AG, Rohm Co. and Cree Inc.Shares of chipmakers climbed, with SMIC rallying more than 8% in Shanghai, set for its biggest one-day gain since October. Shares of National Silicon Industry Group Co., Will Semiconductor Co. and Maxscend Microelectronics Co. also advanced. Sanan Optoelectronics Co. and Wingtech Technology Co. -- among firms seen as potential beneficiaries of China’s third-generation chip effort -- gained 10% and 8%, respectively.The task of coordinating that sprawling program now falls to Liu, who has to keep track of the relevant resources and drive the national strategy to help China achieve chip independence.“For our country, technology and innovation is not just a matter of growth,” Liu told a three-story auditorium packed with China’s top scientists in a separate meeting in May. “It’s also a matter of survival.”Read more: Biden Needs More Than $52 Billion to Counter China in ChipsXi is counting on his lieutenant to help China fend off growing threats from the U.S., which is seeking to take back chip industry supremacy. Under the Trump administration, sanctions were slapped on Chinese giants from Huawei to SMIC, cutting off their access to American technology and equipment crucial to designing and making advanced logic chips. President Joe Biden has also laid out a $52 billion plan to bolster domestic chip manufacturing, while calling on allies to join export controls aimed at curbing Beijing’s drive toward technology self-sufficiency.Rival powerhouse nations like South Korea and leading corporations such as Taiwan Semiconductor Manufacturing Co. have also responded with their own spending plans, fueling the race to take the lead in the sector.Read more: China Revs Up Grand Chip Ambitions to Counter U.S. BlacklistingsWith traditional chipmaking facing a series of challenges from technology development to heavy capital investment, third-generation chips -- which use compounds such as gallium nitride and silicon carbide to significantly improve the performance of semiconductors that power a wide range of industries and products -- may offer China its best chance to overcome rivals, senior academic Mao Junfa told an industry event in Nanjing earlier this month.“China couldn’t buy chips, even with cash in hand,” he said, referring to Washington’s sanctions on Chinese tech companies including Huawei. “The compound chip technologies could help China surpass rivals in the post-Moore’s Law era.”(Update with share performance of chipmakers in 13th paragraph.)More stories like this are available on bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2021 Bloomberg L.P.Related QuotesGeneral Motors plans to boost its cumulative investment in electric and autonomous vehicles to $35 billion from 2020-2025, a significant jump from a $27 billion target.Driving the news: GM said this morning that the initiative will include building two new battery cell manufacturing plants in addition to the two already under construction in Tennessee and Ohio.Get market news worthy of your time with Axios Markets. Subscribe for free.GM, without providing details, also said it's adding new commeWASHINGTON (Reuters) -The U.S. Justice Department filed a lawsuit on Wednesday aimed at stopping insurance broker Aon's $30 billion acquisition of Willis Towers Watson because it would reduce competition and could lead to higher prices.  The deal would combine the second and third largest of the \"Big Three\" global insurance brokers, the department said.  The third is Marsh McLennan.BEIJING (Reuters) -ByteDance founder Zhang Yiming told staff on Thursday he was already shifting away from a chief executive's daily responsibilities and his work pace was less intense, according to two people who attended the meeting.  In May, Zhang unexpectedly announced that he will step down as CEO of the TikTok owner amid Chinese' regulators' tightened scrutiny of the country's biggest technology firms.  Zhang told staff he was currently studying other companies' organizational structures and managing styles, and doing research on the education industry.The money transfer business has opted for a direct listing with dual class share structure and a scheme to let customers become shareholders.Southwest Airlines canceled nearly 300 flights Wednesday and delayed more than 500 a day after it was forced to temporarily halt operations over a computer glitch.  The Federal Aviation Administration said Tuesday it had issued a temporary nationwide groundstop at the request of Southwest Airlines to resolve a computer reservation issue.  \"While our technology issues from Tuesday have been resolved, we are still experiencing a small number of cancellations and delays across our network as we continue working to resume normal operations,\" airline spokesman Dan Landson said.Onovughakpor “Onovu” Otitigbe is Black girl magic personified.  Not only did Otitigbe break Albany High School’s record as the first Black valedictorian in its 152-year history, but she is also on her way to Harvard University.(Bloomberg) -- The owner of coconut water company Vita Coco is planning to go public this year after investors rushed to back Oatly Inc.’s initial public offering, according to people with knowledge of the matter.All Market Inc., which also owns Runa energy drinks and water brand Ever & Ever, aims to list its shares in the U.S. as soon as the third quarter, the people said, asking not to be identified discussing private information. The company could be valued at more than $2 billion in an IPO,(Bloomberg) -- Alibaba Group Holding Ltd. was the victim of a months-long web-scraping operation by a marketing consultant that siphoned up sensitive data including usernames and phone numbers, according to a court case that wrapped in June.A central Chinese court ruled that an employee of a consultant that helps merchants on Alibaba’s Taobao online mall was guilty of dredging up more than a billion data items on Taobao users since 2019, using that to serve clients. The court imposed jail termsAn overpass collapse killed 26 and has put pressure on leading Mexican politicians and businessmen.U.S. homebuilding rebounded less than expected in May as very expensive lumber and shortages of other materials continued to constrain builders' ability to take advantage of an acute shortage of houses on the market.  Starts for the volatile multi-family segment rose 2.4% to a pace of 474,000 units.Gold prices dropped more than $50, a day after the Federal Reserve signaled faster and sooner interest rate increases. Watch this level, say analysts.General Motors Chief Executive Mary Barra faced questions from U.S. lawmakers on Wednesday on a workers’ vote at a company plant in Mexico and the company's support for emissions reductions.  Barra met with House of Representatives Speaker Nancy Pelosi and other senior Democrats on Capitol Hill, and touted the company's decision announced earlier in the day to boost spending on electric and autonomous vehicles to $35 billion through 2025.  \"We're committed to an all-EV future,\" Barra said in brief comments to Reuters after the meeting.Jobsite Glassdoor reveals its Employees’ Choice Awards honoring the top 100 CEOs in 2021.NASHVILLE, Tenn. — Southern Baptists agree that the Bible is divinely inspired and without error, that belief in Jesus is the only way to Heaven, that women may not serve as head pastors, and that true marriage is between one man and one woman. But fears of liberal drift are embedded almost as deeply in the denomination’s roots. This week at the Southern Baptist Convention’s first meeting in two years, establishment conservatives narrowly headed off an aggressive takeover attempt by an ascendantBy the end of Ronaldo's press conference, Coca-Cola's shares had already started falling.There's one group of borrowers that can count themselves as 'lucky' during periods of inflation.A fourth stimulus check and others would be put on autopilot, under proposals in Congress.It’s a relatively busy day on the economic calendar after impressive stats from NZ and Australia. Economic data from the Eurozone and the U.S will be in focus.Stock futures opened lower Wednesday evening as investors contemplated the Federal Reserve's latest monetary policy decision and updated projections, which signaled a quicker path to higher interest rates than previously anticipated. Contracts on the S&P 500, Dow and Nasdaq added to earlier losses.The number of Americans filing new claims for unemployment benefits increased last week for the first time in more than a month, but layoffs are easing amid a reopening economy and a shortage of people willing to work.  Initial claims for state unemployment benefits totaled a seasonally adjusted 412,000 for the week ended June 12, compared to 375,000 in the prior week, the Labor Department said on Thursday.  Generous government-funded unemployment benefits, including a $300 weekly check, have also been blamed, as well as a reluctance to return to work out of fear of contracting COVID-19 even though vaccines are widely accessible.", "Section": "", "Writers": "", "URL": "https://finance.yahoo.com/news/xi-jinping-picks-top-lieutenant-061713211.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}