{"Type": "", "Time": "2021-06-17", "Headline": "Delta Covid symptoms: Signs of hay fever - sore throat and headache - most common signs | Express.co.uk", "Text": "When you subscribe we will use the information you provide to send you these newsletters. Sometimes they'll include recommendations for other related newsletters or services we offer. Our Privacy Notice explains more about how we use your data, and your rights. You can unsubscribe at any time.The NHS pointed out the main symptoms of coronavirus: a high temperature, a new, continuous cough, and a loss or change to your sense of smell or taste. However, Professor Tim Spector says otherwise. As coronavirus has mutated, these \"classic\" signs of infection are less common. According to data collected from the Covid Symptom Study – a not-for-profit collaboration between health science company ZOE and researchers at King's College London – other signs of infection are more likely.\"Since the start of May, we have been looking at the top symptoms in the app users – and they are not the same as they were,\" said Professor Spector.As the Delta variant accounts for 90 percent of Covid cases in the UK, the loss of smell is no longer in the top 10 list of reported symptoms.Instead, sore throat, headache, and runny nose are now much more common – and happen to be signs of hay fever too.Symptoms of hay fever include:READ MORE: British scientists invent Covid alarm that can detect virus in 15 mins  \"This variant seems to be working slightly differently,\" Spector said.The professor compared the most common symptoms to a \"seasonal cold\", which may make people dismiss it completely.Younger people are likely to experience \"milder symptoms\", which may \"feel like a bad cold or some funny 'off' feeling\".If you're feeling a little under the weather, or slightly off, Professor Spector urges you to take a test.DON'T MISSNO PRIME MINISTER! Boris must NOT abandon Freedom Day JOHN LONGWORTH [COMMENT]Almost third of 42 Britons who have died from Delta variant had 2 jabs [ANALYSIS]Lockdown POLL: Boris set to delay lifting restrictions - do you agree? [POLL]If you're showing symptoms of Covid, the NHS advise you to self-isolate and to take a more accurate PCR test that is sent off to a laboratory.The React study – put together by Imperial College London – found additional symptoms linked to Covid, such as:The Centres for Disease Control and Prevention (CDC) have a wider array of Covid symptoms to be aware of.Other possible symptoms of Covid include:  The CDC stated it would \"continue to update this list\" as more is learned about the disease.People without Covid symptoms are encouraged to test weekly using a rapid flow test.These free NHS tests are available to order – from online or the pharmacy – to your home.The rapid flow test reveals if you've tested positive for Covid within half an hour.  The NHS encourage weekly rapid flow testing because \"one in three people with Covid do not have symptoms\".Being symptomless still means you can pass on the infection to others who may show signs of infection.The number of people falling severely ill because of Covid in the UK is decreasing as the number of vaccinations skyrocket.The number of deaths within 28 days of a positive Covid test has nosedived by 12.5 percent in the past seven days.This is encouraging news, showing that vaccinations can weaken the link between the number of Covid infections and deaths. See today's front and back pages, download the newspaper, order back issues and use the historic Daily Express newspaper archive.", "Section": "", "Writers": "", "URL": "https://www.express.co.uk/life-style/health/1450452/delta-covid-symptoms-sore-throat-headache-hay-fever", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}