{"Type": "", "Time": "2021-06-17", "Headline": "More S'poreans have no religious affiliation: Population census, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - While Singapore remains religiously diverse, more residents aged 15 years and over reported having no religious affiliation compared with 10 years ago.This increase cut across most types of educational qualifications as well as all age groups, and was more prevalent among younger and Chinese residents, according to the latest population census released on Wednesday (June 16).The proportion of those with no religious affiliation rose by three percentage points to 20 per cent in 2020.Chinese residents had a significantly larger proportion who identified as such (25.7 per cent) than Malays (0.4 per cent) and Indians (2.2 per cent).Among Singapore residents aged 15 years and above in 2020, 31.1 per cent identified themselves as Buddhists, 8.8 per cent as Taoists, 18.9 per cent as Christians, 15.6 per cent as Muslims and 5 per cent as Hindus.Over the past decade, the share of Christians and Muslims increased slightly while the share of Buddhists and Taoists decreased slightly.Among the Chinese, Buddhists remained the largest group at 40.4 per cent in 2020, despite a decrease from 43.0 per cent in 2010.Some 98.8 per cent of Malays were Muslims, a number relatively unchanged from 10 years ago.Hinduism remained the most common religion for Indians (57.3 per cent) in 2020, followed by Islam (23.4 per cent), Christianity (12.6 per cent) and Sikhism (3.4 per cent).Younger residents were more likely to have no religious affiliation, although the proportion of Singapore residents who identified as such rose across all age groups.In 2020, 24.2 per cent of residents aged 15 to 24 years reported having no religious affiliation, higher than the 15.2 per cent for residents aged 55 years and over.A larger proportion of older residents were Buddhists or Taoists compared with those in younger age groups.While Buddhists accounted for 35.1 per cent and Taoists accounted for 13.1 per cent of residents aged 55 years and over in 2020, the corresponding proportions were lower at 24.9 per cent and 4.9 per cent among residents aged 15 to 24 years.In contrast, a larger proportion of residents in younger age groups reported themselves as Muslims than those in the older age groups.The proportion of Christians was similar across all age groups.The proportion of residents without religious affiliation also increased across most types of educational qualifications.Among those with below-secondary qualifications, the proportion without religious affiliation increased from 9.9 per cent to 11.6 per cent.The proportion for those with university qualifications increased from 24.2 per cent to 27.8 per cent.The census - conducted every 10 years - surveyed 150,000 households in 2020 for its latest iteration. It focuses mainly on the resident population, which comprises citizens and permanent residents. Singapore's total population rose from 5.077 million in 2010 to 5.686 million in 2020.Note: The article has been updated for clarity.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/more-sporeans-have-no-religious-affiliation-population-census", "Source": "google"}