{"Type": "", "Time": "2021-06-17", "Headline": "'Call the police': Woman without mask on bus taunts SBS Transit staff, Singapore News - AsiaOne", "Text": "More than a year into the pandemic, some people in Singapore still refuse to abide by Covid-19 rules.On Monday (June 14) night, a woman made a scene aboard bus service 69 in Bedok as she refused to wear a face mask.A passenger told Shin Min Daily News that there were about 20 people on the bus at the time.\"I believe that the bus captain didn't notice that she wasn't wearing a mask when she boarded the bus.\"After he alerted him, the bus captain approached the woman to remind her to put a mask on, but she got into an argument with him.He then called for help from his colleagues at the Bedok bus interchange.According to the Chinese daily, a video clip showed the woman taunting the bus captain's colleague, spewing expletives and saying: \"Call 999, make a police report\".[[nid:502160]]The incident on the bus lasted about 15 minutes, causing many passengers to alight because their journeys were delayed.Moments later, the woman left and the bus captain continued to ply the route.This is the latest in a string of incidents where passengers got aggressive when they were asked to wear masks on public buses. Several of them threatened and even assaulted bus captains.Since last April, it is a must for commuters to wear a mask when taking public transport and those without one will be denied entry, the Land Transport Authority said.In May, a 39-year-old man was arrested for causing public nuisance and flouting safe distancing measures as he refused to wear a mask and tried to convince another passenger to take his mask off in a viral video.ALSO READ: 'It's my life': Passenger refuses to wear mask, quarrels with bus captainlamminlee@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/singapore/call-police-woman-without-mask-bus-taunts-sbs-transit-staff-bedok", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}