{"Type": "", "Time": "2021-06-17", "Headline": "Can you mix and match COVID-19 vaccines? Canada AstraZeneca Germany Covid France | The Independent", "Text": "Find your bookmarks in your Independent Premium section, under my profileCan you mix and match two-dose COVID-19 vaccines?It's likely safe and effective, but researchers are still gathering data to be sure.The authorized COVID-19 shots around the world are all designed to stimulate your immune system to produce virus-fighting antibodies, though the way they do so varies, noted Dr. Kate O’Brien, director of the World Health Organization’s vaccine unit.“Based on the basic principles of how vaccines work, we do think that the mix-and-match regimens are going to work,” she said. Scientists at Oxford University in the United Kingdom are testing combinations of the two-dose COVID-19 vaccines made by AstraZeneca Moderna Novavax and Pfizer-BioNTech. Smaller trials are also ongoing in Spain and Germany.“We really just need to get the evidence in each of these (vaccine) combinations,” O’Brien said.So far, limited data suggests an AstraZeneca shot followed by the Pfizer shot is safe and effective. The combination also appears to come with a slightly higher likelihood of temporary side effects like aches and chills.That might be because mixing and matching different types of vaccines can often produce a stronger immune response, said Lawrence Young, a virologist at the University of Warwick in the United Kingdom.In some places, health officials already suggest mixing in select circumstances.After the AstraZeneca vaccine was linked to extremely rare blood clots, many European countries including Germany, France and Spain recommended people who got it as a first dose get a Pfizer or Moderna shot as a second dose instead.In Britain and Canada, officials say people should aim to get the same vaccine for their second dose if possible. If they got AstraZeneca as their first shot, they're advised to get another vaccine only if they have a history of blood clots or other conditions that might put them at higher risk of clots.___The AP is answering your questions about the coronavirus in this series. Submit them at: FactCheck@AP.org. Read more here: Why do some people get side effects after COVID-19 vaccines?  Can COVID-19 vaccines affect my period?  How long does protection from COVID-19 vaccines last? Want to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.Log inNew to The Independent?Want an ad-free experience?Subscribe to Independent Premium.", "Section": "", "Writers": "", "URL": "https://www.independent.co.uk/news/can-you-mix-and-match-covid19-vaccines-covid-astrazeneca-united-kingdom-scientists-world-health-organization-b1867571.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}