{"Type": "", "Time": "2021-06-17", "Headline": "There's still no evidence of a Chinese lab leak. But here’s what's changed, scientists say.", "Text": "Alina Chan isn't saying the coronavirus definitely leaked from a lab in China. What she is saying is what more scientists have grown comfortable discussing publicly: There's no clear evidence either way.\"I know a lot of people want to have a smoking gun,\" said Chan, a postdoctoral associate at the Broad Institute of MIT and Harvard University who specializes in genetic engineering and has been vocal about the need to investigate the possibility of a lab leak. \"It's more like breadcrumbs everywhere, and they're not always leading in one direction. It's like the whole floor is covered in breadcrumbs.\"Chan was one of 18 scientists who published a letter in the journal Science last month calling for a more in-depth investigation into the virus's origin that takes into account theories about both natural occurrence and laboratory spillovers. The letter helped kick-start a new round of calls to investigate the \"lab leak hypothesis,\" including demands from President Joe Biden and several leading scientists.And while public discussion of a potential lab leak has shifted significantly in recent months, as more people pay attention to a theory that was originally promulgated by former President Donald Trump and his followers, the scientific evidence has remained unchanged, according to interviews with five virologists who have experience in microbiology, infectious disease ecology and viral evolution.The researchers offered near-uniform summations that few conclusions can be drawn based on the available scientific evidence, but they noted that the context and circumstances of the origin debate have changed, particularly as critics point out that China hasn't been fully transparent about the earliest days of the pandemic.The shift reflects how some scientists who previously avoided the topic or were quick to dismiss it are grappling with enduring uncertainties about the virus's origin, free from the politicization that clouded such discussions during the Trump administration.Chan said there had been trepidation among some scientists about publicly discussing the lab leak hypothesis for fear that their words could be misconstrued or used to support racist rhetoric about how the coronavirus emerged. Trump fueled accusations that the Wuhan Institute of Virology, a research lab in the city where the first Covid-19 cases were reported, was connected to the outbreak, and on numerous occasions he called the pathogen the \"Wuhan virus\" or \"kung flu.\"\"At the time, it was scarier to be associated with Trump and to become a tool for racists, so people didn't want to publicly call for an investigation into lab origins,\" she said.Now, more scientists are comfortable confronting the gamut of plausible theories — particularly given China's opacity about the topic — although many still caution that entertaining the idea of a lab leak requires clear scientific proof, which hasn't materialized.\"There has been no new evidence over the past 16 months that the virus had a lab origin,\" said Maciej Boni, an associate professor of biology at Penn State University, who specializes in tropical disease epidemiology and viral evolution.A number of theories about how the virus may have emerged have been thrown out. Most that remain fall under three possible scenarios:The virus evolved naturally before spilling over into humans from an infected animal.The virus evolved naturally, but an employee at the lab became infected from a sample and accidentally \"leaked\" it into the community.Scientists at the lab were manipulating virus samples and accidentally or intentionally released the pathogen.What makes the virus's origin a complicated matter is that the various threads can be difficult to reconcile. While most of the virologists who spoke to NBC News said the coronavirus probably evolved in nature, they agreed that it's reasonable to look into the possibility that it came from a lab.At the heart of those suspicions is the Wuhan Institute of Virology, a research facility founded in the 1950s that was the first in China to receive the highest level of biosafety clearance. The institute's lab has a biosafety level of 4 (known as BSL-4, the highest level), meaning it is equipped to study the world's highest-risk infectious agents and toxins, those that require the strictest biocontainment measures. It's that designation, and the lab's location in the city where the outbreak was first reported, that made the institute an early suspect.\"If we had a pandemic that was sourced near to a BSL-4 lab in the U.S., the first thing you would be asking is if they were working with that pathogen in that lab,\" said an expert on evolutionary genetics of infectious diseases, Andrew Read, a professor of biology at Penn State.Still, he cautioned that while a lab leak is plausible, that doesn't necessarily mean it's the most probable explanation.Boni said it's still more likely that the virus passed from an animal, such as a bat, into humans. He said his experiences conducting field epidemiology work on avian influenza in Vietnam from 2008 to 2016 showed how close contact with wildlife, such as in \"wet markets\" around the world where outdoor stalls sell meat, seafood and live animals for consumption, can create easy opportunities for pathogens to spill into human populations.\"Going back over the past 25 years of emerging viruses that have crossed species boundaries from animals to humans, the most common route is something like a wet market or farm or some other form of human and animal contact,\" he said. \"These are far more common than lab accidents.\"The first cluster of Covid-19 infections was traced to the Huanan Seafood Market in Wuhan, leading to early speculation that it may have been where the virus jumped from animals into humans. But Chinese researchers have since found that several of the earliest known cases of Covid-19 in the city were unrelated to the market, meaning the virus may already have been spreading in the community.A joint investigation this year by the World Health Organization and China focused on the possibility of a zoonotic, or animal, origin. The team's report, released in March, found that the virus probably emerged in bats and jumped to an intermediary animal before it spread to humans.The team also downplayed the theory that the virus leaked from the Wuhan institute, describing the scenario as \"extremely unlikely.\" But the WHO-led investigation was heavily criticized for not doing enough to review all plausible hypotheses. And the validity of the findings was questioned because the investigation hinged on China's cooperation, and the Chinese government didn't give researchers access to full records and raw data.Chan and 17 other scientists, including Ralph Baric, a virologist at the University of North Carolina, Chapel Hill; David Relman, a microbiologist at Stanford University; and Akiko Iwasaki, an immunologist at Yale University, signed the letter in Science in response to the shortcomings of the WHO report.Within the scientific community, the letter was seen as something of a turning point, lending credibility to the hypothesis that the virus may have escaped from the lab.\"I think it had a big effect,\" Chan said. \"I think It literally helped all the people who wanted to investigate this by saying: This is not bogus. Top scientists think this is plausible.\"Calls for a more in-depth investigation into both the natural origin theory and the lab leak hypothesis have been fueled, at least in part, by growing circumstantial evidence uncovered over the last year by a band of anonymous internet sleuths.Last year, a member of the amateur investigative team, which calls itself DRASTIC (short for Decentralized Radical Autonomous Search Team Investigating Covid-19), combed through online records and found a 2013 thesis by a postgraduate student at Kunming Medical University in China that described six workers at a mine in Yunnan province who fell ill with severe pneumonia caused by a \"SARS-like\" coronavirus.Three of the mine workers eventually died, but not much else is known about the situation. In research published in November by scientists at the Wuhan institute, serum samples from four of the mine workers were tested and showed no trace of SARS-CoV-2, the virus that causes Covid-19.Separately, a U.S. intelligence report disclosed that three researchers at the Wuhan institute sought treatment at a hospital after they fell ill in November 2019, as The Wall Street Journal first reported in May.During the WHO-led investigation this year, officials at the Wuhan institute said all staff members had tested negative for Covid-19 antibodies. Its leaders have been adamant that the virus didn't escape from the facility, but the Chinese government's reluctance to share records and test results has cast suspicion over what the lab's scientists knew — and when.Although they are far from conclusive, the intelligence report and the mine workers' mysterious illnesses have been presented as circumstantial evidence that scientists at the Wuhan institute were studying risky coronaviruses similar to SARS-CoV-2 and that the virus may have escaped from the lab, perhaps after an employee became infected.The mine incident also drew attention to a separate SARS-like virus that Chinese researchers collected from a bat in Yunnan province in 2013. Shi Zhengli, a prominent bat researcher who directs the Center for Emerging Infectious Diseases at the Wuhan Institute of Virology, co-wrote a paper published in February 2020 detailing the virus, known as RaTG13.The genomes of RaTG13 and SARS-CoV-2 were found to be 96.2 percent alike, prompting some to wonder whether the pandemic had been caused by lab experiments on RaTG13 that had gone awry. The similarities between the two viruses also raised questions about the possibility that Chinese researchers were conducting \"gain of function\" experiments, which involve manipulating viruses in a lab to make them more dangerous or more transmissible to understand their inner workings.Gain-of-function research isn't altogether uncommon in virology, but such experiments are controversial because of the risks. A scientist could, for example, unwittingly or by design create a pathogen that is better adapted to invade human cells or cause more severe infections. But there are real benefits to gain-of-function research, said Robert Garry, a virologist at Tulane University in New Orleans. For one, understanding the characteristics of a virus and its transmissibility is critical to developing vaccines and lifesaving drugs, he said.He said most virologists take the responsibility of such experiments seriously.\"It's not the Wild West,\" he said. \"It's very highly regulated.\"In 2014, the U.S. National Institutes of Health imposed a moratorium on gain-of-function research after two lab accidents involving anthrax and a strain of H5N1 bird flu occurred at the Centers for Disease Control and Prevention. Funding for gain-of-function experiments was paused for three years while the government conducted safety assessments. The ban was reversed in January 2017, during the Trump administration, after an independent science advisory panel found that the overall risk to public safety was low.While it's possible that scientists at the Wuhan institute were making genetic tweaks to samples, a coronavirus like RaTG13 that is 96.2 percent similar still can't easily be altered to create SARS-CoV-2, Garry said.\"Taking a virus that is 96 percent similar and sequencing and converting it to SARS-CoV-2 is impossible,\" he said. \"That kind of evolution takes maybe three to five decades in nature. You just can't force that in a lab.\"Dr. Charles Chiu, a virologist at the University of California, San Francisco, added that the differences between RaTG13 and SARS-CoV-2 exceed the capabilities of genetic engineering.\"The differences are scattered throughout the genome,\" he said. \"There's a big difference between 96 percent similar and 100 percent identical. We just don't have the ability to make those kinds of changes.\"In other words, the experts say, it's unlikely that scientists could snip and splice bits of a virus or tweak a pathogen's genome in such a way that would create SARS-CoV-2, even if researchers were using closely related coronaviruses.\"We're very good at imitating nature — we have, for instance, been able to synthesize polio virus — but our ability to manipulate or change the sequence of viruses is still limited,\" Chiu said.Chan, of the Broad Institute, wasn't ready to rule out the possibility of genetic engineering, saying that if minor tweaks were being made to virus samples, it could be difficult to detect the fingerprints of such work.\"You can do recombination without leaving a trace,\" she said. \"Basically, it's like you can 3D-print clothing with no seams, so it's difficult to tell if anything has been manipulated or stitched together in a lab.\"Chan acknowledged that it's \"definitely possible\" that the virus evolved in nature but added that all options should be kept on the table because neither the natural origins theory nor the lab leak hypothesis can be ruled out.\"All the evidence right now is circumstantial, and it's consistent with both lab and natural origins,\" she said. \"There's precedents for lab leaks, the genetic data could swing either way, and the epidemiological data, which is how it unfolded in Wuhan, can also swing either way. None of this is pointing in any one direction.\"And it may be years, or even decades, before scientists have any clarity on the topic. The Ebola virus, which was discovered in 1976, is thought to have spread to humans from bats or nonhuman primates, but scientists still haven't identified the origin from a specific animal host.\"The key issue here is that we simply don't have the information to make really firm conclusions,\" said Chiu, of the University of California, San Francisco, referring to Covid-19. \"Unless we know exactly what happened, we're simply making guesses.\"New documents and interviews show how the president and his senior aides cherry-picked evidence and sidelined the government’s own virus sleuths.(Bloomberg) -- Chinese President Xi Jinping is renewing his years-long push to achieve technology self-sufficiency by tapping a top deputy to shepherd a key initiative aimed at helping domestic chipmakers overcome U.S. sanctions.Liu He, Xi’s economic czar whose sprawling portfolio spans trade to finance and technology, has been tapped to spearhead the development of so-called third-generation chip development and capabilities and is leading the formulation of a series of financial and policy supThe Chinese virologist at the center of a theory that Covid-19 originated in a laboratory in Wuhan has angrily denied the claims as \"filth\" in a rare interview. Dr Shi Zhengli is the Wuhan Institute of Virology's (WIV) leading expert on coronaviruses and her work has fuelled speculation over how the first cases of Covid-19 were detected in the same city. The WIV's refusal to allow an independent investigation of its laboratory or its research into coronaviruses has further fuelled suspicions thaChina has spent decades overfishing its waters and decimating its sea life. Now, with nowhere left to go, the country's massive fishing fleet has pushed itself into international waters and at times resorted to predatory (and illegal) fishing practices in other countries' coastal domains.A Space Force wildlife manager doing a sea-turtle nesting survey found an estimated $1.2 million worth of cocaine that washed up on a Florida beach.The Chinese government says the issue at the Taishan facility is \"common\" and did not cause a leak.Vishnell Consiglio wore a $14,000 see-through Berta dress to her Catholic wedding. She wore a hot-pink lehenga to her Sikh wedding.Following their \"very robust conversation\" with Vice President Kamala Harris, Democratic state legislators from Texas conceded that while the Biden administration wants to see federal voting reform legislation make it to the president's desk, the hurdle to passage is the U.S. Senate -- but they aren't giving up on conversations with those lawmakers.  \"We know it's a priority for the administration but quite frankly it lies in the Senate,\" state Sen. Carol Alvarado, the chair of the Texas Senate Democratic Caucus, said after the meeting at the White House Wednesday.  Harris met with more than a dozen Democratic lawmakers from Texas, applauding them as \"courageous leaders\" for staging a walkout in the final hours of the state's regular legislative session last month.\"As far as cybersecurity is concerned, we agreed that we would begin consultations on that issue,\" the Russian president said.Jun.15 -- The Biden administration is engaging with China to get Boeing 737 Max planes back in service there. They were banned after several crashes. Commerce Secretary Gina Raimondo also talks about broader trade issues with China and Europe. She's in Belgium with President Biden for the U.S.-EU summit. She spoke to Bloomberg's David Westin.The march posed a test for Israel's fragile new government as well as the tenuous truce that ended last month's 11-day war between Israel and Hamas.I had the rare opportunity to watch Vladimir Putin in action during my four-year stint serving as a senior communications aide to former Secretary of State John Kerry.Why it matters: From his timing to his baiting techniques and his postgame spin, Russia's president commands an array of tactics aimed at putting U.S. leaders on the defensive and in response mode — and has decades of experience fine-tuning them.Stay on top of the latest market trends and economic insights with Axios Markets. SubscNASA: Earth is trapping 'unprecedented' amount of heat, warming 'faster than expected'Discussions that focus on countering a Chinese invasion of Taiwan risk overlooking a threat that doesn't require Beijing to storm any beaches.The Department of Justice on Monday night asked the Supreme Court to reinstate the death penalty for Boston Marathon bomber Dzhokhar Tsarnaev.Why it matters: Biden is the first sitting president to publicly oppose the death penalty and has said he wants to end its use. Get market news worthy of your time with Axios Markets. Subscribe for free.The Biden administration's action on the appeal to the Supreme Court, which was launched following a request from former President Trump last year, was higThe bill to award gold medal to officers who responded to the insurrection passed, but 21 GOP lawmakers opposed itWhile most Americans expect electric vehicles eventually to dominate the nation's roadways, many have greeted the first battery-powered models with skepticism, expressing concerns about the potential costs and inconveniences of owning such vehicles, a Reuters/Ipsos poll showed.  Automakers have already recognized the challenge and said they plan to market future battery-powered models by touting their performance and long-term cost savings over environmental benefits.  Vehicle manufacturers need to win over more rural Americans and Republicans, with the survey showing those groups express less enthusiasm than others for electric vehicles.The Chinese government cited malicious, slanderous behavior as its rationale for tighter regulations to be imposed on online fan communities.UPDATED with latest: The White House has announced tonight that President Joe Biden will on Thursday sign the bill passed today in Congress that will make Juneteenth a federal holiday. When the White House Press Office sent its daily guidance for Thursday to media late today, it included the following: “3:30 p.m.: THE PRESIDENT signs […]An Asian giant hornet was found dead near Seattle — the first such sighting in the United States this year, per AP.Why it matters: The 2-inch-long invasive insects, known as \"murder hornets,\" pose a threat to honeybees and native hornet species, and their extremely painful stings can be deadly to human beings. Stay on top of the latest market trends and economic insights with Axios Markets. Subscribe for freeWhat's happening: Entomologists from Washington state and the USDA confirmed a report of", "Section": "", "Writers": "", "URL": "https://news.yahoo.com/science-around-lab-leak-theory-204525152.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}