{"Type": "Asia", "Time": "2021-06-17", "Headline": "Myanmar footballer to seek asylum in Japan", "Text": "TOKYO: A goalkeeper from Myanmar's national team who raised an anti-coup salute during a match outside Tokyo has refused to fly home and will seek asylum in Japan, his lawyer told AFP on Thursday (Jun 17).Myanmar has been in turmoil since a February coup ousted Aung San Suu Kyi's elected government, sparking huge protests and renewed clashes between the military and ethnic rebel armies in border regions.Last month, substitute goalkeeper Pyae Lyan Aung raised the three-finger salute as the national anthem played before a World Cup qualifier against Japan.Late on Wednesday, he told a Japanese immigration officer at an airport in Osaka that he would not board a plane back to Myanmar, his lawyer Shogo Watanabe told AFP, confirming earlier local reports.\"After confirming his wishes, we will proceed with procedures to seek refugee status either in Osaka or in Tokyo,\" Watanabe added.\"It's obvious (that he is a political refugee) after he made the three-finger salute ... I hope his refugee status will be recognised as soon as possible,\" Watanabe said, adding the process could take months.National broadcaster NHK showed footage of the player speaking through a translator in Osaka on Wednesday evening.\"If I return to Myanmar, my life would be in danger. I decided to stay in Japan,\" footage broadcast by NHK showed him saying through a translator at the airport.\"The Japanese government and people must know Myanmar's situation. I call for your cooperation,\" he added.The three-finger salute has frequently been used as a show of resistance by protesters during demonstrations that have been brutally repressed, with more than 800 people killed and thousands wounded, according to rights groups.The footballer, whose teammates are believed to have returned home on Wednesday, said he will not go back until ousted leader Aung San Suu Kyi returns to power.But he admitted worries about the consequences of his decision, adding: \"If any danger happens to my teammates or family members, I would return to Myanmar to be arrested.\"Japan's immigration agency could not immediately be reached for comment.Japan accepts just a handful of asylum applications each year, but in May the justice ministry said Myanmar residents already in the country would be able to extend their stays as an emergency measure, given the coup and resulting violence.The decision comes just over a month before Japan hosts the Olympics, and could raise questions about whether other athletes might seek asylum during the Games.Japan has longstanding ties with Myanmar and has described itself as the country's largest provider of economic assistance.Following the coup, Tokyo froze new aid to Myanmar and the foreign minister has warned even existing projects could be halted if the military junta continues to use violence against protesters.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Myanmar,Japan,football,asylum,Myanmar coup", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/myanmar-footballer-seek-asylum-in-japan-15031200", "Source": "google"}