{"Type": "Singapore", "Time": "2021-06-17", "Headline": "Landlord jailed for repeatedly standing naked behind tenant, waiting for her to turn around", "Text": "SINGAPORE: A landlord was given 11 weeks' jail and a S$2,000 fine on Tuesday (Jun 15) for repeatedly appearing naked in front of his female tenant and using criminal force on her by holding or pulling her hands.Chan Eng Hui, 56, had contested the charges at trial, giving explanations that the prosecutor likened to spinning \"a fairy tale\" about how he came to be naked. These included the wind blowing the door open while he was in the toilet, him slipping on the floor after a shower and having to stroke his penis to ease the pain.The judge found his evidence inconsistent, shifting, contradictory and \"difficult to accept\". In contrast, the victim was \"forthcoming and unhesitating\" with unshaken evidence, she said.Chan was convicted of four charges of insulting a woman's modesty and two charges of criminal force.The court heard that Chan lived in a flat with his wife in western Singapore. The victim rented a bedspace from Chan for S$250 per month from April 2018 at the recommendation of a property agent.She shared a room with Chan's wife and two other people. Another two tenants lived in another room. The accused slept in a makeshift room next to the main door of the house that was partitioned with a curtain.THE VICTIM'S TESTIMONYThe victim testified at trial that she did not know Chan before she moved into the flat. They were on talking terms while she lived there, but she stopped making small talk with him after a former female tenant told her that Chan had appeared naked in her room before.Between May 10 and May 12 in 2018, Chan suddenly held her hand and asked her to \"go eat\". The victim rejected him and told him that he could \"just talk and not get touchy\".She said she felt \"turned off\" and \"annoyed\" and did not consent to him holding her hand. She said Chan grabbed her hand forcefully on a separate occasion when she walked past him and he wanted to speak with her.She flung his hand away and told him not to get touchy, before going to her room. Chan's lawyer suggested during the trial that Chan was merely trying to get up when he did this, as he had difficulty getting up after sitting for a long time.THE REPEATED NUDITYBetween end-June to mid-July 2018, the victim was walking out of the kitchen when she saw Chan standing inside the toilet naked, with the toilet door wide open and touching himself. She asked him what he was doing but he did not stop.At the time, Chan's wife was asleep in another room.A few days later, the victim was in the kitchen when she turned around to see Chan naked. She scolded him, but he smiled and told her that he was going to the toilet to shower.About one to two months later, the victim was leaving the house and had turned to shut the main door when she saw Chan naked, facing the main door.She pushed the door open and shouted angrily at him: \"You pervert. You like, you enjoy letting people see, is it? Then you should let everyone take a look at you.\"Chan went into his makeshift room and came out wearing a pair of shorts. He accused the victim of talking nonsense and maligning him.Between September and October 2018, while the victim was at the kitchen sink, he again stood behind her naked. She scolded him and threw a bowl towards him.The bowl hit the wall and shattered. Chan \"appeared indifferent\" and collected the shards, asking the victim whether she \"had to do this\", the court heard.HER DEFENSIVE ACTIONSThe victim said she was angry and felt \"bullied\" by Chan. From the time Chan began appearing naked in front of her, she started keeping weapons nearby to protect herself and locked her door before going to bed.However, Chan changed the lock so she could not lock it. She improvised by using a chair to block the door, and made sure scissors or knives were in her reach. She avoided Chan and made sure there were others in the flat before she returned home.In late December 2018, she managed to record an audio clip as she spoke to Chan. She asked Chan: \"Why did you (not) wear your pants when you appeared behind me suddenly?\"Chan replied: \"You have not agreed to me for so long ... you see that fish, you think I can control myself? When you don't give the fish to the cat, what do you think it will feel? I am a man, you think I am made of wood is it? You don't have feeling, but I am a man, I have feeling.\"The victim made a police report that same month. She said she hesitated as she was worried about how troublesome it would be. She also had difficulties finding a new place to live in and moved out only in January 2019.CHAN'S DEFENCEChan initially was defended by a lawyer but wound up representing himself. He claimed that the victim was in a relationship with him and had agreed to have sex with him in exchange for a reduction in rent.He also said his wife had returned to China and he was \"bored\", but immigration records showed she was in Singapore at the time.Chan later changed his tune to say he was just friends with the victim and found her \"repulsive\". He made derogatory comments about her looks, and claimed her motive was to chase his wife away and occupy his house.In his defence, Chan said the incident when he was standing fully naked in the toilet with the door wide open was because the wind blew the door open.As for the incident where the victim saw him stroking himself, he said he had slipped and fallen after a shower. Because of the pain, he stroked his penis, he said.The judge said his testimony was inconsistent and his explanations were not corroborated by his police statements. He told police that he could not control his urges and apologised, saying he regretted his actions.The prosecutor said Chan was previously convicted in 2009 and 2010 of obscene acts in public. At the time of the offences, he was an \"experienced landlord of some 10 to 12 years\", she added.She said Chan is \"entirely unremorseful\", and there was premeditation and abuse of trust as the victim's landlord. He also caught her unawares by standing naked and stationary behind her, waiting for her to turn around.\"While offenders are free to claim trial, this does not translate to a carte blanche to spin an entire fairy tale in court, or blatantly besmirch the repute of prosecution witnesses,\" said Deputy Public Prosecutor Krystle Chiang.As Chan is unable to pay the S$2,000 fine, he will have to serve an additional two weeks' jail in default.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "court,crime,trials", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/landlord-jailed-repeatedly-standing-naked-behind-tenant-15017366", "Source": "google"}