{"Type": "", "Time": "2021-06-17", "Headline": "Artefacts will help shed light on Singapore's maritime past, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Two shipwrecks, one dating possibly to the 14th century and the other to the 18th century, have been excavated within Singapore's waters - a first for the nation and a ground-breaking development for its maritime heritage.Both wrecks, bearing Chinese ceramics as their primary cargo, were found in the waters off Pedra Branca, a rocky outcrop surrounded by shallow waters where ships throughout history had come to grief.The plan is to display the artefacts in museums here from the end of this year.Maritime archaeologist Michael Flecker, who supervised both excavations, described the first wreck as a \"pretty remarkable\" find, as it is contemporary with the Temasek period that spans the 1300s to 1600s.In 2015, commercial divers carrying out salvage works for another project stumbled upon several ceramic plates, which they handed over to the ISEAS - Yusof Ishak Institute because of their uncanny resemblance to artefacts they had seen in the news.The institute dated the plates to the 14th century, which kick-started an excavation project, beginning with an initial survey in 2016, said the National Heritage Board (NHB) and ISEAS yesterday.A survey of the area around Pedra Branca in 2019 revealed the second wreck, which was identified as the India-built merchant vessel Shah Munchah, which sank in 1796 as it was returning to India from China. Recovery works for the second wreck are nearing completion.In an interview with The Straits Times on Monday about the historic finds, Dr Flecker said various Chinese ceramics formed a majority of the haul from the first wreck, with some matching those previously excavated in mainland Singapore.Ceramics from the wreck are also similar to those excavated at Empress Place in 2015, and more research will be done to improve existing knowledge on maritime trading history in the region during the 14th century.Dr Flecker, who has more than 30 years of maritime archaeology experience, added that the Yuan dynasty blue-and-white ceramic haul from the first wreck is also the largest that has been recovered from a shipwreck to date.\"There's been only three other (wreck) sites with Yuan blue-and-white porcelain anywhere in the world, and in much smaller quantities,\" he said, adding that it was clear from the primary cargo of both vessels - Chinese ceramics - that they were loaded in China.The Shah Munchah wreck site yielded a much wider range of artefacts, from instruments to cannon.The heaviest finds were four anchors - as long as 5m and weighing 2.5 tonnes each - and nine cannon, which required a crane vessel to remove them from the seabed.\nA diver holds a bowl decorated with Chinese characters, recovered from the deep - part of a trove of items found in Singapore waters off Pedra Branca from two shipwrecks, one with cargo dating to as early as the 14th century. Among the items were the largest haul from a shipwreck of blue-and-white ceramics from the Yuan dynasty. The first wreck was discovered after commercial divers carrying out unrelated salvage works stumbled upon several ceramic plates, which they passed to the ISEAS - Yusof Ishak Institute as they bore an uncanny resemblance to artefacts they had seen in the news. The institute dated the plates to the 14th century, and this kick-started an excavation project in 2016, the National Heritage Board (NHB) and ISEAS said yesterday. A survey of the area around Pedra Branca in 2019 revealed the second wreck, identified as the India-built merchant vessel Shah Munchah, which sank in 1796. The two historical shipwrecks are the first to be found in Singapore's waters, and will contribute to a better understanding of the nation's maritime past. PHOTO: ISEAS - YUSOF ISHAK INSTITUTE\nArtefacts are currently being stored at facilities managed by both NHB and ISEAS, where they will be cleaned, conserved and catalogued.The two historical shipwrecks are the first to be found within Singapore's waters, and will contribute to a better understanding of the nation's maritime past.There's been only three other (wreck) sites with Yuan blue-and-white porcelain anywhere in the world, and in much smaller quantities.As there were no claims to the wrecks and their artefacts at the end of the stipulated notice period of a month, they have been claimed by Singapore.Although it is very likely there are more wrecks on the seabed in Singapore's waters, some of these have been covered by reclamation, while heavy maritime traffic in the Singapore Strait makes locating others a hazard.NHB's director of heritage research and assessment Yeo Kirk Siang said: \"As an island that has been serving as the gateway to Asia for centuries, Singapore today is the legacy of our rich maritime heritage.\"We will continue to research the significance of the artefacts and find ways to promote the knowledge, so as to enable more people to learn about them and Singapore's maritime history.\"NHB plans to display the artefacts in museums here from the end of this year, while ISEAS will likely publish findings progressively in reports and research papers.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/artefacts-will-help-shed-light-on-singapores-maritime-past", "Source": "google"}