{"Type": "", "Time": "2021-06-17", "Headline": "To hold or not to hold, the Tokyo Olympic Games a dilemma: China Daily contributor, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BEIJING (CHINA DAILY/ASIA NEWS NETWORK) - The Olympic Games are about competition and achievements, both individual and national, but certainly not only about them.The Olympics also bring political and economic benefits for host cities and countries, and helps them attract more tourists and better promote their culture. These beneficial impacts are often called the \"Olympic miracle\" or the \"Olympic effect\".Yet, the Tokyo Summer Olympics and Paralympics, already deferred from 2020 to this year, have put Japan in a difficult position. Whether or not the Olympics are held from July 23 to Aug 8 and the Paralympics from Aug 24 to Sept 5, as planned, they are unlikely to measure up to the political and economic expectations of the Japanese government.According to a survey by Asahi Shimbun, one of the largest-selling newspapers in Japan, in May, more than 80 per cent of respondents said they don't want the Olympics to be held this summer. While 43 per cent said the Games should be cancelled, 40 per cent said it should be further postponed.Asahi Shimbun, which is one of the official sponsors of the Tokyo Olympics, published an editorial following the survey, urging Japanese Prime Minister Yoshihide Suga to cancel the Games. The editorial stressed: \"The foremost priority must lie on maintaining a basic structure that protects the lives, health and livelihoods of citizens. The Olympics must never be allowed to invite a situation that threatens this structure.\"But despite the growing opposition, the International Olympic Committee (IOC) has said the Games will go ahead, putting the Japanese government in a dilemma because it knows the Games may not benefit Japan.Initially, Japan viewed the 2020 Tokyo Olympics as \"economic recovery games\", but it is likely to result in financial losses. Japan has been in economic stagnation since the bursting of the asset price bubble in late 1991. And although the Japanese government has adopted several fiscal stimulus policies over the years, the country's economy is yet to see a strong rebound. So the Japanese authorities pinned their hopes on the Olympics to attract more foreign investment and tourists to invigorate the economy.The fact, however, is, foreign spectators have been banned due to the Covid-19 pandemic, and the organisers are expected to decide by the end of this month whether to allow domestic spectators into the stadiums. Holding the Games without spectators will limit the revenues to 1.66 trillion yen (S$20 billion), some 146.8 billion yen less than if domestic spectators attend the events.To make matters worse, Japan's economy shrank by 5.1 per cent year on year in the January-March period, due partly to the increased expenditure to prevent and control the spread of the virus, according to government data.And negative gross domestic product (GDP) growth is forecast to continue into the second and third quarters. Hence, even if the Olympics are held, it may not benefit the Japanese economy.Besides, the Nomura Research Institute, a Japan-based think-tank and systems integrator, has estimated that cancelling the Tokyo Olympics and Paralympics would cost Japan about 1.8 trillion yen. And as per a contract, if Tokyo is in any way responsible for the cancellation of the Games, it would have to pay all the money the IOC would owe to broadcasters, sponsors and the like.The Suga administration, too, cannot benefit much from the Olympics. The decision to hold the Games not only involves economic but also political concerns. Some Japanese politicians fear a loss of face if the Tokyo Games are cancelled and the Beijing 2022 Winter Olympic Games are successfully held. That may also damage the Suga administration's image and pose a challenge to the ruling party.Moreover, the Japanese authorities believe the Olympics symbolise the country's recovery, just like the 1964 Tokyo Games did 19 years after the end of World War II.An Asahi Shimbun survey conducted on May 15-16 showed that the approval rating for the Suga Cabinet had declined to 33 per cent, the lowest since its formation in September and down from the 40 per cent in the previous survey in April. Some media reports even said the Tokyo Games may face a shortage of medical workers if held as planned.Meanwhile, since Mr Suga has reiterated that the Olympics will be held this summer, opposition parties are trying to win more seats in the Tokyo Metropolitan Assembly's election to be held on July 4, in order to weaken the government and get more support in the next election.Thus, for the Suga administration, the Tokyo Olympics are not only an opportunity to rebuild Japan's image, but also a tool it can use to win the next election.Actually, neither Japan or Tokyo nor the Japanese Olympic Committee or the Tokyo organising committee has the power to cancel the Games. A contract they signed back in 2013, when Tokyo won the right to host the Olympics, gives that power exclusively to the IOC.Only the IOC has the right to terminate the contract if it thinks that \"the health or safety of participants in the Games would be seriously threatened or jeopardised for any reason\".Since the first modern Olympic Games in 1896, the once-in-four-year event has been cancelled only three times due to the two world wars. And sadly, the Tokyo Olympics, whether it is cancelled or held as planned, won't be able to promote the Olympic spirit, guarantee the safety of the participants and officials, or help the Japanese economy.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/to-hold-or-not-to-hold-the-tokyo-olympic-games-a-dilemma-china-daily-contributor", "Source": "google"}