{"Type": "", "Time": "2021-06-17", "Headline": "ISD detains S'porean Dickson Yeo, who spied for China, for acting as paid agent of foreign state, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A Singaporean man who had worked for China's intelligence services since 2015 has been detained for two years under the Internal Security Act (ISA) for being a threat to Singapore.Dickson Yeo, 40, had acted as a paid agent of a foreign state, said the Internal Security Department (ISD) on Tuesday (June 15).He was arrested by the ISD on Dec 30 last year, after he was deported to Singapore from the United States upon completion of a 14-month jail term for spying for China in the US. Yeo was issued an order of detention under the ISA on Jan 29.\"ISD's investigations established that Yeo had worked for the intelligence apparatus of a foreign state and had carried out various taskings given to him by his foreign handlers in exchange for monetary gains,\" said the department.\"Yeo admitted to being fully aware that his foreign handlers were working for the intelligence apparatus of the foreign state.\"ISD said that Yeo was tasked with sourcing information and providing reports on issues of interest to his foreign handlers, including information relating to Singapore.He had approached various individuals in Singapore to try and obtain information for the purpose of writing his reports. Yeo had set up a front company in Singapore as a cover for his information-gathering activities, as well as recruitment for his foreign handlers.\"He had also tried, but failed, to secure employment in the Singapore Government sector to further his information-gathering activities. Yeo had carried out these activities over a period from 2016 until his arrest in the US in 2019,\" said ISD.The department said investigations are ongoing and that Yeo's continued detention is necessary to allow the ISD to find out the full extent of his activities.During a trip to Beijing in 2015, Yeo was recruited by Chinese agents who claimed to represent think-tanks. He was studying for a doctorate at the Lee Kuan Yew School of Public Policy at the National University of Singapore at that time.US court documents show he admitted to being offered money in exchange for political reports and information, initially on South-east Asia, before focusing on the US.He also made numerous trips to meet the Chinese agents he was in contact with, trawled social networking sites to find targets and was directed to set up a fake consulting firm, Resolute Consulting - the same name as a renowned US firm.He registered the company in Singapore in early 2018 and got more than 400 resumes, mostly American military and government staff with security clearances.He then got a post as a visiting scholar at George Washington University in Washington and travelled to the US to continue his efforts.Living in the Washington area from January 2019 to July 2019, Yeo exploited networking opportunities in the area to spot and assess individuals from whom he could extract information.He was questioned by immigration officers at the John F. Kennedy airport in New York, when he returned to the US in November 2019.Spooked, he booked a flight to return the next day, when he was approached by Federal Bureau of Investigation agents. He agreed to be interviewed and was taken into custody.News of Yeo's arrest and guilty plea was announced last July and he was sentenced last October.He maintained before the court that he was supportive of the Chinese cause and claimed that he did not betray Singapore.When announcing his arrest upon returning to Singapore, ISD said Yeo had revealed to US investigators that his previous intelligence taskings targeted other states, apart from the US.\"The Singapore Government takes a very serious view of anyone who enters into a clandestine relationship with a foreign government and engages in activities at the behest of the foreign power that is inimical to our national security and interests, including bilateral relations,\" said the ISD on Tuesday.Dickson Yeo, who is enrolled as a PhD student at the Lee Kuan Yew School of Public Policy, travels to Beijing to give a presentation on South-east Asian politics. He is recruited by Chinese intelligence operatives there.Yeo uses a professional networking website to contact and recruit a civilian working with the US Air Force on the F-35 fighter jet programme. The civilian writes a report for Yeo and gives him information on the geopolitical implications of Japan purchasing F-35 aircraft from the US.Yeo creates a fake consulting company to harvest resumes from US military and government employees with access to sensitive information.Yeo recruits a US State Department employee and pays him to write a report about an unnamed member of the US Cabinet.He moves to Washington, DC, to network with people and tries to recruit them. His LinkedIn profile lists him as a doctoral fellow at the George Washington University during this time.Yeo returns to the US to ask a US Army officer working at the Pentagon to provide classified information. He is stopped and arrested after landing at the airport.Yeo pleads guilty to one charge of acting within the US as an illegal agent of a foreign power.Yeo’s sentencing hearing is scheduled. He receives a 14-month jail sentence, with the 11 months he had spent in jail credited towards his sentence.Yeo is deported to Singapore from the US and arrested by the Internal Security Department.An order of detention under the Internal Security Act is issued against Yeo for acting as a paid agent of a foreign state.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/singaporean-man-detained-by-isd-for-acting-as-a-paid-agent-of-a-foreign-state", "Source": "google"}