{"Type": "", "Time": "2021-06-17", "Headline": "Covid-19 testing starts for 85 stallholders at Block 116 Bukit Merah View, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Mandatory Covid-19 testing started at 10am yesterday for 85 stallholders at Block 116 Bukit Merah View.A temporary site was set up at Block 125A for this.The testing follows the Ministry of Health's (MOH) announcement on Sunday that a new cluster had formed at 115 Bukit Merah View Market and Food Centre.All 182 stalls there were closed from Sunday for cleaning until today. The workers and tenants who had been working at the market from May 25 have been quarantined and will be swabbed.MOH said all workers and tenants who had worked in the nearby 116 Bukit Merah View from May 25 are also being tested for Covid-19 \"to disrupt any wider, undetected community transmission\".Most of those who were tested at the temporary site said they are not worried about getting Covid-19.Ms Theresa Neo, 52, who works in a nail salon at Block 116, said: \"I'm fully vaccinated so I'm not worried.\"She added that the salon would remain open as it had not been instructed to close.A Teochew porridge food stallholder at Block 116 who wanted to be known only as Mr Than, 50, said he received a text message informing him that he should get tested.He came out of the temporary testing site teary-eyed but said it was a painless process. \"It's very normal now to get tested... I'm not worried about getting Covid-19.\"He said he would be returning to work, adding: \"We need to earn money, what to do?\"Free testing is also being offered to residents and members of the public who visited either 115 Bukit Merah View Market and Food Centre or shops at 116 Bukit Merah View between May 25 and June 12.The temporary testing site at Block 125A was not open to the public yesterday, but it will be from today to Thursday after Tanjong Pagar GRC MP Joan Pereira put in a request to MOH.Some residents who went to Block 125A yesterday were unhappy when they were turned away.Ms Pereira said in a Facebook post yesterday: \"Many residents had approached me to ask for this arrangement, as there are many elderly in our area, and this would be more convenient for them.\"I have highlighted this feedback to MOH, and I am very grateful to (all) for making this possible for the convenience of our residents.Mr Wang Da Feng, 70, made the trip down to the temporary testing site yesterday with his 71-year-old wife, but both were turned away. They visit the Block 115 market and food centre every day.The retiree, who lives in Telok Blangah Crescent, said: \"We both felt a bit unwell, and my wife started coughing last night so we wanted to get tested. It's a wasted trip today, but it's okay, we will just come back tomorrow.\"Mr Chia Foo Keng, 65, who lives at Block 117 Bukit Merah View, also said he visits the market every day.\"I'm fully vaccinated, but I still feel it's better to get tested. Who knows whether I have Covid-19 or not?\" said Mr Chia, a fishmonger at a market in Ang Mo Kio.Ms Pereira told ST that there are residents who are worried about the new cluster.\"This is especially so as there are many elderly living in the area, and their children have also written to me as they are worried,\" she said.She has advised them to minimise interaction, monitor their health and see a doctor immediately if necessary, she added.The 115 Bukit Merah View Market and Food Centre cluster now has 16 cases, after 10 more cases were linked to it yesterday.Some of the cases detected so far are food stall vendors or sundry shop workers at the market and food centre. Their ages range from the 60s to the 80s.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/covid-19-testing-starts-for-85-stallholders-at-block-116-bukit-merah-view", "Source": "google"}