{"Type": "", "Time": "2021-06-17", "Headline": "Hong Kong police arrest editor-in-chief of Apple Daily newspaper in raids | Hong Kong | The Guardian", "Text": "Ryan Law among five directors detained under national security legislation imposed by BeijingFirst published on Wed 16 Jun 2021 21.14 EDTHong Kong’s national security police have arrested the editor-in-chief and four other directors of the Apple Daily newspaper in early morning raids involving hundreds of officers, over their role in the publication of dozens of articles alleged to be part of a conspiracy to collude with foreign forces.The city’s security chief, John Lee, accused those arrested of using “journalistic work as a tool to endanger national security”, and issued a chilling warning to residents and other media.“Normal journalists are different from these people,” Lee said. “Please keep a distance from them.”The police force’s national security department said the five had been arrested on suspicion of collusion with a foreign country or with external elements to endanger national security, through articles which police said called for sanctions to be imposed on Hong Kong and mainland China. All were arrested at their homes, at around 7am.Police also searched Apple Daily’s newsroom and its offices, saying the warrant covered “the power of searching and seizure of journalistic materials”. “The operation, still ongoing, aims at gathering evidence for a case of suspected contravention of the national security law,” it said.Those arrested were named by Apple Daily as editor-in-chief, Ryan Law; the chief executive officer, Cheung Kim-hung; the chief operating officer, Chow Tat-kuen; the deputy chief editor, Chan Puiman; and the chief executive editor, Cheung Chi-wai.Police also froze HK$18m (US $2.3m) in assets of three companies, Apple Daily Limited, Apple Daily Printing Limited and AD Internet Limited. Parent company, Next Digital, announced the suspension of trading in its shares before markets opened on Thursday.The police operation is a significant escalation in the government’s moves to stifle Hong Kong’s press, of which the pro-democracy tabloid was widely considered to be a primary target.Senior superintendent Steve Li Kwai-wah, the head of the police’s national security division, said there was “very strong evidence that the questionable articles played a very crucial part in the conspiracy, which provided ammunition for foreign countries, institutions and organisations to impose sanctions”, adding that those arrested played “a very important role” in their publication.The articles reportedly date back to 2019. Authorities have made repeated assurances since the implementation of the controversial and wide-ranging national security law in June 2020 that it was not retroactive.Li said the police valued freedom of the press. “We are not targeting the media, but only an organisation that is allegedly violating article 29 of the national security law.” He warned Apple Daily staff not to reoffend, and other journalists not to bring suspicion upon themselves, according to the Hong Kong Free Press.In a press conference on Thursday afternoon, Lee issued a further warning to the city’s press to distance themselves from their Apple Daily colleagues.“You should not collude with these perpetrators. Do not play cahoots with them, otherwise you will pay a hefty price. Distance yourself from them otherwise all you will be left with are regrets,” he said.Lee refused to say what form the offending articles took – news reports or opinion – or to answer long-running concerns over how the national security law applies to media.“Do your journalistic work as freely as you like in accordance with the law, provided you do not conspire or have any intention to break Hong Kong law, and certainly not the Hong Kong national security law,” he said.The owner of the paper, pro-democracy campaigner and tycoon Jimmy Lai, has been in jail since late last year on charges relating to the 2019 protests and allegations of national security offences.Apple Daily livestreamed the police raid on the office, which showed officers leading Law into the building, apparently with his hands tied behind his back. Most employees weren’t at work yet, but those there were moved to the building’s canteen on another floor, away from the search of the newsroom. The paper published a photo of a police officer searching through a reporter’s computer. Apple Daily said 38 journalists’ computers were seized.“This is the worst of times in Hong Kong,” said Apple Daily in an open letter to its readers. It said the city’s press freedom was “hanging by a thread”, but it vowed to stand tall and had “no regrets”.The staff union said it was “enraged” by the arrests, and described the court decision to grant a warrant seizing journalistic materials as “regrettable”.“As difficult as the circumstances may be, we will carry on with our jobs with the aim to publish our papers as normal tomorrow.”Beijing’s Liaison Office in Hong Kong supported the arrests, saying: “Press freedom is not a shield for unlawful acts”. The national security law was imposed by Beijing, with the Hong Kong government’s blessing, in June last year, and has since led to the arrests of more than 100 individuals, including 54 over the holding of democratic primary polls, an informal pre-election event often held by political parties of all stripes. Politicians and activists were among those arrested, and most were denied bail.Lai is among the most high-profile of those arrested under the law. He was charged a third time under the law in April, accused of foreign collusion in relation to activist Andy Li’s attempt to flee to Taiwan by boat last year. His assets were also frozen.Lai has been a vocal opponent of the crackdown on the pro-democracy movement, and Apple Daily has produced extensive critical journalism. Hong Kong’s police commissioner has accused Apple Daily of creating hatred and dividing society, while pro-Beijing media has called for it to be shut down.Thursday marked the second raid on its newsroom. Earlier this month, Law told Agence France-Presse he was facing “the greatest crisis since I took up the post over three years ago”.The raids were condemned by journalism and human rights groups. Steven Butler, Asia program coordinator of the Committee to Protect Journalists, said the arrests destroyed “any remaining fiction that Hong Kong supports freedom of the press”.“China, which controls Hong Kong, may be able to eliminate the paper, which it sees as an annoying critic, but only at a steep price to be paid by the people of Hong Kong, who had enjoyed decades of free access to information.”Taiwan’s foreign minister, Joseph Wu, said he was “out of words to describe my anger and sadness”.“Authoritarianism is waging a brutal war on Apple Daily, a desperately endangered symbol of freedom in Hong Kong.” ", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/world/2021/jun/17/hong-kong-police-arrest-editor-in-chief-of-apple-daily-newspaper-in-morning-raids", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}