{"Type": "", "Time": "2021-06-17", "Headline": "Opinion | The Fed sticks to its monetary course — but inflation looms - The Washington Post", "Text": "MARKET ANTICIPATION for the Wednesday meeting of the Federal Reserve’s policy-making Open Market Committee was higher than usual, given that it took place shortly after the release of new data showing that inflation continues to surge. Consumer prices were up 5 percent in May relative to May 2020, the fastest rate of increase since August 2008. Even leaving out volatile food and energy prices, “core” inflation was up 3.8 percent, which was the fastest increase for that indicator since June 1992. Long dormant as a risk factor in the U.S. and global economies, inflation now is being taken more seriously than at any time in more than 40 years.The question on everyone’s mind was: Would the Fed react to the new numbers by adjusting the easy-money stance it adopted in response to the pandemic-induced economic collapse of a year ago? The central bank, and its chair, Jerome H. Powell, answered “no,” albeit with a caveat. Though the Fed raised its own forecast of 2021 annual inflation a full percentage point over its March estimate, to 3.4 percent, there will be no “taper” of its $120 billion per month bond-buying program, until the Fed sees what Mr. Powell called “substantial further progress” toward full employment and its inflation goal, which is a 2 percent annual average over time. And there will be no short-term increase in the Fed’s key interest rate, which is currently set at zero. That’s where the caveat came in: The Fed’s board published non-binding forecasts that point to the need for at least one rate increase in 2023, as opposed to 2024 after its March meeting.Hypothetical as they still are, these earlier rate hikes — which generally make stocks less attractive to investors — would come too soon for Wall Street’s taste, and the market fell after the Fed meeting. Yet they would come too late for skeptics of the Fed’s posture, who note that it is getting hard to square with the central bank’s own acknowledgement that inflation is running faster than it thought just three months ago. Mohamed A. El-Erian, now at Cambridge University, tweeted that a “possible policy mistake” by the Fed ranks with vaccine-resistant covid virus variants as a risk to the global economy.The Fed is sticking to its view that much inflationary pressure comes from “transitory” effects related to the post-pandemic reopening, such as a surge of consumer and government spending while many sectors of the economy are still struggling to ramp up production. Mr. Powell said he sees “no sign” that long-term inflation expectations are getting out of hand. And he’s got data to back him up, such as a recent moderation in lumber prices and persistently low interest rates on 10-year Treasury notes.Mr. Powell is obviously not indifferent to the threat of uncontrolled inflation, a fact he usefully reiterated Wednesday. Equally clearly, he believes that the bigger risks to prosperity lie in trying to cool the economy — which is what inflation-fighting requires — while job creation and wage increases are still heating up. If and when the chair’s assessment proves valid, the American people will owe him a debt of gratitude. If not — he’ll own that, too.Read more:Lawrence H. Summers: The inflation risk is realHenry Olsen: The Fed doesn’t want you to worry about inflation. You should.Catherine Rampell: Don’t freak out about inflation yetPaul Waldman: How inflation fears are complicating Biden’s political futureGeorge F. Will: The Fed has an irresistible equity itchThe most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/opinions/the-fed-sticks-to-its-monetary-course--but-inflation-looms/2021/06/16/2727a07e-cedb-11eb-a7f1-52b8870bef7c_story.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}