{"Type": "Singapore", "Time": "2021-06-17", "Headline": "2 historic shipwrecks and their artefacts found in Singapore's territorial waters", "Text": "SINGAPORE: Two historic shipwrecks and their artefacts – including Chinese ceramics from as far back as the 14th century – have been discovered within Singapore’s territorial waters around Pedra Branca island, located at the easternmost point of Singapore.In 2015, several ceramic plates were discovered by accident by commercial divers involved in a maritime operation, which led to the discovery of the first historic shipwreck about 100m to the north-west of Pedra Branca.One year later, the National Heritage Board (NHB) commissioned the Archaeology Unit of the ISEAS-Yusof Ishak Institute (ISEAS) to survey and investigate the site, and to conduct excavations to recover wrecks and objects from the shipwreck.These excavations, which continued until 2019, led to the discovery of a second historic shipwreck about 300m east of Pedra Branca. Excavations to recover artefacts from the second shipwreck were carried out from 2019 until mid-2021.ARTEFACTS RECOVEREDThe two shipwrecks originated from different periods, according to ISEAS’ findings.The first shipwreck contained Chinese ceramics and may date back to the 14th century, a time when Singapore was known as Temasek, the research stated.Some of the key finds include Longquan dishes and bowls, and a jarlet. Fragments of blue-and-white porcelain bowls with lotus and peony motifs from the Yuan dynasty were also found in the shipwreck.This ship carried more of these blue-and-white porcelain than “any other documented shipwreck in the world,” said Dr Michael Flecker, a visiting fellow and project director of Maritime Archaeology Projects at ISEAS.“Many of the pieces are rare, and one is believed to be unique,\" he said.ISEAS’ research also noted that direct parallels can be made between the finds from the first shipwreck and those from archaeological excavations at Empress Place conducted in 2015 and from past excavations at Fort Canning Park.The second shipwreck, noted ISEAS’ research, is likely to be the Shah Munchah, a merchant vessel that sank while voyaging from China back to India in 1796.Artefacts recovered from this shipwreck include a range of Chinese ceramics and non-ceramic artefacts, such as copper-alloy, glass sand agate objects, as well as four anchors and nine cannons of the ship. The cannons were typically mounted on merchant ships employed by the East India Company during the 18th and early 19th centuries, and used mostly for defensive purposes and signalling.Among the key non-ceramic finds in the second shipwreck were a jar shard depicting a dragon motif; an earthenware duck; figurines of Guanyin’s head, happy Buddha and a boy of good fortune; figurines of a dog and mythical sea creature Makara; a figurine of a Chinese couple holding fans on a biscuit base; and a Qingbai figurine of a horse with a side-saddle rider.“Had the ship survived another 23 years, she would almost certainly have called at the re-established port of Singapore. Her incredibly diverse cargo provides great insights into the type of goods that would have been exchanged and purchased by the new inhabitants of this fledging city,” said Dr Flecker.NEXT STEPS: CONSERVATION AND HISTORICAL SIGNIFICANCEAfter the removal of salt via the process of desalination, the artefacts have to be meticulously cleaned, conserved and catalogued. In-depth research and documentation will also need to be carried out.Once the conservation, research and documentation have been completed, NHB will work towards exhibiting the artefacts in its museums from end-2021.Archaeological reports and research might also be published by ISEAS. The institute might also conduct talks for members of the public.Mr Yeo Kirk Siang, director of NHB’s Heritage Research and Assessment, told CNA that the discoveries are \"significant\" in unveiling Singapore's history.“What is significant about it is it unveils part of our history before 1819. That part is little known so far. With every find, it enriches our understanding. Singapore’s history is clearly connected to our maritime trade – in the past and even today,\" he said.“Understanding our maritime history helps us understand Singapore’s relations, our context and our place in the world, our geographic location, why it’s important, what’s the reason for our existence, and what’s the reason for our success.“If we can understand our past, it gives us a more grounded understanding of the world that we live in today,” he added.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Shipwreck", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/2-historic-shipwrecks-and-their-artefacts-found-in-singapore-15024902", "Source": "google"}