{"Type": "", "Time": "2021-06-17", "Headline": "Covid-19: Vaccination for 1.2 million Kelantan residents expected to be completed by October, says Khairy | The Star", "Text": "\n                    Thursday, 17 Jun 2021\n                KOTA BHARU (Bernama): The government anticipates that the vaccination of about 1.2 million residents in Kelantan will be completed by October, says National Covid-19 Immunisation Programme Coordinating minister Khairy Jamaluddin (pic).He said it was based on the state government's target of administering 30 000 doses of Covid-19 vaccine a day, next month.\"We will also provide another 550,000 doses of vaccine to Kelantan next month (July) thus enabling the state to increase the administration rate to 30,000 doses a day or at least 20,000 (doses) a day,\" he said.He said this at a press conference after attending the state-level Covid-19 Immunisation Task Force Meeting with Kelantan Mentri Besar Datuk Ahmad Yakob at the Darulnaim Complex here on Thursday (June 17).Khairy said he was confident that the target could be achieved following the positive development of the immunisation programme, including the vaccination outreach programmes.\"The daily vaccination rate in Kelantan is now increasing to 12,000 (doses). Congratulations to Kelantan for the implementation of the various outreach programmes to facilitate vaccination for the residents especially senior citizens,” he said.To date, 42 per cent of Kelantan's eligible population have registered for the Covid-19 vaccination.Kelantan will also set up five more vaccination centres (PPV), one each in Kota Bharu, Bachok, Pasir Mas, Machang and Kuala Krai.- BernamaRelated stories:Covid-19: Residents in the interior of Kelantan to receive single-dose CanSino vaccine, says KhairyKhairy: Govt considering mixing vaccines to boost efficacy against Covid-19 variantsCovid-19: You may walk in for jab after inoculation of the pre-registered is completed, says Khairy\n\nTags / Keywords:\nCovid-19\n                                                                ,\n                                                                                                vaccine\n                                                                ,\n                                                                                                Khairy Jamaluddin\n                                                                ,\n                                                                                                Kelantan\n                                                                ,\n                                                                                                people\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/news/nation/2021/06/17/covid-19-vaccination-for-12-million-kelantan-residents-expected-to-be-completed-by-october-says-khairy", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}