{"Type": "Asia", "Time": "2021-06-17", "Headline": "Hong Kong police raid newspaper Apple Daily, arrest 5 including editor-in-chief", "Text": "HONG KONG: Hong Kong police arrested five directors at the Apple Daily early on Thursday (Jun 17) morning, including its editor-in-chief, with a warrant to seize journalistic materials for the first time, in the latest blow to the newspaper's jailed owner Jimmy Lai.The warrant, which police said was aimed at gathering evidence for a case involving the national security law that Beijing imposed last year, raises further concerns about media freedoms in the city.\"This is a blatant attack on the editorial side of Apple Daily. They are arresting editors,\" Mark Simon, an adviser to Lai who is outside Hong Kong, told Reuters. \"They're arresting the top editorial folks.\"The security law was Beijing's first major move to set China's most restive city on an authoritarian path. It punishes anything Beijing deems as subversion, secessionism, terrorism and collusion with foreign forces with up to life in prison.Hong Kong Police's National Security Department said in a statement that five directors of a company had been arrested on suspicion of collusion with a foreign country or with external elements to endanger national security.It said only that the five included four men and a woman aged between 47 and 63.Apple Daily said five of its directors, including editor-in-chief Ryan Law, chief executive officer Cheung Kim-hung, chief operating officer Chow Tat-kuen, deputy chief editor Chan Puiman and chief executive editor Cheung Chi-wai had all been arrested in morning raids.The newspaper said at about 7.30am local time that about 100 officers arrived at its headquarters and cordoned off the area.National security police said in a statement that officers had searched a media company in Tseung Kwan O with a warrant that covers \"the power of searching and seizure of journalistic materials\".Police said late Thursday morning that 500 officers raided the newsroom of Apple Daily after reports it had published were suspected to have breached the new national security law.Senior superintendent Li Kwai-wah told reporters outside the paper's headquarters that the police have also frozen HK$18 million ($2.32 million) of assets owned by three companies linked to Apple Daily.SECOND RAID IN LESS THAN A YEARThe paper broadcast live footage of the police raid on its Facebook account. Officers could be seen cordoning off the complex and walking through the building.\"They arrived around 7am this morning, our building is besieged,\" an unnamed reporter said in a live commentary with the broadcast. \"Now we can see them moving boxes of materials onto their truck.\"\"Police are restricting us from using quite a lot of our equipment. But we can still keep this live camera on and our website will keep updating,\" the voice added.It is the second raid on Apple Daily in less than a year.The move is the latest blow to Apple Daily after authorities last month directed Lai's shares in Next Digital, publisher of the newspaper, to be frozen.Lai was arrested in August last year and later charged under the national security law imposed by China on its freest city. The pro-democracy activist's assets were also frozen under the same law.He has been in jail since December after being denied bail in a separate national security trial. He faces three charges under the new law, including collusion with a foreign country.In an interview with AFP last month, editor-in-chief Law struck a defiant tone.He admitted that the paper was in \"crisis\" since the jailing of its owner but said his reporters were determined to press on with publishing.At a recent townhall meeting, staff asked Law what they should do if the police came back to arrest him.He had a simple reply: \"Broadcast it live.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Hong Kong,Apple Daily", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/hong-kong-police-raid-newspaper-apple-daily-arrest-5-ryan-law-15031142", "Source": "google"}