{"Type": "Asia", "Time": "2021-06-17", "Headline": "Biden queries China's desire to find origin of COVID-19", "Text": "GENEVA US President Joe Biden said China was trying to project itself as a responsible nation in regard to the COVID-19 pandemic, but it remained unclear whether Beijing was really trying to understand the origins of the coronavirus.Asked if he would call Chinese President Xi Jinping as \"old friend to old friend\" to ask him to re-admit World Health Organization investigators, Biden said: \"Let's get something straight: We know each other well, we're not old friends. It's just pure business.\"Biden made clear that he remained sceptical about China's cooperation with the WHO investigation.\"China is trying very hard to project itself as a responsible and very, very forthcoming nation, and they are trying very hard to talk about how they're helping the world in terms of COVID-19 and vaccines,\" Biden said.\"Look, certain things you don't have to explain to the people of the world, they see the results. Is China really actually trying to get to the bottom of this?\"Biden in May ordered aides to find answers to the origin of the virus that causes COVID-19, which was first reported in the Chinese city of Wuhan, and said US intelligence agencies are looking at rival theories, potentially including the possibility of a laboratory accident in China.A WHO-led team that spent four weeks in and around Wuhan in January and February with Chinese researchers said in its report that the virus had probably been transmitted from bats to humans through another animal, and that \"introduction through a laboratory incident\" was extremely unlikely.But experts said some data had been withheld, and Washington says the study was \"insufficient and inconclusive\".China has repeatedly said that \"politicising\" the issue will hamper investigations.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "China,Joe Biden,medical health,pandemic,COVID-19,coronavirus", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/biden-queries-china-s-desire-to-find-origin-of-covid-19-15029122", "Source": "google"}