{"Type": "", "Time": "2021-06-17", "Headline": "Dickson Yeo had approached various people in Singapore, applied for government jobs to get info: ISD, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Dickson Yeo had approached various people in Singapore, relying heavily on social networking platforms to reach out to them and gather information at the behest of a foreign country, said the Internal Security Department (ISD).He had also attempted to find jobs in a range of positions in the Government, thinking that he could access information of interest to his foreign handlers.However, the department's investigations showed that no classified government information pertaining to Singapore had been compromised as a result of Yeo's activities, a spokesman told The Straits Times on Tuesday (June 15).Earlier in the day, the agency overseeing domestic security announced that Yeo had been detained for two years under the Internal Security Act (ISA) for acting as a paid agent of a foreign state.He was arrested by the ISD on Dec 30 last year after he was deported to Singapore from the United States upon completion of a 14-month jail term for spying for China in the US. Yeo was issued an order of detention under the ISA on Jan 29.Responding to queries from The Straits Times, the department said Yeo was tasked by his foreign handlers to gather information on a wide range of subjects, primarily global and regional geo-political issues and developments.\"He had relied heavily and successfully on social networking platforms to reach out to individuals with the relevant expertise, knowledge and access. He had pitched taskings to his resource persons as 'research topics' for his various foreign clients.\"The ISD said it was unable to provide further details on the professions of these individuals or the number of persons involved.The agency also said that Yeo had tried to gain employment in a range of positions in the public sector positions and agencies he believed would allow him access to information of interest to his foreign handlers. It added that it could not provide specific details of these jobs, citing operational and security reasons.People looking to join the public sector in positions that require access to classified information will have to undergo security clearance, the ISD said. Several factors are taken into consideration in this process, including the nature of the work and the sensitivity of the information dealt with.\"Security checks will vary for different positions which have different levels of access to confidential information,\" the department added.Yeo's path to being a spy started during a trip to Beijing in 2015, when he was recruited by Chinese agents who claimed to represent think-tanks. He was studying for a doctorate at the Lee Kuan Yew School of Public Policy (LKYSPP) at the National University of Singapore at the time.When news of Yeo's activities broke after he pleaded guilty in a US court last July, the school terminated his PhD candidature \"with immediate effect\".At the time, retired diplomat Bilahari Kausikan revealed that one of Yeo's former professors at the school was Huang Jing until 2017, when the academic was expelled from Singapore \"for being a Chinese agent of influence\".On Tuesday, an LKYSPP spokesman said the past incidents involving its former staff member and former student show how different sectors in society, including education, can be potential targets for foreign subversion. The best safeguard against illegal foreign subversion is a community that is aware and vigilant, she added.The spokesman stressed that the school will not tolerate any acts or activities of foreign interference that threaten Singapore's national security or interests. Its staff and students are also expected to conduct themselves fully in accordance with the laws of Singapore at all times.She added that the school has strengthened its procedures, saying: \"We maintain an enhanced oversight on academic collaborations and partnerships, both local and overseas, and will also continue to keep a heightened awareness among all our staff and students on the risks of foreign interference.\"Professor Joseph Liow, dean of the College of Humanities, Arts and Social Sciences, and Tan Kah Kee chair in comparative and international politics at Nanyang Technological University, said of Yeo's activities: \"Academics and researchers should be aware that these sorts of things happen in real life, and are not merely the stuff of spy novels or Hollywood movies.\"Foreign powers spy all the time, and spying is conducted in many ways, which have evolved with technology, he noted. And one could say that by virtue of being a very open country, Singapore is vulnerable to such activities, added Prof Liow.\"I wouldn't say that we have to be exceedingly worried about this, but we certainly need to be aware that such things take place, and also be alert to requests that appear unusual,\" he said.\"It's not happening on a daily basis, and of course our security agencies spend a lot of time making sure such activities don't take place. But nevertheless as academics, researchers, or just regular citizens, we need to exercise some common sense and be vigilant.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/dickson-yeo-had-approached-various-people-here-applied-for-a-range-of-government-jobs", "Source": "google"}