{"Type": "", "Time": "2021-06-17", "Headline": "Fiorentina boss Gennaro Gattuso leaves after 23 days over transfer disagreements - sources", "Text": "Fiorentina have announced manager Gennaro Gattuso has left his position just 23 days after joining as manager, with the decision down to a disagreement over transfer strategies, sources have told ESPN.La Viola announced Gattuso's appointment on May 25 -- just two days after his departure from Napoli following the culmination of the 2020-21 Serie A campaign.- Stream LIVE games and replays on ESPN+ (U.S. only)\"ACF Fiorentina and Mister Rino Gattuso, by mutual agreement, have decided not to follow up on the previous agreements and therefore not to start the next football season together,\" a Fiorentina statement read.\"The company immediately set to work to identify a technical choice that will guide the Viola team towards the results that Fiorentina and the City of Florence deserve.\"Sources have told ESPN that Fiorentina are unhappy with the \"unacceptable situation\" regarding Gattuso's agent, Jorge Mendes.FC Porto midfielder Sergio Oliveira and Valencia winger Goncalo Guedes, clients of Mendes, had been summer targets for Fiorentna.Gattuso's departure has increased the pressure on Fiorentina's U.S. owner Rocco B. Commisso who has seen five managerial changes in just two seasons, which have yielded 10th and 13th-place finishes.Commisso stuck with Vincenzo Montella when he bought the club in June 2019 before dismissing him in December of that year and replaced with Beppe Iachini, who lasted until November 2020.Fiorentina then turned to former manager Cesare Prandelli, who resigned in March 2021, citing a \"darkness inside,\" and Iachini was rehired to see out the campaign.Gattuso started his managerial career with Swiss side Sion in 2013 and, after stints in Greece and in the Italian lower leagues, was appointed Milan boss in 2017 before taking over at Napoli in 2019.", "Section": "", "Writers": "", "URL": "https://www.espn.com/soccer/fiorentina-itafiorentina/story/4411687/fiorentina-boss-gennaro-gattuso-leaves-after-23-days-over-transfer-disagreements-sources", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}