{"Type": "", "Time": "2021-06-17", "Headline": "Blackstone Said to Near $3 Billion Deal for Developer Soho China - Bloomberg", "Text": "Outside the Soho China Ltd. Wangjing Soho project in Beijing.Blackstone Group Inc. is nearing an agreement to acquire office developer Soho China Ltd. in what would be its biggest real estate investment in Asia’s largest economy, people familiar with the matter said.The private equity firm could announce a deal as soon as this week, the people said, asking not to be identified because the matter is confidential. Soho China could be valued at about $3 billion in a transaction, the people said. The developer has a market value of about HK$19.8 billion ($2.55 billion) based on its last closing price.Soho China shares were halted from trading Tuesday in Hong Kong, pending an announcement under the city’s takeover code. The suspension came after its stock price surged 48% last week, the most since the company went public in 2007.The Soho China Ltd. Wangjing Soho project in Beijing.Photographer: Qilai Shen/BloombergWhile talks are in their final stage, they could still drag on or fall apart, the people said. A representatives for Blackstone declined to comment, while a representative for Soho China didn’t immediately respond to a request for comment.Soho has been seen as a takeover target since early 2020, as a lack of new assets in its pipeline and declining office rents in key Chinese cities put mounting pressure on its profits. The Beijing-based developer said in March last year it was in talks on a potential deal with overseas financial investors that could lead to a bid for the company.Blackstone was in discussions about a deal for Soho, though negotiations stalled due to concerns about financing and the impact of the coronavirus pandemic, Bloomberg News reported at the time. Soho said in August that all previous talks with potential investors had been terminated.Soho has developed 54 million square feet (5 million square meters) of commercial projects in Beijing and Shanghai, according to its website. Its key assets include the signature Bund SOHO in Shanghai and the landmark Wangjing SOHO in Beijing, designed by Zaha Hadid, the first woman to receive the prestigious Pritzker Architecture Prize.Blackstone’s real estate arm has about $196 billion of capital under management, according to its website. The investment firm reached a $1.1 billion deal in November to buy control of the biggest urban logistics park in southern China’s Greater Bay Area.In late 2018, Blackstone acquired a Shanghai mall and office complex from Mapletree Investments Pte for $1.2 billion, people with knowledge of the mater said at the time. It agreed the next year to buy stakes in Chinese shopping centers in Xi’an and Zhengzhou from Taubman Centers Inc.— With assistance by Emma Dong, and Vinicy Chan", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-16/blackstone-said-to-near-3-billion-deal-for-developer-soho-china", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}