{"Type": "", "Time": "2021-06-17", "Headline": "Italy vs Switzerland EURO 2020 Odds, Tips & Prediction│16 JUNE 2021", "Text": "\nItaly face Switzerland in the second game of the Euro 2020 tournament. An interesting encounter between two strong national teams and geographical neighbours. Italy are quoted by bookmakers as the big favourite, which is no surprise given the Squadra’s winning streak. However, it should be noted that Italy have been unable to beat Switzerland since 2003, i.e. for 18 years.The last time Italy failed to win and concede a goal was in October 2020, against the Netherlands in the Nations League. Since then, the Squadra Azzurra have played nine games in two tournaments and friendlies and achieved nine victories. Including, the Italians have been stronger already in the framework of Euro 2020 against Turkey. The score of the match was 3-0, with Immobile and Insigne scoring the goals for the Italians, with Demiral scoring the opening goal after a Berardi cross ball bounced into the net. As for the formation, Italy played a 4-3-3 against the Turks, as they did in their three World Cup 2022 qualifying matches, with Insigne-Immobile-Berardi in front.Before the start of Euro 2020, Switzerland had a 6-match winning streak, including the Red Crosses beating the Bulgarians and the Lithuanians in the 2022 World Cup qualifiers. Unsurprisingly, Switzerland were quoted as favourites to play against the Welsh in Baku. However, the Dragons put up a good fight against the Swiss and drew 1-1, although the Red Crosses were twice ahead in almost every area. Moreover, the Swiss team had a chance to take the lead, even scoring in the 85th minute, but the goal was cancelled due to offside. The Swiss’ tactical scheme is not as stable as Italy’s. For example, against the Lithuanians, the Red Crosses played 4-4-2, while against the Bulgarians they were 3-4-1-2. Against the Welsh, Petkovic opted for the second option, which was not very successful.Italy are the favourites for the clash. Italy will likely get their 10th successive win over the Swiss. However, there are doubts that Italy will leave the field without conceding a goal this time as well. The Swiss team is well-prepared for the Euro, and after the draw against Wales, the Red Crosses mustn’t lose to Italy. And not to lose to the favourites, the Swiss will have to score. We offer the following betting options: Both Teams To Score for 2.29, Total Over 2.5 for 2.34, W1 and Both to Score - Yes for 3.94. All materials on this site are available under license Creative Commons Attribution 4.0 International. You must include the name of the author (creator) of the work (material) and the party of attribution, copyright notice, license title, disclaimer notice and link to the material, if provided with the material.", "Section": "", "Writers": "", "URL": "https://www.telecomasia.net/sports-betting/tips/football/uefa-euro/italy-vs-switzerland-euro-2020-odds-tips-prediction-16-june-2021/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}