{"Type": "Singapore", "Time": "2021-06-17", "Headline": "Dickson Yeo applied for government jobs to access 'information of interest' for foreign handlers: ISD", "Text": "SINGAPORE: Singaporean Dickson Yeo had applied for a range of government jobs to access information that his foreign handlers would be interested in, the Internal Security Department (ISD) said on Tuesday evening (Jun 15).Earlier in the day, ISD announced that Yeo, 40, had been detained under the Internal Security Act (ISA) since Jan 29 for acting as a paid agent for a \"foreign state\".While ISD did not name the foreign state, Yeo was last year sentenced to 14 months' prison in the US for spying for China against the US.ISD said on Tuesday that Yeo carried out intelligence activities against Singapore from 2016 until his arrest in the US in 2019.He was tasked to source for information and provide reports on issues of interest to his foreign handlers, including information relating to Singapore.\"Towards this end, he had approached various individuals in Singapore in an attempt to obtain information for the purpose of writing his reports,\" ISD said.Yeo also set up a front company in Singapore as a cover for his information-gathering activities as well as conducting recruitment for his foreign handlers. He also tried, but failed, to get a job in the Singapore Government, ISD said.“Yeo had tried to gain employment in a range of positions in the public sector, positions and agencies that he believed would allow him access to information of interest to his foreign handlers,\" ISD said in response to queries from CNA.\"We are unable to provide specific details due to operational and security reasons.\"Nevertheless, ISD said those seeking to join the public sector in positions that require access to classified government information will require security checks.\"Several factors are taken into consideration in the conduct of security clearance, including the nature of the work in the position, and the sensitivity of the information that the position deals with,\" it added.\"Security checks will vary for different positions which have different levels of access to confidential information.  For operational reasons, we are unable to go into the specifics.”CLASSIFIED INFORMATION NOT COMPROMISEDAfter Yeo admitted in a US court in July last year to working with Chinese intelligence officials to obtain sensitive information from Americans, Singapore's Ministry of Home Affairs said its investigations into Yeo's actions did not reveal any direct threat to Singapore's security.ISD explained that this assessment was based on initial information arising from Yeo's arrest in the US last year.\"Details on the extent of his activities in relation to Singapore were surfaced only after his arrest and investigation under the ISA following his return to Singapore,\" it stated.\"However, our investigation showed that no classified government information pertaining to Singapore had been compromised. Investigations are ongoing.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Dickson Yeo,US,China,Singapore", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/dickson-yeo-china-us-isa-isd-government-job-spy-15019552", "Source": "google"}