{"Type": "", "Time": "2021-06-17", "Headline": "Xi Jinping picks top lieutenant to lead China’s chip battle against US | The Star", "Text": "\n                    Thursday, 17 Jun 2021\n                The involvement of one of Xi's most-trusted lieutenants in China's chip efforts highlights the importance accorded by Beijing to the initiative. - AFPBEIJING (Bloomberg): Chinese President Xi Jinping is renewing his years-long push to achieve technology self-sufficiency by tapping a top deputy to shepherd a key initiative aimed at helping domestic chipmakers overcome US sanctions.Liu He, Xi’s economic czar whose sprawling portfolio spans trade to finance and technology, has been tapped to spearhead the development of so-called third-generation chip development and capabilities and is leading the formulation of a series of financial and policy supports for the technology, according to people with knowledge of the matter.It’s a nascent field that relies on newer materials and gear beyond traditional silicon and is currently an arena where no company or nation yet dominates, offering Beijing one of its best chances to sidestep the hurdles slapped on its chipmaking industry by the US and its allies.The sanctions, which emerged during Donald Trump’s presidency, have already smothered Huawei Technologies Co.’s smartphone business and will impede longer-term efforts by chipmakers from Huawei’s HiSilicon to Semiconductor Manufacturing International Corp to migrate toward more advanced wafer fabrication technologies, threatening China’s technological ambitions.\"China is the world’s largest user of chips, so supply chain security is of high priority, ” said Gu Wenjun, chief analyst at research firm ICwise.\"It’s not possible for any country to control the entire supply chain, but a country’s effort is definitely stronger than a single company.”The involvement of one of Xi’s most-trusted lieutenants in China’s chip efforts highlights the importance accorded by Beijing to the initiative, which is gaining urgency as rivals from the US. to Japan and South Korea scramble to shore up their own industries.The Chinese president has long called upon his Harvard-educated adviser to tackle matters of top national priority, making him the chief representative in trade negotiations with the U.S. as well as chairman of the Financial Stability and Development Committee, where Liu leads the charge to curb risks in the nation’s $5-trillion-plus financial sector.In May, Liu spearheaded a meeting of the technology task force that discussed ways to grow next-generation semiconductor technologies, according to a government statement. The 69-year-old vice premier, who has led the country’s technology reform task force since 2018, is also overseeing projects that could lead to breakthroughs in traditional chipmaking, including the development of China’s own chip design software and extreme ultraviolet lithography machines, one of the people said, asking not to be identified as they weren’t authorized to speak to media.The State Council and the Ministry of Industry and Information Technology didn’t respond to faxed requests for comment.During trade negotiations with the Trump administration, Liu emerged as one of the most visible advocates of Beijing’s agenda. He’s known Xi since childhood -- both are sons of veteran Communist Party leaders and were among masses of young people dispatched to work in impoverished rural areas during the Cultural Revolution. Now, Liu is leading the charge to reform the tech sector, which was identified in China’s latest five-year economic plan as a key strategic area in which the \"whole nation system” should be used to mobilize any necessary resources.First introduced under Mao Zedong to help the then-fledgling Communist China industrialize, the approach was crucial to helping Beijing attain a number of top national priorities, from developing its first atomic bomb in the early 1960s to achieving Olympic sporting success. After that it was largely set aside as officials shifted to focus on economic growth. But following a series of U.S. sanctions that exposed the vulnerabilities of China’s chip capabilities, Xi is once again reactivating the mechanism to achieve breakthroughs in advanced chip development and manufacturing.About a trillion dollars of government funding have been set aside under the technology initiative, part of which will be used by central and local governments to jointly invest in a series of third-generation chip projects, according to people with knowledge of the matter. Top chipmakers and research institutes have submitted proposals to the ministries of science and information technology, all vying for a place in the national program and a share of the financing.The Ministry of Science and Technology is slated to inject 400 million yuan (US$62 million) into some key \"strategic electronics materials” including third-generation chips, according to a government document.Even moonshot chip programs are in line for government funding. The state-backed National Natural Science Foundation of China has pledged financial support for dozens of exploratory research programs, ranging from ultra-low power consumption to the development of a flexible chip that can collect and transmit nerve signals, as Beijing seeks to overcome \"computing bottlenecks” when Moore’s Law -- the industry standard for predicting the pace of chip improvements -- finally stops working.Several subsidiaries of China Electronics Technology Group Corp. and China Railway Construction Corp. -- organizations already sanctioned by the US -- are among the state-backed firms backing the effort, one of the people said.Another government-linked giant, China Electronics Corp, is one of the leaders in third-generation chip development, thanks to its investment in smaller firms including CEC Semiconductor Co.Using its own in-house technology, CEC Semiconductor makes silicone carbide-based power devices that can work at 200 degrees Celsius (360 degrees Fahrenheit) for a number of key industries from telecommunications to electric cars -- reducing China’s reliance on overseas suppliers such as Infineon Technologies AG, Rohm Co. and Cree Inc.Shares of chipmakers climbed, with SMIC rallying more than 8% in Shanghai, set for its biggest one-day gain since October. Shares of National Silicon Industry Group Co., Will Semiconductor Co. and Maxscend Microelectronics Co. also advanced. Sanan Optoelectronics Co. and Wingtech Technology Co. -- among firms seen as potential beneficiaries of China’s third-generation chip effort -- gained 10% and 8%, respectively.The task of coordinating that sprawling program now falls to Liu, who has to keep track of the relevant resources and drive the national strategy to help China achieve chip independence.\"For our country, technology and innovation is not just a matter of growth, ” Liu told a three-story auditorium packed with China’s top scientists in a separate meeting in May. \"It’s also a matter of survival.”Xi is counting on his lieutenant to help China fend off growing threats from the US, which is seeking to take back chip industry supremacy.Under the Trump administration, sanctions were slapped on Chinese giants from Huawei to SMIC, cutting off their access to American technology and equipment crucial to designing and making advanced logic chips.President Joe Biden has also laid out a $52 billion plan to bolster domestic chip manufacturing, while calling on allies to join export controls aimed at curbing Beijing’s drive toward technology self-sufficiency.Rival powerhouse nations like South Korea and leading corporations such as Taiwan Semiconductor Manufacturing Co. have also responded with their own spending plans, fueling the race to take the lead in the sector.With traditional chipmaking facing a series of challenges from technology development to heavy capital investment, third-generation chips -- which use compounds such as gallium nitride and silicon carbide to significantly improve the performance of semiconductors that power a wide range of industries and products -- may offer China its best chance to overcome rivals, senior academic Mao Junfa told an industry event in Nanjing earlier this month.\"China couldn’t buy chips, even with cash in hand, ” he said, referring to Washington’s sanctions on Chinese tech companies including Huawei\"The compound chip technologies could help China surpass rivals in the post-Moore’s Law era.”( \nTags / Keywords:\nChina\n                                                                ,\n                                                                                                Xi Jinping\n                                                                ,\n                                                                                                Liu He\n                                                                ,\n                                                                                                chips\n                                                                ,\n                                                                                                technology\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/17/xi-jinping-picks-top-lieutenant-to-lead-chinas-chip-battle-against-us", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}