{"Type": "", "Time": "2021-06-17", "Headline": "Football: Emotional Ramos in tears as he bids farewell to Real Madrid, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.MADRID (REUTERS) - Sergio Ramos burst into tears as he said farewell to Real Madrid on Thursday (June 17) after 16 years at the club in which he became one of their most iconic players and lifted 22 trophies.Ramos, who made 671 appearances for Real and scored 101 goals including netting in two Champions League finals, ran down his contract with the 13-time European champions and was unable to agree a new deal with the club.\"One of the most difficult moments in my life has arrived, you are never prepared to say goodbye to Real Madrid but the time has come,\" Ramos said before bursting into tears in a farewell ceremony at the club's Valdebebas training ground.\"A marvellous, unique era has come to an end but an exciting new future has opened to me and I'm very keen to demonstrate I can play at the top level for a few more years and add a couple more trophies to my list of honours.\"Club president Florentino Perez, who brought Ramos to Real from Sevilla in 2005, thanked the player for \"making Real Madrid's legend even greater and ensuring it is the most admired club in the world\".\"It's not an easy day because you've been really special to me and you and I have lived and suffered through historic moments for Real Madrid,\" Perez added.\"I wish you all the best and want you to know this will always be your home, a legend like you will always be one of this club's great ambassadors.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-emotional-ramos-in-tears-as-he-bids-farewell-to-real-madrid", "Source": "google"}