{"Type": "", "Time": "2021-06-17", "Headline": "AIA, Prudential and Aviva reprimanded by Singapore authorities for breaching regulatory requirements | Singapore | Malay Mail", "Text": "Loading...Tuesday, 15 Jun 2021 03:42 PM MYT\n\nInvestigations by the Monetary Authority of Singapore found that AIA, Prudential and Aviva failed to review and assess the performance of their supervisors, grade them according to regulations and pay them based on the grades. ― TODAY pic\n\nFollow us on Instagram and subscribe to our Telegram channel for the latest updates.SINGAPORE, June 15 — Insurance companies Aviva, AIA and Prudential have been found by the Monetary Authority of Singapore (MAS) to have breached regulations by not reviewing the performance of their supervisors and for paying them beyond the cap set by regulations.MAS in a release today (June 15) said that the companies have been reprimanded for the offences which happened in 2017 and 2018.MAS has also directed Aviva Financial Advisers to appoint independent individuals outside the company to conduct a review of its internal control processes and to perform call-backs to all customers before any sales are completed. The central bank also singled out Peter Tan Shou Yi, a consultant engaged by Aviva, for accepting the commissions, and Chee Boon Lai Lionel, chief executive of subsidiary Aviva Financial Advisers, for failing to perform his duties. Under the Balanced Scorecard framework set out in 2015 by MAS, financial advisers and the supervisors who manage them are graded from A (the best) to E (the worst) based on the number and category of infractions they make in a quarter. The value of commissions they receive, which is capped in the first year and spread out over a specified period under government requirements, are also linked to their grading. In Aviva’s case, the company had engaged Tan as a consultant from July 2016 to March 2020 but he also acted as a supervisor to the financial advisers representing Aviva Financial Advisers. Despite having frequent and direct interactions with the financial advisers on sales and compliance issues, neither Aviva or Aviva Financial Advisers put in place compliance arrangements to monitor Mr Tan’s activities from the time he joined till April 2019. Aviva Financial Advisers also failed to review Tan’s performance, assign a grade to him and pay him according to the grade, as it should given that he took on supervisory roles and responsibilities, said MAS. In addition, Aviva did not cap and spread his commissions from the sales of insurance products. Tan, on his part, breached commission requirements in accepting the remuneration. MAS said Aviva had contravened risk management practices on internal controls while its subsidiary had breached regulations on financial advisers. Aviva Financial Adviser’s chief executive officer, Chee, was reprimanded by MAS for failing to monitor Tan’s activities and not properly addressing the poor conduct of his company’s financial advisers, who have misrepresented the nature and features of certain insurance products to their customers. “Despite MAS’ repeated supervisory engagements with Aviva Financial Advisers between August 2017 and September 2018 over the sales conduct of its representatives, the measures put in place by Aviva Financial Advisers to address these issues remained inadequate,” said MAS. As for AIA, its subsidiary, AIA Financial Advisers did not review and assess the performance of three of its managing directors who also acted as supervisors of financial advisers. These managing directors were not graded or paid according to the Balanced Scorecard framework and the company did not cap and spread their commissions. Prudential made similar regulatory breaches as AIA for three of its group leaders and a consultant. In addition, Prudential also breached risk management guidelines as it did not put in place enough risk management mitigation procedures and compliance arrangements to monitor the activities of the consultant and group leaders. ― TODAYLoading...© 2021, Malay Mail, All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.malaymail.com/news/singapore/2021/06/15/aia-prudential-and-aviva-reprimanded-by-singapore-authorities-for-breaching/1982370", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}