{"Type": "", "Time": "2021-06-17", "Headline": "Taiwan reports 'record number' of Chinese jets in its air defence zone - BBC News", "Text": "Some 28 Chinese military aircraft flew into Taiwan's air defence zone on Tuesday, said its defence ministry, the largest reported incursion so far. Fighters and nuclear-capable bombers were among those in the so-called air defence identification zone (ADIZ).The incident comes after Nato leaders on Monday warned of the military challenge posed by China. While democratic Taiwan sees itself as a sovereign state, Beijing views the island as a breakaway province.According to Taipei, the Chinese mission included 14 J-16, six J-11 fighters, four nuclear capable H-6 bombers as well as anti-submarine, electronic warfare and early warning aircraft.An air defence identification zone is an area outside of a country's territory and national airspace but where foreign aircraft are still identified, monitored, and controlled in the interest of national security. It is self-declared and technically remains international airspace. The Chinese aircraft flew close to the Taiwan-controlled Pratas Islands, as well as around the southern part of Taiwan itself. China has over recent months regularly carried out flights over the waters between the southern part of Taiwan and the Pratas Islands. On 24 January, a similar mission saw 15 aircraft entering Taiwan's air defence zone while on 12 April, Taiwan reported 25 jets. Tuesday's operation came just one day after Nato leaders at a summit in Brussels warned of the military threat posed by China, calling its behaviour a \"systemic challenge\". China, they said, was rapidly expanding its nuclear arsenal, was \"opaque\" about its military modernisation and was co-operating militarily with Russia.Over the weekend, G7 leaders urged China to \"respect human rights and fundamental freedoms\", highlighting abuses against the Uyghur Muslim minority group and the crackdown on Hong Kong pro-democracy activists.Both statements were strongly criticised and dismissed by China. Nato warns of military challenge posed by ChinaChina accuses G7 of manipulation and slanderFirst crew blasts off to new China space stationThree astronauts successfully take off for China's longest ever human spaceflight mission.Biden and Putin praise talks but discord remainsDecoding Biden and Putin's body language. VideoDecoding Biden and Putin's body languageWhy cyber gangs won't worry about US-Russia talks'I walked three days to find a hospital for my son'Covid threat to India's holiest river. VideoCovid threat to India's holiest riverThe vast European mine infuriating the neighboursDecoding Biden and Putin's body language. VideoDecoding Biden and Putin's body languageWhat's going on in Iran's election?‘Mindset shifting’ as more Australians ditch boozeBBC Worklife: The myth of a new digital-nomad movementCruising industry still in choppy watersFootball phrases15 sayings from around the worldKim Jong-un admits North Korea food concerns1First crew blasts off to new China space station2Eriksen to have heart-starting device3Major Australian banks hit by website outage4Botswana diamond could be world's third largest5‘Mindset shifting’ as more Australians ditch booze6World Bank rejects El Salvador Bitcoin request7The 32-year-old taking on Big Tech8The vast European mine infuriating the neighbours9Biden and Putin praise talks but discord remains10© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "Section": "", "Writers": "", "URL": "https://www.bbc.com/news/world-asia-china-57493353", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}