{"Type": "", "Time": "2021-06-17", "Headline": "Malaysia considering mixing Covid-19 vaccines to boost efficacy: Khairy, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.PETALING JAYA (THE STAR/ASIA NEWS NETWORK) - Malaysia's government is considering mixing two different vaccines to boost efficacy against different Covid-19 variants, Science Minister Khairy Jamaluddin said on Wednesday (June 16), as he also revealed a shift in his perspective towards herd immunity.Mr Khairy said he was moving away from achieving herd immunity in Malaysia, as he expects Covid-19 to be endemic in the country.\"I've stopped using that term,\" he said at a webinar. \"I've advised the Prime Minister to be careful in using the term 'herd immunity', simply because my view as the coordinating minister, looking at the data and the science, is that this very well may be endemic and we may see Covid-19 in a less threatening form, but it will stay with us for quite some time.\"What the world will look like, or what Malaysia will look like in 2022, is a mixture of people who have been fully vaccinated as well as rapid test kits that can be used on a daily basis, and I think we need to introduce that as part of our lives.\"The National Immunisation Programme (NIP) had set a target of vaccinating 80 per cent of the population to achieve herd immunity against Covid-19.Mr Khairy, also the coordinating minister for the NIP, said the authorities are also looking at real-world data received from Germany on heterologous vaccinations using vaccines from AstraZeneca for the first dose, then Pfizer-BioNTech as the second dose.Heterologous vaccinations, Mr Khairy said, was a method of using two different vaccines to boost efficacy against different variants.He added that data from this has so far shown it to have boosted neutralising antibodies and better effectiveness against different variants.\"We are watching this very closely. We do not want to make a quick decision on this before getting more data.\"The data points are coming in for heterologous vaccinations, and once the technical working group is clear on that, it will advise the committee that I chair with the Health Minister. We will then implement the heterologous vaccinations,\" Mr Khairy said during a webinar titled The Path To Herd Immunity organised by The Oxford & Cambridge Society Malaysia on Wednesday.He noted that there is a possibility that they will \"end up doing this\", as a lot of countries have been doing it to boost neutralising antibodies and efficacy.\"Also, when you are facing vaccine supply constraints, you can mix it up to ensure that the effectiveness of the vaccine is still there,\" he said.During the webinar, Mr Khairy also said the authorities were thinking of shortening the AstraZeneca dosing interval, but acknowledged being constrained by problems with the AstraZeneca vaccine supply.\"Part of the AstraZeneca supply from Covax was delayed and some of the supplies from Thailand were also slightly delayed. So, we are recalculating our delivery schedules right now to see whether we can shorten the interval period for AstraZeneca,\" he said.The AstraZeneca dosing interval is currently 12 weeks.Separately, the Science Minister said his ministry is working closely with the Education Ministry to consider inoculating those who would be in their examination year this year.He said this will include teachers, support staff as well as national exam-year students, as the Pfizer-BioNTech has been approved for those aged 12 to 15.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/malaysia-science-minister-khairy-abandons-herd-immunity-as-govt-considers-mixing", "Source": "google"}