{"Type": "", "Time": "2021-06-17", "Headline": "Wedding guest horrified after turning up in a similar dress to the bridal party - 9Honey", "Text": "By Bianca Farmakis| 9 hours agoA woman was mortified to realise she had turned up to a wedding dressed identically to the bridesmaids, despite not being part of the bridal party.Lisa Marie Torres, who shares regular wedding etiquette content to her TikTok profile, had accompanied her fiance to the wedding, in which he was a groomsman.On her arrival, Torres discovered her pale lilac dress looked shockingly similar to the one worn by the five bridesmaids.RELATED: Bride-to-be slammed after disinviting mother to wedding over her outfit choiceTheir floor-length gowns were the same colour as Torres' below-the-knee dress, and all had a similar halter-top neckline.In her TikTok video, Torres is seen looking up \"wedding etiquette\" and clicking on an article revealing \"the colours you can't wear to a wedding.\"A screenshot of the article states, \"If you're not a bridesmaid, wearing the same colours as the 'maids can make you look like a wannabe.\"RELATED: Bride horrified after mother-in-law shows up to wedding in similar gown\"If you know the bride or one of the bridesmaids well, don't be shy about asking what colour they're wearing so you can include it in your list of colours you can't wear to the wedding,\" the article states.Torres looks shocked, writing in a caption, \"I think I did this.\"She then pans to an image of the bridal party and cuts to a portrait of Torres and her fiance, capturing the similarities between the gowns.TikTok users laughed at Torres' mistake, but many were confused as to how she was supposed to know in the first place.\"How are you supposed to know what colour they are wearing?\" asked one user.\"That's what I asked! It's often on the wedding website - also, the invitation usually shows wedding colours,\" she replied.RELATED: Bride-to-be shocked after mother-in-law buys similar dress for her wedding\"I nearly died of post-event embarrassment. Not sure if this is an actual thing, but this is how I felt.\"Hoping to not repeat her mistake, Torres said she would be attending another wedding the following week where her fiance was a groomsman yet again, but she was not a bridesmaid.\"I'll be wearing black this time instead of their wedding colours,\" she said.Fortunately, the bride confirmed to Torres that she didn't \"even notice\" her matching dress, and said all her guests \"looked great.\"Auto News: Kia's Australian Open Fleet hits the road - caradvice.com.auOnline Coupons and Best DealsEdenSearch properties in AUSTop Utes!© 2021 Nine Digital Pty Ltd© 2021 Nine Digital Pty Ltd", "Section": "", "Writers": "", "URL": "https://honey.nine.com.au/latest/wedding-guest-horrified-after-turning-up-in-a-similar-dress-to-the-bridal-party/21b9bdb9-e56c-4100-b839-3351e0716e8a", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}