{"Type": "", "Time": "2021-06-17", "Headline": "‘Worst of times’: Hong Kong media defiant amid police crackdown | Hong Kong | The Guardian", "Text": "Apple Daily hits back after executives arrested in second raid on pro-democracy paper’s newsroomLast modified on Thu 17 Jun 2021 08.06 EDTApple Daily’s journalism has ruffled feathers since its establishment in 1995. A populist Hong Kong tabloid owned by Jimmy Lai, a pro-Trump media mogul and now jailed activist, the paper is fond of sensational crime stories, celebrity gossip, and investigations into government scandals and corruption. It’s a vocal supporter of the pro-democracy movement, a thorn in the side of police, and has become a symbol of resistance against Hong Kong’s crackdown.Hong Kong’s police commissioner has accused it of creating hatred. Pro-Beijing media have called for it to be shut down. Lai has said the paper is on the right side of history.The raid by police on Thursday on its newsroom – Apple Daily’s second in less than a year – and on the homes of five of its executives, with an unprecedented warrant under Hong Kong’s national security law allowing the seizure of journalistic materials, has appeared to confirm fears that the government’s crackdown on media was now coming for its loudest critic.Authorities said the five arrested executives, including its editor-in chief, Ryan Law, were accused of conspiring to collude with foreign forces, through the publication of more than 30 unspecified articles, breaching one of the most serious clauses of the draconian national security law introduce nearly one year ago.After the first raid in September, when the authorities also arrested Lai, readers rushed to buy copies of the paper and shares in the company. In an age where mass protests are illegal, a photograph went viral of a young man cordoned off by police and surrounded by officers while he quietly read Apple Daily at a train station.Thursday’s events were not unexpected.Less than a month ago, Law told Agence France-Presse that since Lai’s jailing in December staff had asked what they should do if he was arrested. “Do journalism,” he answered. “It will be a big story.”The police operation marked a significant escalation not just against Apple Daily, but the whole of the city’s media. The authorities suggested they saw at least part of Apple Daily’s work as an act against the state, and not of journalism.Hong Kong’s security chief, John Lee, called those arrested – who weren’t yet charged – “perpetrators” and “criminals” who “used journalistic work as a tool to endanger national security”.He urged people to “keep a distance” from them, and not share the unspecified articles, and advised other media to shun their colleagues for the sake of their credibility, because “normal journalists are different from these people”.Journalists peppered Lee with questions, including: what were the offending articles? News? Opinion? What about them was illegal? Why were police looking at articles from 2019 for breaching a 2020 law that authorities said was not retroactive?He declined to answer.When asked about a long-running concern, that journalists can’t know what is illegal under the wording of the law, Lee said the answer was “simple”. But in reality he failed to give one, telling them to just not break the law, likely to lead to further self-censorship out of fear.On Thursday afternoon Apple Daily wrote to readers. “This is the worst of times in Hong Kong,” it said, a city that now felt unfamiliar and “leaves us speechless”. But it vowed to stand firm.“The staff of Apple Daily will hold fast to our duties, and press on till the end to see the arrival of dawn.”", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/world/2021/jun/17/worst-of-times-hong-kong-apple-daily-media-defiant-amid-police-crackdown", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}