{"Type": "", "Time": "2021-06-17", "Headline": "I turned up at a wedding dressed identically to the bridesmaids but I wasn't one - I was so embarrassed", "Text": "News Corp is a network of leading companies in the worlds of diversified media, news, education, and information services.A WOMAN was left horrified after realising that she had accidentally committed one of the biggest wedding fails a guest could make.The TikTok user, @lisalovesrandom, shared how she had turned up at her friend's big day dressed as a bridesmaid - even though she wasn't one.In a video shared to the site, Lisa - who is currently engaged - can be seen researching wedding etiquette.She comes across an article that says: \"If you're not a bridesmaid, wearing the same colour as the 'maids can make you look like a wannabe.\"An image of a bride standing with her bridesmaids in purple dresses then flashes up.Next, an image of Lisa at the same event pops up - and she's wearing an almost identical lavender-hued frock.To make matters worse, Lisa is standing with her fiancé who is a groomsman, making it seem as if she's even keener to slip her way into the bridal party.Captioning the clip, the bride-to-be wrote: \"Have you ever accidentally broken #weddingetiquette? . So sorry @kathleeeenk . I didn’t know.\"The video has been watched thousands of times, and received more than a hundred 'likes'. One person wrote: \"Thank you for everything you're teaching me.\"Another sympathetic person commented: \"How are you supposed to know what colour they are wearing?\"A third shared: \"That's funny.\"Then the bride herself, Kathleen, replied: \"Girl I didn't even notice!! You all looked great.\"Lisa responded: \"Hahaha. So glad you weren't upset. PHEW.\"It comes as Lisa revealed how she had presented her bridesmaids with a list of all the costs for her wedding.In other wedding news, we told you how a budget bride was savaged for her foam cake.We also revealed how a cheeky bride asked strangers to donate to her big day via PayPal.And a groom checked his phone as his bride walked down the aisle in viral TikTok video. Daily horoscope today – The Sun's FREE news and updates for your star sign June 17: Give someone special space and feel your own heart grow Stranger leaves mum with crying baby a note - but it’s not what you think How Martine McCutcheon overcame ‘chubby’ swipe to look better than ever at 45©News Group Newspapers Limited in England No. 679215 Registered office: 1 London Bridge Street, London, SE1 9GF. \"The Sun\", \"Sun\", \"Sun Online\" are registered trademarks or trade names of News Group Newspapers Limited. This service is provided on News Group Newspapers' Limited's Standard Terms and Conditions in accordance with our Privacy & Cookie Policy. To inquire about a licence to reproduce material, visit our Syndication site. View our online Press Pack. For other inquiries Contact Us. To see all content on The Sun, please use the Site Map. The Sun website is regulated by the Independent Press Standards Organisation (IPSO)", "Section": "", "Writers": "", "URL": "https://www.thesun.ie/fabulous/7153807/wedding-dressed-bridesmaids/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}