{"Type": "", "Time": "2021-06-17", "Headline": "TikTok Owner ByteDance’s Annual Revenue Jumps to $34.3 Billion - WSJ", "Text": "SINGAPORE—ByteDance Ltd., the owner of popular short-video app TikTok, told employees that its revenue last year more than doubled to $34.3 billion, underscoring why the Chinese technology giant is one of the world’s hottest startups.The privately held company on Thursday shared highlights of its 2020 financial performance with its employees. ByteDance said its total revenue grew 111% from a year ago, while gross profit rose 93% to $19 billion, according to excerpts of a company memo viewed by The Wall Street Journal.ByteDance had about 1.9 billion monthly active users across all its platforms as of December 2020, according to the memo. The company also runs viral apps such as Douyin, the domestic Chinese equivalent of TikTok, and a news aggregation app called Jinri Toutiao.The Beijing-based firm told staffers that it incurred a $2.1 billion operating loss from January to December last year. The loss was partly due to higher expenses incurred from share-based compensation to workers, according to a person familiar with the matter. For 2019, ByteDance had reported an operating profit of $684 million.Its net loss for 2020 totaled $45 billion, due largely to an accounting adjustment the company made for an increase in the fair value of its convertible redeemable preferred shares. Startups that have raised outside funds often have to take these noncash charges as their valuations rise, if they prepare results in line with International Financial Reporting Standards.We are delighted that you'd like to resume your subscription.You will be charged\n        $ + tax\n        (if applicable) for The Wall Street Journal.\n        You may change your billing preferences at any time in the Customer Center or call\n        Customer Service.\n        You will be notified in advance of any changes in rate or terms.\n        You may cancel your subscription at anytime by calling\n        Customer Service.\n      Please click confirm to resume now.WSJ MembershipCustomer ServiceTools & FeaturesAdsMoreDow Jones Products", "Section": "", "Writers": "", "URL": "https://www.wsj.com/articles/tiktok-owner-bytedances-annual-revenue-jumps-to-34-3-billion-11623903622", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}