{"Type": "", "Time": "2021-06-17", "Headline": "Chilly response: Former PAP MP gets a taste of winter after angry netizens flood his Instagram account with snowflake emoticon - The Online Citizen Asia", "Text": "Former People’s Action Party (PAP) Member of Parliament (MP) Amrin Amin gets a taste of winter after netizens began flooding his Instagram account with the snowflake emoticon under his most recent posts.A member of the public had earlier criticised the former Parliamentary Secretary for being “out of touch” when the latter opined on Monday (14 June) that the People’s Association (PA)’s faux pas of using a Malay couple’s wedding photograph as a prop in its Hari Raya Aidilfitri display at an HDB estate in Tiong Bahru is not a racist incident.Mr Amrin, however, responded by calling him a “snowflake”, which drew a lot of flak from other netizens.In the comments section of Mr Amrin’s post about the incident, one netizen replied that other individuals from minority communities do not have to agree with Mr Amrin’s assessment of whether the incident is racist or not.“No offense, but just cos you don’t see it as racist don’t mean the rest of us minorities have to agree with you. Stop being out of touch,” the netizen wrote.The slew of snowflake emojis on Mr Amrin’s Instagram posts came after it was disclosed by several users that accounts posting comments mentioning the word “snowflake” have been blocked from Mr Amrin’s page, following the exchange on Monday.A contributor told Wake Up, Singapore: “He/his PR team is blocking anyone who comments the word ‘snowflake’ on his posts”.Sharing a TikTok video he made to celebrate the Dragon Boat Festival, Mr Amrin shared that he “made ‘bak chang’ (meat rice) dumplings with family”.“Did you make any? I wish you and family peace and health this Dragon Boat Festival. 祝大家端午安康!” He added.A post shared by Amrin Amin (@amrinamin)Users did not hesitate to poke fun at Mr Amrin’s post, leaving comments with references to snowflakes, in addition to the numerous comments only containing snowflake emoticons.“wishing you the same, snowflake,” said one commenter.“Eh your dumplings got snowflake flavour or not ah,” wrote another.“Can we have snowflake festival instead?” One commenter joked.Several commenters made references to Elsa of Arendelle, a fictional character from the Disney film franchise “Frozen” who is well-known for her superpower of creating and controlling ice and snow.“Elsa would be proud of this comment section,” said one user. Two other most recent posts — one about COVID-19 testing, the other about the easing of pandemic restrictions — were not spared from the cold as users proceeded to leave multiple comments with snowflake emoticons. The word snowflake is derogatory slang for a person deemed to be very sensitive or easily offended. According to the Collin’s Dictionary definition, it means: “Someone deemed too emotionally vulnerable to cope with views that challenge their own, particularly in universities and other forums once known for robust debate.”In his post on Monday (14 June), Mr Amrin shared the PA’s latest statement on the use of the wedding photo in its Hari Raya decorations at Radin Mas which caused an uproar two weeks ago when the woman whose photo was used called out the PA for its actions.Following the incident, the PA issued a public apology, however Ms Sarah Bagharib said that the apology shed light on “glaring gaps” that reflect a “very superficial understanding of the gravity of the issue”.In response, the PA made a statement on its Facebook page on Monday referencing her interview with Nanyang Technological University professor Walid Jumblatt Abdullah, from which she was quoted as saying that the incident has perpetuated a culture of racism.The PA said: “These are accusations we reject. While the error was culturally insensitive, it was certainly not racist. It is not right to raise the allegation of racism, without basis, to stoke emotions and sentiments.”The organisation claimed that it had explained to Ms Sarah that while it acknowledges that its staff “should have been more culturally sensitive”, it is not right to paint “sweeping conclusions from this incident”, adding that it was an “isolated case”.The PA went on to describe Ms Sarah’s public call for messages or suggestions that they would like to have relayed to the organisation in their meeting as “odd”, adding that it does not see why that meeting should be “appropriated” as a platform for public grievances unrelated to the incident.As such, the PA said that it will not be following through with the meeting as there is “no point” in doing so, in light of the above.Sharing the PA’s statement on his own Facebook page on the same day, Mr Amrin wrote that the lesson in this who situation is that while it is wrong to use a person’s photo without permission and that weddings do no equate to Hari Raya, what the PA did was not “racist”.“As we call out racism, we must be careful not to label every error as borne out of racism or ‘racist culture’.” said the former MP of Sembawang GRC.He went on to say that while it is crucial to point out shortcomings, people should not be too hasty to “cancel” and always look out for “opportunists eager to score points in their desire to gain mileage at any cost, without regard to sincere ongoing ground efforts”.He concluded, “Grace is important in building harmony in a diverse society. No one is perfect. It’s a work-in-progress. Not every slip is Armageddon.”Mr Amrin’s remarks, however, were largely met with indignation from netizens. Some expressed shock at his move to call Ms Sarah an “opportunist”.Many pointed out that Mr Amrin appears to be out of touch with his community and that they are glad he is no longer in office, as his views do not represent that of the people in the Malay community. © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/15/chilly-response-former-pap-mp-gets-a-taste-of-winter-after-angry-netizens-flood-his-instagram-account-with-snowflake-emoticon/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}