{"Type": "", "Time": "2021-06-17", "Headline": "Azmin: King's call for Parliament to reconvene in line with govt's intentions | The Star", "Text": "\n                    Thursday, 17 Jun 2021\n                International Trade and Industry Minister Datuk Seri Mohamed Azmin Ali (right) and Penang Chief Minister Chow Kon Yeow (center) having a light moment with factory worker Ong Hock Keah, 48 at the vaccination centre (PPV) under the Program Imunisasi Industri Covid-19 Kerjasama Awam-Swasta (Pikas) at Bukit Jawi Golf Resort in Nibong Tebal, Penang, Thursday.NIBONG TEBAL: The Yang di-Pertuan Agong's call for Parliament to reconvene as soon as possible is in line with the government's intentions, says Datuk Seri Azmin Ali.The Senior Minister said the government has all the while intended to reconvene Parliament when the time is right.\"The government constantly ensures that all actions or efforts taken within the past one year are in accordance with the Federal Constitution and the laws of the country.\"In the context of the Parliament meeting, the Prime Minister himself has stated that it will reconvene. He never said that Parliament would not convene.\"For me, the King's call is in line with the government's intention to have the Parliament meeting when the time is suitable to ensure democratic processes are upheld,\" the International Trade and Industry Minister said on Thursday (June 17).He said the country cannot afford to see its healthcare system collapse, adding that continuous efforts to contain the spread of Covid-19 have so far been successful.\"We have rolled out two vaccination programmes – the National Covid-19 Immunisation Programme and the public-private partnership immunisation programme for the industries (Pikas) – with the aim to accelerate the process towards achieving herd immunity,\" he said.Azmin added that Tan Sri Muhyiddin Yassin had never taken any unilateral action by himself.\"In the National Security Council meetings, leaders of all states are involved for their views to be heard before decisions are made.\"Health director-general Tan Sri Dr Noor Hisham Abdullah had said in May that if we did not take stern action, the number of daily Covid-19 cases might reach up to 13, 000, according to forecasts using R-naught (R0) and Susceptible-Exposed-Infectious-Removed (SEIR) models.\"But, as you can see, on June 14, only 4, 900 new Covid-19 cases were recorded.\"This shows that steps taken by the government to battle Covid-19 have been effective,\" he said.Azmin also said the implementation of the various movement control orders and supporting the healthcare sector through the allocation of billions of ringgit are to ensure that they do not collapse.\"In September, based on the same SEIR model, Dr Noor Hisham forecast that the number of Covid-19 cases might reach up to 40, 000 daily.\"If that happens, our healthcare system will collapse.\"As a responsible government that consults experts for their recommendations before decisions are made, the decisions made are for the priority of the people and country.\"I'm glad that the efforts have resulted in success shared by everyone,\" said Azmin after checking out the Pikas programme at Bukit Jawi Golf Resort here.On Wednesday (June 16), the King called for Parliament to be reconvened as soon as possible.Istana Negara Comptroller of the Royal Household Datuk Ahmad Fadil Shamsuddin said that Yang di-Pertuan Agong Al-Sultan Abdullah Ri'ayatuddin Al-Mustafa Billah Shah conveyed this after looking at all the views presented by the political leaders, the Special Independent Committee on Emergency and experts as well as government agencies.A statement issued said it was to allow the Emergency Ordinance and the National Recovery Plan to be debated by members of the Dewan Rakyat.His Majesty also called on the government to act decisively to simplify bureaucracy and speed up the Covid-19 vaccination process in order for the country to achieve herd immunity as early as possible.\nTags / Keywords:\nAzmin Ali\n                                                                ,\n                                                                                                Parliament\n                                                                ,\n                                                                                                Reconvene\n                                                                ,\n                                                                                                Yang di-Pertuan Agong\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/news/nation/2021/06/17/azmin-king039s-call-for-parliament-to-reconvene-in-line-with-govt039s-intentions", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}