{"Type": "", "Time": "2021-06-17", "Headline": "Airlines, Banks And Other Companies Across The World Hit In Latest Web Outage : NPR", "Text": "\n\n      Jaclyn Diaz\n    \n\n                Virgin Australia was one of several major companies to be hit with technical issues Thursday that affected websites and mobile applications for airlines, banks and other corporations.\n                \n                \n                    \n                    Rick Rycroft/AP\n                    \n                \nhide caption\nVirgin Australia was one of several major companies to be hit with technical issues Thursday that affected websites and mobile applications for airlines, banks and other corporations.Several major companies, financial institutions and airlines from the U.S. to Australia and Hong Kong suffered brief online outages Thursday due to a third-party IT provider. The outage appeared to affect each company's website and mobile applications.  Internet monitoring websites including ThousandEyes and Downdetector.com showed disruptions across the world. In Australia, major banks and airlines were hit by the outage, affecting business in the middle of the day.This all comes a week after a similar major outage at the cloud service company Fastly. On June 8, dozens of sites were disrupted, including The New York Times, CNN, some Amazon sites, Twitch, Reddit, The Guardian and the U.K. government's homepage. It took at least an hour for Australia's Commonwealth Bank to start to see services return to normal Thursday after its tech issues. The bank tweeted that it was \"urgently investigating the outage\" of several of its services.  Virgin Australia, an airline, reported problems with its website and Guest Contact Centre. The company said an issue with the \"Akamai content delivery system\" was to blame for the service problems across the world. \"We are working with them to ensure that necessary measures are taken to prevent these outages from reoccurring,\" the company said in a statement. Akamai is a third-party system used for IT network authentication for the airline.Akamai Technologies didn't immediately respond to NPR's request for comment. Major airlines in the U.S., including Delta, American, Southwest and United, experienced outages at around 1 a.m. ET. Financial institutions, Discover and Navy Federal Credit Union also suffered tech issues. Hong Kong's stock exchange, one of the largest in the world, also had technical problems in the middle of the day. NPR thanks our sponsorsBecome an NPR sponsor", "Section": "", "Writers": "", "URL": "https://www.npr.org/2021/06/17/1007496797/airlines-banks-and-other-companies-across-the-world-hit-in-latest-web-outage", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}