{"Type": "", "Time": "2021-06-17", "Headline": "Wife objects to husband's extramarital affair; he kills her", "Text": "A Delhi man, 25, was arrested here on Wednesday for allegedly killing his wife and later misleading investigators by cooking up a false story, police said.Vikas killed his wife Priyanka as she had objected to his extramarital relationship with one of his sisters-in-law, they said.The couple also had differences over issues related to taking care of their newborn, they said.On Tuesday, Vikas had an argument with his wife, and in the night, he stabbed her to death with a knife, police said.After killing her, Vikas made an acquaintance of his call the police control room (PCR). He stated that a thief entered his house in south Delhi's Ranhola area and killed his wife, they said.On reaching the spot, police found stab injuries to the woman’s neck. Her body was on a bed, police said.They said a case of murder was registered. When Vikas was questioned, he initially said a thief had entered the house and escaped from one of the upper floors after killing his wife, Deputy Commissioner of Police (Outer) Parvinder Singh said.'During the course of investigation, it was revealed that at that time Priyanka and Vikas were sleeping in the same room with their newborn. The version narrated by Vikas was, however, not found to be convincing. The spot was carefully examined, which revealed that neither the main gate nor the other doors of the house were tampered from outside,' he said.When Vikas was questioned about minor injuries on his body, he could not give any satisfactory explanation and after sustained interrogation, Vikas revealed that he had killed his wife as she used to frequently object to his extramarital affair, Singh said.He also had differences with his wife over taking care of the baby, the officer said.'On Tuesday, Vikas had an argument with his wife and to teach her a lesson, he bought a cutter knife blade and stabbed her during the night. Thereafter, in order to save himself, he cooked up a false story and got a person known to him make a PCR call that some thief entered his house and murdered his wife,' the DCP said.Vikas, who previously worked as a cab driver, was not found involved in any other case, police said, adding the knife was recovered on his instance. (Inputs from PTI)Burner phones, safehouses, sheltering with rebels and months away from loved ones -- Myanmar anti-coup activists have been driven underground by a brutal crackdown but have no regrets about choosing life on the run.The freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.China’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the buHong Kong police rounded up 79 people in a series of raids that shut down two underground casinos and an unlicensed pub in the span of two hours on Tuesday night. In one raid on a Ko Shing Street flat in Sai Ying Pun, officers found a baccarat table and two large televisions used to play online card games, seizing HK$215,000 (US$27,697) in cash, HK$410,000 in chips and five account books. Sixteen men and six women, aged 31 to 74, were inside the premises when officers from the Western special duIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Browsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.Beijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityChinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiThe US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Los Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.Deposed Myanmar leader Aung San Suu Kyi went on trial for sedition in a junta court Tuesday, more than four months after her government was ousted in a coup that has thrown her country into turmoil.For Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.When 28 Chinese warplanes streaked through the skies around Taiwan on Tuesday – the largest such incursion this year – they followed a pattern that has generated alarm among US and Taiwanese military planners.Australia recommended that AstraZeneca's Covid-19 jab should not be given to people under 60 on Thursday, a fresh blow to the country's glacial vaccine rollout.Italy became the first team to reach the knockout stage of Euro 2020 as midfielder Manuel Locatelli scored twice in a 3-0 win over Switzerland in Rome on Wednesday, while Wales moved to the brink of joining them by beating Turkey.The UN aviation agency said Wednesday it will release an interim report next week on the diversion of a Ryanair flight by Belarus that caused a global outcry.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neThe European Union and United States launched a trade and technology council that seeks to “write the rules of the road” on the global economy, in the face of growing competition from China. It was the latest salvo against Beijing on US President Joe Biden’s whistle-stop European tour, which had seen him succeed in rallying support among the G7, Nato and now EU for a much-vaunted transatlantic coalition to face down China’s rising influence. A joint EU-US statement said the council would focus oThe strategic partnership sees EMERGE working with Mediacorp's Bloomr.SG network to \"develop the knowledge and skills of up-and-coming\" content creators in esports.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/wife-objects-to-husbands-extramarital-affair-he-kills-her-051503833.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}