{"Type": "", "Time": "2021-06-17", "Headline": "The Big Story: 14 new Covid-19 community cases in S'pore; no imported cases for first time in nearly a year, Multimedia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Catch up on the hottest topics on The Straits Times' weekday talk show.The Big Story, broadcast every weekday at 5.30pm on Facebook and YouTube, has reporters and senior editors discussing the top stories of the day.The show is helmed by multimedia correspondent Hairianto Diman and assistant video editor Olivia Quay, and airs live from ST's digital studio.There were 14 confirmed Covid-19 cases as at Tuesday noon (June 15). All were locally transmitted within the community.There were no imported cases, the first such instance since June 29, 2020.Meanwhile, long queues formed at the temporary Covid-19 testing area at Block 125A Bukit Merah View on Tuesday, after the site was opened to residents.Set up on Monday, the site was intended for the mandatory testing of about 85 stallholders at 116 Bukit Merah View after a new cluster formed at the nearby 115 Bukit Merah View Market and Food Centre.Separately, with the Covid-19 vaccination exercise under way, companies in Singapore may have different operating procedures for staff planning to get their jabs. A number have rolled out initiatives to support the national vaccination programme, while others are not as supportive.Mr Alvin Goh, executive director of the Singapore Human Resources Institute shares his views on this matter.Also on the show - football heavyweights France and Germany are set to face off at Euro 2020 on Tuesday night.ST sports correspondent Sazali Abdul Aziz weighs in the teams' performances in the competition and predicts the winner of this match.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/multimedia/the-big-story-14-new-covid-19-community-cases-in-spore-no-imported-cases-for-first-time", "Source": "google"}