{"Type": "Asia", "Time": "2021-06-17", "Headline": "After massed plane incursion near Taiwan, China says must respond to 'collusion'", "Text": "BEIJING/TAIPEI: China does not tolerate foreign forces intervening in Taiwan issues and has to make strong responses to such acts of \"collusion\", the government said on Wednesday (Jun 16) after the island reported the largest incursion to date of Chinese aircraft.Twenty-eight Chinese air force aircraft, including fighters and nuclear-capable bombers, entered Taiwan's air defence identification zone (ADIZ) on Tuesday, the island's government said.The incident came after the Group of Seven leaders issued a joint statement on Sunday scolding China for a series of issues and underscored the importance of peace and stability across the Taiwan Strait, comments China condemned as \"slander\".Asked at a news conference whether the military activity was related to the G7 statement, Ma Xiaoguang, spokesman for China's Taiwan Affairs Office, said it was Taiwan's government that was to blame for tensions. Beijing believes the island's government is working with foreign countries to seek formal independence.\"We will never tolerate attempts to seek independence or wanton intervention in the Taiwan issue by foreign forces, so we need to make a strong response to these acts of collusion,\" Ma said.Democratically-ruled Taiwan has complained over the last few months of repeated missions by China's air force near the island, concentrated in the southwestern part of its air defence zone near the Taiwan-controlled Pratas Islands.However, this time not only did the Chinese aircraft fly in an area close to the Pratas Islands, but the bombers and some of the fighters flew around the southern part of Taiwan near the bottom tip of the island, according to Taiwan's defence ministry.The fly-by happened on the same day the US Navy said a carrier group had entered the disputed South China Sea.A senior official familiar with Taiwan's security planning told Reuters that officials believed China was sending a message to the United States as the carrier group sailed through the Bashi Channel, which separates Taiwan from the Philippines and leads into the South China Sea.\"It's strategic intimidation of the US military. They wanted the United States to notice their capability and for them to restrain their behaviour.\"Taiwan needs in particular to pay attention to the fact that China's military has started conducting drills in Taiwan's southeastern ADIZ, the source added.This \"to a certain degree was targeting our deployments in the east and increasing air defence pressure around our ADIZ\", the source said.Taiwan's east coast is home to two major air bases with hangers dug out of the side of mountains to provide protection in the event of a Chinese assault.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Taiwan,China", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/taiwan-china-air-force-incursion-pratas-islands-collusion-15024946", "Source": "google"}