{"Type": "", "Time": "2021-06-17", "Headline": "All 14 new COVID cases in Singapore in community", "Text": "SINGAPORE — The Ministry of Health (MOH) on Tuesday (15 June) confirmed 14 new COVID-19 cases in Singapore, taking the country's total case count to 62,315.All of them are local cases in the community, of whom nine of 10 linked cases belong to the 115 Bukit Merah View Market & Food Centre cluster. The cluster now has 25 cases.Tuesday marks the 51st consecutive day with local cases reported as well as the first time since 29 June last year to have no imported cases reported.\"Amongst the new cases today, four are asymptomatic, and were detected from our proactive screening and surveillance, while 10 were symptomatic,\" said the MOH.The four unlinked cases in the community are:a 41-year-old Filipino woman who is a foreign domestic worker (received first dose of vaccine)a 36-year-old Singaporean woman who is a homemakera 30-year-old Singaporean woman who works as a sales representative at Imperva Singaporea 35-year-old Singaporean man who is currently unemployedSeparately, one case has been linked to the 36-year-old woman, who is his family member and household contact. He is a 35-year-old Singaporean man who works as a senior executive at NETS.The ministry noted that the number of new cases in the community has decreased from 93 in the week before to 60 in the past week. The number of unlinked cases in the community has increased from 10 in the week before to 18 in the past week.The MOH also announced the closure of two clusters – \"Case 63290\" and White Sands – as there have been no cases linked to them for the past two incubation periods, or 28 days. Singapore currently has 44 active COVID-19 clusters.The cluster was first linked to a 74-year-old Singaporean man who works at a sundry store at the food centre. The fully-vaccinated man was confirmed to have COVID-19 on 9 June.Three of the nine new cases linked to the cluster work at the food centre and had been quarantined earlier:a 37-year-old female India national who is a food stall vendora 77-year-old Singaporean man who is a food stall vendor (fully vaccinated)a 39-year-old male India national who is a food stall vendor (fully vaccinated)Of the remaining six, most are family members or household contacts, or both, of cases in the cluster:a 30-year-old male India national who works as a supervisor at Keong Hong Construction (quarantined earlier)a 33-year-old female permanent resident who is a cleaner employed by SATS Facility Management (quarantined earlier)a 35-year-old Singaporean woman who is a teacher at KidsCampus at Chai Cheea 87-year-old Singaporean man who is a retiree; frequently visits 115 and 116 Bukit Merah View (link to cluster cases not mentioned)a 35-year-old male India national who works as a sales executive at Halnaz Frozen Goods (link to cluster cases not mentioned)a 72-year-old Singaporean man who is a retiree (fully vaccinated, link to cluster cases not mentioned)The food centre, initially planned for a 13 to 15 June closure, will now be closed to members of the public till 26 June, said the MOH on Tuesday. This is due to the detection of more cases amongst the market and food centre staff and their close contacts, which suggests that there is \"ongoing spread with wider transmission\", the ministry noted.All staff and tenants who have been working at 115 Bukit Merah View Market & Food Centre from 25 May have been placed on quarantine, and are tested during quarantine.The MOH said that special testing operations have commenced on Monday for all staff and tenants who have been working in 116 Bukit Merah View from 25 May. Free COVID-19 testing has also been extended to members of the public who had visited the shops at 115 and 116 Bukit Merah View between 25 May and 12 June, it added. These testing operations are in progress, said the MOH.\"All visitors to 115 and 116 Bukit Merah View between 25 May and 12 June are advised to monitor their health closely, and minimise social interactions as far as possible, for 14 days from their date of visit. They are encouraged to see a doctor immediately if they feel unwell,\" the ministry stressed.With 17 more patients discharged from hospitals or community isolation facilities on Tuesday, 61,911 cases – or 99.4 per cent of the total – have fully recovered from the infection.Most of the 137 hospitalised cases are stable or improving, while two of them are in critical condition in the intensive care unit.A total of 233 patients – with mild symptoms or are clinically well but still test positive – are isolated and cared for at community facilities.Apart from the 34 patients who have died from COVID-19 complications, 15 others who tested positive for the virus were determined to have died from unrelated causes, including three whose deaths were attributed to a heart attack and another four, whose deaths were attributed to coronary heart disease.Among the 96 confirmed cases reported from 9 to 15 June, 40 cases have tested positive for their serology tests, 41 have tested negative, and 15 serology test results are pending.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:'Not possible to have fair hearing': Woman without mask at MBSMan who smuggled 3 dogs and 3 cats from pet shop in JB jailed 24 weeksE-scooter, PAB riders must pass online theory test from 1 Jan 2022Burner phones, safehouses, sheltering with rebels and months away from loved ones -- Myanmar anti-coup activists have been driven underground by a brutal crackdown but have no regrets about choosing life on the run.The freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.China’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the buHong Kong police rounded up 79 people in a series of raids that shut down two underground casinos and an unlicensed pub in the span of two hours on Tuesday night. In one raid on a Ko Shing Street flat in Sai Ying Pun, officers found a baccarat table and two large televisions used to play online card games, seizing HK$215,000 (US$27,697) in cash, HK$410,000 in chips and five account books. Sixteen men and six women, aged 31 to 74, were inside the premises when officers from the Western special duIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Browsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.Beijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityChinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiThe US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Los Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.Deposed Myanmar leader Aung San Suu Kyi went on trial for sedition in a junta court Tuesday, more than four months after her government was ousted in a coup that has thrown her country into turmoil.For Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.When 28 Chinese warplanes streaked through the skies around Taiwan on Tuesday – the largest such incursion this year – they followed a pattern that has generated alarm among US and Taiwanese military planners.Australia recommended that AstraZeneca's Covid-19 jab should not be given to people under 60 on Thursday, a fresh blow to the country's glacial vaccine rollout.Italy became the first team to reach the knockout stage of Euro 2020 as midfielder Manuel Locatelli scored twice in a 3-0 win over Switzerland in Rome on Wednesday, while Wales moved to the brink of joining them by beating Turkey.The UN aviation agency said Wednesday it will release an interim report next week on the diversion of a Ryanair flight by Belarus that caused a global outcry.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neThe European Union and United States launched a trade and technology council that seeks to “write the rules of the road” on the global economy, in the face of growing competition from China. It was the latest salvo against Beijing on US President Joe Biden’s whistle-stop European tour, which had seen him succeed in rallying support among the G7, Nato and now EU for a much-vaunted transatlantic coalition to face down China’s rising influence. A joint EU-US statement said the council would focus oThe strategic partnership sees EMERGE working with Mediacorp's Bloomr.SG network to \"develop the knowledge and skills of up-and-coming\" content creators in esports.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/all-14-new-covid-cases-in-singapore-in-community-074801883.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}