{"Type": "", "Time": "2021-06-17", "Headline": "Delta variant symptoms: Headache or runny nose signs of UK's most dominant strain | Express.co.uk", "Text": "When you subscribe we will use the information you provide to send you these newsletters. Sometimes they'll include recommendations for other related newsletters or services we offer. Our Privacy Notice explains more about how we use your data, and your rights. You can unsubscribe at any time.  The Delta variant, first identified in India, is now accounting for 90 percent of Covid cases in the UK. When it comes to symptoms for this particular variant there are two main indicators which have changed from previous symptoms.  Data compiled from the ZOE Covid study from King’s College, London have listed the two main symptoms warning of a person’s potential risk to the Delta variant.The study indicated headaches and a runny nose could be the main symptoms, said study lead professor Tim Spector.He added that data indicated the variant appeared to be far more transmissible with every person infected passing it on to six others.READ MORE: 'We have a legal duty!' Furious nurse slams those refusing to take jab    According to the NHS, the classic Covid symptoms are fever, cough and loss of smell or taste.But Professor Spector added that the top symptoms reported by those suffering from the Delta variant have changed.Most of these infections are occurring in unvaccinated people, Professor Spector said.DON'T MISSGB News clash as host branded a 'hypocrite' in fiery vaccine debate - INSIGHTCharlie Mullins rages at anti-vaxxers: 'You won't have a job!' - VIDEOCan you catch Covid after the vaccine? - EXPLAINER  He continued: “We’re only seeing slight increases in the vaccinated group and most of those in the single vaccinated group.“Covid is also acting differently now.“It’s more like a bad cold in this younger population and people don’t realise that and it hasn’t come across in any of the government information.“This means that people might think they’ve got some sort of seasonal cold, and they still go out to parties and might spread around to six other people and we think this is fuelling a lot of the problem.”    The Centres for Disease Control and Prevention (CDC) have listed other potential Covid symptoms to spot which include:    In England, 39,061 cases of the Delta variant have now been confirmed, with 2,035 in Scotland, 184 in Wales and 43 in Northern Ireland.Of those, 42 Britons have died from the Delta variant - 12 were fully vaccinated, 23 were unvaccinated, and seven had received their first dose more than 21 days before.With cases of the Delta variant increasing, coronavirus restrictions in the UK have now been extended for another month. See today's front and back pages, download the newspaper, order back issues and use the historic Daily Express newspaper archive.", "Section": "", "Writers": "", "URL": "https://www.express.co.uk/life-style/health/1450737/delta-variant-symptoms-uk-covid-signs-headache-runny-nose", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}