{"Type": "", "Time": "2021-06-17", "Headline": "Blackstone Buying Developer Soho China in $3B Deal - Mingtiandi", "Text": "MingtiandiAsia real estate and outbound investment newsA password will be e-mailed to you.\nUsername\n\n\nE-mail\n\n\n\n2021/06/16 by Michael Cole Leave a Comment Bund Soho is the firm’s most successful project in ShanghaiJust 10 months after the COVID-19 pandemic derailed an attempt to take private one of China’s largest commercial developers, Blackstone Group has agreed to acquire Soho China through a new deal worth HK$23.7 billion ($3 billion), according to a stock market announcement on Wednesday.The Beijing-based developer told the Hong Kong exchange that funds managed by Blackstone have agreed to pay HK$5.00 each for the company’s 5.2 billion issued shares, which would give the US fund manager the rights to Soho China’s portfolio of nine office properties in Shanghai and Beijing.A pair of companies controlled by Zhang Xin, Soho’s chief executive and the wife of chairman Pan Shiyi, have already agreed to sell 2.85 billion shares in the developer to Blackstone, giving the private equity giant a 54.93 percent holding in the company. Pan has no direct shareholding in the company.“We’re thrilled to announce this investment in Soho China to expand our footprint in China,” Blackstone real estate managing director Justin Wai said in a statement. “China is a key market for our Asia business where we’ve built a diverse real estate portfolio across office, retail, logistics, and residential.”In its statement, Soho said that the company has established a committee composed of its independent board directors to review the Blackstone offer before advising independent shareholders regarding the terms of the deal and whether they should be accepted.Following completion of the transaction, Blackstone intends to retain the stock market listing for Soho China and does not intend to pursue any compulsory acquisition strategies. Companies controlled by Zhang are set to maintain a 9 percent stake in the firm.The buyout offer represents a 99.5 percent premium over Soho China’s average trading price of HK$2.51 per share over the thirty days ending yesterday, when trading was halted.Soho founders Zhang Xin (left) and Pan Shiyi have some reasons to smileHowever, that markup also reflects the realities of China’s commercial real estate world post-pandemic, with Soho China’s share price having slid around 15 percent since the beginning of 2020.That slide may explain in part the disparity in value from last year’s discussions, with the offer unveiled on Wednesday shaving nearly 24 percent off the reported HK$31 billion value of the proposal revealed in March of last year.In announcing an end to its privatisation discussions in August 2020, Soho China said the talks had concluded without the two sides having reached agreement on terms. This year’s offer is being managed by Goldman Sachs, according to today’s announcement.During 2020, Soho China notched revenue of RMB 2.2 billion ($342 million), an increase of about 19 percent from the previous year. But the company’s pre-tax profit of RMB 1.6 billion marked a 17 percent slide from the 2019 total.Since the earlier buyout attempt, two of Blackstone’s senior executives associated with the deal have left the company, with former head of China real estate Tim Wang having headed for the exit in September of last year, before joining GLP just two months ago.Former Blackstone managing director Yan Yan, who had served as president of Soho China during a more than two-decade career with the company before joining the US private equity firm, was announced as a strategic advisor to China’s Hillhouse Capital in January of this year.In its statement Wednesday, Blackstone said it looks forward to working with Soho’s founders and management in optimising the company’s assets and pointed to the potential for recovery in the Shanghai and Beijing office markets.The group has continued to be active in China’s real estate market over the past year, including closing on a $1.1 billion purchase of a Guangzhou warehouse project in January.With a flair for public appearances and dramatic designs for their buildings, Zhang and Pan have made Soho China into one of the mainland’s most prominent developers, with the company having employed star architect Zaha Hadid to plan their curvy Wangjing Soho in Beijing.After founding the company in 1995, Zhang and Pan achieved early financial success developing strata-title office projects to sell units to wealthy individuals in northern China and elsewhere in the country.Having expanded their strata office model to Shanghai in the early 2000s, however, the company later struggled to build a base of rental income following a shift to a build to hold strategy.With the recent completion of a new project on Qiananmen Avenue in Beijing, Soho China’s portfolio measures 826,406 square metres (8.9 million square feet) of space. That group of assets generated RMB 1.4 billion in rental revenue last year, despite three of the five Beijing properties operating at occupancy of between 60 and 68 percent as of 31 December.In Shanghai, Bund Soho stood at 97 percent occupancy at the end of 2020, while the other three properties ranged from 82 to 87 percent.Share this nowFiled Under: Finance Tagged With: Blackstone, China, cm-ml, daily-sp, Featured, Pan Shiyi, SOHO China, Zhang XinYour email address will not be published. Required fields are marked *Comment Name * Email * Website  \n\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.More MTD TV VideosMore Sponsored Features>>", "Section": "", "Writers": "", "URL": "https://www.mingtiandi.com/real-estate/finance-real-estate/blackstone-acquiring-developer-soho-china-for-3b/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}