{"Type": "", "Time": "2021-06-17", "Headline": "Coronavirus Live News Updates: India reports less than 1 lakh cases for 10th day", "Text": "\n                        Coronavirus Latest News Updates: Biological E's made-in-India vaccine, which has already entered phase III trial, is expected to have 90 percent effectiveness against Covid\n                    \n                            Representational image. AP\n                        Coronavirus Latest news updateCoronavirus Latest news updateJapan said on Thursday it will make a vaccine passport available from next month for Japanese travellers, as governments around the world experiment with ways to relaunch tourism and business trips. The certificate will be paper-based rather than digital and will be issued by local governments from sometime next month.The country's borders are closed to almost all foreign arrivals, though the rules will be relaxed for the Olympic Games, which open in Tokyo on July 23.Coronavirus Latest news update: Vaccination PolicyBiological E's made-in-India vaccine is expected to have 90 per cent effectiveness against Covid and will likely be a gamechanger in the fight against the pandemic, NK Arora, chairperson of the Centre's Covid Working Group, told NDTV on Thirsday. He also said that the vaccine is entering Phase 3 trials and could be available by October.Coronavirus Latest news update:The active cases declined to 8,26,740 comprising 2.78 per cent of the total infections, while the national COVID-19 recovery rate has improved to 95.93 per cent. A net decline of 38,692 cases has been recorded in the COVID-19 caseload in a span of 24 hours. This was the lowest number India has seen in at least past 71 days. Coronavirus Latest news update:A single day rise of 67,208 new coronavirus infections were recorded taking India's total tally of COVID-19 cases to 2,97,00,313, while the active cases declined to 8,26,740, the lowest after 71 days, according to the Union Health Ministry data updated on Thursday. The COVID-19 death toll climbed to 3,81,903 with 2,330 fresh fatalities, the data updated at 8 am showedCoronavirus Latest news updateCoronavirus Latest news updateJapan said on Thursday it will make a vaccine passport available from next month for Japanese travellers, as governments around the world experiment with ways to relaunch tourism and business trips. The certificate will be paper-based rather than digital and will be issued by local governments from sometime next month.The country's borders are closed to almost all foreign arrivals, though the rules will be relaxed for the Olympic Games, which open in Tokyo on July 23.Coronavirus Latest news update: Vaccination PolicyBiological E's made-in-India vaccine is expected to have 90 per cent effectiveness against Covid and will likely be a gamechanger in the fight against the pandemic, NK Arora, chairperson of the Centre's Covid Working Group, told NDTV on Thirsday. He also said that the vaccine is entering Phase 3 trials and could be available by October.Coronavirus Latest news update:The active cases declined to 8,26,740 comprising 2.78 per cent of the total infections, while the national COVID-19 recovery rate has improved to 95.93 per cent. A net decline of 38,692 cases has been recorded in the COVID-19 caseload in a span of 24 hours. This was the lowest number India has seen in at least past 71 days. Coronavirus Latest news update:A single day rise of 67,208 new coronavirus infections were recorded taking India's total tally of COVID-19 cases to 2,97,00,313, while the active cases declined to 8,26,740, the lowest after 71 days, according to the Union Health Ministry data updated on Thursday. The COVID-19 death toll climbed to 3,81,903 with 2,330 fresh fatalities, the data updated at 8 am showed Coronavirus Latest News Updates: Biological E's made-in-India vaccine, which has already entered phase III trial, is expected to have 90 percent effectiveness against Covid.A single day rise of 67,208 new coronavirus infections were recorded taking India's total tally of COVID-19 cases to 2,97,00,313, while the active cases declined to 8,26,740, the lowest after 71 days, according to the Union Health Ministry data updated on Thursday.The COVID-19 death toll climbed to 3,81,903 with 2,330 fresh fatalities, the data updated at 8 am showedThe active cases declined to 8,26,740 comprising 2.78 per cent of the total infections, while the national COVID-19 recovery rate has improved to 95.93 per cent.A net decline of 38,692 cases has been recorded in the COVID-19 caseload in a span of 24 hours.As many as 19,31,249 tests were conducted on Wednesday taking the total cumulative tests conducted so far for detection of COVID-19 in the country to 38,52,38,220.The daily positivity rate was recorded 3.48 per cent . It has been less than 5 per cent for 10 consecutive days, the ministry said, adding the weekly positivity rate has declined to 3.99 per cent.Recoveries continue to outnumber daily new cases for the 35th consecutive day. The number of people who have recuperated from the disease surged to 2,84,91,670, while the case fatality rate has increased to 1.29 per cent, the data stated.Cumulatively, 26,55,19,251 COVID-19 vaccine doses have been administered so far under the Nationwide Vaccination Drive. India's COVID-19 tally had crossed the 20-lakh mark on August 7, 30 lakh on August 23, 40 lakh on September 5 and 50 lakh on September 16. It went past 60 lakh on September 28, 70 lakh on October 11, crossed 80 lakh on October 29, 90 lakh on November 20 and surpassed the one-crore mark on December 19. India crossed the grim milestone of 2 crore on 4 May\n                Updated Date:\n                \n                    June 17, 2021 11:04:19 IST\n                \n\n                        TAGS:\n                    \n                The daily COVID-19 count in India remained below the one-lakh mark for the fifth consecutive day with the country reporting 84,332 fresh cases, its lowest in 70 days, according to data updated by the Union Health Ministry on Saturday.\n\n            \n                Coronavirus news Updates: Over 26 crore doses have been provided to states and UTs so far, through the Government of India channel and through direct state procurement category, the health ministry said\n            \n                Coronavirus News Updates: The tally of COVID-19 cases in Mumbai rose to 7,15,146, while the toll reached 15,146.\n\n\n\n\n\n\n\n\n\n            Sign up for a weekly curated briefing of the most important strategic affairs stories from across the world.FirstpostSectionPlusToolsAppsNetwork18 sites Copyright © 2021. Firstpost - All Rights Reserved.", "Section": "", "Writers": "", "URL": "http://www.firstpost.com/india/coronavirus-live-updates-covid-19-vaccines-lockdown-health-latest-news-17-june-highlights-9724871.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}