{"Type": "", "Time": "2021-06-17", "Headline": "'I am alive again': Vaccinated South Korean grannies enjoy a splash, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SEOUL (REUTERS) - Senior residents of a district in South Korean capital Seoul on Thursday (June 17) enjoyed \"aqua aerobics\" - arm lifts and jogging in the water - as the local district government reopened public pools following the country's ramped-up vaccination drive.Blood cancer patient Park Jong-seon, 90, was the most excited among 10 swimmers in the aqua aerobics class, which started back up on Monday. She has been longing to return to the pool because the water exercise relieves her joint pain.\"I am free to go outside and not be locked up at home all the time,\" said Ms Park, smiling in a navy swim cap and not wearing a mask in the 25m pool. \"I finally feel like I am alive again.\"The 50-minute pool workout is open to anyone who is fully vaccinated, but the 10 swimmers were aged 75 and older as the vaccination campaign has so far focused on the elderly.Jung-gu district has reopened public swimming pools and offer free meals at senior centres as incentives for vaccinations, said its mayor Seo Yang-ho.As of Thursday, nearly 90 per cent of Jung-gu residents aged 75 or older had signed up for inoculations, he said.South Korea has eased coronavirus restrictions on large concerts and sports events this week. Masks will also no longer be required outdoors for those who have received at least one vaccination dose and some fully vaccinated travellers will be exempt from mandatory quarantine starting in July.South Korea on Wednesday said it has inoculated over 25 per cent of its population with at least one dose of a Covid-19 vaccine - two weeks ahead of schedule - putting the country on track to meet a target of 70 per cent by September.The government aims to give first doses to at least 36 million people, or 70 per cent of the general public aged 18 years and older, by September, Korea Disease Control and Prevention Agency (KDCA) director Jeong Eun-kyeong said on Thursday.The vaccination plan for the third quarter announced on Thursday starts with school teachers, high school seniors ahead of their college entrance exam, and those aged between 50 and 59, Ms Jeong said.South Korea reported 540 new infections by midnight on Wednesday, for a tally of 149,731 cases, the KDCA said, with a death toll of 1,994 since the pandemic began.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/i-am-alive-again-vaccinated-south-korean-grannies-enjoy-a-splash", "Source": "google"}