{"Type": "", "Time": "2021-06-17", "Headline": "Euro 2020: Are you back with us? Doctor who treated Christian Eriksen reveals moving moment, Latest Football News - The New Paper", "Text": "The doctor who treated Denmark’s Christian Eriksen has spoken to German media about the “moving moment” he brought the midfielder back to life after he collapsed during his country’s opening Euro 2020 game.An electric shock was administered to the 29-year-old after a few minutes of heart massage, German doctor Jens Kleinefeld told the Funke media group in an interview published Thursday (June 17).“About 30 seconds later, the player opened his eyes and I could talk to him directly,” Kleinefeld said.“That was a very moving moment, because in such medical emergencies in everyday life, the chances of success are much lower.” Dr Kleinefeld said he looked at the Inter Milan midfielder and asked him, “Well, are you back with us?”Eriksen answered, “Yes, I am back with you” and, “Damn, I’m only 29 years old,” the doctor said.“That’s when I knew the brain wasn’t damaged and he had fully returned,” he said.Eriksen responded successfully to commands and was fully conscious in the stadium, Kleinefeld said, but it took time to equip him with all the monitors required for safe transport to hospital.Electric shock treatment usually has a high success rate in healthy professional athletes compared to normal patients with pre-existing conditions, he said.“I was 99 per cent sure in the stadium that he would arrive at the hospital and remain stable,” he said.In a scene that shocked the sporting world and beyond, Eriksen suddenly collapsed on the field in the 43rd minute of Denmark’s Group B game on Saturday against Finland in Copenhagen.Medical personnel administered cardiopulmonary resuscitation as he lay motionless on the field for about 15 minutes before being carried off the pitch and rushed to hospital.He was later confirmed to have suffered a cardiac arrest.Eriksen's Inter teammate Romelu Lukaku said there will be a tribute to him when Belgium meet Denmark on Thursday. Belgium will kick the ball out of play in the 10th minute to allow everyone to applaud him. – AFPGet The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/sports/football/euro-2020-are-you-back-us-doctor-who-treated-christian-eriksen-reveals-moving-moment", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}