{"Type": "Singapore", "Time": "2021-06-17", "Headline": "JTC and Shell Singapore sign MOU to explore development of solar farm on Semakau Landfill", "Text": "SINGAPORE: JTC Corporation and Shell Singapore have signed a non-binding Memorandum of Understanding (MOU) to jointly explore the development of a solar farm on part of Semakau Landfill, both parties announced in a press release on Thursday (Jun 17).The MOU is supported by the National Environment Agency (NEA) and Energy Market Authority (EMA) and was signed at a ceremony on Thursday morning.The solar farm is expected to occupy an area of 60ha and have a capacity of at least 72 megawatt-peak, which is enough to reduce carbon dioxide emissions by 37,000 tonnes a year, said the four parties in a joint press release.The energy produced can power up to 17,500 households for a year.The farm will also be the first large-scale solar project in Singapore where a sanitary landfill is also used for clean energy generation. This project is aligned with Singapore’s target to increase solar deployment to at least 2 Gigawatt-peak by 2030.If successful, the farm will also help reduce Singapore’s carbon emissions and meet its growing clean energy needs, noted the press release.“Generating solar energy on this scale on an offshore operational landfill comes with its fair share of complexity and challenges. This is where the innovation and creativity of a joint task force made up of the various government agencies and Shell come into play, to ensure that an optimal balance is achieved,” said the press release.“Close collaborations” like these are part of JTC’s SolarLand initiative to optimise available land for solar generation in support of Singapore’s clean energy switch, said JTC CEO Tan Boon Khai.“JTC is piloting new sustainable energy innovations with Shell to maximise the use of renewable energy solutions for our industries. This project is an example of how we are tapping available land to double up for solar generation to maximise renewable energy generation,” he said.Ms Aw Kah Peng, who is chairman of Shell companies in Singapore, noted that the project is aligned with the company’s 10-year plan to re-purpose its core business, cut down on its own carbon dioxide emissions and help customers decarbonise.“With a common goal of enabling more and cleaner energy, we look forward to exploring with our partners this opportunity to maximise the use of Semakau in a way that is compatible with its primary purpose as a landfill,\" she added.Shell’s Pulau Bukom Energy and Chemicals Park is also located about 2km northwest of the Semakau Landfill and working together would allow an “innovative integration” of an intermittent renewable source to Bukom, added the release.NEA chief executive officer Luke Goh noted that the plans will contribute towards the national solar deployment target and complement NEA's resource sustainability initiatives.\"NEA is happy to support the deployment of a solar farm on Semakau Landfill,” he added.“Semakau Landfill remains Singapore’s only operational landfill. To preserve its capacity for as long as possible, we are redoubling efforts to reduce waste and close the waste loop.\"EMA chief executive Ngiam Shih Chun described solar energy as Singapore’s “most promising renewable energy source” and a “key switch” for decarbonisation.“Our energy sector is moving towards a cleaner and more sustainable future,” he noted.“Given our limited land space, EMA has been working with government agencies and industry players on innovative ways to harness more solar energy. I look forward to the successful implementation of this offshore solar farm on Semakau Landfill which will demonstrate how we can be creative in our solar deployment.”Next, JTC and Shell will jointly conduct a Request for Information exercise next week to source for innovative solutions from the market.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "solar energy,Pulau Semakau,JTC,Shell", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/semakau-landfill-jtc-and-shell-singapore-sign-mou-solar-farm-15031852", "Source": "google"}