{"Type": "", "Time": "2021-06-17", "Headline": "Liverpool could be dealt harsh blow for next season which Jürgen Klopp is helpless to - Liverpool.com", "Text": "The Reds know their schedule for the coming season but are less certain on the amount of fans who will be in attendanceSign up to receive the best LFC opinion direct to your inboxTraditionally the day when Premier League fixtures are revealed is one of much excitement.Planning away days, pencilling in when you need time off work to make sure you can make those Monday night games, seeing just when the Merseyside Derby appears on the calendar, where you will be heading on Boxing Day and New Year's Day, and where you think the spoils will be won and lost during the season. It all forms part of the truly unique experience of being a football fan.Liverpool fans now know what lies ahead for the season, with the Reds beginning what they hope will be a campaign of success with a lengthy trip to Norfolk to take on a newly promoted Norwich City on Saturday, August 14.There is much excitement and anticipation ahead of the new campaign, one where fans have renewed hope of being back in full force and seeing stadiums packed as the country looks to move back to normality after 18 months of the worst healthcare crisis in a century.But while the sight of fans, albeit limited in number, back in stadiums for Euro 2021 is something that has gladdened the heart and made football infinitely more watchable, there is still a question mark over whether everything will be back to normal as far as clubs being able to welcome supporters back to stadiums as the concern over the spread of the Delta variant of the coronavirus grows.The grand reopening of society in the UK that Prime Minister Boris Johnson had been aiming for on June 21 was postponed for four weeks, 'Freedom Day' having to wait for people eager to get back to living their lives without the many restrictions that had been placed upon them to combat the pandemic.The aim, as stated by the government, is to see a return to a society free of restrictions on July 19, a development that would allow for stadiums to be filled to capacity for the first time since March 2020. But as this pandemic has shown, it cares little for dates on a calendar, and while Liverpool and their rivals have more hope that than at any other stage of the crisis that the end is in sight thanks to the success of the vaccine rollout and the huge uptake in those getting the jab, they will know that they could yet be let down in a big way if things go south.Many Reds have already paid for their season tickets in full, keen to get back to the place they love, a place where they have been forced to keep away from for well over a year, a place where their absence has been felt keenly. It isn't simply about the monetary aspect of what happens, Reds fans, like fans up and down the country, want to be back in the ground and cheering on their team because it brings the kind of joy, euphoria and release from the trials and tribulations of everyday life unlike anything else. It is good for the mind and the soul - for the most part anyway.As football fans we watched last season from afar. We were still emotionally invested in what was happening on the pitch, but a fraction of how it felt in normal times. Much was done to try and dress up the spectacle of a football match played in front of an empty stadium, but the experience was a surreal, unorthodox and somewhat unfulfilling one. It hammered home just how much fans are required to make football have a beating heart.It had to be done, though, and despite the financial impact that has been felt by clubs across the globe, football did continue. It did muddle through.But with so many vaccinated and the vaccines seemingly having the desired effect, after so long having to comply and conform to a new way of life, so restrictive on our ability to enjoy those things we took for granted, many fans feel more emboldened to get back to doing what they love.And while there are no certainties where this pandemic is concerned, the aim from the Premier League is still to be seeing full stadiums when the Premier League season kicks off in August, and that includes a sea of red in the away end at Carrow Road on the opening day.A Premier League statement read: \"The Premier League has announced that it and its clubs are committed to the ambition of having full stadiums, including away supporters, from the start of the season, and will continue to work closely with Government and all relevant authorities, ensuring operational plans are in place ready to safely welcome supporters back to stadiums in August\".For Liverpool and owners Fenway Sports Group, a full Anfield is very much a want and a need.Matchday revenue for 2020/21 will be virtually nil when the 2021 accounts are published early next year by the Reds. In 2019 the matchday revenue for the year was £84m, in 2020 it was £71m as three months of the season were lost. It is not a trend that can continue indefinitely for the Reds and others, especially when it also has a knock on effect on commercial deals.For football to bounce back it needs fans more than ever. And after the failed attempt at the European Super League that demonstrated the importance of fans having a voice, fans deserve the chance for that voice to be channelled into supporting what happens on the pitch. That is why we are all here after all.The government line remains the same. There will be a review on progress on July 5, but even the most optimistic would be hard pushed to think that will bring forward any relaxation in restrictions.In March 2020 we were told '12 weeks to flatten the curve'. Here we are in mid-June and we are still wrangling with the pandemic. There is a route out, a clear one, but pinning hopes on dates on a calendar has seen them dashed before now.", "Section": "", "Writers": "", "URL": "https://www.liverpool.com/liverpool-fc-news/liverpool-jurgen-klopp-blow-season-20827673", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}