{"Type": "", "Time": "2021-06-17", "Headline": "Singapore central bank reprimands insurers AIA, Aviva and Prudential", "Text": "SINGAPORE, June 15 (Reuters) - Singapore's central bank said on Tuesday it has reprimanded the local businesses of insurers AIA, Prudential and Aviva for breaching requirements related to risk management and supervisors' pay. The Monetary Authority of Singapore (MAS) said its investigations found numerous instances where remuneration was paid to supervisors over sales of investment products and life policies, violating its regulations. A MAS reprimand is issued when there are failures in a financial institution that may pose potential risks to its business, market participants and investors. Those reprimanded were AIA Financial Advisers Private Limited, Prudential Assurance Company Singapore, Aviva Ltd and Aviva Financial Advisers Pte Ltd. The companies did not immediately respond to separate requests for comment. The MAS has dealt firmly with these financial institutions \"to send a clear message to the industry on the importance of upholding high ethical standards,\" Ho Hern Shin, deputy managing director, financial supervision, said in a statement. (Reporting by Chen Lin; Editing by Martin Petty) The displaced sleep packed together under plastic sheeting for protection from Myanmar's monsoon rains.  Food is short and there are signs of disease spreading, according to people who have fled recent fighting in eastern Myanmar's Kayah State - just one of several conflicts to surge since the Feb. 1 coup toppled elected leader Aung San Suu Kyi.  The United Nations estimates nearly 110,000 people have been displaced in Myanmar's Kayah State by the recent violence.Leading Chinese construction machinery manufacturer XCMG (SHE:000425) has formulated and published the industry's first \"Hoisting Supply Chain Safety Development Report and Initiative\" (the \"Report\"), a blockbuster release since XCMG's publication of the \"4.0 Sustainability Principles for Hoisting Industry Chain\" in 2016.Forget lash extensions and microblading, try this Ayurveda-inspired serum.Finding it increasingly challenging for you to enjoy uninterrupted sleep with Singapore’s notorious heat? Try this fuss-free method that doesn’t involve burning a hole in your pocket.The FTSE 100 was set to fall today in reaction to last night’s news that the majority of the US Federal Reserve’s  officials now expect interest rates to rise earlier than forecast, in 2023.  In March, most Federal Reserve officials had predicted rates would stay at their current levels until at least 2024 but last night said the consensus had now shifted forward thanks to their growing belief in the economic recovery.  While the Fed’s newfound belief in the strong recovery story should be good for the economy and corporate profits generally, the prospect of tightening monetary policy should lead to investors pulling some of their funds out of stock markets and into less risky assets like bonds as interest rates rise.Fotric produces highly innovative thermal imagers by combining components from world class manufacturers with designing insights from end users and field engineers. Today, we are proudly announcing the release of our latest handheld camera series: the 320M/F and the 340A.The comic will be turned into a 12-issue seriesThe United States is ending a Cambodian aid programme aimed at protecting one of the country's biggest wildlife sanctuaries, citing worsening deforestation and the silencing of those who speak out about the destruction of natural resources.  The U.S. embassy in Phnom Penh said in a statement on Thursday that it had invested more than $100 million to combat deforestation and despite some progress high rates of illegal logging had continued in the Prey Lang Wildlife Sanctuary.  Since 2016, Prey Lang had \"lost approximately 38,000 hectares (93,900 acres) of forest, nearly nine percent of its forest cover,\" it said, accusing Cambodian authorities of not adequately prosecuting wildlife crimes or putting a stop to illicit activities.Naho has played a crucial role in fighting Japan's two deadly coronavirus waves this year, the worst the country has faced since the pandemic began.The Leitz Phone 1 is Leica's first self-branded mobile phone, and it'll be a Softbank exclusive when it launches in July. The camera maker isn't afraid to admit that the Leitz Phone 1 is actually a rebadged Aquos R6.As he counts down the days to his third straight Olympics, Tonga's famously chiseled flagbearer Pita Taufatofua is also contemplating offers for a career in movies and documentaries.A pig that became an unlikely national icon in China after surviving 36 days under rubble from a powerful 2008 earthquake has died at the age of 14, sparking an outpouring of emotion on Thursday.The author talks to Helen Brown about her prize-winning debut novel, the mistreatment of ‘hysterics’, French and anglophone feminism, and growing up the daughter of a pop starThe Italian son of Egyptian and Sardinian immigrants came to global attention when he placed second at the 2019 Eurovision Song Contest, but there’s so much more to him than meets the eye. He speaks to Roisin O’Connor about his new album, Ghettolimpo, and why he’s still avoiding labelsSINGAPORE - Media OutReach - 17 June 2021 - APOL introduced their signature series named Sphinx, Kraken and Behemoth. APOL's strong desire to stay in sync with the latest trends has led them to produce not only top-quality materials for the chair but also all the key features that an ergonomic chair should have. This would include the 4D adjustable armrest, full length backrest recline, multi-functional tilt mechanism, class 4 hydraulics, aluminum wheelbase and caster wheels. The addition of theThe Milky Way moving across the night sky made for a beautiful background for the Pack Creek Fire burning in Utah’s east on June 12.A timelapse video taken over four and a half hours by Temuji Nana shows the galaxy and shooting stars while the fire burns through the night.Firefighting authorities said the blaze began in Manti-Lasal National Forest on June 9 due to an abandoned campfire. The fire had grown to 8,518 acres by June 16. Credit: Temujin Nana via StoryfulSpacecraft will dock with main section of Chinese space station that was placed in orbit on 29 AprilLong bets on most of Asia's emerging currencies were trimmed, a Reuters poll showed on Thursday, as investors weigh the prospect of tighter monetary settings as the U.S. recovery outperforms, while the COVID-19 situation locally is brought under control.  The 13 responses came in before the Federal Reserve's policy meeting late on Wednesday where it stunned by signalling it might raise interest rates as early as 2023, a faster pace than initially assumed.  Emerging markets in the past have not fared well with the prospect of U.S. interest rate hikes, and with the Fed opening the door to an accelerated timetable to wean off pandemic-driven monetary stimulus, it could suck funds out of riskier assets and force Asia's central banks to tighten quicker.Asian markets opened lower following the negative closing of the US marketsLong bets on most of Asia's emerging currencies were trimmed, a Reuters poll showed on Thursday, as investors weigh the prospect of tighter monetary settings as the U.S. recovery outperforms, while the COVID-19 situation locally is brought under control.  The 13 responses came in before the Federal Reserve's policy meeting late on Wednesday where it stunned by signalling it might raise interest rates as early as 2023, a faster pace than initially assumed.  Emerging markets in the past have not fared well with the prospect of U.S. interest rate hikes, and with the Fed opening the door to an accelerated timetable to wean off pandemic-driven monetary stimulus, it could suck funds out of riskier assets and force Asia's central banks to tighten quicker.", "Section": "", "Writers": "", "URL": "https://sg.finance.yahoo.com/news/singapore-central-bank-reprimands-insurers-063429059.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}