{"Type": "", "Time": "2021-06-17", "Headline": "Long lines at Bukit Merah block as residents get swabbed, Latest Singapore News - The New Paper", "Text": "Long queues formed at the temporary Covid-19 testing area set up at Block 125A Bukit Merah View yesterday, after the site was opened to residents.Set up on Monday, the site was intended for the mandatory testing of about 85 stallholders at 116 Bukit Merah View after a new cluster formed at the nearby 115 Bukit Merah View Market and Food Centre.As it turned out, many residents went there on Monday to be tested but were turned away.Yesterday, the site was opened up for the residents after Tanjong Pagar GRC MP Joan Pereira made an appeal to the Ministry of Health (MOH). It is open to residents until tomorrow.When The Straits Times visited Block 125A's multi-purpose function hall at 10am yesterday, two queues had formed.One was for people who had made an appointment.The second queue, for people who had not, spilled over to the nearby blocks. About 120 people, mostly the elderly, were in this queue. The estimated wait time was one to two hours.Some in the second queue were told they could come back within the next two days as appointments for yesterday had been fully booked.Madam Shanthi Nadesan, 58, started queueing up at 10am. She had waited for at least an hour when she spoke to ST. She said she had made an appointment at Raffles Medical to get tested but decided to forgo it.\"I spoke to the MP, Ms Joan Pereira, and she said I don't have to go so far, I can just come here. But I did not expect to have to wait so long,\" said the former school librarian, who has yet to be vaccinated.Bukit Merah resident Simon Lee, 65, had been in the queue since 9.40am and was given a swab test about an hour later.Mr Lee, who was in the queue with his mother-in-law, wife and daughter, said he was not bothered by the waiting time.\"It shows that everyone is disciplined. When called upon, we would do our part to be tested,\" said the taxi driver.Undergraduate Germaine Tan, 21, who made an appointment for a swab test at 10.30am, joined the queue for those with bookings about five minutes before her scheduled timing. She still had to wait in line, with about 20 others ahead of her.\"It is quite organised, because there is someone ushering (those in) the queue, so it is not so bad,\" said the third-year student from the Singapore Institute of Management.According to a Health Promotion Board staff member on-site, roughly 200 people were tested as at 11.30am.Ms Pereira said she, as well as MOH, had anticipated that many elderly residents may not know how to register online and would just go to the temporary site directly to be swabbed.\"Therefore, MOH has deployed safe distance ambassadors on the ground to maintain safe distancing... I have also called upon residents to help the elderly in their family to book appointments online, in order to reduce the crowds at the opening hour,\" she told ST.Residents and members of the public who had visited either 115 Bukit Merah View Market and Food Centre or shops at 116 Bukit Merah View between May 25 and June 12 were urged to go for a free Covid-19 swab test.Staff and tenants who had been working at 115 Bukit Merah View Market and Food Centre from May 25 have been quarantined and would be swabbed during quarantine.Staff and tenants who had been working in the nearby 116 Bukit Merah View from May 25 also had to go for mandatory swabbing to disrupt any wider, undetected community transmission.Get The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/long-lines-bukit-merah-block-residents-get-swabbed", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}