{"Type": "", "Time": "2021-06-17", "Headline": "Even 30% pay raises can’t stop the junior banker exodus in Asia", "Text": "By Cathy Chan and John Cheng(Bloomberg) — They’ve raised salaries and promised quicker promotions.But the world’s biggest securities firms and banks are still struggling to retain junior investment bankers in Asia, challenging their expansion plans for a region that’s growing faster than almost anywhere else.Recruiters and executives say the exodus is in some ways more difficult to stem than in New York and London, where analysts and associates have rebelled against the industry’s work-till-you-drop culture.In Asia’s biggest hubs, young employees are more likely to leave because they think they can earn more — and climb the corporate ladder faster — at one of the many fintech and investment firms that have sprouted up to tap the region’s buoyant economies and swelling piles of wealth. The challenge is particularly acute in China and Hong Kong as foreign firms ramp up hiring to take advantage of a financial opening in Asia’s largest economy, competing with each other as well as the local startup scene.“The whole industry is running into a pretty big supply and demand issue, and I don’t think this is going to be alleviated any time soon,” Mark Leung, JPMorgan Chase & Co.’s chief executive officer for China, said in a Bloomberg Television interview. The U.S. lender is among banks including Goldman Sachs Group Inc., Credit Suisse Group AG and HSBC Holdings Plc. hiring hundreds of staff for their push into China.While it’s hard to quantify turnover with any certainty, an informal Bloomberg News poll of executives at four global securities firms found that anywhere between 13% to 15% of investment banking analysts and associates left their roles this year, roughly double the average in previous years. That’s in line with estimates for the U.S. and higher than the U.K., according to executives at recruiting firms.Exits have picked up despite annual pay raises of 25% to 30% since 2019 for Hong Kong-based bankers covering in-demand sectors like technology and health care, said executives who oversee groups or the region, asking not to be named discussing private information. The increments have been more subdued for Southeast Asia where attrition is also rising, one of them said.Jonathan Lam left HSBC Holdings Plc’s investment bank in Hong Kong in the middle of last year to join Butler, a home concierge company he helped start that offers personalised services ranging from housekeeping to fixing washing machines and hosting dinner parties. It was the feeling of making an impact and “owning something” that drove Lam to quit his debt capital markets job right after a promotion, he said. The prospect of a financial windfall also helped.“With banking you can make good money in the short term, but with startups, if you grind it through, it will lead to big fortunes,” said Lam, 30, who founded Butler with alumni of Goldman Sachs Group Inc. and Wells Fargo & Co. The startup completed a funding round last year and has 30 employees.Asia’s economic rise has made it one of the world’s most attractive regions for entrepreneurs. Its share of global startup investments rose to about 40% in 2015-2017, up from 10% a decade earlier, according to McKinsey. It’s home to more than a third of the world’s unicorns, the nickname for startups valued at US$1 billion or more.The attrition is made more acute by the fact that finance is still a growth industry in Asia and is smaller relative to the overall economy than in the U.S. and Europe. More than half of finance firms in mainland China surveyed by recruitment firm Michael Page expect to increase their headcount by about 11% this year, on average. Financial services will likely be the most-active recruiter in Hong Kong and the second most-active in Singapore, the poll showed.Some smaller hedge funds and money managers in Hong Kong are offering double the salary to lure talent, two quantitative trading analysts at a Wall Street bank said based on approaches from headhunters. Private equity firms, where employees get a share of profits, have also been active recruiters of junior talent in the past year, including Bain Capital, PAG and Hillhouse Capital, one of the people said.In Singapore, opportunities are sprouting at hedge funds and private equity firms as well as a new breed of fintech and digital banking firms, according to Lim Chai Leng, a senior director at recruiting firm Randstad Singapore.Startups and smaller boutique firms can offer flexible working and other benefits that established players have struggled to keep up with, said James Carss, managing director at executive search firm NRG in the U.K. The churn rate in the U.K. is three to four months behind Asia, but is likely to catch up, he said.Big technology firms are also drawing from the banks. Morgan Stanley Vice President Shiyi Lin last month left to join the strategic investment group at Alibaba Group Holding Ltd., according her LinkedIn page. In Singapore, Jack Ma’s Ant Group Co., Southeast Asia’s most-valuable startup Grab Holdings Inc. and its most valuable company Sea Ltd. are setting up digital banks.Daniel Yuan, a Yale-educated former analyst at Goldman Sachs, left in 2019 to become chief of staff at online finance company Futu Holdings Ltd. While he credits Goldman for teaching him everything he knows about finance, he found his ability to move up the ladder too rigid.“I knew exactly what I needed to do and how long I needed to keep doing this in order to advance my career at Goldman,” Yuan said. “At a leaner and more entrepreneurial corporate like Futu, there’s a lot of flexibility around what I can do, especially in my capacity as the chief of staff.”Banks are starting to notice. One example is Lam’s old firm, HSBC, which counts Hong Kong as its largest market. The lender, which is in a midst of a major pivot to Asia, last month promised a shorter career path for new associates, offering promotions after three years instead of four. It also pledged to boost pay. JPMorgan is also hiring more junior bankers and staff globally.Globally, lenders are raising pay for junior employees, enforcing curfews and hiring more to prevent defections and ease discontent as a jump in deals during the pandemic intensified the focus on work-life issues. Wall Street was set abuzz earlier this year by a leaked presentation from junior analysts at Goldman Sachs that detailed their grueling workload and punishing hours.Spokespeople for Goldman, HSBC and JPMorgan declined to comment for this story.“In Asia, junior bankers are more likely to leave for career opportunities that they see as more financially attractive,” said John Mullally, regional director at Robert Walters in Hong Kong. “The long hours and stress of banking careers are a factor, but just not as much as it is for their counterparts in Europe and the U.S.”For some beleaguered bankers, the exodus of their colleagues at the same time as dealmaking is thriving, is taking its toll. Over the past 12 months, mergers and acquisitions have jumped 30% in Asia Pacific, while initial public offerings have risen 44%, according to data compiled by Bloomberg.An associate at JPMorgan, who asked not to be named, said his workload doubled after a colleague quit for a financial technology firm in December, leaving him to work 18 hours a day, on average, without a break for almost two months.He’s now actively looking for a job at a buy-side firm, he said, looking for a place with less hierarchy and more opportunities for career advancement.© 2021 Bloomberg L.P.Milan exercised the option to make the loan deal permanent and said Tomori will remain with the club until June 2025.  Financial details of the transfer were not provided but British media reported that Milan activated a 25 million pounds ($34.89 million) release clause to sign the defender.  The 23-year-old centre back joined Milan in January and made 22 appearances during his loan spell, helping them qualify for the Champions League with a second place finish in Serie A.\"I literally shoved needles deep into my skin this is not a rash.\"Hiring the wrong financial advisor can wreak havoc on your investments and ruin your retirement. However, this new tool is changing everything.Credit reputation would reflect positively on you and help in your application for things like credit cards, renovation loans and home loans. The post Credit reputation must be maintained to increase chances of getting loans appeared first on iCompareLoan.“We’re a bit out of practice.\"The star posed with nothing on for the Bare Yourself campaign.Cut your monthly payment while rates are low. Free Quotes. Wont affect your credit. Calculate New Payment. (1.97% APR)Follow all the action live from the Group C match at the National Arena in RomaniaA resilient but frustrating team to watch, Ukraine are led by a legend and could upset one or two teams along the way - if they can score enough goals to get themselves throughBrokers say shares are undervalued compared with New GSK prospectsWall Street legend Whitney Tilson says there's a huge new tech trend coming – and he's giving away his top pick for free right here.CHARLOTTE, N.C., June 17, 2021 (GLOBE NEWSWIRE) -- LPL Financial LLC (Nasdaq:LPLA) today announced that financial advisors Alicia Curtis and Jyl Barnard of Curtis Barnard Financial Services and financial professional Chris Dearing and assistant Kari Snyder of Riverfront Financial Group and have joined LPL Financial’s broker-dealer, corporate registered investment advisor (RIA) and custodial platforms. Collectively, they reported having served approximately $400 million in advisory and brokerageReleased today, the How We Live Report looks at results from a national survey conducted for Aviva Canada by Leger Canada that asked Canadians across the country about their lives and aspirations along with additional data sources relating to current and post COVID-19 habits. The report shows that Canadians are considering moving to more rural locations, prioritizing backyard renovations, but are not protecting their homes as much as they should – despite spending more time in them than ever bef\"I have more energy now when playing with my two young sons—and definitely look better in my swimming trunks.\"If you pay more than $99/month for power and own a home in Texas, you better read this.‘The UK’s timid and very fearful reopening is not based on any medical science that we can establish,’ says Michael O'Leary,As COVID-19 cases fall, experts are warning about the return of a similar disease.Chair of the Labour Party Anneliese Dodds has said that \"there are issues of fairness\" following recent reports which say that the government is considering allowing double vaccinated people to avoid quarantine on their return from amber list countries - but testing will still be required.Get a $200 checking bonus when you apply for an eligible checking account online in minutes with qualifying direct deposits. Learn more.Switching all your savings to bonds will reduce your risk of losing what you already have, but there is a real opportunity cost in missing out on the larger gains offered by stocks.  For example, let's say you're 60 years old with $750,000 of retirement savings so far.  If you invested all that money in bonds and left it there until you retired at 65, you'd have just over $1 million if you earned a 6% average annual rate of return.Alexandra Kerlidou sits in her wheelchair on stage in Athens.  The student with cerebral palsy, who cannot use her hands or speak, is playing the \"Eyeharp\", gaze-controlled digital software which allows people with disabilities to play music, something she had never thought possible.  \"I felt strange, I had never imagined such a thing,\" said Alexandra, using a speech-generating computer program as she described trying the \"Eyeharp\" for the first time in her home on Lesbos with creator Zacharias Vamvakousis.Gunman ‘ran amok’, newspaper saysYou may be surprised by how pressure washing can transform your home. See for yourself. Look for nearby pressure washing services.\"Don't ask for a short back and sides in Bucharest.\"The longtime runner is all about power walking to stay sane.The safe-haven asset saw one of its largest drops since January, and was trading at $1,797 in afternoon trade.", "Section": "", "Writers": "", "URL": "https://sg.finance.yahoo.com/news/even-30-pay-raises-cant-stop-the-junior-banker-exodus-in-asia-035029167.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}