{"Type": "", "Time": "2021-06-17", "Headline": "China's ByteDance, owner of TikTok, saw revenue surge 111% in 2020", "Text": "GUANGZHOU, China — ByteDance, the owner of TikTok, saw its revenue for 2020 more than double, a person familiar with the matter told CNBC.Revenue for last year totaled $34.3 billion, up 111% year-on-year, senior management at the company told employees in a company-wide meeting. Gross profit rose 93% to $19 billion, the person who attended the meeting said.ByteDance had 1.9 billion monthly active users by the end of 2020 across all of its platforms — which include its widely popular short video app TikTok, the Chinese version Douyin, and news aggregation app Toutiao, among others.The Wall Street Journal first reported the numbers.The rapid growth underscores the excitement around ByteDance, a private company, and why its valuation has reportedly been pegged north of $100 billion.The company also hired former Xiaomi executive Shou Zi Chew to be its new chief financial officer earlier this year, signaling it could be gearing up for an initial public offering.ByteDance's 2020 operating loss was $2.1 billion versus a $684 million operating profit the year before, said the person, who wished to remain anonymous as they were not authorized to speak publicly. The loss was mainly due to the cost of share-based compensation for shareholders, the source said.The Chinese internet company has managed to find success internationally with TikTok, the short video app popular for dancing and lip syncing. Advertising is a key part of ByteDance's revenue on its platforms, but it has started pushing into new areas such as gaming and is pitting itself against some of China's other tech giants like Tencent.It's been a rocky year for the company, however.ByteDance was dubbed a national security threat by former President Donald Trump's administration last August and ordered to divest its TikTok business in the U.S. The Wall Street Journal reported this year that a deal to sell TiKTok has been shelved indefinitely.In China, ByteDance has been caught up on a broader regulatory crackdown on the country's technology sector. Douyin, the Chinese version of TiKTok, along with 104 other apps, were called out by China's Cyberspace Administration of China for the illegal collection of personal data and asked to rectify the issues.The company will also undergo a key management change this year. Zhang Yiming, the co-founder of ByteDance, will step down from his role as CEO by the end of the year and move into a key strategy role. Another co-founder, Liang Rubo, who is currently head of human resources, will take over as CEO.Got a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. © 2021 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by ", "Section": "", "Writers": "", "URL": "https://www.cnbc.com/2021/06/17/chinas-bytedance-tiktok-owner-saw-revenue-surge-111percent-in-2020.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}