{"Type": "", "Time": "2021-06-17", "Headline": "S'pore's labour market continues recovery into 1st quarter; total employment grows by 12,200, Jobs News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Singapore's labour market continued its recovery in the first quarter, with total employment growing for the first time since the start of the Covid-19 pandemic.A report by the Ministry of Manpower (MOM) on Thursday (June 17) showed that the total employment, excluding foreign domestic workers, rose by 12,200 in the first three months of the year, after four consecutive quarters of decline. This far surpassed the preliminary estimate of 4,800 released in April.Resident hires continued to rise, outpacing the decline in non-resident employment, which is partly due to restrictions on the inflow of foreign workers.This increase was driven by the broad hiring of residents in the service sectors, such as information and communications, food and beverage, health and social services, and administrative and support services.More retrenched residents here have also found jobs within six months, while job vacancies have risen to nearly match the unemployed population, according to the report.But the labour market is still not fully back to its pre-pandemic state, said MOM.Moreover, uncertainties in the economy and the recent tightened measures during phase two (heightened alert) are expected to weigh on the pace of labour market recovery in the second quarter.Manpower Minister Tan See Leng said Singapore's path to recovery \"will not be a straight road\", and will entail some twists and potential roadblocks.\"Recovery is also expected to be more uneven across sectors than earlier expected,\" said Dr Tan, speaking to the media after visiting the Procter & Gamble Singapore Innovation Centre at Biopolis on Wednesday (June 16).Unemployment rates continued to ease, after peaking in September last year at 3.5 per cent for the overall workforce, 4.9 per cent for citizens and 4.8 per cent for residents.In March, this dropped to 2.9 per cent overall, 4.2 per cent for citizens and 4 per cent for residents. The rates are still higher than pre-pandemic unemployment levels.Retrenchments, however, fell for the second consecutive quarter to pre-pandemic levels, said MOM. The re-entry rate of retrenched residents into employment also rose for two consecutive quarters, to 66.2 per cent.As business activities picked up, the number of workers placed on shorter work weeks or temporary layoffs also declined, from 8,710 in the fourth quarter of last year to 4,020 in the first quarter of this year.Meanwhile, the number of job vacancies rose to 68,400 in March, exceeding the last high of 65,500 in March 2015.The ratio of job vacancies to unemployed persons also improved, to 0.96 - or nearly one job vacancy for every unemployed person - in March. This is an increase from a ratio of 0.75 in December last year.Associate Professor Lawrence Loh from the National University of Singapore Business School said the first quarter performance is expected, as it follows on the heels of the recovering Covid-19 situation in the latter part of last year.“However, it is too early to say that there is a turnaround in the employment trend,” he stressed, adding that Singapore is not out of the woods just yet.“Employment normally lags economic growth – given the restricted situation in the second quarter now, the decline in economic activity is likely to affect the job market in the next quarter and beyond.”Foreign employment growth is likely to continue its decline, given ongoing border restrictions. This could lead to labour shortages in sectors like construction.To help construction companies cope with the manpower crunch, the Government has introduced a temporary scheme that would make it easier to recruit workers from China, where the coronavirus situation is more stable and fewer restrictions are in force.Chinese work permit holders usually obtain their skills certification from overseas training centres in China, but they will now be allowed to get certified in Singapore instead.Maybank Kim Eng senior economist Chua Hak Bin said the labour market recovery is K-shaped, with a stark divergence between resident and non-resident employment. “The divergent and uneven labour market recovery will likely continue in the second quarter, given even stricter border and quarantine controls under the heightened measures,” he added. “Wage pressures may surface earlier than expected as the resident labour market tightens, even though employment is still far below pre-pandemic levels.\nThe Government has also put in place various schemes for employers to access a wider pool of talent, from career conversion programmes to the Jobs Growth Incentive that encourages employers to bring forward the hiring of local workers through wage subsidies.Dr Tan said businesses here have to innovate, from digitalisation to developing niche capabilities.\"As businesses transform, the workforce must be reskilled and upskilled to keep pace with the changing needs,\" he added.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/jobs/spores-labour-market-continues-recovery-into-first-quarter-but-not-back-to-pre-covid", "Source": "google"}