{"Type": "", "Time": "2021-06-17", "Headline": "Woman, 45, who refused to wear mask on bus assisting police in investigations for public nuisance, breaking Covid-19 rules", "Text": "This story was submitted via Stomp App contribution.This story was submitted via Stomp App contribution.A 45-year-old woman is assisting police with investigations after causing a commotion for refusing to wear a mask on a public bus on Monday (June 14).The woman was caught on video making a scene onboard bus service 69 at Bedok Bus Interchange after a bus captain reminded her to put on her mask.However, instead of complying, she argued with the driver, causing a delay which forced other passengers to alight.In the video circulating online, she taunts SBS Transit staff and tells them to call the police.In response to a Stomp query, Ms Tammy Tan, the operator's corporate communications senior vice president said: \"On Monday evening, 14 June 2021, at about 10.30pm, a Service 69 bus was at the Bedok Interchange when a female passenger boarded without donning a mask.  \"The Bus Captain reminded her to do so for the safety of everyone onboard but she refused although she carried one with her.  \"This led to a delay with some passengers alighting from the bus.  \"The woman commuter subsequently alighted from the bus which then resumed its journey back to the Tampines Interchange. \"We would like to remind all passengers to wear a mask when travelling on public transport as part of our health and safety measures during this pandemic.\"The police told Stomp they received a call for assistance at 12 Bedok North Drive at 10.26pm.\"A 45-year-old woman is assisting in investigations for public nuisance and breach of COVID-19 regulations,\" a police spokesman said.Police investigations are ongoing.Get more of Stomp's latest updates by following us on Facebook, WhatsApp, Twitter, Instagram and YouTube.View the discussion thread.View the discussion thread.Download the new STOMP app today.SPH Digital News | The Straits TimesAll rights reserved | Terms & Conditions | Data Protection Policy | Advertise with usSPH Digital News / STOMP / Copyright (c) 2019 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E.", "Section": "", "Writers": "", "URL": "https://stomp.straitstimes.com/singapore-seen/woman-45-who-refused-to-wear-mask-on-bus-assisting-police-in-investigations-for", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}