{"Type": "", "Time": "2021-06-17", "Headline": "Kimmel on Marjorie Taylor Greene: ‘Sorriest excuse for a congresswoman we’ve ever had’ | Late-night TV roundup | The Guardian", "Text": "Late-night hosts discussed the controversial congresswoman’s Holocaust apology as well as the lifting of Covid-19 restrictionsLast modified on Wed 16 Jun 2021 12.35 EDTOn Jimmy Kimmel Live!, the host discussed the extremist Republican congresswoman Marjorie Taylor Greene’s apology after comparing Covid-19 restrictions to the Holocaust. In a press conference, she admitted remorse after having visited the Holocaust museum, saying her eyes were now open to the horrors of it. “It’s amazing what a little education can do,” he said. “She now knows as much about the Holocaust as every sixth-grader in Washington DC. Quick, build a climate change museum too!”He also referred to her as “the sorriest excuse for a congresswoman we’ve ever had”.To celebrate Donald Trump’s 75th birthday, a party was put on which his son Donald Trump Jr posted video of on Instagram. “What a party, all the best people are there although I couldn’t help but notice: his wife wasn’t,” he commented.Kimmel suggested that Melania Trump might have run off with Hunter Biden instead.On The Late Show, Stephen Colbert talked about “an important threshold” as New York passed a 70% vaccination rate. Remaining restrictions are now being lifted which “means that Pizza Rat can finally dine inside again”.Back in March, Joe Biden called Vladimir Putin “a killer” which he recently discussed on a US TV interview, trying to confusingly explain that it was a hypocritical thing to say. “My favourite sayings are the ones that are convoluted and need a lot of explanation,” he said.Jason Riddle, who was charged for his involvement in the Capitol riot, is now running for office in New Hampshire but in a recent interview, revealed that he didn’t even understand the system or that he was up against a Democrat. “This explains his campaign slogan: Jason Riddle for … I dunno, your guess is as good as mine!” joked Colbert.Another rioter, who memorably put his feet up on Nancy Pelosi’s desk, made an appearance on Russian TV recently, which led Colbert to joke that he also did the rounds on the country’s other morning shows: Oppress the Nation, Murder the Press and Fox New Sunday.On Late Night, Seth Meyers discussed the planned New York City parade to honour the pandemic frontline workers, announced by the mayor, Bill de Blasio, this week. “Dude, have you learned nothing?” Meyers asked. “New Yorkers hate parades. That’s like saying you’re going to honour them with a trip to Fenway and some deep-dish pizza.”Publishing houses have reportedly been reticent to publish a post-presidency book by Donald Trump because they worry it won’t be truthful. Meyers quipped that fears were based just on the title: How I Slept with Carmen Electra.In a new interview, Barack Obama said that if you watch Fox News, you have a different version of reality than if you read the New York Times. “If you only watch Fox, you might not know that some women have brown hair,” Meyers said.Marjorie Taylor Greene just learned something shocking about the Holocaust: it happened. pic.twitter.com/zZTVLNZG6ZOn The Daily Show, Trevor Noah also talked about Greene, Georgia congresswoman and “your crazy aunt’s even crazier friend”.Greene has become “notorious for saying absolutely anything with zero shame” talking unhinged conspiracies and also comparing Covid-19 restrictions to the Holocaust, something she is now admitting was a mistake.“This woman writes the laws, the laws that governs the land and she’s out here like, ‘Yo did you guys hear about the Holocaust – shit’s wild,’” he said. “I mean, for real though, are we going to get a press conference every time Marjorie Taylor Greene learns about something? Because she doesn’t know about a lot of things.”He said that he felt bad for her because learning “forces you to take back all the ignorant shit you said in the past”.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/culture/2021/jun/16/jimmy-kimmel-marjorie-taylor-greene-late-night-recap", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}