{"Type": "", "Time": "2021-06-17", "Headline": "Race-based data in population census needed for S'pore to help ethnic groups meaningfully: Indranee, Politics News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Data categorised by ethnicity remains relevant to Singapore, and is done with the \"best of intentions\", to ensure no group is inadvertently left behind, and to know where to intervene with help.Explaining why population data is broken down by ethnicity, Minister in the Prime Minister's Office Indranee Rajah said at a media briefing on the release of Singapore's population census on Wednesday (June 16): \"To the extent that any group may not be doing as well as any others in any areas, then it tells us that as a society and in terms of policy, we should do something to try and make sure that we can bridge any gap.\"The census is conducted every decade by the Department of Statistics. Its latest findings showed that the ethnic composition of the resident population has remained stable - with 74.3 per cent Chinese, 13.5 per cent Malays and 9 per cent Indians. The resident population comprises citizens and permanent residents.Citizen proportions also remained constant at 75.9 per cent Chinese, 15 per cent Malays and 7.5 per cent Indians.Singapore's total population rose from 5.077 million in 2010 to 5.686 million in 2020.Ms Indranee, who oversees the National Population and Talent Division, was asked by reporters whether it was useful to continue presenting data according to ethnicity rather than socio-economic indicators like income - particularly when the figures might reveal stark disparities. In the area of education, for example, the proportion of university graduates in 2020 was 34.7 per cent for the Chinese, 10.8 per cent for Malays and 41.3 per cent for Indians.Ms Indranee said such questions assume \"all will be well\" in the absence of such breakdowns.\"If you didn't have this data, then let's say that a particular ethnic group was not doing well compared to the others, you would have no idea how many (people); you would have no idea in what areas; you wouldn't know whether the problem was education or whether the problem was something else,\" she explained.\"All you would have is just one big block of data… And you would not, for example, be able to reach or address those groups in a way that is meaningful to them.\"Ms Indranee acknowledged the importance of not presenting such race-based data in a manner that leads to divisiveness or finger-pointing.The Government has put out race-based statistics with the right balance - enough for people to know where different groups are going or heading, but not in such a way as to be inimical to any group, she said.Ms Indranee added she had noticed that social media conversations often pinpoint the few instances where the Government relies on race-based data, but without the full picture.In school, for instance, if students are not faring well, basic remedial classes are offered to students of all races.\"It's (only) a small subset where they may come from family backgrounds where the parents only speak in the vernacular, where there are certain issues that may be tied to ethnicity or culture,\" Ms Indranee noted.\"And the only way you're able to address them is on their own terms, which is through their own cultural and ethnic lens, and that was the basic thinking behind setting up the self-help groups.\"There are four race-based self-help groups: the Chinese Development Assistance Council, the Singapore Indian Development Association (Sinda), Yayasan Mendaki and the Eurasian Association.Ms Indranee, who is Sinda president, stressed that these groups were not the \"be-all and end-all\".She also said that events of the past few weeks have shown that being multiracial, multi-religious and multilingual was still very important to Singapore.One of these was a video from last weekend showing a Chinese man making racist remarks at a mixed-race couple. Another was a clip of a Chinese woman interrupting her neighbour's Hindu prayers.Such incidents have sparked police investigations and animated discussion among both the public and government leaders.Ms Indranee said racism has existed since the dawn of time - and as a matter of concern for Singapore since its independence.\"It is an ugly thing. We shouldn't have it. You have to fight against it. It comes up from time to time because people have frustrations, they may have personal angst,\" she said. \"When we see it, we should deal with it firmly.\"But Ms Indranee also said this did not mean that Singapore would reach a \"post-race\" stage, nor that the country would disregard markers like religion or language.\"What it means is that you must work very hard to make sure that the different races, religions, languages - with all their wonderful differences which we celebrate - can actually live together peacefully and harmoniously,\" she said. \"And that's constantly a work in progress.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/politics/race-based-data-in-population-census-needed-for-spore-to-help-ethnic-groups", "Source": "google"}