{"Type": "Sport", "Time": "2021-06-17", "Headline": "'Catalyst for change': Malaysian swimmer opens up about abuse", "Text": "KUALA LUMPUR: A former Malaysian national team swimmer says she hopes to become a \"catalyst for change\" after her taboo-breaking decision to open up about alleged sexual assault by a coach.Cindy Ong's story is the latest to cast a harsh spotlight on physical and sexual abuse in sport, and follows a litany of complaints from fellow swimmers, gymnasts and ice-skaters.But her move to go public is a particularly rare and difficult one in a country where social conservatism often discourages people from speaking out.Now 37, she told AFP how the abuse began with the coach inappropriately touching her in her early teens. He also harassed her several years later after she returned from studying overseas.\"A lot of grooming went on over the years,\" said Ong, who remains a successful swimmer, winning five gold and two silver medals at the 2019 FINA World Masters Championship in South Korea.\"He made me think that he was interested in me. He said things like 'I will wait for you'.\"Ong said she felt powerless to stop the coach with the national team, who is about 15 years older than her. Reporting him to sports authorities or the police did not cross her mind.The swimmer, who grew up in the city of Ipoh in northern Malaysia, said that speaking out would have been considered \"extremely taboo\".\"It was just a different era, and it was not possible to speak up. I didn't tell my parents, I didn't tell my friends.\"But Ong said it was an \"open secret\" that he was suspected of abuse, and is believed to have sexually assaulted other swimmers.For now, the mother of three has decided not to pursue a case against the coach or publicly name him, believing too much time has passed. He is no longer with the national team, she said.But Ong wants to help others by bringing attention to what she believes is rampant abuse in sports in the south-east Asian nation.\"I'm honestly trying very hard to advocate, and to push, and to use myself as a platform and a voice for a lot of other people\", she said.\"I hope to be a catalyst for change.\"\"LIBERATED\"Ong was inspired by teenager Ain Husniza Saiful Nizam, who recently sparked a nationwide debate in Malaysia about school harassment after criticising her teacher on TikTok for making a joke about rape.\"I just wanted to echo that and say - look guys, this is happening in sports too,\" said Ong, who was a member of Malaysia's national swimming team for several years before going to study in the United States aged 17.She wants authorities to launch a campaign to tackle abuse in sports, and hopes to encourage the tabling of a long-delayed sexual harassment Bill in parliament, seen as key to boosting protection for women.While many supported her decision to speak out, the reception has not been universally warm.She faced a barrage of obscene comments online and someone even sent her a lewd video - an incident which she reported to police.Malaysia has seen abuse allegations in swimming before - a former national diving coach stood trial for raping a diver and was cleared - but the country is far from alone.Swimming Australia recently pledged to set up an independent female panel to investigate complaints about \"misogynistic perverts\" bydual Olympic silver medallist Maddie Groves.Ong's case is yet to lead to any reforms, but the government is paying attention.The deputy sports minister, Wan Ahmad Fayhsal Wan Ahmad Kamal, tweeted that her claims were a \"serious allegation, will get to the bottom of it\".\"Country's image at stake, no (compromise) on misconduct\".Malaysia's National Sports Council, which promotes the development of sports, did not respond to AFP's requests for comment.After staying quiet so long, the swimmer says she now feels \"liberated\".\"After I spoke out,\"she said. \"I felt more empowered to help other people.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Malaysia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/malaysia-sexual-abuse-swimming-cindy-ong-coach-national-team-15031752", "Source": "google"}