{"Type": "", "Time": "2021-06-17", "Headline": "Khairy: Govt considering mixing vaccines to boost efficacy against Covid-19 variants | The Star", "Text": "\n                    Thursday, 17 Jun 2021\n                PETALING JAYA: The government is considering mixing two different vaccines to boost efficacy against different Covid-19 variants, says Khairy Jamaluddin.The coordinating minister for the National Covid-19 Immunisation Programme said they are currently looking at real world data received from Germany on heterologous vaccinations using AstraZeneca for the first dose and Pfizer-BioNTech as the second dose.Heterologous vaccinations, Khairy said, was a method of using two different vaccines to boost efficacy against different variants.He added that data from this has so far shown to have boosted neutralising antibodies and were more effective against different variants.“We are watching this very closely. We do not want to make a quick decision on this before getting more data. The data points are coming in for heterologous vaccinations and once the technical working group is clear on that, it will advise the committee that I chair with the Health Minister. We will then implement the heterologous vaccinations,” he said during a webinar titled “The Path to Herd Immunity” organised by The Oxford & Cambridge Society Malaysia on Wednesday (June 16).Khairy noted that there is a possibility that they will “end up doing this” as a lot of countries have been doing it to boost the neutralising antibodies, and the efficacy.“Also, when you are facing vaccine supply constraints, you can mix it up to ensure that the effectiveness of the vaccine is still there,” he said.During the webinar, Khairy also said they were thinking of shortening the AstraZeneca dosing interval.However, he said currently they have a problem with the AstraZeneca vaccine supply.“Part of the AstraZeneca supply from Covax was delayed and some of the supplies from Thailand were also slightly delayed. So, we are recalculating our delivery schedules right now to see whether we can shorten the interval period for AstraZeneca,” he said.The AstraZeneca dosing interval is currently at 12 weeks.Separately, Khairy also said that they were working closely with the Education Ministry and are considering inoculating those who would be in their examination-year this year.He said this will include teachers, support staff as well as exam-year students as the Pfizer-BioNTech has been approved for those aged 12 to 15. \nTags / Keywords:\nKhairy Jamaludin\n                                                                ,\n                                                                                                Covid-19\n                                                                ,\n                                                                                                Vaccination\n                                                                ,\n                                                                                                National Covid-19 Immunisation Programme\n                                                                ,\n                                                                                                Efficacy\n                                                                ,\n                                                                                                Pfizer-BioNTech\n                                                                ,\n                                                                                                AstraZeneca\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/news/nation/2021/06/17/khairy-govt-considering-mixing-vaccines-to-boost-efficacy-against-covid-19-variants", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}