{"Type": "", "Time": "2021-06-17", "Headline": "Ngee Ann Poly lecturer who made racist remarks to be fired", "Text": "SINGAPORE — A senior Ngee Ann Polytechnic (NP) lecturer caught on video making racist remarks against an interracial couple in public is to be fired for a \"serious breach\" of the school's Staff Code of Conduct, said NP on Thursday (17 June). In a Facebook post, NP said the staff member, who was not named, has been officially charged with breaching the Code and will be let go. \"Our staff members are expected to respect cultural, ethnic and religious differences in our society. They must uphold secularity and impartiality at all times,\" it added.This follows internal investigations into the aforementioned incident, as well as an online post by an NP alumna alleging that the same staff member had made Islamophobic remarks in class in 2017.\"NP understands that Police investigations are ongoing. We will fully cooperate with the authorities.\"The lecturer, identified in various media reports as Tan Boon Lee, 60, was seen in a viral Facebook video posted by David Parkash on 6 June, arguing with the latter at Orchard Road that interracial dating between Indian men and Chinese women is \"racist\". He added, \"I have nothing against you personally but I think it's racist that the Indians prey on the Chinese girls.\"Three days later, NP alumna Nurul Fatimah Iskandar alleged in an Instagram post that Tan had made Islamophobic comments in a 2017 class. Tan reportedly taught at the polytechnic’s School of Engineering and was suspended by NP last week.NP said that it had reached out to the alumna to \"express regret\" and offer her counselling support. \"We have since met her to get more details of her experience and would like to apologise for the distress that she suffered.\"The school noted that the former student could not recall whether she had emailed her feedback on the incident or raised it during a post-course focus group discussion (FGD) in 2017. FGDs are typically held at the end of every semester to seek students’ feedback on courses and lecturers.And while records of her feedback could not be found, NP is \"committed to preventing a similar incident from occurring again\", and will ensure that students are made aware of the appropriate channels for them to provide feedback in a safe manner. Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeRelated stories:'Horrible': K Shanmugam responds to video of man claiming interracial dating is 'racist'Use of wedding photo for Hari Raya ‘culturally insensitive’ but ‘not racist’: People's AssociationMan jailed over racist remarks on sharonliew86 'parody' accountChina and other nations were attempting to “seize control” of strategically important international organisations so they could be “weaponised”, a new report by the UK parliament’s influential Foreign Affairs Committee said. The report, published Thursday, accused China in particular of “bullying” states to back their position or their candidates for top jobs, using measures including financial leverage “to shift policies away from the cooperation the organisations were created to promote”. TheThe PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saMeet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Hong Kong police rounded up 79 people in a series of raids that shut down two underground casinos and an unlicensed pub in the span of two hours on Tuesday night. In one raid on a Ko Shing Street flat in Sai Ying Pun, officers found a baccarat table and two large televisions used to play online card games, seizing HK$215,000 (US$27,697) in cash, HK$410,000 in chips and five account books. Sixteen men and six women, aged 31 to 74, were inside the premises when officers from the Western special duIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Browsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.Every PC user must read this in 2021 - Do it now.Washington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HouseBeijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityThe US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.Former Taiwanese president Ma Ying-jeou has called on the government to listen to public opinion and allow civilian groups which have different political leanings to the ruling Democratic Progressive Party to import much-needed Covid-19 vaccines. Taiwan, which is battling a surge in cases, has struggled to secure vaccines although it has signed deals to buy 10 million doses from AstraZeneca, 5 million from Moderna and more than 4.7 million doses via the Covax Facility, which is supported by theHong Kong immigration officials will renew the visas of all of Cathay Pacific’s expatriate pilots, but its large contingent of foreign cabin crew will be denied extensions permitting them to remain based in the city, the airline has said. The decision leaves Cathay’s foreign cabin crew at risk of losing their jobs, with the airline saying it would offer the same voluntary redundancy package to affected staff that it offered to others in late April. In its memo on Thursday, Cathay expressed regreThe strategic partnership sees EMERGE working with Mediacorp's Bloomr.SG network to \"develop the knowledge and skills of up-and-coming\" content creators in esports.Learn more about scalp psoriasis. Look for scalp psoriasis treatments.China’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the buLos Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.Mazda Motor Corporation today announced its new technology and product development policy towards 2030 based on the company's long-term vision for technology development, \"Sustainable Zoom-Zoom 2030.\"Celebrated surgeon and author of the New York Times best seller \"The Plant Paradox\" reveals what many have suspected for a long time, and even worse.Chinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiThe freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.The European Union and United States launched a trade and technology council that seeks to “write the rules of the road” on the global economy, in the face of growing competition from China. It was the latest salvo against Beijing on US President Joe Biden’s whistle-stop European tour, which had seen him succeed in rallying support among the G7, Nato and now EU for a much-vaunted transatlantic coalition to face down China’s rising influence. A joint EU-US statement said the council would focus oYou may be surprised by how pressure washing can transform your home. See for yourself. Look for nearby pressure washing services.For Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.A reporter with a pro-Beijing newspaper in Hong Kong accused of making a false statement when accessing a government car registry has been let off the hook after prosecutors agreed to drop the charge on condition of a binding-over order. The prosecution’s decision stood in marked contrast to the justice department’s handling of a case last year involving an RTHK contributor accused of the same act, prompting Principal Magistrate Ivy Chui Yee-mei to question the difference in approach at Thursday", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/ngee-ann-lecturer-racist-remarks-to-be-fired-054317666.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}