{"Type": "", "Time": "2021-06-17", "Headline": "Myanmar village of Kin Ma burns down after clashes - BBC News", "Text": "A village in the centre of Myanmar has been burned down after clashes between the security forces and local guerrillas, leaving at least two people dead. Residents told the BBC that 200 of the 240 houses in Kin Ma were razed to the ground by the military on Tuesday.They said the incident began after forces clashed with a local militia opposed to the governing regime.Dan Chugg, UK ambassador to Myanmar, has condemned the attack. \"Reports that the junta has burned down an entire village in Magway, killing elderly residents, demonstrate once again that the military continues to commit terrible crimes and has no regard for the people of Myanmar,\" a Facebook post read.State television however blamed the fire on \"terrorists\".According to Reuters news agency, MRTV reported that any media that suggested another cause was \"deliberately plotting to discredit the military\". One resident told the BBC that security forces clashed with a People's Defence Force (PDF) on Tuesday. Such groups were formed in the wake of the recent military coup, and have started to fight against the police and military with homemade weapons. \"When the PDF members drew back, they [the security forces] came into the village and started to set alight the houses in the southern part,\" the resident said. \"Almost the whole village was burned down to ashes.'' Another resident said the villagers fled into the woods outside Kin Ma after troops opened fire. Two elderly people however could not run and died in the fire, locals said, while a few more were reported missing.\"The fire was everywhere in the village and we saw big flames,\" the resident said. \"We had to flee for our lives from gunfire and we had to watch it from a distance.\"According to Reuters, the fire was so large it was recorded by Nasa's satellite fire-tracking system at 15:22 GMT on Tuesday.Myanmar's military seized power in February, alleging voter fraud in general elections held the previous year - a vote independent election monitors say was largely free and fair. Demonstrations spread across the country after the coup. Security forces responded with a brutal crackdown, killing more than 800 people and detaining close to 5,000.Could phone footage put Myanmar's leaders in jail?Street tales from Myanmar: 'Take care of our baby if I die'First crew blasts off to new China space stationThree astronauts successfully take off for China's longest ever human spaceflight mission.Biden and Putin praise talks but discord remainsDecoding Biden and Putin's body language. VideoDecoding Biden and Putin's body languageWhy cyber gangs won't worry about US-Russia talks'I walked three days to find a hospital for my son'Covid threat to India's holiest river. VideoCovid threat to India's holiest riverThe vast European mine infuriating the neighboursDecoding Biden and Putin's body language. VideoDecoding Biden and Putin's body languageWhat's going on in Iran's election?‘Mindset shifting’ as more Australians ditch boozeBBC Worklife: The myth of a new digital-nomad movementCruising industry still in choppy watersFootball phrases15 sayings from around the worldKim Jong-un admits North Korea food concerns1First crew blasts off to new China space station2Eriksen to have heart-starting device3Major Australian banks hit by website outage4Botswana diamond could be world's third largest5‘Mindset shifting’ as more Australians ditch booze6World Bank rejects El Salvador Bitcoin request7The 32-year-old taking on Big Tech8The vast European mine infuriating the neighbours9Biden and Putin praise talks but discord remains10© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "Section": "", "Writers": "", "URL": "https://www.bbc.com/news/world-asia-57506196", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}