{"Type": "", "Time": "2021-06-17", "Headline": "Myanmar village destroyed amid clashes between military and anti-junta group | Myanmar | The Guardian", "Text": "Residents say 200 homes in Kin Ma burned to ground after opponents of junta fought with regime’s forcesLast modified on Thu 17 Jun 2021 01.49 EDTA village in central Myanmar has been torched by the military junta, killing at least two people and reducing about 200 homes to piles of ash and rubble, residents have told local media.Security forces set fire to the Kin Ma village, in Magway region, on Tuesday afternoon after fighting with opponents of the junta, according to residents. More than 1,000 people are sheltering in the forest and nearby villages, while at least two elderly people, who had been unable to flee, were burned to death, villagers told the Irrawaddy news site.MRTV state television blamed “terrorists” for the fire, and said that media who reported otherwise were “deliberately plotting to discredit the military”. MRTV said 40 “terrorists” set fire to a house in Kin Ma, starting a fire that spread to 100 of the village’s 225 homes.However, residents told Reuters that only 30 houses in the village remained, while some 200 homes had been burned to the ground. The blaze was large enough to be recorded by Nasa’s satellite fire-tracking system at 9.52pm on Tuesday, the news agency reported.Photographs of the village showed a haze of smoke above piles of rubble, where homes once stood. Burnt planks of wood, sheet metal, bricks and cooking pots were scattered around, with only a few trees left standing. Some images showed animal carcasses.Dan Chugg, the UK ambassador to Myanmar said in a statement: “Reports that the junta has burned down an entire village in Magway, killing elderly residents, demonstrate once again that the military continues to commit terrible crimes and has no regard for the people of Myanmar.”Myanmar’s military is already accused of burning hundreds of villages in 2017, during a brutal crackdown that that drove about 700,000 Rohingya Muslims to flee to Bangladesh, and which has since led to a genocide case in the Hague. Security forces denied setting fires, and even blamed Rohingya for doing so in some instances.According to interviews given to the outlet Myanmar Now, security forces arrived at Kin Ma on Tuesday, searching for a man who was suspected of shooting at the house of a junta-allied official in another village. After fighting with opponents of the coup outside the village, and apparently losing 15 soldiers, the junta forces set fire to the village, local people told the outlet. The Guardian was unable to verify the claims.The military’s seizure of power initially prompted huge protests, where millions took to the streets to call for the return of democracy. However, security forces unleashed brutal forces on protesters, repeatedly opening fire on peaceful marches and rounding up activists during night time raids. As street demonstrations have waned, some have taken up arms to protect their communities and oppose the junta.UN special rapporteur for Myanmar, Tom Andrews, warned earlier this month of a rapidly deteriorating security and humanitarian situation in parts of the country, where he said junta bombs had displaced more than 100,000 people. People who had been forced to flee their homes were at risk of mass deaths from starvation and disease, he said in a grim warning.The military has killed more than 860 civilians since seizing power in a coup on 1 February, according to the Assistance Association for Political Prisoners (Burma), a rights group that tracks casualties and arrests.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/world/2021/jun/17/myanmar-village-destroyed-clashes-military-anti-junta", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}