{"Type": "", "Time": "2021-06-17", "Headline": "Woman allegedly made disturbing discovery on car after receiving unusual message: 'New fear unlocked'", "Text": "A woman said she made a disturbing discovery on the car she’d been driving after receiving an unexpected alert.TikTok user @murasakisweetpotatoes took to the app to share her experience and seek advice from the audience. “Happy birthday to me … big emergency,” she said. “I’m relying on TikTok, as always, to tell me what the f*** is going on. I was notified like 30 minutes ago that an AirTag was following me.”An AirTag is a device similar to the Tile that tracks easily misplaced objects like a purse or a set of keys. The gadget uses Bluetooth to ping its location to nearby Apple products. “I found a tracking device behind the license plate of my brother’s car that I’ve been driving,” @murasakisweetpotatoes said, trying to smile through what appeared to be a horrifying situation. “While as a Gemini I feel flattered, as a citizen, I feel concerned … we called local law enforcement …. and police took the serial number, so we’ll see what happens.”In a follow-up post, the TikToker alleged that she received a notification from the “Find My” app on her phone that a device nearby. Her brother confirmed that he had no idea where it came from and didn’t even know what an AirTag was.According to Apple’s official website, that featured is “designed to discourage unwanted tracking.” If someone else’s AirTag becomes attached to your or your items in any way, it will send you an alert. If you still haven’t found it after some time, it will start playing a sound, so you know it’s there. These alerts are only triggered when an AirTag is separated from its owner, so you would not receive an alert if you were traveling with one, say, on a train with other Apple device users. User @murasakisweetpotatoes clarified that if there was a notification, she didn’t hear one. This was most likely because the AirTag was attached to the outside of the car.She claimed Apple required her to give law enforcement the serial number of the stray device and required a court order before giving law enforcement any information regarding the device’s owner.“This could have been completely random or someone stalking my little brother,” @murasakisweetpotatoes said. She claimed that police told her they were too busy when she followed up with them about the incident and said she should call back in a week. She did not have any more answers about who could have placed the device behind the car’s license plate. The incident left commenters spooked. “New fear unlocked,” one user said. “This is so scary,” another wrote. “When I heard about this device, it REALLY creeped me out. I don’t really see any other purpose other than stalking,” a third remarked.These delicious keto recipes will get you through the summer:In The Know is now available on Apple News — follow us here! If you found this story interesting, read more about a woman who found a Tile in her purse after eating at a restaurant. More from In The Know:Woman claims neighbor called police over her “dressing inappropriately”Barack Obama’s first presidential memoir is out now — and it’s cheaper to read with KindleThese inexpensive silky-soft pillowcases on Amazon are good for your hair and your skinThe 3 most affordable meal delivery kits for cooking at homeThe post Woman allegedly made disturbing discovery under license plate after receiving an unusual message appeared first on In The Know.Australia recommended that AstraZeneca's Covid-19 jab should not be given to people under 60 on Thursday, a fresh blow to the country's glacial vaccine rollout.When 28 Chinese warplanes streaked through the skies around Taiwan on Tuesday – the largest such incursion this year – they followed a pattern that has generated alarm among US and Taiwanese military planners.Los Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.The freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.If you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Israel's ultra-Orthodox parties were once viewed as political kingmakers, but now they have been pushed into opposition by a \"change\" government they fear will put secular values before theirs.The global infrastructure plan announced by G7 leaders aims to offer developing nations a credible alternative to China's much-criticized Belt and Road Initiative -- but it faces major hurdles on the ground, especially if Beijing's hiccups are any indication.The newly-formed Amihan Esports Wild Rift squad went from unknown to become the dark horses that took down Team Secret at the Wild RIft PPGL Summer Playoffs.If you’re wondering whether Ethereum is a good long term investment, keep reading.Purchases of new private units in Singapore declined about 30% to 891 in May from 1,268 in April, Urban Redevelopment Authority figures showed.For Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neItaly became the first team to reach the knockout stage of Euro 2020 as midfielder Manuel Locatelli scored twice in a 3-0 win over Switzerland in Rome on Wednesday, while Wales moved to the brink of joining them by beating Turkey.Burner phones, safehouses, sheltering with rebels and months away from loved ones -- Myanmar anti-coup activists have been driven underground by a brutal crackdown but have no regrets about choosing life on the run.Two experienced astronauts are among the first three-man crew for China’s first space station, with final preparations under way for their mission launch on Thursday. The Long March 2F rocket carrying them to the Tianhe module – the first part of the Tiangong space station – is expected to lift off at around 9.22am from the Jiuquan satellite launch centre in the Gobi Desert. Propellant refuelling for the rocket was under way on Wednesday morning, according to the China Manned Space Engineering OA former mayor in northern Mexico has been condemned to eight years in prison for his involvement in the 2017 murder of journalist Miroslava Breach, prosecutors said Wednesday.There was no talk of gazing into Vladimir Putin's \"soul\" and the Russian president didn't try to gaslight a rookie US leader.Blackstone Group is nearing an agreement to acquire office developer Soho China Ltd. in what would be its biggest real estate investment in China, people familiar with the matter said.Hong Kong police arrested the chief editor and four executives of pro-democracy newspaper Apple Daily on Thursday, raiding its newsroom for a second time in the latest blow to the outspoken tabloid.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/woman-allegedly-made-disturbing-discovery-200008940.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}