{"Type": "", "Time": "2021-06-17", "Headline": "Japan seeks to end Tokyo coronavirus emergency a month before Olympics, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.TOKYO (BLOOMBERG) - The Japanese government recommended ending a state of emergency for Tokyo, Osaka and other areas on June 20 as planned, because infections have fallen about a month before the country is due to host the Summer Olympics.Economy Minister Yasutoshi Nishimura, who is also in charge of Covid policy, said Thursday (June 17) the government is seeking to allow the measure to end, about two months after it was first imposed in the capital.The formal decision will be made by Prime Minister Yoshihide Suga, who will have a news conference later Thursday to discuss the issue.The Olympics, delayed by a year due to the coronavirus, appear well on track for a July 23 start, even though surveys show large numbers of the Japanese public want to call off or delay the global sports spectacle out of fears it could become a superspreader event.Olympic organisers are set to make a decision later this month on whether to allow spectators. The government is backing a 10,000-person limit on public events, which could be applied to the Olympics, and Mr Suga has said he would like to see fans in the stands for the games.Virus management is crucial for Mr Suga, who faces a party leadership election in September and must hold a general election by the end of October.While none of the opposition parties has enough backing to topple his ruling Liberal Democratic Party (LDP), any major stumbles with public health related to the Olympics could prompt the LDP to replace Mr Suga as premier.Infection numbers have fallen in Tokyo from 1,027 on April 29 to a seven-day average of 385 new cases a day as of June 16, but the pace of the decline has slowed recently.Japan's vaccination rollout, which has accelerated in recent weeks, still ranks among the slowest for a developed country, with the bulk of the population likely not having received a dose by the start of the Olympics opening ceremony.Focused virus measures will be in place through July 11 for many of the areas where the emergency is lifted, including the capital and Osaka, Mr Nishimura said.Under the current emergency, bars and restaurants are banned from serving alcohol, and must close by 8pm, and individuals are urged to avoid unnecessary travel.Mr Nishimura said eateries will be allowed to serve alcohol until 7pm if certain conditions are met.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/japan-seeks-to-end-tokyo-coronavirus-emergency-a-month-before-olympics", "Source": "google"}