{"Type": "", "Time": "2021-06-17", "Headline": "Those Above 18 Can Walk-In To Get COVID Vaccination Without Pre-Registration, Booking On CoWIN", "Text": "Making a significant change in the vaccination process in India, the government has said that pre-registration and booking of appointments through the CoWIN portal is not mandatory to get the jab.The Ministry of Health and Family Welfare said that  anyone over the age of 18 can directly go to their nearest vaccination center to get registered on the CoWIN digital platform and get the dose. \nBCCL\"Anyone aged 18 years and above can directly go to the nearest vaccination centre wherein the vaccinator performs the on-site registration and provides vaccination,\" the health ministry said.GoI is committed to provide #VaccineForAll under world’s #LargestVaccineDrive Prior registration on #COWIN is not required to get vaccinated.Walk-in & assisted registrations are being facilitated for citizens above 18y of age at all #COVID19 vaccination centres in the country. pic.twitter.com/3RTtKX8qI9 The facilitated registration through the Common Service Centres on CoWIN, is just one of the many modes of registration on CoWIN, it said.Facilitators such as health workers or ASHAs, also mobilize beneficiaries in rural areas and those residing in urban slums, for on-site registration and vaccination directly at the nearest vaccination centers. The facility for assisted registrations through the 1075 Help Line has also been operationalized, it added.Anyone aged 18 years and above can directly go to the nearest vaccination centre wherein the vaccinator performs the on-site registration and provides vaccination.#COVID19Vaccination This comes as the government is trying to ramp up the vaccine rollout process amid the fear of a third wave of COVID-19 in the country later this year.\nBCCLCiting the difficulties in the registration on CoWIN platform and getting appointment slots many have been urging the government to allow walk-in and spot registration for getting the vaccine.Booking an appointment slot has been a particularly challenging task for many, especially those in rural areas due to poor telecommunication infrastructure.The government has however blamed 'vaccine hesitancy' among the people for the slow pace of vaccinations in rural areas.Last week, the government had advised states to focus on increasing second dose coverage among healthcare workers (HCW) and frontline workers (FLW).\nAFPIn a high-level meeting chaired by Union Health Secretary Rajesh Bhushan, low vaccination coverage was highlighted and states were also informed about the modifications of the CoWIN platform to make it more effective.\"States/UTs were asked to sharpen their focus and prepare effective plans for expediting the second dose administration for the HCWs and FLWs. States were asked to dedicate special time slots or sessions for the exercise,\" a statements said.As per the statement, the national average for the 1st dose administration among the HCWs is 82 per cent and the national average for the second dose among HCWs is only 56 per cent.\nAFP18 States/UTs including Punjab, Maharashtra, Haryana, Tamil Nadu, Delhi and Assam have coverage below the national average in this aspect.For FLWs, the national average of 1st dose coverage is 85 per cent but the national average of second dose coverage for FLWs is only 47 per cent. 19 States/UTs have reported 2nd dose coverage of FLWs less than the national average. Among them are Bihar, Haryana, Maharashtra, Tamil Nadu, Andhra Pradesh, Puducherry, Telangana, Karnataka, and Punjab.Start a conversation, not a fire. Post with kindness.Get the NEWS that fits your groove.Subscribe to Indiatimes and get handpicked updates based on your interests!Connect With Us On", "Section": "", "Writers": "", "URL": "https://www.indiatimes.com/news/india/those-above-18-can-walk-in-to-get-covid-vaccination-without-pre-registration-on-cowin-542782.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}