{"Type": "Asia", "Time": "2021-06-17", "Headline": "Hong Kong police raid newspaper Apple Daily, arrest 5 including editor-in-chief", "Text": "HONG KONG: Hong Kong police arrested five executives at the Apple Daily early Thursday (Jun 17) morning, including its editor-in-chief Ryan Law.It was the second time in less than a year that the newspaper's office has been raided. More than 500 police officers were involved in Thursday's operation, which authorities said was sparked by articles Apple Daily had published \"appealing for sanctions\" against Hong Kong's and China's leaders.Police officers were seen sitting at computers in the newsroom after entering with a warrant to seize journalistic materials, including from reporters' phones and laptops.The warrant, which police said was aimed at gathering evidence for a case involving the national security law that Beijing imposed last year, raises further concerns about media freedom in the city.Officials said the five executives were arrested for collusion with a foreign country or external elements \"to endanger national security\".\"They have overall responsibility for the content, style and principles of news reporting,\" senior superintendent Steve Li told reporters.Authorities also confirmed HK$18 million (US$2.3m) in Apple Daily assets had also been frozen under the security law, the first time a seizure order has been made directly against a Hong Kong media company, rather than an individual.Police officers gather outside the headquarters of Apple Daily in Hong Kong, Jun 17, 2021. (Apple Daily via AP)Security Secretary John Lee described the newsroom as a \"crime scene\" and said the operation was aimed at those who use reporting as a \"tool to endanger\" national security.\"We are talking about a conspiracy in which these suspects try to make use of journalistic work to collude with a foreign country or external elements to impose sanctions or take hostile activities against Hong Kong and ... China,\" Lee said.He did not elaborate on which articles the police action was taking aim at.\"It is your choice whether you will regard them as part of you who go about your journalistic work lawfully and properly,\" he told reporters.Senior superintendent Li said the tabloid published dozens of reports dating back to 2019 that \"incited foreign countries to impose sanctions\", without saying when the most recent articles in question were.The legislation is not retrospective but prosecutors can use actions from before its implementation as evidence.'BLATANT ATTACK'The five people arrested were editor-in-chief Ryan Law, chief executive officer Cheung Kim-hung, chief operating officer Chow Tat-kuen, deputy chief editor Chan Puiman and chief executive editor Cheung Chi-wai.\"This is a blatant attack on the editorial side of Apple Daily. They are arresting editors. They're arresting the top editorial folks,\" Mark Simon, an adviser to Jimmy Lai, told Reuters.The tabloid's billionaire owner Lai, 73, was charged with collusion after hundreds of officers searched the paper's newsroom last August. He is currently serving multiple jail sentences for attending various protests.The paper broadcast live footage of the police raid on Thursday on its Facebook account. Officers could be seen cordoning off the complex and walking through the building.\"They arrived around 7am this morning, our building is besieged,\" an unnamed reporter said in a live commentary with the broadcast. \"Now we can see them moving boxes of materials onto their truck.\"\"Police are restricting us from using quite a lot of our equipment. But we can still keep this live camera on and our website will keep updating,\" the voice added.Chief editor Law was seen walking in handcuffs, flanked by police officers. The Apple Daily paper's general news desk told reporters in a text message seen by Reuters to carry on with their assignments outside the building for the time being.The move is the latest blow to Apple Daily after authorities last month directed Lai's shares in Next Digital, publisher of the newspaper, to be frozen.The union representing Apple Daily's journalists described the operation as a \"wanton violation of press freedom\" that \"displayed how much police power has inflated under the national security law\".In an interview with AFP last month, Law struck a defiant tone. He admitted that the paper was in \"crisis\" since the jailing of its owner Lai but said his reporters were determined to press on with publishing.At a recent townhall meeting, staff members asked Law what they should do if the police came back to arrest him.He had a simple reply: \"Broadcast it live.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Hong Kong,Apple Daily", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/hong-kong-police-raid-newspaper-apple-daily-arrest-5-ryan-law-15031142", "Source": "google"}