{"Type": "", "Time": "2021-06-17", "Headline": "Covid-19: You may walk in for jab after inoculation of the pre-registered is completed, says Khairy | The Star", "Text": "\n                    Thursday, 17 Jun 2021\n                PETALING JAYA: Walk-ins to vaccination centres will be introduced once those who have pre-registered for the Covid-19 vaccines have been inoculated, says Khairy Jamaluddin.The coordinating minister for the National Covid-19 Immunisation Programme said that this might happen by the end of August or in mid-September once those who are pre-registered have been immunised.“I think once we have cleared them (those who are pre-registered) by the end of August or early September, then we will introduce walk-ins.“You can just show up and be vaccinated. You will not need a registration anymore,” he said during a webinar titled “The Path to Herd Immunity” organised by The Oxford & Cambridge Society Malaysia on Wednesday (June 16).Presently, walk-ins are not available as the government has to be fair to those who have registered, said Khairy.“We have to give out those appointments first. Once that is done then we can open it up and anyone can just turn up to get vaccinated,” he added.During the webinar, Khairy also explained the reasons why other vaccines such as those by Moderna and Sinopharm are not available in the country.He said the registration of pharmaceutical products in Malaysia has to have a local product registration holder.“There has to be a company here that is responsible for the product. For Pfizer-BioNTech and AstraZeneca, they have subsidiaries here while for Sinovac, it doesn't, so it appointed Pharmaniaga to become its product registration holder,” he said.With the Moderna vaccine, Khairy said there is no product registration holder, noting that nobody has come forward to express an interest in registering the vaccine.“We have been talking to pharmaceutical companies but there is no private pharmaceutical company that wants to register it.\"We can facilitate it, we can ask for the data from Moderna or Sinopharm from all these pharmaceutical companies, and approve it, then it can be sold in the private market,” he said.Separately, Khairy also said that in the private sector model which will come later, where the private sector will purchase and procure the vaccines, they will have to work out their own liability when administering the Covid-19 vaccines.“Under the government programme, the pharmaceutical companies have indemnified themselves so we have created a vaccine injury fund for it.\"For instance, if there is proof of causality that results in constant or long-term hospitalisation then we will make monetary compensation, and if there is death that has a causal link to the vaccine, we will pay out up to RM1mil.“So private hospitals will have to come up with a similar scheme for vaccine injury,” he said.Meanwhile, Khairy, when explaining the objectives of the National Covid-19 Immunisation Programme, noted that he will be cautious in using the term “herd immunity” as Covid-19 may stay around for quite some time.“I have stopped using that term but some of the other leaders are still using it.“I have advised the Prime Minister to be careful about using that term ‘herd immunity’ simply because, as the coordinating minister looking at the data and science, I am of the view that this may very well be endemic as we may see Covid-19 in a less threatening form but it will stay with us for quite some time,” he said. \nTags / Keywords:\nKhairy Jamaluddin\n                                                                ,\n                                                                                                Covid-19\n                                                                ,\n                                                                                                vaccination\n                                                                ,\n                                                                                                walk-in\n                                                                ,\n                                                                                                Moderna\n                                                                ,\n                                                                                                Sinopharm\n                                                                ,\n                                                                                                Pfizer-BioNTech\n                                                                ,\n                                                                                                AstraZeneca\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/news/nation/2021/06/17/covid-19-you-may-walk-in-for-jab-after-inoculation-of-the-pre-registered-is-completed-says-khairy", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}