{"Type": "", "Time": "2021-06-17", "Headline": "Must-reads, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.More Singaporeans staying single, having fewer babiesAmid Singapore's slowest decade of population growth since independence, more Singaporeans are staying single, and even those who marry are having fewer babies. The nation's sixth census also found that Singapore residents of all ages and races are now better educated, and more do not consider themselves as having a religion. More than 3,400 staff and visitors of Ion test negativeMore than 3,400 retail staff and visitors of Ion Orchard who had to take a compulsory Covid-19 swab test have tested negative for the virus. The Ministry of Health (MOH) said it concluded the mandatory testing on Tuesday. Another 11,395 people who visited the mall voluntarily stepped forward for testing, said MOH. Biden, Putin meet for first summit to iron out US-Russia relationsUnited States President Joe Biden and Russian President Vladimir Putin sat down in a lakeside Geneva villa yesterday for their first summit since Mr Biden took office. Both had said they hoped for more stable and predictable relations, even though they were at odds over everything from arms control and cyber hacking to election interference and Ukraine. New Covid-19 treatment spells hope for IndiaTraumatised by its recent calamitous battle with Covid-19 and apprehensive of a third wave, India has found a silver lining in a new treatment for Covid-19 patients - a powerful infusion of laboratory-made antibodies. Several Indian hospitals reported encouraging results after using this therapy on some patients. Man's death ruled as a misadventureThe death of a man who made headlines more than 20 years ago for being Singapore's youngest bone marrow donor as a 15-month-old infant has been ruled as a misadventure. Mr Seamus Shi Liang died on Dec 2 last year after a part of a machine he was fixing while working fell on his head. Delay in delivery of Tesla's first cars hereTesla's delivery of its first cars here has been delayed by between two and six months, its schedule upset by a worldwide chip shortage, the pandemic and high demand. Buyers who have been in touch with the company said it had secured certificates of entitlement for its first cars in the May and June tenders. Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/must-reads-156", "Source": "google"}