{"Type": "", "Time": "2021-06-17", "Headline": "Biden, Putin end summit in shorter time than predicted, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.GENEVA • US President Joe Biden and his Russian counterpart Vladimir Putin met in Geneva yesterday for their first summit since Mr Biden took office, but their talks lasted less than four hours - far less than Mr Biden's advisers had said they expected.Both had said they hoped for more stable and predictable relations, even though they were at odds over everything from arms control and cyber hacking to election interference and Ukraine.Mr Putin and Mr Biden shook hands on arrival at the Villa La Grange, but the news that there would be no joint news conference meant there was none of the joviality that accompanied a 2018 meeting between Mr Putin and then US President Donald Trump.\"Mr President, I'd like to thank you for your initiative to meet today,\" Mr Putin said, sitting next to Mr Biden. He added: \"US and Russian relations have a lot of issues accumulated that require the highest-level meeting.\"Mr Biden said they would try to determine areas of cooperation and mutual interest. \"It is always better to meet face-to-face.\"He flashed a \"thumbs-up\" to reporters as he left the lakeside villa where the talks were held and got into his limousine.Aides had earlier played down hopes for the summit. \"We're not expecting a big set of deliverables out of this meeting,\" a senior United States official said.\"I'm not sure that any agreements will be reached,\" said Mr Putin's foreign policy adviser, Mr Yuri Ushakov.The first round of talks - which included Mr Biden, Mr Putin, US Secretary of State Antony Blinken and Russian Foreign Minister Sergei Lavrov - lasted almost two hours, officials said.Talks resumed after a break, with Moscow's ambassador to the US, Mr Anatoly Antonov, who was recalled to Russia in March, among those present. That round ended after about an hour.Relations between Moscow and Washington have been deteriorating for years, notably with Russia's 2014 annexation of Crimea from Ukraine, its 2015 intervention in Syria and US charges - denied by Moscow - of meddling in the 2016 election that brought Mr Trump to the White House.They sank further in March when Mr Biden said he thought Mr Putin was a \"killer\", prompting Russia to recall Mr Antonov for consultations. The US recalled its own ambassador in April.Kremlin spokesman Dmitry Peskov said the two presidents would \"need to determine how to proceed with the heads of the diplomatic missions\", according to Russian news agencies.While the issues were difficult, the immediate surroundings of Villa La Grange, a mansion set in a 30-ha park overlooking Lake Geneva, was at least serene, with a heavy police presence.Arms control is one area where progress has historically been possible despite wider disagreements. In February, Russia and the US extended for five years the New Start treaty, which caps the number of strategic nuclear warheads they can deploy and limits the land-and submarine-based missiles and bombers to deliver them. The senior US official said Mr Biden would also define areas of vital national interest where Russian misconduct would bring a response.Mr Biden signed an executive order in April giving Washington wide latitude to impose sanctions on Moscow. In a sign of the strain in ties, there was no joint meal.Mr Putin, 68, was due to hold his news conference shortly after the end of talks, and Mr Biden, 78, some 45 minutes later.Mr Vladimir Frolov, a former Russian diplomat, said Mr Putin wanted Russia to be treated with respect, as members of the Soviet Politburo were in the 1960s-1980s, with \"a symbolic recognition of Russia's geopolitical parity with the US\".\"In exchange, they (Moscow) would be willing to cut back on some of the loony stuff,\" Mr Frolov said. This might mean \"no poisonings, no physical violence, no arrests/kidnappings of US and Russian nationals; no interference in domestic politics\".Mr Trump's summit with Mr Putin in Helsinki included a meeting accompanied only by interpreters, but Mr Biden and Mr Putin had no solo talks.Standing beside Mr Putin in Helsinki, Mr Trump refused to blame him for meddling in the 2016 US election, casting doubt on the findings of his own intelligence agencies and sparking a storm of domestic criticism.REUTERSJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/biden-putin-end-summit-in-shorter-time-than-predicted", "Source": "google"}