{"Type": "Sport", "Time": "2021-06-17", "Headline": "Football: Denmark sees surge in 'heart runners' after Eriksen's cardiac arrest", "Text": "COPENHAGEN: The cardiac arrest suffered by Denmark midfielder Christian Eriksen during a Euro 2020 match has seen a seven-fold increase in sign-ups for the \"heart runner\" app, which allows emergency services to quickly direct citizen responders to assist heart attack victims.Eriksen's life was saved when CPR was administered to him on the pitch and his heart was re-started with a defibrillator before he was taken to hospital, where he is recovering.The incident shocked millions of TV viewers around the world and prompted hundreds of Danes to sign up for the app as volunteers who will make themselves available in similar situations.\"This tragic incident has put in perspective what is really important, and that you and I can make a difference by performing CPR,\" Fredrik Folke, clinical professor at Copenhagen University and head of research at the Copenhagen Emergency Medical Service, told Reuters.\"In a normal weekend we would have around 90 to 100 new signups, but just after the match and until the next morning we had around 700 new signups.\"The app is part of a scheme backed by non-profit foundation TrygFonden, and Folke says almost all those signing up as volunteers have had formal CPR training.\"You sign up for the app and you register. If there's a cardiac arrest, we can automatically alert the ten nearest citizen responders and they would receive the alert immediately,\" Folke said.\"They will be instructed to either run directly to the cardiac arrest and do CPR, or directed to the nearest defibrillator in the vicinity, which they can use before the emergency services arrive.\"Eriksen's collapse during the match against Finland has prompted calls around the world for more CPR training and for defibrillators to be more available, not least at sports grounds and training facilities.Doctors are still trying to establish the cause of Eriksen's heart stoppage. The Inter Milan player has posted a picture of himself on social media thanking fans for their support.According to statistics from TrygFonden, the chances of surviving a heart attack increase from less than 10per cent to over 70per cent if the victim receives CPR and a shock from a defibrillator before the ambulance arrives.As shown at Copenhagen's Parken Stadium on Saturday, quick action is necessary.\"You can't do anything wrong when you do CPR - the only wrong thing you can do is to not do anything,\" Folke said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "news and politics,CPR,Christian Eriksen,Denmark", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/football-denmark-sees-surge-in-heart-runners-after-eriksen-s-15027574", "Source": "google"}