{"Type": "", "Time": "2021-06-17", "Headline": "Myanmar's renewed war scatters tens of thousands to forests, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.YANGON (REUTERS) - Some camps dotted in the forest have a few dozen people, some more than a thousand. The displaced sleep packed together under plastic sheeting for protection from Myanmar's monsoon rains.Food is short and there are signs of disease spreading, according to people who have fled recent fighting in eastern Myanmar's Kayah State - just one of several conflicts to surge since the Feb 1 coup toppled elected leader Aung San Suu Kyi.\"Some children are suffering diarrhoea. It is difficult to get clean water here. Some people didn't get a chance to bring rice or food,\" said 26-year-old Foung, who gave only one name for fear of retribution.\"We pray,\" he said, sharing pictures of the tarpaulin slung between boulders under the trees where he now sleeps.The United Nations estimates nearly 110,000 people have been displaced in Myanmar's Kayah State by the recent violence.With new fighting in northern and western Myanmar, nearly 200,000 people have fled homes elsewhere since the coup, by far the biggest mass movement since the 2017 exodus of 700,000 Rohingya Muslims in the face of an army offensive.The junta has branded its opponents as terrorists - including Peoples Defence Forces such as the newly formed Karenni National Defence Force which has been fighting in the region since last month, initially inflicting casualties on the army too.Although the group said it would halt attacks on Tuesday (June 15) after appeals from communities, many of those taking refuge in the forest show little sign of readiness to take the risk of heading back to their homes.\"Some people from remote villages went home to take bags of rice and stuff during the ceasefire period, but most do not dare to stay,\" said Mr John Canaydy, from a village near the town of Demoso, centre of much of the fighting.\"Staying in the camp is safer than staying in our own homes,\" said Mr Canaydy, who is on the junta's wanted list for taking part in anti-military protests.In a bulletin on Tuesday, the UN Office for the Coordination of Humanitarian Affairs said aid efforts by national and international groups to complement the work of local communities had not been sufficient to address all needs.\"Efforts have been met with access challenges due to insecurity and roadblocks,\" it said.Some displaced people have tried to sneak into deserted towns and villages under cover of darkness to try to get food to bring back to the forest.At least three volunteers had been killed by the junta's forces when they tried to bring help, said Mr Banya Khung Aung, director of the Karenni Human Rights Group.\"One-third of the population are now in the forest,\" he said. \"Neglect may cost many lives.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/myanmars-renewed-war-scatters-tens-of-thousands-to-forests", "Source": "google"}