{"Type": "Asia", "Time": "2021-06-17", "Headline": "Japan condom-makers fear anticlimax at Olympics", "Text": "TOKYO: For Japanese condom makers, the Olympics was supposed to be a golden opportunity, with hordes of eager tourists and tens of thousands of their innovative, ultra-thin prophylactics given to athletes.But a ban on overseas fans, strict virus rules, and regulations preventing the distribution of their premium condoms to competitors have left manufacturers deflated.Since the 1988 Seoul Games, hundreds of thousands of free condoms have been distributed at the Olympics, to encourage safe sex as the world's elite athletes mingle at close quarters.While organisers are still expected to hand out 160,000 at the pandemic-postponed Games, which start next month, COVID-19 rules should limit interaction in the Olympic Village.The rulebook for athletes specifically warns them to \"avoid unnecessary forms of physical contact\", leaving some wondering why condoms are being distributed at all.The plan to give them out \"is something I just cannot comprehend\", tweeted Ken Noguchi, a Japanese mountaineer and environmental activist.Games organisers say distributing condoms is meant to raise awareness about HIV/AIDS, and that the International Olympic Committee has asked for the handouts to continue this year, despite the pandemic.\"The distributed condoms are not meant to be used at the Olympic Village,\" the organising committee told AFP.Instead they are supposed to be \"brought back by athletes to their respective home countries and to help them support the campaign to raise awareness\", they added.While the distribution is going ahead, there's a wrinkle for manufacturers: A ban on their prized model, condoms that are just 0.01mm thick.HARD TIMESAs soon as Tokyo was named 2020 host, Japanese condom firms thrust ahead with their manufacturing to ensure maximum coverage in time for the Games.Now it turns out the manufacturers can only distribute their latex-based condoms, while the ultra-thin models are made of polyurethane, according to the Japan Condoms Industrial Association.\"When I learned about the requirement, I thought, 'Oh my God ... can that be right?\" an industry source told AFP.\"We had really counted on being able to offer these (ultra-thin) ones.\"It's a far cry from the heady excitement in the run-up to the Games before they were postponed last year.In 2018, leading condom-maker Sagami Rubber Industries opened a new factory in Malaysia to meet the expected rise in demand.\"It's only Japanese companies that now manufacture condoms as thin as 0.01-0.02mm,\" spokesman Hiroshi Yamashita told AFP at the time.\"We see (the Tokyo Games) as an extremely precious opportunity to let the world know about Japan's high technology.\"The pandemic has brought on hard times, with Japan's borders effectively closed to tourists and Olympic organisers barring overseas spectators for the first time in history.In Tokyo's quirky Harajuku and bustling Shibuya neighbourhoods, the Condomania boutiques managed by Koji Negishi usually attract large numbers of tourists.But \"foreign tourists have basically disappeared from this area, compared to 2019\", he told AFP.Negishi's shops stock a variety of products intended to appeal to visitors, ranging from the famed barely-there prophylactics to souvenirs printed with iconic Ukiyoe woodblock prints, like the \"Great Wave\" with Mount Fuji in the background.\"The ones that are designed as souvenirs don't sell at all,\" Negishi said mournfully.\"Now our shop is staying afloat thanks to regular customers from the neighbourhood,\" he added.However, COVID-19 restrictions in Tokyo have also reduced the number of Japanese customers.An industry source said domestic tastes appear to favour condoms with extra lubricant, rather than the ultra-thin style.\"From a safe sex perspective, what we want is people using any condom, rather than none,\" he said.\"So at the end of the day, whatever people choose because it feels good to them is a good thing to us.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Japan,Olympics,Tokyo 2020", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/covid-19-japan-olympics-condom-makers-business-tourists-15032632", "Source": "google"}