{"Type": "", "Time": "2021-06-17", "Headline": "\n        Mancini fires Euro 2020 warning after identifying Italy fault; allays key injury fear    ", "Text": "Date published: Wednesday 16th June 2021 10:52               - Steve Pearson Italy manager Roberto Mancini indirectly fired a warning to every team at Euro 2020 after highlighting a frequent shortcoming against Switzerland.Italy became the first team to book their place in the Last 16 at Euro 2020 after registering hugely impressive back-to-back 3-0 victories. Manuel Locatelli bagged a career first before Ciro Immobile notched late on in a performance where Italy never let up.Give our social media channels a follow – we’re on Facebook, Twitter and InstagramToday’s result raised their scarcely believable tally of unanswered goals across all competitions to 31. Additionally, they have now registered 10 successive clean sheets.Speaking after the match (via Corriere dello Sport), Mancini said: “The team played a difficult match, they are good and physical, we struggled at the beginning but then we deservedly won. We could have closed it earlier but we did well, it wasn’t easy.”On the outstanding performance of Locatelli, the ex-Man City boss said: “He played a great game. Two goals for a midfielder is not easy, but everyone was good because this was the second game in five days.MATCH REPORT: Imperious Italy despatch Switzerland as Locatelli registers career first“We want to get out of the back to get to the attackers, we often missed the last pass. The goals were very good and we could have closed the game even earlier.”Allaying fears of a Giorgio Chiellini layoff after the veteran was substituted early, Mancini added: “Let’s hope it’s nothing. serious, we’ll see tomorrow.”When asked if he views France as the favourites, Mancini concluded: “There are national teams that are ahead of us in the work of growth, but in football anything can happen. This Italy can grow, I repeat. There are many young players, the margins are great.” Speaking on BBC Radio 5 Live, pundit Leon Osman labelled Italy “outstanding” and insisted others must now take note.“Brilliant performance from Italy and they controlled it from start to finish,” said the ex-Everton midfielder.“Three wonderful goals and they really look like a team that people will have to take notice of. They played against a decent Switzerland side, controlled the game and looked outstanding.“I really enjoyed watching them and they were full of energy which is great to see in the modern game. They want to score goals and entertain. They look impressive from what we’ve seen so far.”Manuel Locatelli scored twice in the same game for the first time in his career at...England playmaker Jack Grealish is desperate to play against Scotland and prove to Europe how good...Wales boss Rob Page hailed a star who \"can't even get in a Championship side,\" while...Gary Neville believes Gareth Southgate has a dilemma concerning injured defender Harry Maguire ahead of the...", "Section": "", "Writers": "", "URL": "https://www.teamtalk.com/news/mancini-italy-fault-allays-chilellini-injury-fear", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}