{"Type": "", "Time": "2021-06-17", "Headline": "Thailand sets mid-October to reopen to vaccinated visitors - The Washington Post", "Text": "BANGKOK — Thailand plans to fully reopen to vaccinated foreign visitors by mid-October as the government seeks to restart the crucial coronavirus-devastated tourism industry, the prime minister announced Wednesday.Prime Minister Prayuth Chan-ocha said fully inoculated foreign visitors and returning Thai citizens must be allowed entry “without quarantine or other inconvenient restrictions,” and that his goal is to open up the country within 120 days.Prayuth acknowledged that the push to re-open might create problems.“I know this decision comes with some risk because, when we open the country, there will be an increase in infections, no matter how good our precautions,” he said. “But I think when we take into consideration the economic needs of the people, the time has come for us to take that calculated risk.”Tourism is a major contributor to Thailand’s economy and employs millions of people. The country attracted nearly 40 million foreign arrivals in 2019, which plunged in 2020 because of an entry ban to control the coronavirus.Prayuth said the government would reconsider the reopening only if a serious situation develops.The government had previously targeted next January for reopening the country.Thailand is in the midst of a surge in coronavirus cases that started in April and has accounted for more than 80% of the country’s 204,595 total confirmed cases and 90% of its 1,525 deaths.The surge has caused special concern because Thailand has been late in securing and deploying vaccine supplies. So far it only has supplies of Sinovac from China and AstraZeneca, which is beginning to be produced locally under license. Just over 7% of the country’s 69 million people have had at least one dose.Prayuth, who has come under fierce criticism over the vaccine supply situation, said his government is making progress in obtaining other vaccines, including those from Pfizer, Johnson & Johnson and Moderna.“To date, we have signed reservation and supply contracts for 105.5 million doses to be delivered this year, putting us ahead of our target for vaccine supplies,” he said. “Based on our current plans, we will administer an average of about 10 million shots a month from July, so that by early October almost 50 million people will have had at least their first shot administered.”Thailand plans to begin a trial project next month in which it will allow fully vaccinated visitors from abroad to enter Phuket without quarantine. But the so-called “Phuket sandbox” still entails restrictions, including a requirement to stay on the island for 14 days before heading to the mainland.The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/business/thailand-sets-mid-october-to-reopen-to-vaccinated-visitors/2021/06/16/66528254-ceaa-11eb-a224-bd59bd22197c_story.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}