{"Type": "", "Time": "2021-06-17", "Headline": "US needs 'combat-credible' forces to deter China, says Biden's defence nominee, United States News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.WASHINGTON (BLOOMBERG) - The US military should maintain a \"combat-credible\" posture in the Indo-Pacific to help deter potential Chinese aggression, President Joe Biden's nominee to be assistant secretary of defence for the region told senators.Such an approach would include the \"forward\" positioning of US forces in order to \"deter, and, if necessary, deny a fait accompli scenario\" where China tries to quickly overwhelm Taiwan, Mr Ely Ratner told the Senate Armed Services Committee in written answers to questions for his confirmation hearing on Wednesday (June 16).The strategy would also include \"new operational concepts, modernised and high-end ready forces, and capable allies and partners proficient in their warfighting roles\", he said.Mr Ratner's testimony comes as the United States and China are clashing over everything from technology to China's militarisation of the disputed South China Sea.On June 15, China's air force sent 28 aircraft close to Taiwan - the largest sortie this year - further ratcheting up military pressure on the government in Taipei as it seeks to strengthen ties with the US.In his written comments, Mr Ratner described China's People's Liberation Army (PLA) as \"mission focused\".It is \"well-resourced, and rapidly developing both in terms of direct military pressure on Taiwan and through other PLA capabilities aimed at deterring, delaying or denying third-party intervention in a crisis\", he said.If confirmed, Mr Ratner said, he will \"carefully review the current military balance across the Taiwan Strait to ensure that our defence cooperation with Taiwan is commensurate with the threat posed\" by China.Washington and Beijing have been issuing warnings to each other regarding Taiwan since Mr Biden took office in January, adding to tensions that increased steadily during the Donald Trump administration.The most recent exchange emerged from the Group of Seven summit in Britain over the weekend as leaders, at Mr Biden's behest, expressed concerns over Taiwan as well as Xinjiang and Hong Kong.China responded by calling the US \"very ill\".Until last week, Mr Ratner led a China task force at the Pentagon aimed at reorienting America's military to better compete with Beijing.Based on the task force's recommendations, Defence Secretary Lloyd Austin issued a directive \"designed to focus departmental processes and procedures and better help department leaders contribute to whole-of-government efforts to address the challenge from China\".Mr Ratner served as deputy national security adviser to then-vice president Biden from 2015 to 2017. He also held positions at the State Department, the Senate and the Centre for a New American Security.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/united-states/us-needs-combat-credible-forces-to-deter-china-says-bidens-defence-nominee", "Source": "google"}