{"Type": "", "Time": "2021-06-17", "Headline": "Singapore's Ngee Ann Poly to sack lecturer in racist remark incident for serious misconduct | The Star", "Text": "\n                    Thursday, 17 Jun 2021\n                In the video that went viral, Ngee Ann Polytechnic lecturer Tan Boon Lee (left) was seen making racist remarks to an interracial couple in Orchard Road. - DAVE PARK ASH/FACEBOOK, YONG LI XUANSINGAPORE (The Straits Times/ANN): Ngee Ann Polytechnic (NP) is in the process of sacking senior lecturer Tan Boon Lee for serious misconduct.This comes after a video posted on June 6 of Tan making racist remarks to an interracial couple in Orchard Road went viral.This was followed by an Instagram post on June 9 by NP alumna Nurul Fatimah Iskandar, who alleged that Tan made Islamophobic comments in a class in 2017.NP said it made the decision after completing its internal investigations into both incidents.It has charged Tan – a lecturer at the School of Engineering – with a serious breach of its staff code of conduct, and “is proceeding to terminate his service”.\"Our staff members are expected to respect cultural, ethnic and religious differences in our society. They must uphold secularity and impartiality at all times... The disciplinary action meted out against the staff in question reflects our commitment to provide a safe, inclusive and respectful environment for our campus community,\" said NP in a statement on Thursday (June 17).Police investigations into both incidents are ongoing.In her Instagram post, Nurul, now 22 and a student at the National University of Singapore, said she had reported Tan’s insensitive comments to NP at the time.NP said it has been unable to locate any records of her feedback after searching its various feedback channels and checking with Nurul on her NP mailbox archives.“In our conversation with her, she indicated that she could not recall whether she had e-mailed her feedback on the incident or raised it during a post-course focus group discussion (FGD) in 2017, ” it added.FGDs are typically held at the end of every semester to seek students’ feedback on courses and lecturers.“Nonetheless, we are committed to preventing a similar incident from occurring again, and will ensure that students are made aware of the appropriate channels for them to provide feedback in a safe manner, ” it said.“We will also advise our staff on how to manage and report feedback that they may receive outside of these channels, as appropriate.”NP also apologised for the distress that Tan’s comments caused Nurul, and said it has offered her counselling support.Last Thursday, Nurul told The Straits Times that Tan had used lesson time to initiate an offensive discussion about Islam.“He opened websites about Islam and explained why he didn’t agree with certain Quranic verses. He then singled me out, and tried to start a debate on the topic. It didn’t help that I was the only Muslim student in class and I sat in the front row, ” she said.NP said that it will make all feedback channels for students more accessible and visible on its website, and publicise them on its campus digital screens.These channels include a whistle-blowing e-mail address for students – tellnp@np.edu.sg, a general inquiry AskNP e-mail address, course experience dialogues and student surveys.“In addition, students can share their feedback with their staff advisers at any time. We would like to assure students that all feedback will be taken seriously and handled in confidence, ” the polytechnic said.NP added that it would be reviewing its internal feedback monitoring processes to identify and resolve gaps.“We also remind all staff to strictly adhere to the staff code of conduct and create a safe learning environment for all in NP, ” it said. - The Straits Times/Asia News Network\nTags / Keywords:\nSingapore\n                                                                ,\n                                                                                                Ngee Ann\n                                                                ,\n                                                                                                Polytechnic\n                                                                ,\n                                                                                                lecturer\n                                                                ,\n                                                                                                sack\n                                                                ,\n                                                                                                racist\n                                                                ,\n                                                                                                an Boon Lee\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/17/singapore039s-ngee-ann-poly-to-sack-lecturer-in-racist-remark-incident-for-serious-misconduct", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}