{"Type": "", "Time": "2021-06-17", "Headline": "Shell signs solar farm exploratory pact with Singapore's JTC | Reuters", "Text": "Shell's company logo is pictured at a gas station in Zurich April 8, 2015. BG Group's bonds traded up strongly on Wednesday on the back of Royal Dutch Shell's US$70bn offer to buy the UK firm.  REUTERS/Arnd WiegmannSINGAPORE, June 17 (Reuters) - Royal Dutch Shell (RDSa.L) has signed a non-binding memorandum of understanding (MoU) with Singapore state firm JTC Corp (JTC.UL) to explore developing a solar farm on part of a landfill in southern Singapore, the companies said on Thursday.If successful, the solar farm will reduce the city-state's carbon emissions and meet its growing clean energy needs, they said in a statement.The solar farm will be the first large-scale solar project in Singapore where a sanitary landfill is also used for clean energy generation, they said, adding that the project is aligned with Singapore's target to increase solar deployment to at least 2 global warming potential (GWp) by 2030.The MoU is also supported by Singapore's National Environment Agency and Energy Market Authority. JTC and Shell said they will jointly conduct a Request for Information (RFI) exercise on June 24 to source for \"innovative solutions from the market\".The solar farm, likely to be located on part of Semakau landfill which is about two kilometres from Shell's Bukom manufacturing site, is expected take up an area of 60 hectares (148.3 acres) and have a capacity of at least 72 MegaWatt peak(MWp), sufficient to cut carbon dioxide emissions by 37,000 tonnes a year.Land-scarce Singapore has been finding ways to harness solar energy, which it finds the most promising renewable energy source.Shell said as part of a 10-year plan, it is changing its manufacturing business where Bukom is pivoting from a crude-oil, fuels-based product slate towards new, low-carbon value chains.Our Standards: The Thomson Reuters Trust Principles.Subscribe for our daily curated newsletter to receive the latest exclusive Reuters coverage delivered to your inbox.Democratic U.S. congressional members sent a letter on Wednesday to the Environmental Protection Agency, urging it to reject any action that would exempt oil refiners from obligations to blend biofuels into the nation's fuel mix.Reuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.Build the strongest argument relying on authoritative content, attorney-editor expertise, and industry defining technology.The most comprehensive solution to manage all your complex and ever-expanding tax and compliance needs.The industry leader for online information for tax, accounting and finance professionals.Information, analytics and exclusive news on financial markets - delivered in an intuitive desktop and mobile interface.Access to real-time, reference, and non-real time data in the cloud to power your enterprise.Screen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks.All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.© 2021 Reuters. All rights reserved", "Section": "", "Writers": "", "URL": "https://www.reuters.com/business/energy/shell-signs-solar-farm-exploratory-pact-with-singapores-jtc-2021-06-17/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}