{"Type": "", "Time": "2021-06-17", "Headline": "Landlord who exposed himself to female tenant jailed, fined", "Text": "SINGAPORE — A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.Over about seven months, the victim would turn around to catch 56-year-old Chan Eng Hui in the buff while he made eye contact with her. Chan, who has been dealt with for previous incidents of indecent exposure in 2009 and 2010, was found guilty of four charges of insulting the modesty of a woman and two of using criminal force on her.The victim’s age and nationality was not revealed in court. She cannot be named to protect her identity.The victim moved into the flat on 1 April 2018, renting a bed space from him for $250 a month. She moved out in January 2019. Initially, the victim said she was on “talking terms” with Chan, but stopped talking to him after a female tenant informed her that Chan had appeared naked in her room.Between 10 and 12 May 2018 while both were in the flat, Chan held her hand and said “Go, go, let’s just go eat.”She rejected him and said “You can just talk and not get touchy”, before going into her room. She did not consent to the touch and felt annoyed by what she perceived to be a disrespectful act.In the same period, Chan grabbed her as she walked past a sofa in the living room, in an attempt to pull her in his direction. In response, the victim flung his hand away and told him not to get touchy before entering her room.From end-June to mid-July 2018, while both were in the flat at around 6.30am, the victim was walking out of the kitchen when she saw Chan standing inside the toilet naked with the door open. He was touching his private parts as he made eye contact with her.Even as the victim asked him what he was doing, Chan continued touching his private parts. Chan’s wife had been sleeping then.From the moment Chan began exposing himself to her, the victim would use weapons to protect herself and lock the door before sleeping.A few days later, in the evening, while the victim was washing something in the kitchen, she turned around to see Chan naked again, standing in front of the washing machine. After they made eye contact, Chan smiled and said he wanted to shower in the toilet. Furious, the victim scolded him. The same act happened between September and October, while the victim was at the kitchen wash basin, prompting the victim to throw a bowl towards him.Between 1 August and 20 September 2018, at around 6.30am, the victim was leaving the flat when she turned around to see Chan naked. The victim then shouted at him, “You pervert. You like… you enjoy letting people see, is it? Then you should let everyone take a look at you.”Two audio recordings recorded by the victim and submitted to court captured an exchange between Chan and the victim. In one recording, the victim says, “Why did you don’t wear your pant when you appeared behind me suddenly?” Chan is heard replying, “You have not agreed to me for so long. You see that fish, you think I can control myself. When you don’t give the fish to the cat, what do you think it will feel? I am a man, you think I am made of wood, is it? You don’t have feeling, but I am a man, I have feeling?”After 30 December 2018, Chan changed the lock of her bedroom door so that the victim was unable to lock the door. The woman would then use a chair to block the door.In his defence, Chan claimed that he was wearing his shorts at all times.The victim eventually reported the matter to the police on 23 December 2018. When asked why she did not do so earlier, she said that she worried it would be troublesome as she was working here, and was concerned that the incident would affect her work permit.In finding Chan guilty, District Judge Lau Qiuyu described him as “evasive” and his evidence “externally inconsistent”. While Chan initially argued that he was in a boyfriend-girlfriend relationship with the victim, he later claimed that they were just friends and he found acts of intimacy repulsive.DJ Lau added that she was unable to accept his claim that he did not intentionally expose himself to the woman. Chan had claimed that the exposure was accidental as the wind had blown open the toilet door while he was urinating. For another incident, Chan claimed that he had slipped on washing powder and that he hit himself, causing him to stroke his private parts in pain.When asked for his mitigation, Chan said he had nothing to say. He told the court that he was unable to pay the fine. He will serve two weeks' jail in default of the fine. Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:Of 25 new COVID cases in Singapore, 19 local including 1 dorm residentMan who smuggled 3 dogs and 3 cats from pet shop in JB jailed 24 weeksE-scooter, PAB riders must pass online theory test from 1 Jan 2022The displaced sleep packed together under plastic sheeting for protection from Myanmar's monsoon rains.  Food is short and there are signs of disease spreading, according to people who have fled recent fighting in eastern Myanmar's Kayah State - just one of several conflicts to surge since the Feb. 1 coup toppled elected leader Aung San Suu Kyi.  The United Nations estimates nearly 110,000 people have been displaced in Myanmar's Kayah State by the recent violence.Check out these new donuts flavors from Krispy Kreme PH for Father's Day. Celebrate you Dad this Father's Day with Krispy Kreme new flavors. The post Krispy Kreme releases three new Coffee Glaze Cake Doughnuts appeared first on theAsianparent Philippines: Your Guide to Pregnancy, Baby & Raising Kids.Finding it increasingly challenging for you to enjoy uninterrupted sleep with Singapore’s notorious heat? Try this fuss-free method that doesn’t involve burning a hole in your pocket.Cebuano forward Carl Tamayo showed the rest of the Philippines that he belongs on the Gilas Pilipinas men’s national basketball team as he made big plays down the stretch in their 81-78 victory overWith almost no tours having been undertaken in the past year, the Pollstar Awards pivoted in two different directions for the 31st annual edition of the show held Wednesday night at the Beverly Hilton Hotel ballroom. One shift in focus was to deliver awards to the top touring artists of the last decade, instead of […]The United States is ending a Cambodian aid programme aimed at protecting one of the country's biggest wildlife sanctuaries, citing worsening deforestation and the silencing of those who speak out about the destruction of natural resources.  The U.S. embassy in Phnom Penh said in a statement on Thursday that it had invested more than $100 million to combat deforestation and despite some progress high rates of illegal logging had continued in the Prey Lang Wildlife Sanctuary.  Since 2016, Prey Lang had \"lost approximately 38,000 hectares (93,900 acres) of forest, nearly nine percent of its forest cover,\" it said, accusing Cambodian authorities of not adequately prosecuting wildlife crimes or putting a stop to illicit activities.Naho has played a crucial role in fighting Japan's two deadly coronavirus waves this year, the worst the country has faced since the pandemic began.As he counts down the days to his third straight Olympics, Tonga's famously chiseled flagbearer Pita Taufatofua is also contemplating offers for a career in movies and documentaries.A pig that became an unlikely national icon in China after surviving 36 days under rubble from a powerful 2008 earthquake has died at the age of 14, sparking an outpouring of emotion on Thursday.The Milky Way moving across the night sky made for a beautiful background for the Pack Creek Fire burning in Utah’s east on June 12.A timelapse video taken over four and a half hours by Temuji Nana shows the galaxy and shooting stars while the fire burns through the night.Firefighting authorities said the blaze began in Manti-Lasal National Forest on June 9 due to an abandoned campfire. The fire had grown to 8,518 acres by June 16. Credit: Temujin Nana via StoryfulCebuana volleyball star Cherry Ann “Sisi” Rondina and the rest of the Philippine beach volleyball team start their bid for berths in the Tokyo Olympics as they compete in the Asian Volleyball ConfederationNelson Cruz hit a three-run homer against his former team, rookie starter Bailey Ober struck out six and the Minnesota Twins beat the Seattle Mariners 7-2 on Wednesday night.  Cruz’s second-deck shot to left field in the fifth inning made it 6-0 and helped snap the Twins’ three-game losing streak.  “It's fun to watch,\" Minnesota manager Rocco Baldelli said.Australia recommended that AstraZeneca's Covid-19 jab should not be given to people under 60 on Thursday, a fresh blow to the country's glacial vaccine rollout.The Gilas Pilipinas plunge back into action on Friday evening when they battle the up-and-coming Indonesia in the FIBA Asia Cup qualifiers at the Angeles University Foundation gym in Pampanga.Tip off isBeachgoers in St Petersburg, Florida, were treated to a close encounter with a school of cownose rays on June 13.This drone footage taken by Michael McCarthy shows the rays gliding around swimmers, some of whom are visibly sunburnt.“I saw this group of cownose rays while kayaking at the beach and launched the drone to get abetter look at them,” he told Storyful. “As they were swimming right up against the shoreline they startled quite a few people at the beach.”Cownose rays are known to frequent the area and are generally considered harmless to humans. Credit: See Through Canoe via StoryfulAs the Federal Reserve takes initial steps toward removing its massively accommodative policy, investors are preparing for the main show ahead.  Fed officials on Wednesday penciled in two potential rate hikes in 2023, sooner than policymakers had previously projected, and Chair Jerome Powell edged closer to unveiling plans to taper the Fed's $120 billion a month of bond purchases.  Powell went so far as to describe the two-day gathering as the \"talking-about talking-about meeting,\" a glib reference to his protestations earlier this year that he and his colleagues were not even \"talking about talking about\" tighter policy.Don't you have a plan yet for this Father's Day? Why not try the Airbnb Online Experiences that your Dad and your whole family can enjoy. The post Give Dad a treat this Father’s Day with Airbnb Online Experiences appeared first on theAsianparent Philippines: Your Guide to Pregnancy, Baby & Raising Kids.China are still a long way from the football superpower they crave to be, but under Li Tie they have offered a glimmer of hope to fans scarred by years of disappointment.Playoff P stepped up in Game 5.A FAMILY member sought help from the police in Alcoy town, Cebu for a case that happened in 2018 when her older brother was killed, only to be told “ipabarang ang killers (bewitch the killers by voodoo).”Feeling", "Section": "", "Writers": "", "URL": "https://ph.news.yahoo.com/landlord-exposing-himself-female-tenant-jailed-fined-055722920.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}