{"Type": "", "Time": "2021-06-17", "Headline": "Myanmar village burned after fighting; residents blame security forces, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.YANGON (REUTERS) - Security forces set ablaze a village in central Myanmar after clashing there with opponents of the ruling junta, leaving at least two elderly people burned to death, several village residents said on Wednesday (June 16).MRTV state television said the blaze on Tuesday at Kin Ma, a village of about 800 people in the Magway Region, was caused by\"terrorists\" and that media who reported otherwise were\"deliberately plotting to discredit the military\".Reuters was unable to independently verify the cause of the blaze. A junta spokesman did not answer calls requesting comment.All that remained of Kin Ma on Wednesday was about 30 houses, with some 200 homes reduced to piles of ash and bricks, according to several villagers who gave accounts of the incident by telephone and photographs seen by Reuters.The blaze was large enough to be recorded by Nasa's satellite fire-tracking system at 9.52 pm on Tuesday.The villagers, who spoke on condition of anonymity, said that security forces set the fires after confronting opponents of the junta and that at least two people were killed.A 32-year-old volunteer assisting people displaced from the village said the two people killed were elderly residents who had been unable to flee their home during the fire. He said some people returned to the village on Wednesday and found the bodies.Most of the village's residents remained in hiding in nearby forests, the villagers who spoke with Reuters said.MRTV said 40 \"terrorists\" torched a house in Kin Ma, starting a fire that spread to 100 of the village's 225 homes.Myanmar has been gripped by violence and protests since the military overthrew elected leader Aung San Suu Kyi on Feb 1, returning as the country's outright rulers after a decade of tentative democracy and economic reform.The overthrow of Ms Suu Kyi's government, for alleged electoral violations, sparked protests almost daily in many parts of Myanmar and ignited conflict between the military and rebel groups.Photographs taken on Wednesday of the aftermath showed a thin haze of smoke above Kin Ma from white embers that smouldered on blackened ground.Burnt planks of wood, sheet metal, bricks and cooking pots were scattered around, with only a few trees left standing. Some images showed animal carcasses.\"Reports that the junta has burned down an entire village in Magway, killing elderly residents, demonstrate once again that the military continues to commit terrible crimes and has no regard for the people of Myanmar,\" Britain's embassy in Myanmar said on Twitter, quoting its ambassador Dan Chugg.\nSmoke is seen rising from a fire in the village of Kin Ma in Myanmar on June 16, 2021. PHOTO: REUTERS\nHuman rights groups have accused Myanmar's forces of burning hundreds of villages in 2017 during an offensive that drove about 700,000 minority Rohingya Muslims to flee to Bangladesh.Security forces have denied setting fires and in some cases have blamed Rohingya for doing so.Western condemnation of the junta has grown over the military's use of force against its opponents.The Assistance Association for Political Prisoners, a human rights group, has said security forces have killed more than 860 civilians, but the military has said the figure is lower.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/myanmar-village-burned-after-fighting-residents-blame-security-forces", "Source": "google"}