{"Type": "", "Time": "2021-06-17", "Headline": "Doctors warn of Covid-19 'explosion' as Delhi defies social distancing norms, South Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.NEW DELHI (REUTERS) - In India's capital, Delhi, thousands of commuters crowded into underground train stations and shopping malls on Tuesday (June 15), prompting some doctors to warn it could lead to a resurgence in Covid-19 infections.Major Indian cities have begun lifting strict lockdowns as the nationwide tally of new infections has dropped to its lowest level in more than two months.But disease experts and doctors have cautioned that a race towards resuming business as usual would compromise vaccination efforts as only about 5 per cent of all 950 million eligible adults have been inoculated.Doctors say Delhi's near-complete reopening is concerning.The city's authorities have said they would reimpose strict curbs if cases rise.Thousands died in the capital in May as oxygen supplies all but vanished and families pleaded on social media over scarce hospital beds.People paid 20 times the usual price to secure ambulances and hearses, many died in parking lots, and morgues ran out of space.\"Delhi's top #mall saw a footfall of 19,000 people last weekend - as soon as it reopened. Have we gone totally mad?\" Dr Ambrish Mithal of Max HealthCare in New Delhi said on Twitter. \"Wait for #COVID19 to explode again- and blame the government, hospitals, country.\"In the early hours of Tuesday, Delhi's underground rail network put out alerts on Twitter about peak traffic and longer waits, responding to commuters angry about long queues.After a strict five-week lockdown in Delhi, the authorities have fully reopened shops and malls, and allowed restaurants to have 50 per cent seating. Suburban rail networks can run at 50 per cent capacity, and offices have been partially reopened.Vaccinations have slowed, however; the city government said inoculation centres for people ages 18 to 44 would start shutting down on Tuesday as doses were scarce.\"Delhi ought to have unlocked far more scientifically. We are inviting trouble!\" Dr Arvinder Singh Soin, a surgeon and leading liver transplant specialist, said on Twitter.Nationwide, India reported 60,471 new Covid-19 infections over the past 24 hours, the lowest number since March 31, data from the health ministry showed.The South Asian country's total Covid-19 caseload now stands at 29.57 million, the second-highest globally behind the United States.India added 2,726 deaths overnight, taking the overall tally to 377,031, data showed.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/south-asia/delhi-defies-social-distancing-norms-doctors-say-brace-for-covid-19-explosion", "Source": "google"}