{"Type": "", "Time": "2021-06-17", "Headline": "Opinion | Biden offered Putin the benefit of the doubt. He should know better. - The Washington Post", "Text": "PRESIDENT BIDEN’S first summit meeting with Vladimir Putin was preceded by reports of persistent cyberattacks by Russian state and private actors against sensitive U.S. targets and a major Russian military mobilization along the borders of Ukraine, among other provocations. Mr. Biden consequently vowed to reestablish “red lines” with the Kremlin ruler, who himself told an interviewer that relations were at their lowest point in years. So it was somewhat surprising that both leaders emerged from their talks in Geneva on Wednesday describing a positive exchange and the potential for a more stable and cooperative relationship.“The talks were quite constructive,” said Mr. Putin, who went on to praise Mr. Biden as “very balanced” and “very experienced.” “The tone of the entire meeting was very good, positive,” agreed the U.S. president. “I think there is a genuine prospect for us to significantly improve relations between our countries.”It would certainly be welcome if Mr. Biden’s discussion with the Russian ruler, and follow-up talks they agreed would take place, led to an end to Russia-based cyberattacks, the relaxation of the Kremlin’s squeeze on the Russian operations of Radio Free Europe/Radio Liberty, and the release of U.S. citizens unjustly imprisoned in Moscow. Mr. Putin hinted “compromise” was possible on all these matters. Mr. Biden further reported that Mr. Putin had offered “help” on Iran and Afghanistan, and that accommodations were possible on the wars in Syria and Libya, where the two countries back opposing sides.In short, the rhetoric sounded a lot like that which followed the initial encounters between the past three U.S. presidents and Mr. Putin, who has invariably reneged on his promises and relentlessly escalated his assaults on the U.S. political system and alliances. The Russian ruler’s implacable hostility toward the United States was evident in his performance at a post-summit news conference, in which he repeatedly offered bogus comparisons between his foreign aggressions, his human rights offenses, and U.S. actions. His persecution of the peaceful opposition movement led by Alexei Navalny, he claimed, was comparable to the prosecution of the mob that stormed the U.S. Capitol on Jan. 6.Mr. Biden called that comparison “ridiculous,” but otherwise appeared willing to offer Mr. Putin the benefit of the doubt. Mr. Putin surely understood, the president asserted, that the death of Mr. Navalny would be “devastating for Russia,” because of the harm that would be done to the regime’s global standing; the Kremlin knew that the United States possessed significant cyber capabilities and would use them if Russia’s cyberattacks continued. “I think the last thing he wants now is a Cold War,” Mr. Biden said of Mr. Putin. Perhaps. But why, then, is his regime engaged in such mischief-making as seeking to discredit U.S. vaccines? Who is responsible for the mysterious injuries suffered by U.S. diplomats and intelligence officials in Moscow, Havana and even Washington?Mr. Biden properly devoted much of his European tour to reaffirming U.S. ties to its major democratic allies after four years of disruption by President Donald Trump. Mr. Biden underlined his aspiration to lead them in a contest for global influence with resurgent autocracies, led by China and Russia. He was right to meet Mr. Putin and seek to reestablish U.S. red lines. As for the prospect of “significantly improved relations,” Mr. Biden said, “we’ll find out.”Indeed we will, but there’s no reason to believe the outcome will vary from previous U.S. attempts at cooperation with Mr. Putin.Read more:Jennifer Rubin: What Biden knows about being a superpower that Republicans don’tMax Boot: Biden wiped the smirk off Putin’s faceE.J. Dionne Jr.: Biden to Putin: Stability, sure. But democracy matters.Josh Rogin: Biden should tell Putin to stop harassing U.S. news organizations in RussiaThe Post’s View: Russia’s FSB poisoned another Putin critic. It’s chilling.Latest: Putin swaggers toward summit with Biden as an old hand at dueling with the WestLive updates: Biden arrives in Geneva for Putin summit after meeting with European Union leaders in BrusselsAnalysis and more:Amid internal disputes over Russia policy, Biden has chosen a mix of confrontation and cooperation‘Part of the club’: Biden relishes revival of alliances that Trump dismissedBiden, E.U. eliminate long-running aircraft trade dispute, but other Trump tariffs still stand in the wayBiden takes steps to rein in ‘forever wars’ in Afghanistan and IraqPhotos: Putin’s rocky relationship with American presidentsBiden will give Putin a list of demands. The Russian president may ignore them.NATO expands focus to China, a win for Biden in his first trip to the battered alliancePresident Biden says Queen Elizabeth II ‘reminded me of my mother’Trump’s shadow still looms over cloudy skies at G-7 summitThe most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/opinions/global-opinions/biden-offered-putin-the-benefit-of-the-doubt-he-should-know-better/2021/06/16/d68436d4-cec4-11eb-8cd2-4e95230cfac2_story.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}