{"Type": "Sport", "Time": "2021-06-17", "Headline": "Football: Ramsey and Roberts give Wales 2-0 victory over Turkey", "Text": "BAKU: Captain Gareth Bale inspired a scintillating 2-0 victory for Wales over Turkey on Wednesday (Jun 16), giving the Dragons a big leap towards the European Championship knockout stages and reviving memories of their 2016 run to the semi-finals.Midfielder Aaron Ramsey missed two early chances, but made no mistake just before halftime when he chested down Bale's perfect ball over the defence to slot past the goalkeeper.Wales could have doubled the lead at the hour mark when Bale was tripped by Zeki Celik and awarded a penalty, but the Welsh skipper skied his effort after a stuttering run up.Wales were rewarded for their superiority throughout when they scored right at the death as a corner was played short and defender Connor Roberts was on hand to divert another Bale pass past goalkeeper Ugurcan Cakir.\"We fought hard, we worked our socks off like we always do,\" Bale said.The Group A win thrilled the few hundred Wales fans - outnumbered by Turkish supporters at Baku's Olympic Stadium - and many more at home who are dreaming of another Euros run like their first appearance in the tournament five years ago.The surprise semi-finalists then, who next play Italy, now have four points, after drawing with Switzerland in their opener. Turkey, without points, take on the Swiss next.Remarkably, Wales now have the best winning percentage in the Euros' history: 63 per cent or five wins in eight games.Wednesday's man-of-the-match Bale twice picked out Ramsey before his goal with superb defence-splitting passes. Cakır denied him from a tight angle in the sixth minute and then Ramsey thundered a shot over the bar in the 24th.There was nothing lucky about the third time, though, with Bale floating a superbly-timed cross in the 42nd minute for Ramsey who brought the ball down perfectly to slot under Cakir.TURKEY APOLOGETICWith Turkish and Azeri Presidents Tayyip Erdogan and Ilham Aliyev in the stands, Turkey upped the pace after the break.Captain Burak Yilmaz, who had missed a good chance in the first half, should have scored 10 minutes after the restart when he was unmarked in front of the Welsh goal but blazed a volley from three metres out well over the crossbar.On the hour, Bale was brought down just inside the box to earn a spot kick. But the 31-year-old's effort flew high and wide to keep the Turks in the game.\"It's unfortunate but what he did show was character afterwards,\" said Wales manager Rob Page.\"Everybody makes mistakes. Ok, he missed it, but so what? He got man of the match!\"The disappointing Turks did force a good save from keeper Danny Ward when he punched a Merih Demiral header wide in the 87th minute. But they ran out of steam in stoppage time, allowing Bale to cut inside to feed Roberts for the second goal.\"I would like to apologise,\" Turkey defender Umut Meras said. \"We wanted to win so hard tonight but that was not enough.\"Turkey coach Senol Gunes lamented his team could not level the game after going behind but had warm words for Wales.\"We had many chances but couldn't find the equaliser. Wales played a good match. They were effective with their pivot striker and two wingers,\" he said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Turkey,sports,Wales,Connor Roberts,Aaron Ramsey,Euro 2020", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/euro-2020-ramsey-and-roberts-give-wales-2-0-victory-over-turkey-15028974", "Source": "google"}