{"Type": "", "Time": "2021-06-17", "Headline": "COVID quarantines confusing, inconsistent: Singapore residents", "Text": "SINGAPORE — Inconsistent and sometimes conflicting information given by officials enforcing quarantine orders (QOs) has left some Singapore residents alarmed at the lack of clear communication and apparent gaps in procedures. Two women who were recently quarantined – one of them alongside her family and helper – told Yahoo News Singapore that they found their recent experiences confusing and frustrating. Multiple online comments by others who have served quarantine also suggest that the women's experiences are not unique. \"The whole thing felt a shambles,\" said Elaine (not her real name), a 35-year-old employment pass holder with a background in healthcare. \"Everyone in this new world is working as hard as they possibly can. But they (personnel overseeing quarantine orders) need better leadership and better communication.\"After going for a family staycation at a hotel from 7-9 May with her husband and two children aged one and four, Elaine was notified via text on 14 May of possible exposure to a COVID case at the hotel pool. The family and their helper were then issued a seven-day quarantine order by Certis officers.Over multiple calls with Certis officers about whether the family home was suitable for quarantine and when their swab tests were taking place, the overall impression Elaine had was of a \"disorganised\" effort. \"The next day, someone turned up with a quarantine order and armbands (which we had to wear). They installed these little black boxes, which work in tandem with the RFID in the armbands,\" recalled Elaine. \"We said we already had the Home app, where you can log your temperature three times a day and it tracks your location. It felt like we were criminals.\"Elaine and her two children were eventually conveyed to a hospital for swab tests, but not her husband. Certis officers were \"unhelpful\" when she called the local security company and asked why. \"When we called MOH (Ministry of Health), they were much more helpful and sent a nurse around to do swab tests.\"She added, \"Literally no one told us what would happen if we tested positive. We were really worried that the kids might be taken away from us if they were positive.\"After multiple calls, Elaine obtained negative results for herself and her boys, while the results for her husband and helper came two to three days later. On 15 May, a day before the QO was to end, a nurse was sent to their home, after Elaine had made multiple calls to MOH to clarify her family's quarantine status, to conduct swab tests. Her one-year-old son was not tested for a second time as the nurse said it was not necessary. \"They told us we would be fine as long as we didn’t get a positive,\" said Elaine, who was informed of her four-year-old son's negative test results on 17 May. However, the next day, there was a knock at the door in the morning. \"My helper was given a document by a Certis officer, and she felt she had to sign it. They didn’t tell her what it was for. It was an extension of my one-year-old boy's QO. I called MOH, and they couldn’t give me any info,\" said Elaine, who noted that the family had been to multiple places since the end of their quarantine. Her husband took their younger son to get tested, where he was told that the extension was likely due to the fact that the boy had not been tested when the family was let out of quarantine. The boy was eventually cleared.\"The lack of communication is very frustrating. It really impacts your anxiety levels,\" said Elaine. A 37-year-old lawyer who only wished to be known as Ms Wang also endured a \"frustrating and confusing\" experience after being issued a QO from 18-25 May, following her possible exposure to COVID-19. Having confined herself to her room, the mother of two was informed that Certis officers would assess her home for quarantine suitability but no one turned up. At the end of the QO, having received a negative swab result on 21 May, she interacted with her family members.On 26 May, she received an SMS telling her to go for a swab test and that she had been issued another QO from 20-29 May. After numerous calls to the Certis hotline, Ms Wang was told that her QO would be rescinded if she were to get a negative swab result.The following day, despite her HealthHub app displaying a negative result, a Certis officer came to issue her the new QO. She was then told by two other officers over the phone that the negative result was invalid as her quarantine had been extended and she needed another swab. After multiple calls, her QO was finally rescinded in the evening.\"You basically have to keep calling until you find someone helpful,\" said Ms Wang, who was in a \"state of anxiety\" for fear of possibly infecting her family members. \"The communication is abysmal. I understand that they need to do this, but they need to manage the process properly. These are people’s lives.\"Alluding to Prime Minister Lee Hsien Loong's remarks last month that the government will take a more aggressive approach to testing and quarantine, she added, \"The current process already seems overstretched. I think it would be so easy to improve this just by being clear. If you tell people what to expect, there won’t be so much anxiety.\"As neither woman wanted to be identified, their detailed accounts and personal details could not be shared with the MOH.Yahoo News Singapore asked MOH about the volume and nature of complaints it has received regarding the serving and enforcement of QOs during Phase 2 (Heightened Alert), which lasted from 16 May to 13 June. In light of PM Lee's remarks on more aggressive testing and quarantine, the ministry was also asked if it is confident that it has sufficient resources to test and quarantine potentially thousands more.In response, an MOH spokesperson said that extensive contact tracing, including leveraging on TraceTogether and SafeEntry records, is a key strategy to cast a wide net to isolate and ring-fence any possible emerging transmissions in the community.The spokesperson noted that \"wider rings\" are being drawn around cases to combat the more transmissible strains, while more people are now using TraceTogether and SafeEntry, which provides MOH with more data for contact tracing and quarantine. \"This has led to a higher number of persons under quarantine (PUQs), resulting in delays in the testing and conveyance to quarantine facilities,\" said the ministry. \"We seek the public’s understanding and patience. We will continue to improve our operating processes and improve communications between the various agencies involved in managing the quarantine process.\"Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeRelated stories:COVID swab test personnel not trained to deal with special needs people: Rahayu Mahzam9 of 14 new COVID cases in Singapore linked to Bukit Merah View Market clusterA fifth of asymptomatic Covid patients develop long Covid: studyBurner phones, safehouses, sheltering with rebels and months away from loved ones -- Myanmar anti-coup activists have been driven underground by a brutal crackdown but have no regrets about choosing life on the run.The freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.China’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the buHong Kong police rounded up 79 people in a series of raids that shut down two underground casinos and an unlicensed pub in the span of two hours on Tuesday night. In one raid on a Ko Shing Street flat in Sai Ying Pun, officers found a baccarat table and two large televisions used to play online card games, seizing HK$215,000 (US$27,697) in cash, HK$410,000 in chips and five account books. Sixteen men and six women, aged 31 to 74, were inside the premises when officers from the Western special duIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Browsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.Beijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityChinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiThe US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Los Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.Deposed Myanmar leader Aung San Suu Kyi went on trial for sedition in a junta court Tuesday, more than four months after her government was ousted in a coup that has thrown her country into turmoil.For Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.When 28 Chinese warplanes streaked through the skies around Taiwan on Tuesday – the largest such incursion this year – they followed a pattern that has generated alarm among US and Taiwanese military planners.Australia recommended that AstraZeneca's Covid-19 jab should not be given to people under 60 on Thursday, a fresh blow to the country's glacial vaccine rollout.Italy became the first team to reach the knockout stage of Euro 2020 as midfielder Manuel Locatelli scored twice in a 3-0 win over Switzerland in Rome on Wednesday, while Wales moved to the brink of joining them by beating Turkey.The UN aviation agency said Wednesday it will release an interim report next week on the diversion of a Ryanair flight by Belarus that caused a global outcry.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neThe European Union and United States launched a trade and technology council that seeks to “write the rules of the road” on the global economy, in the face of growing competition from China. It was the latest salvo against Beijing on US President Joe Biden’s whistle-stop European tour, which had seen him succeed in rallying support among the G7, Nato and now EU for a much-vaunted transatlantic coalition to face down China’s rising influence. A joint EU-US statement said the council would focus oThe strategic partnership sees EMERGE working with Mediacorp's Bloomr.SG network to \"develop the knowledge and skills of up-and-coming\" content creators in esports.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/covid-quarantine-procedures-confusing-inconsistent-singapore-100905061.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}