{"Type": "", "Time": "2021-06-17", "Headline": "Morning Briefing: Top stories from The Straits Times on June 17, 2021, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Good morning! Here are our top stories to kick-start your Thursday, June 17.There were also three unlinked cases confirmed on Wednesday.READ MORE HEREThose interested may contact providers directly from June 18 for details on how they may get the vaccine.READ MORE HEREThe tests will take place on Thursday at the void deck of Block 80D Telok Blangah Street 31, from 9am to 4pm.READ MORE HEREWith just over a week left of the June school holidays, people in Singapore are returning to attractions and staycations.READ MORE HEREThe Council of Rulers said the state of emergency should also end after the Aug 1 expiry date.READ MORE HEREThe summit lasted less than four hours – far less than Biden’s advisers expected.READ MORE HEREPayPal poll shows almost 2 in 3 pick China as top foreign destination for e-commerce buys.READ MORE HEREAll four lamp posts near the fitness corner have now been replaced. READ MORE HEREThundery showers have been forecast on some days during the second half of the month.READ MORE HEREBeat the heat with your own coconut concoction.READ MORE HEREJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/morning-briefing-top-stories-from-the-straits-times-on-june-17-2021", "Source": "google"}