{"Type": "", "Time": "2021-06-17", "Headline": "Biden tells Putin certain cyber-attacks should be 'off-limits', Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.GENEVA (REUTERS) - US President Joe Biden told Russian President Vladimir Putin on Wednesday (June 16) that certain critical infrastructure should be \"off-limits\" to cyberattacks, but analysts said his efforts were unlikely to be more successful than previous attempts to carve out safe zones online.Biden wasn’t explicit about which areas he wanted out of bounds, but spoke of 16 kinds of infrastructure – an apparent reference to the 16 sectors designated as critical by the US Homeland Security Department, including telecommunications, healthcare, food and energy.\"We agreed to task experts in both our countries to work on specific understandings about what is off-limits,\" Biden said.\"We’ll find out whether we have a cybersecurity arrangement that begins to bring some order.\"A senior administration official said that the proposal was focused on \"destructive\" hacks, as opposed to the conventional digital espionage operations carried out by intelligence agencies worldwide. Putin’s response to the idea wasn’t immediately clear.In a separate press conference, he said the two leaders had agreed to \"begin consultations\" on cybersecurity issues but didn’t directly refer to Biden’s proposal.The threat of cyberattacks aimed at critical infrastructure, a staple of disaster movies where renegade hackers trigger blackouts and mayhem, have long worried experts.The United States had its first serious taste of what that might mean last month, when ransom-seeking cybercriminals briefly triggered the closure of a major US pipeline network, interrupting gasoline deliveries and triggering panic-buying up and down the East Coast.Earlier cyberattacks aimed at the Ukrainian power grid and a Saudi petrochemical plant have also drawn concern.In all those cases, the hackers involved are accused by the United States of either working directly for the Russian government or from Russian territory.Russian officials have repeatedly denied carrying out or tolerating cyberattacks, and Putin on Wednesday made no concessions on the issue.\"We need to throw out all kinds of insinuations, sit down at the expert level and start working in the interests of the United States and Russia,\" Putin told reporters.He then made an insinuation of his own, saying that Russian officials had tracked malicious digital activity coming from the United States.\"We certainly see where the attacks are coming from. We see that this work is coordinated from US cyberspace,\" Putin said.Experts were sceptical that Biden’s proposal would be taken seriously by Putin.\"There’s no indication at all that he actually went along with it,\" said Keir Giles, a Russia expert with the London-based Chatham House think tank.Giles said that grappling with the cyber threat emerging from Russia would require \"an outbreak of honesty\" on the Kremlin’s side.\"There’s no indication – at least from Putin’s public comments so far – that that outbreak has begun,\" Giles said.The fate of a similar agreement between former US President Barack Obama and Chinese leader Xi Jinping is not encouraging, said Stefan Soesanto, a researcher at the Centre for Security Studies at the Swiss Federal Institute of Technology in Zurich.The 2015 agreement theoretically banned the theft of intellectual property for commercial gain, but many cyber experts that track Chinese hacking say Beijing eventually reneged on the deal.\"Will Biden fare better than Obama/Xi? I don’t think it will,\" Soesanto said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/biden-tells-putin-certain-cyber-attacks-should-be-off-limits", "Source": "google"}