{"Type": "", "Time": "2021-06-17", "Headline": "Singapore Exchange Welcomes OTS Holdings Limited to Its Catalist | Finance Magnates", "Text": "Email was send successfully!Please check your inbox for  our authentication email.*required fieldsThank you for registering  to Finance Magnates.Please open the email we sent you and click on the  link to verify your account.Singapore Exchange (SGX) today announced that it has welcomed OTS Holdings Limited to its Catalist. The total market capitalization of OTS Holdings currently stands at around S$49 million.According to an official press release shared with Finance Magnates, Singapore Exchange now has a total of 218 companies listed on its Catalist with a combined market capitalization of nearly S$13 billion.Within the consumer sector, 137 companies are currently listed on SGX with a combined market capitalization of approximately S$76 billion.Get Paid to Learn about Cryptocurrency TradingGo to article >>Commenting on the recent announcement, Mohamed Nasser Ismail, Global Head of Equity Capital Markets at SGX, said: “We are delighted to welcome OTS Holdings Limited to SGX Catalist. With an established track record and experienced management team, OTS Holdings is well-positioned to tap on SGX’s international platform to engage investors, as it continues to innovate and expand its business regionally. We look forward to supporting the company at every step of their growth journey.”Since the start of 2021, several firms have joined Singapore Exchange as trading members. During the first week of June 2021, Synergy Futures Limited, the Hong Kong-based financial services provider, joined SGX as a trading member. In March, Singapore Exchange welcomed Haitong International as a clearing member.OTS Holdings Limited is planning to expand its operations through the latest IPO listing. The Singapore-based company aims to strengthen its position in Asia’s consumer markets. “This IPO listing is an important milestone for OTS Holdings, accelerating our growth strategy that involves greater regional presence and diversification through new products such as plant-based food products. Along with our team, I am excited about the opportunities we have ahead of us and we look forward to welcoming new investors to join us on the next phase of OTS Holdings’ journey as a brand builder in Asia’s consumer markets,” Ong Bee Chip, Managing Director at OTS Holdings Limited mentioned in the official press release.Keep in touch with usFinance Magnates is a global B2B provider of multi-asset trading news, research and events\nwith special focus on electronic trading, banking, and investing.Copyright © 2021                                \"Finance Magnates Ltd.\" All rights reserved. For more information, read our\n\nTerms, Cookies and Privacy Notice\n", "Section": "", "Writers": "", "URL": "https://www.financemagnates.com/institutional-forex/singapore-exchange-welcomes-ots-holdings-limited-to-its-catalist/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}