{"Type": "", "Time": "2021-06-17", "Headline": "Hong Kong police arrest Apple Daily executives, seize reporting materials in national security law raid, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.HONG KONG (REUTERS, BLOOMBERG) - Five hundred Hong Kong police officers sifted through reporters’ computers and notebooks at pro-democracy tabloid Apple Daily on Thursday (June 17), the first case in which authorities have cited media articles as potentially violating the national security law.Around dawn, police arrested five executives of the newspaper, and officers were later seen sitting at computers in the newsroom after entering with a warrant to seize journalistic materials, including from reporters’ phones and laptops.The raid is the latest blow to media tycoon Jimmy Lai, the tabloid’s owner and a staunch Beijing critic, whose assets have been seized under the security law and who is serving prison sentences for taking part in illegal assemblies.In comments raising further alarm over media freedoms in Hong Kong, Security Secretary John Lee described the newsroom as a \"crime scene\" and said the operation was aimed at those who use reporting as a \"tool to endanger\" national security. He did not elaborate on the dozens of articles police said they were taking aim, at but said the five were arrested for a conspiracy to make \"use of journalistic work\" to incite foreign forces to impose sanctions on Hong Kong and China. \"Normal journalists are different from these people. Don’t collude with them,\" he told reporters. \"Do your journalistic work as freely as you like in accordance with the law, provided you do not conspire or have any intention to break ... the national security law.\" Senior superintendent Li Kwai-wah said the tabloid published dozens of reports dating back to 2019 that \"incited foreign countries to impose sanctions\", without saying when the most recent articles in question were. The legislation is not retrospective but prosecutors can use actions from before its implementation as evidence.Police have also frozen HK$18 million (S$3.1 million) of assets owned by three companies linked to Apple Daily and that the raid was not targeted at the media industry as a whole.China’s Hong Kong Liaison Office said it firmly supported what it described as \"just action\" by the police. In a letter to its readers, Apple Daily said that it was the victim of a “targeted attack by the regime,” but that its staff “will continue to stick to their posts loyally and fight to the end.”Police seized 38 computers used by its reporters, Apple Daily said.It was the second time police have raided the Apple Daily headquarters; 200 officers went in last year to arrest Lai on suspicion of colluding with foreign forces. Lai has been in detention since December, denied bail under the security law and serving several sentences for taking part in some unauthorised rallies, including during the global financial hub’s mass pro-democracy protests in 2019. The security law was Beijing’s first major move to set China’s most restive city on an authoritarian path. It punishes anything Beijing deems as subversion, secessionism, terrorism and collusion with foreign forces with up to life in prison. National security police said in a statement that five directors of a company had been arrested on suspicion of collusion with a foreign country or with external elements.Hong Kong police do not name arrestees. Apple Daily said editor-in-chief Ryan Law, chief executive officer Cheung Kim-hung, Chief Operating Officer Chow Tat-kuen, Deputy Chief Editor Chan Puiman and Chief Executive Editor Cheung Chi-wai had all been arrested in morning raids. \"This is a blatant attack on the editorial side of Apple Daily,\" Mr Mark Simon, an adviser to Lai who is outside Hong Kong, told Reuters. \"They’re arresting the top editorial folks.\"Pictures published by Apple Daily showed police sitting at reporters’ desks and using their computers. A person streaming a live feed for Apple Daily’s Facebook page said the building was cordoned off and reporters were prevented from accessing certain floors or getting their equipment or notebooks. Chief editor Law was seen walking in handcuffs, flanked by police officers.The Apple Daily paper’s general news desk told reporters in a text message seen by Reuters to carry on with their assignments outside the building for the time being. \"This fits into the pattern over the past year of the government using the national security law to target its top critics,\" said Mr Tom Kellogg, the executive director of the Georgetown Centre for Asian Law.\nPolice officers unload outside the headquarters of the Apple Daily newspaper and its publisher Next Digital Ltd. in Hong Kong, on June 17, 2021. PHOTO: BLOOMBERG\n\"This is a serious blow to press freedom in Hong Kong, and a direct attack on the journalistic work of Apple Daily,\" he added. \"Whereas prior attacks on Apple have focused on Jimmy Lai’s own advocacy, these arrests are – for the first time – focused on Apple Daily’s journalistic output.\"Mr Steven Butler, Committee to Protect Journalists’ Asia programme coordinator said the arrests \"under Hong Kong’s Orwellian National Security Law destroy any remaining fiction that Hong Kong supports freedom of the press.”\"China, which controls Hong Kong, may be able to eliminate the paper, which it sees as an annoying critic, but only at a steep price to be paid by the people of Hong Kong, who had enjoyed decades of free access to information,\" he added.The move is the latest blow to Apple Daily after authorities last month directed jailed tycoon Lai’s shares in Next Digital, publisher of the newspaper, to be frozen. Trading in the company’s stock on the Hong Kong bourse was suspended on Thursday. Asked how long he thinks the newspaper can survive, Mr Simon said: \"It’s not up to us. It’s up to them. There’s 100 police officers in our newsroom. They decide, not us.\"The arrests on Thursday are likely to reignite ongoing concerns about whether Hong Kong still retains the constitutionally-guaranteed freedom of speech that has led numerous international news organisations to establish regional headquarters in the finance hub. \"Hong Kong has been left with little free speech under the national security law, which is really aimed at silencing all dissent,\" said Associate Professor Victoria Hui from the University of Notre Dame. \"Beijing has reined in Hong Kong and will continue to take whatever it takes to silence any dissenting voices.\"\nA police vechie is seen outside the headquarters of Apple Daily and Next Media in Hong Kong, on June 17, 2021. PHOTO: REUTERS\nIn an e-mail sent to readers on Wednesday, Mr Law, the now-arrested Apple Daily editor, wrote that Hong Kong media were operating under \"more and more laws restricting freedom of the press\".But he vowed the newspaper would carry on reporting.\"Is the national security law the biggest crisis of Apple Daily?\" he asked, noting that identifying the government’s \"red lines\" were becoming increasingly important.\"No matter how great the pressure is, we will definitely be able to stand up,\" he added. \"At the end of the tunnel, there must be light.\"Apple Daily is an unapologetic tabloid that mixes pro-democracy discourse with celebrity gossip and investigations of those in power and is popular in Hong Kong. In May, Reuters reported that Hong Kong’s security chief sent letters to Lai and branches of HSBC and Citibank threatening up to seven years in jail for any dealings with the billionaire’s accounts in the city. Lai’s assets were also frozen under the same law.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/hong-kong-arrests-apple-daily-editor-on-security-law-local-media-says", "Source": "google"}