{"Type": "", "Time": "2021-06-17", "Headline": "Gennaro Gattuso quits as Fiorentina manager just TWENTY-THREE DAYS after he was appointed | Daily Mail Online", "Text": "By Sam Blitz For Mailonline  Published:  01:31 EDT, 17 June 2021   |  Updated:  05:05 EDT, 17 June 2021    38View  commentsGennaro Gattuso has left Fiorentina just 23 days after accepting the job due to a dispute over transfers.The 43-year-old manager was announced as the new Viola coach on May 25, following his departure from Napoli - where he failed to guide his side to the Champions League after slipping up on the final day of the Serie A season.Gattuso was set to officially take over on July 1 ahead of the new season and had already started discussions over transfer plans at the club.Gennaro Gattuso has quit Fiorentina after just two weeks following a dispute over transfersGattuso was announced as the new head coach of La Viola on May 25 after leaving NapoliACF Fiorentina statement: Gattuso#ACFFiorentina #Fiorentina https://t.co/MzjzddODbwBut now the club have confirmed Gattuso's departure, with several reports, including Sky Sport Italia, claiming he had a falling out with club owner Rocco Commisso over transfer targets.  'ACF Fiorentina and Mister Rino Gattuso, by mutual agreement, have decided not to follow up on the previous agreements and therefore not to start the next football season together,' a club statement read.'The Company immediately set to work to identify a technical choice that will guide the Viola team towards the results that Fiorentina and the City of Florence deserve.'The Sky Sport report claims Gattuso and his agent Jorge Mendes had recommended that Fiorentina sign the likes of Porto midfielder Sergio Oliveira and Valencia forward Goncalo Guedes, but Commisso wants cheaper targets. Gazzetta dello Sport described Gattuso's imminent exit as an 'incredible divorce'Gattuso has fallen out with owner Rocco Commisso over transfer targets this yearGattuso's strained relationship with the Fiorentina board also comes at a time when they are reportedly set to miss out on Stuttgart striker Nico Gonzalez, who is also wanted by Brighton. Gazzetta dello Sport described the Gattuso fiasco as an 'incredible divorce'.Reports also claim former Leicester City manager Claudio Ranieri is one of the options lined up to replace Gattuso now that his exit has been confirmed. The 69-year-old Italian is recently unemployed following his departure from Sampdoria, where he achieved an acceptable ninth-placed finish in Serie A last season. Gattuso reportedly wanted Portuguese duo Goncalo Guedes (left) and Sergio Oliveira (right)The recommendations of the duo also came from Gattuso's agent Jorge Mendes (centre)Other names touted as Gattuso's successor include former Lyon manager Rudi Garcia, who has been linked to the vacant Everton manager position, while Andrea Pirlo is also available after being sacked by Juventus last month. Fiorentina suffered from several manager exits last season in a campaign which saw them finish in the bottom half of the table. La Viola started with Guisepee Iachini as manager but was sacked in November, with former Italy manager Cesare Prandelli arriving as a replacement.Prandelli then resigned from his position in March, with Iachini returning to the club for the final few months of the season. Iachini was then replaced for a second time by Gattuso at the end of May, but that journey has now met a premature end.  Claudio Ranieri (L) and Andrea Pirlo (R) are among the options lined up to replace Gattuso\n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group", "Section": "", "Writers": "", "URL": "https://www.dailymail.co.uk/sport/football/article-9695727/Gennaro-Gattuso-set-quit-Fiorentina-just-TWO-WEEKS-following-fall-owner.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}