{"Type": "", "Time": "2021-06-17", "Headline": "Covid-19 Delta variant represents 2% to 4% of French cases, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.PARIS (REUTERS) - The Delta variant of the Covid-19 virus, first found in India - which experts estimate to be more infectious than other variants - currently represents 2 per cent to 4 per cent of confirmed Covid-19 cases in France, said French Health Minister Olivier Veran on Tuesday (June 15).Mr Veran said this meant France was registering between 50 and 150 cases a day of the Covid-19 Delta variant, which highlighted the importance of sanitary protocol measures and vaccinations to keep the virus at bay.\"We are in the process of crushing the virus and crushing the pandemic, and we must in no way let the variant get the upper hand so that it leads to another wave of the pandemic,\" Mr Veran told reporters at a Paris vaccination centre.On Monday, British Prime Minister Boris Johnson delayed his plans to lift most remaining Covid-19 restrictions by a month, citing the dangers posted by the Covid-19 Delta variant.France's Covid-19 numbers have steadily gone down over the last two months after the country eased its third national lockdown.France has more than 110,400 Covid-19 deaths, the ninth-highest Covid-19 death toll in the world.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/covid-19-delta-variant-represents-2-4-of-french-cases", "Source": "google"}