{"Type": "", "Time": "2021-06-17", "Headline": "Hong Kong Police Raid Pro-Democracy Newspaper Apple Daily, Arrest 5", "Text": "The Apple Daily's chief-editor and four other executives were arrested by the Hong Kong police.Hong Kong police arrested the chief editor and four executives of pro-democracy newspaper Apple Daily on Thursday, raiding its newsroom for a second time in the latest blow to the outspoken tabloid.The paper and its jailed owner Jimmy Lai have long been a thorn in Beijing's side with unapologetic support for the financial hub's pro-democracy movement and scathing criticism of China's authoritarian leaders.More than 500 officers were involved in the dawn operation which police said was sparked by articles Apple Daily had published \"appealing for sanctions\" against Hong Kong and China's leaders.The five executives were arrested \"for collusion with a foreign country or with external elements to endanger national security\".\"Those arrested are all directors of Apple Daily so they are very familiar with the company's daily operations,\" senior superintendent Steve Li told reporters. \"They have overall responsibility for the content, style and principles of news reporting.\"Police said HK$18 million (US$2.3m) in Apple Daily assets had also been frozen under the security law, the first time a seizure order has been made directly against a Hong Kong media company, rather than an individual.On Facebook, Apple Daily broadcast live footage and shared photos of the raid. Officers could be seen cordoning off the building, searching the newsroom and looking through journalists' computer consoles.\"They arrived around 7 am this morning, our building is besieged,\" an unnamed reporter said in the broadcast.\"Police are restricting us from using quite a lot of our equipment. But we can still keep this live camera on and our website will keep updating,\" the voice added.Sweeping security lawMost of the executives were arrested at home but later taken to the newspaper.Chief editor Ryan Law and CEO Cheung Kim-hung were both led into the building with their hands fastened behind their backs.Stand News, a pro-democracy online media outlet, published pictures showing police had smashed down the house door of Chan Pui-man -- Law's deputy.Hong Kong's stock exchange said trading in shares of Next Digital -- the publisher of the newspaper -- had been halted.The security law introduced last June is the speartip of a sweeping crackdown on Beijing's critics in Hong Kong since 2019's huge democracy protests.It has criminalised much dissent, given China jurisdiction over some cases, allowed mainland security agents to operate openly in Hong Kong and awarded authorities a suite of powerful new investigation powers.Those convicted of a national security crime face up to life in prison and the majority are denied bail after arrest.Thursday's raid was the second on Apple Daily in less than a year.The tabloid's billionaire owner Lai, 73, was charged with collusion after hundreds of officers searched the paper's newsroom last August.He is currently serving multiple jail sentences for attending various protests.Apple Daily has staunchly backed Hong Kong's pro-democracy cause, including the huge and often violent demonstrations that swept the city in 2019.Beijing has made no secret of its desire to see the paper's voice tamed, with state media routinely describing Lai as a \"traitor\" and a \"black hand\" and senior communist party officials already declaring him guilty.Asset seizures Last month, police used the national security law to freeze Lai's bank accounts and his majority shares in Next Digital.It was the first time Hong Kong authorities used the law to seize shares of a listed company's majority shareholder.Until Thursday's raid, authorities had left the company's assets alone. It is unclear whether Apple Daily will now be able to pay its staff.More than 100 people have been arrested under the security law, many of them the city's best-known democracy activists. Others have fled overseas.China says the law was needed to return stability to the international financial hub.Critics, including many Western nations, say it has been the final nail in the coffin for the \"One Country, Two Systems\" promise that Hong Kong could maintain certain liberties after its 1997 handover to China by the British.A shadow of fear has hung over the newsroom since Lai's arrest.Speaking with AFP last month, chief editor Law admitted that the paper was in \"crisis\" since the jailing of its owner but said his reporters were determined to press on with publishing.At a recent meeting, staff asked Law what they should do if the police came back to arrest him.\"Broadcast it live,\" he said.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)Track Latest News Live on NDTV.com and get news updates from India and around the world. Watch Live News:Follow Us:................................ Advertisement ................................", "Section": "", "Writers": "", "URL": "https://www.ndtv.com/world-news/hong-kong-police-raid-pro-democracy-newspaper-apple-daily-arrest-five-2465846", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}