{"Type": "", "Time": "2021-06-17", "Headline": " Locatelli, Immobile fire Italy into Euro 2020 last 16  - Sports - The Jakarta Post", "Text": "Please Update your browser\n          Your browser is out of date, and may not be compatible with our website. A list of the most popular web browsers can be found below.\n          Just click on the icons to get to the download page.Log in with your social accountManuel Locatelli scored a brace and Ciro Immobile added a late third as Italy sealed their place in the Euro 2020 last 16 on Wednesday with a game to spare after a rampant 3-0 win over Switzerland in Rome.Sassuolo midfielder Locatelli put the Azzurri ahead on 26 minutes in the Group A clash, adding a second just after the break with Immobile scoring for the second consecutive game a minute from time.Roberto Mancini's side are top of Group A with six points from two games, with six goals scored and none conceded, two points clear of Wales who beat Turkey 2-0 earlier.\"The matches are all difficult, some may seem simpler but they are always to be played and to be won,\" said Mancini.\"Switzerland are a strong team. It was a very hard game. We could have scored earlier, but in the end it is a well-deserved victory.\"Italy will advance as Group A winners if they avoid defeat against surprise Euro 2016 semi-finalists Wales at the Stadio Olimpico on Sunday.\"Up to now the lads have been good but the road is long,\" Mancini added.\"There are national teams that are ahead of us in the work of growth, but in football anything can happen.\"Switzerland will likely have to beat Turkey in Baku this weekend to have a chance of reaching the knockout phase.\"Everyone deserves to be disappointed tonight, but tomorrow from the first training session we move on,\" said Swiss coach Vladimir Petkovic.\"I spoke to the team and told them there's a match left, and three points could get us to the next round.\"The only bad news for the Italians in a game they dominated was the loss of captain Giorgio Chiellini who hobbled off the pitch with a muscle injury in the first half.The 36-year-old Juventus defender had a 20th-minute goal ruled out for handball by VAR and four minutes later asked to be replaced, holding his thigh.\"We hope that there is nothing serious, we will see tomorrow,\" said Mancini.Lazio defender Francesco Acerbi took his place, making his debut in a major international tournament at the age of 33, with the captain's armband handed to Juventus teammate Leonardo Bonucci.Italy gave the Swiss no space in another commanding display, having beaten Turkey 3-0 five days ago in Rome.Record run in sight Lazio forward Immobile once again led Italy's three-man attack, flanked by wingers Lorenzo Insigne and Domenico Berardi.Immobile missed several chances to add to his tally, sending a header over the bar early from a Leonardo Spinazzola cross.After Chiellini's exit, Locatelli started the move which reaped the opener, combining with Sassuolo teammate Berardi, who weaved into the area and steered across for the former to the finish off.Swiss keeper Yann Sommer denied Immobile and an Insigne follow-up was cleared off the line after half an hour.Another well worked move resulted in Italy's second goal, Nicolo Barella teeing up Locatelli to drive in from 20 yards.Locatelli, who has taken the place of injured Marco Verratti, brings his tally to three goals in 12 appearances for Italy since making his debut last September.\"I hope very much that Marco will be able to come back, he's a very strong player who makes the difference,\" said Locatelli. \"But I'm proud to be part of an incredible group and happy to be here.\"Let it continue!\"Switzerland had few chances with Liverpool's Xherdan Shaqiri blasting over after an hour, while Italy goalkeeper Gianluigi Donnarumma kept out their best effort from Steven Zuber minutes later.For Italy it was a 10th consecutive win with a clean sheet, extending their unbeaten run to 29 matches since September 2018 -- just after failing to qualify for the last World Cup.Italy have now scored two goals or more in each of their last 10 international matches.Mancini meanwhile moves within one game of Italy's two-time World Cup-winning coach Vittorio Pozzo's record of 30 unbeaten games between 1935 and 1939.© 2016 - 2021 PT. Bina Media Tenggara", "Section": "", "Writers": "", "URL": "http://www.thejakartapost.com/news/2021/06/17/locatelli-immobile-fire-italy-into-euro-2020-last-16-.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}