{"Type": "", "Time": "2021-06-17", "Headline": "'Stuffing them in a pail might cause them to die': Marine life enthusiasts warn after groups seen collecting sea creatures at Changi Beach, Singapore News - AsiaOne", "Text": "[UPDATE June 16] NParks said on Tuesday (June 16) that it will take steps to prevent manhandling of marine animals in intertidal areas.Staff, volunteers and nature groups will help put up more signs and increase patrols in these places, Ryan Lee, group director of Nparks' National Biodiversity Centre told local media.In addition, he said NParks will \"raise awareness on the detrimental effects of touching, collecting or trampling on marine wildlife in their natural habitats\".A number of marine groups, enthusiasts and netizens were shocked by scenes of people collecting intertidal wildlife in a viral social media post.Daphne Ting took to Facebook on Sunday (June 13) describing the situation at Changi Beach as \"horrible\".\"What I saw today were groups and groups of people armed with shovels, tongs and pails, happily collecting crabs, fish, shells, sea cucumbers, eels, jellyfish and even sea anemone,\" she said. These creatures can be seen collected by these beachgoers and kept in cramped conditions in pails.Comments were mostly critical of the situation and a handful called on the authorities to take action. One commenter wrote: \"There should be...a ban of bringing tools like shovel and pails.\"Marine life harvesting is a common sight and the people who collect such wildlife are often unaware of how these animals behave, according to experts in a CNA report.Dennis Chan, founder of Untamed Paths, an organisation that sheds light on unusual wildlife here, told the publication: \"If you're going to stuff them into a pail, the oxygen level depletes rapidly and might cause them to die.\"ALSO READ: 'Let it go': Video of man reeling in endangered eagle ray at East Coast Park sparks concern\"Putting these creatures in buckets also increases the temperature of water, causing more distress,\" the 27-year-old added.Jianlin Liu, who has conducted intertidal surveys in Bali, told CNA that starfish, anemones and soft invertebrates like marine flatworm and nudibranches are delicate animals that can be easily injured or killed if forcefully moved and taken out of the water. In an effort to educate against such incidents and improve the public's understanding of marine life conservation, the National Parks Board runs the Intertidal Watch, where volunteers conduct scientific surveys at intertidal areas to aid conservation.Responding to the Changi Beach incident, MP for Nee Soon GRC Louis Ng took to Instagram on June 14 to remind the public to leave the animals alone.\"Take nothing but pictures, leave nothing but footprints, kill nothing but time,\" he said.Similarly, Young Nautilus, a company providing science-based learning journeys to students said in a Facebook post: \"Do help to advise against wildlife harvesting if you are at the intertidal zones and seeing animals being dabao-ed home!\" alexanderkt@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/singapore/stuffing-them-pail-might-cause-them-die-marine-life-enthusiasts-warn-after-groups-seen", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}