{"Type": "", "Time": "2021-06-17", "Headline": "Australia limits use of AstraZeneca Covid-19 vaccine to people over 60 | World | Malay Mail", "Text": "Loading...Thursday, 17 Jun 2021 01:08 PM MYT\n\nAustralia has administered 3.3 million doses of the AstraZeneca vaccine, and it has been linked to 60 cases of blood clots, the government has said. So far, two people have died, which Hunt said has driven the policy shift. — Reuters pic\n\nFollow us on Instagram and subscribe to our Telegram channel for the latest updates.SYDNEY, June 17 — Australia will recommend only people over 60 receive AstraZeneca’s Covid-19 vaccine, the country’s Minister for Health Greg Hunt said today, following a spate of blood clots in those who have received the inoculation.Australia has administered 3.3 million doses of the AstraZeneca vaccine, and it has been linked to 60 cases of blood clots, the government has said. So far, two people have died, which Hunt said has driven the policy shift.“The government places safety above all else,” Hunt told reporters in Canberra.“This updated advice received today is based on new evidence demonstrating a higher risk for the very rare (thrombocytopenia syndrome) condition in the 50-59 year-old age group.”Australia in April moved to limit the use of the AstraZeneca vaccine to people over 50 years old.Several European Union member states have stopped administering the AstraZeneca vaccine to people below a certain age, usually ranging from 50 to 65, restricting its use to older people, due to very rare cases of blood clotting, mainly among young people.Hunt said the recommendation would not delay its inoculation timetable, which has a target of giving at least one Covid-19 vaccine dose to every Australian before the end of 2021.Australia in April expanded its order of Pfizer’s Covid-19 vaccine to 40 million doses, while it has also ordered 25 million shots from Moderna .Australia’s amended vaccine policy comes as the country’s most populous state battles to contain a cluster of Covid-19 cases.New South Wales said it now recorded four local cases of Covid-19, with the source of the outbreak still unclear.“At this stage, we are all on high alert,” NSW state Premier Gladys Berejiklian told reporters in Sydney.A man in his 60s, who works as a driver for international airline crews, was detected with the virus yesterday, the state’s first case in more than a month, and his wife has since tested positive. Genetic tests found the man has the Delta virus strain, officials said.The Delta variant, which has been classified by the World Health Organisation (WHO) as among the four Covid-19 variants of concern due to evidence that they spread more easily, likely caused the latest devastating outbreak in India.Nearly a dozen venues in Sydney including a cinema in a shopping centre in the popular tourist spot of Bondi and a supermarket have been listed as virus hotspots.Australia has successfully suppressed past outbreaks through snap lockdowns, swift contact tracing and tough social distancing rules. It has reported just under 30,300 cases and 910 deaths since the pandemic began. — ReutersLoading...© 2021, Malay Mail, All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.malaymail.com/news/world/2021/06/17/australia-limits-use-of-astrazeneca-covid-19-vaccine-to-people-over-60/1982891", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}