{"Type": "", "Time": "2021-06-17", "Headline": "Cristiano Ronaldo's Euro 2020 stunt costs Coca-Cola $5.2 billion", "Text": "Coca-Cola has lost a staggering $4 billion after Cristiano Ronaldo's viral press conference stunt at Euro 2020.Speaking to the media ahead of Portugal's opening clash with Hungary on Tuesday, Ronaldo didn't want a bar of two Coke bottles sitting on the desk in front of him.Coca-Cola is the official sponsor of Euro 2020 and have placed two bottles in front of everyone speaking at press conferences.But in a viral moment that has sent social media users into a frenzy, Ronaldo picked up the two Coca-Cola bottles and put them out of sight before holding up his water bottle and saying: \"Drink water.\"Coca-Cola probably wouldn't have been impressed by Ronaldo's actions, and even less so after taking a look at the stock market on Tuesday.The company saw a staggering $5.2 billion wiped off its market value in the hours after Ronaldo's press conference.According to The Athletic, Coca-Cola’s shares were worth $73 each before the press conference, but dropped to $71.86 afterwards.That 1.6 per cent drop in value is worth the eye-watering total of $5.2 billion.Coca-Cola released a statement after Ronaldo's presser, saying “everyone is entitled to their drink preferences” and everyone has different “tastes and needs”.On Tuesday, Ronaldo became the all-time top scorer at the European Championships after two goals in the final minutes helped title holders Portugal beat Hungary 3-0 in their Group F opener.Ronaldo now has 11 goals, taking sole possession of the record he previously shared with France's Michel Platini on nine.Portugal finally broke the deadlock in a game they dominated thanks to Raphael Guerreiro six minutes from time just after Hungary had a goal ruled out for offside.A Ronaldo penalty and a second effort added to the final score, which was harsh on Hungary who worked hard in front of a packed Puskas Area in Budapest - the only stadium to be filled to capacity at the Euros due to the coronavirus pandemic.Portugal had no trouble controlling the first half but struggled to convert their chances created into goals.Diego Jota had a good early opportunity but his powerful header was saved by Hungary keeper Peter Gulacsi, who also managed to block an attempt by Ronaldo in the 19th minute when the Portuguese superstar was already offside.Ronaldo then wrote his name in the record books with a goal from the spot late in the match after Willi Orban fouled Rafa Silva in the box. The Portuguese superstar then scored his 106th for Portugal and closed the gap to Iranian Ali Daei's record (109) of the all-time men's international top goalscorer.\"It was important to win, it was a difficult game,\" Ronaldo said. \"I'm grateful to the team for helping me to score two goals and be the Man of the Match. Now we must go on.\"Hungary's Szalai said the defeat \"is frustrating\" and that Portugal \"didn't work enough to score,\" while keeper Gulacsi believed they needed a little luck to score a goal.Also read: If you had invested Rs 25,000 in Bitcoin in 2015 this is how rich you would beHere's how much money Bill Gates makes per minuteHow much does Mark Zuckerberg spend on his security?Who is the secretive Bitcoin billionaire who invented Bitcoin? Unveiling Satoshi Nakamotowith AAPAustralia recommended that AstraZeneca's Covid-19 jab should not be given to people under 60 on Thursday, a fresh blow to the country's glacial vaccine rollout.When 28 Chinese warplanes streaked through the skies around Taiwan on Tuesday – the largest such incursion this year – they followed a pattern that has generated alarm among US and Taiwanese military planners.Los Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.The freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.If you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Israel's ultra-Orthodox parties were once viewed as political kingmakers, but now they have been pushed into opposition by a \"change\" government they fear will put secular values before theirs.The global infrastructure plan announced by G7 leaders aims to offer developing nations a credible alternative to China's much-criticized Belt and Road Initiative -- but it faces major hurdles on the ground, especially if Beijing's hiccups are any indication.The newly-formed Amihan Esports Wild Rift squad went from unknown to become the dark horses that took down Team Secret at the Wild RIft PPGL Summer Playoffs.If you’re wondering whether Ethereum is a good long term investment, keep reading.Purchases of new private units in Singapore declined about 30% to 891 in May from 1,268 in April, Urban Redevelopment Authority figures showed.For Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neItaly became the first team to reach the knockout stage of Euro 2020 as midfielder Manuel Locatelli scored twice in a 3-0 win over Switzerland in Rome on Wednesday, while Wales moved to the brink of joining them by beating Turkey.Burner phones, safehouses, sheltering with rebels and months away from loved ones -- Myanmar anti-coup activists have been driven underground by a brutal crackdown but have no regrets about choosing life on the run.Two experienced astronauts are among the first three-man crew for China’s first space station, with final preparations under way for their mission launch on Thursday. The Long March 2F rocket carrying them to the Tianhe module – the first part of the Tiangong space station – is expected to lift off at around 9.22am from the Jiuquan satellite launch centre in the Gobi Desert. Propellant refuelling for the rocket was under way on Wednesday morning, according to the China Manned Space Engineering OA former mayor in northern Mexico has been condemned to eight years in prison for his involvement in the 2017 murder of journalist Miroslava Breach, prosecutors said Wednesday.There was no talk of gazing into Vladimir Putin's \"soul\" and the Russian president didn't try to gaslight a rookie US leader.Blackstone Group is nearing an agreement to acquire office developer Soho China Ltd. in what would be its biggest real estate investment in China, people familiar with the matter said.Hong Kong police arrested the chief editor and four executives of pro-democracy newspaper Apple Daily on Thursday, raiding its newsroom for a second time in the latest blow to the outspoken tabloid.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/euro-2020-cristiano-ronaldo-stunt-costs-coca-cola-52-billion-205154311-065441277.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}