{"Type": "", "Time": "2021-06-17", "Headline": "Coronavirus India News Live Updates: Covid-19 Cases, Lockdown Unlock in Maharashtra, Delhi, UP, West Bengal, Bihar, Kerala Today Latest News", "Text": "Coronavirus India Live Updates: The US Centers for Disease Control and Prevention has classified the Delta, a highly transmissible COVID-19 variant first identified in India, as a “variant of concern.”India reported 67,208 new coronavirus cases and 2,330 deaths in the last 24 hours. With this, the country’s overall caseload rose to 2.97 crore, while the death toll surged to 3.81 lakh. Kerala remains the top contributor with 13,270 cases. The number of active cases dropped to 8.26 lakh, the lowest in 71 days.Kerala is set to gradually ease lockdown restrictions from today onwards following a decline in daily reported cases. However, a complete lockdown will continue in the state during the weekend. Shop selling essential good will remain open between 7 AM and 7 PM, while public transport will be permitted to partially operate.In other news, several hospitals across Delhi have reported cases of multi inflammatory syndrome in children (MIS-C) as a post-Covid complication over the last month, though city pediatricians emphasise that affected children have responded well to treatment. In Karnataka, scientists are studying genomic sequences of the SARS-CoV-2 virus among children infected in the second wave in order to ascertain if infections are being caused by the existing variants of the virus or newer ones.The US Centers for Disease Control and Prevention has classified the Delta, a highly transmissible COVID-19 variant first identified in India, as a \"variant of concern.\" \"The B.1.1.7 (Alpha), B.1.351 (Beta), P.1 (Gamma), B.1.427 (Epsilon), B.1.429 (Epsilon), and B.1.617.2 (Delta) variants circulating in the United States are classified as variants of concern.To date, no variants of high consequence have been identified in the United States,\" the CDC said in a statement on Tuesday. The CDC said the Delta variant shows increased transmissibility, potential reduction in neutralisation by some monoclonal antibody treatments under emergency authorisation and potential reduction in neutralization from sera after vaccination in lab tests.The variant of concern designation is given to strains of the virus that scientists believe are more transmissible or can cause more severe disease. Vaccines, treatments and tests that detect the virus may also be less effective against a variant of concern. (PTI)Kerala is set to gradually ease lockdown restrictions from today onwards following a decline in daily reported cases. However, a complete lockdown will continue in the state during the weekend. Shop selling essential good will remain open between 7 AM and 7 PM, while public transport will be permitted to partially operate.Kerala government eases curbs from today while complete lockdown will continue on weekends; visuals from KochiShops selling essential items will be allowed to operate daily from 7am to 7pm & public transport can operate on a limited basis#COVID19 pic.twitter.com/tbrKpGiRWG\n\nDelhi has recorded 14.4 lakh Covid cases since the first case was confirmed in March last year. Since then, the city has seen four waves of infections, of which the last was the deadliest. Over the past three weeks, however, the number of cases has been dipping.Here is what the caseload analysis for the past month tells us:* 40,470 people tested positive for Covid in Delhi between May 15 and June 15* Over half — 51% — were in the 30 to 60 age group* This was followed by the 15-30 age group, which constituted around 28% of the total caseload* Those above the age of 60 constituted 17% of the caseloadRead the full report here. Chief Minister Arvind Kejriwal Wednesday said the Delhi government would train 5,000 youth as “health assistants” in the coming weeks to prepare for a possible third wave of Covid-19 infections in the city.“In the last few days, preparations are being made to protect Delhi from a possible third wave of Covid. I have visited many hospitals. We are setting up oxygen plants and making arrangements for oxygen concentrators, cylinders and storage tanks as well. But if a third wave comes — as we saw in the first and second waves — we face shortage of medical and paramedical staff,” he said in a press conference.“Keeping that in mind, the government has made a grand ambitious plan to prepare 5,000 health assistants. In technical terms, they are called ‘community nursing assistants’,” he said. Read the full report here. With a state-appointed task force Wednesday expressing apprehension that a third wave of the pandemic could hit Maharashtra in a month or two if Covid-appropriate behaviour was not followed, Chief Minister Uddhav Thackeray directed senior doctors and officers to ensure medicines and health equipment were available across urban and rural areas.At a meeting to review the preparations for the possible third wave of the pandemic, the CM was informed that a highly virulent “Delta plus” variant of the coronavirus could stoke a third wave in Maharashtra.The state health department officers also said while the number of patients during the second wave was much higher than the first due to the ‘Delta variant’ of the virus, the third wave may even see a higher volume of patients. The state recorded around 19 lakh patients in the first wave of the pandemic and nearly 40 lakh in the second. Health officials said the third wave could even see eight lakh active patients, of whom 10 per cent could be children. Read the full report here. With the second wave of Covid-19 infections on a decline, footfall of passengers at the Pune airport has seen considerable rise over the last one week. This has led to airlines adding flights to their daily schedule. As a result, flight movement from the airport has gone up from 26 per day in the middle of May to about 46 per day in mid-June.Airport officials said they expect that passenger activity will improve further in the coming weeks.“As the severity of the infection spread will go down, more people will buy tickets to travel and the number of flights will go up. We are seeing increasing footfall and flight operations since the second wave of the Covid-19 pandemic has started receding and businesses are opening up,” said airport director Kuldeep Singh. Read the full report here. Over the last month, several hospitals across Delhi have reported cases of multi inflammatory syndrome in children (MIS-C) as a post-Covid complication, though city pediatricians emphasise that affected children have responded well to treatment.According to the Lancet, the factors that trigger the condition are not yet known but it is thought to be a rare immune overreaction that occurs approximately four to six weeks after a mild or asymptomatic SARS-CoV-2 infection. The symptoms include fever for three days, rash, eye infection and gastrointestinal symptoms like diarrhoea, stomach-ache and nausea. In very rare cases, the condition can lead to multi-organ failure. Read the full report here. SCIENTISTS IN Karnataka are studying genomic sequences of the SARS-CoV-2 virus among children infected in the second wave in order to ascertain if infections are being caused by the existing variants of the virus or newer ones.A technical advisory committee advising the state government on the Covid-19crisis has tasked the nodal officer for genome sequencing in the state, Prof V Ravi, a former professor of virology, to study gene sequences in samples of children who tested positive for Covid. “Samples are now being collected and they need to be processed. We should have data and information in about 15 days,” he said.“We have discussed the issue of infections among children and some additional work is required to study the genomic sequencing of viruses from samples of children,” said Prof M K Sudarshan, a public health expert and chairman of the state technical advisory committee. Read the full report here. India reported 67,208 new coronavirus cases and 2,330 deaths in the last 24 hours. With this, the country’s overall caseload rose to 2.97 crore, while the death toll surged to 3.81 lakh. The number of active cases dropped to 8.26 lakh, the lowest in 71 days.India reports 67,208 new #COVID19 cases, 1,03,570 discharges & 2,330 deaths in last 24 hours, as per Health MinistryTotal cases: 2,97,00,313Total discharges: 2,84,91,670 Death toll: 3,81,903 Active cases: 8,26,740 (lowest after 71 days)Total Vaccination: 26,55,19,251 pic.twitter.com/ImnmFjsAc7\n\nDr Reddy’s in a statement Wednesday said that the soft launch of Sputnik V vaccine in India, which was initiated in Hyderabad, has been scaled up to many cities including Bengaluru, Mumbai, Kolkata, Delhi, Chennai, among others. It added that registration on CoWIN was not open to public yet, but will be open at the time of commercial launch.Meanwhile, drugs such as ivermectin, hydroxychloroquine, favipiravir and antibiotics like doxycycline and azithromycin prescribed for adult Covid patients are not recommended for treating children, stated a government guideline issued on Wednesday. The guidelines by the Union Health Ministry said the decision has been taken since most of these drugs used in adults are have not been tested on children for prevention or treatment of Covid infection among them.India recorded 62,224 new Covid-19 cases and 2,542 deaths on Tuesday. With this, the country's overall caseload rose to 2.96 crore, while the death toll surged to 3.62 lakh. Kerala is the top contributor, adding 12,246 new cases to the country's caseload. The number of fresh cases reported in the last 24 hours are 212 in Delhi, 830 in Mumbai, 1,611 in Bengaluru, 377 in Kolkata and 689 in Chennai.Meanwhile, in a statement, the government said that its decision to increase the gap between two shots of Covishield from 4-6 weeks to 12-16 weeks lies in \"fundamental scientific reason regarding behaviour of adenovector vaccines\", according to the National Technical Advisory Group on Immunisation (NTAGI).", "Section": "", "Writers": "", "URL": "https://indianexpress.com/article/india/coronavirus-india-live-updates-lockdown-covid-vaccine-7362766/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}