{"Type": "World", "Time": "2021-06-17", "Headline": "Little warmth despite the heat at Biden-Putin summit", "Text": "GENEVA: Despite the soaring summer temperatures in Geneva on Wednesday (Jun 16), beyond the surface pleasantries there was little sign of personal warmth between Joe Biden and Vladimir Putin followingtheir first summit.The US and Russian presidentsshook hands and smiledas they went in for talks at a plush 18th-century villa in the Swiss city.However, though both sides said the tone of the meeting had been positive and constructive, the feeling was that it had been workmanlike rather than chummy.\"We know each other but we're not old friends. It's just pure business,\" Biden told a press conference afterwards.Biden had flown into Geneva the evening before and spent the night at the five-star Intercontinental Hotel.Putin jetted in just before the summit, his motorcade whisking him straight to the sumptuous La Grange venue.A Geneva protocol official said one of the lakeside villa's benefits was its symmetry, meaning it could be easily divided - giving both camps a perfectly equal number of rooms and no chance for one-upmanship.FRENZIED SCUFFLEThe even-handedness stretched to the layout of flags outside the entrance for when Putin and Biden flanked Swiss President Guy Parmelin for a photograph before the two guests headed in for talks.The Russian, Swiss and US flags were out on either side - though the Russian one was foremost on the side Putin stood on, with the US flag first on Biden's side.Parmelin wished them \"a fruitful dialogue in the interests of your two countries and the world. Best wishes, and goodbye\", before simply walking off, leaving the two visiting presidents on the doorstep seemingly wondering what to do next.Biden turned towards Putin and then extended his hand.The pair shook hands for less than four seconds, exchanged a few words and smiled before heading inside.They were shown into the villa's showpiece room - its impressive library, home to 15,000 books with volumes dating back to the 15th century.The pair sat in chairs that looked far more comfortable for a three-and-a-half hour meeting than the wooden armchairs set out in preparation for the summit last week.They were seated on either side of a globe of the world, with their respective flags behind them.Journalists were invited in to witness their opening remarks, but all decorum went out the window as the reporters charged into the room.\"The media scuffle was the most chaotic your pooler has seen at a presidential event in nine years. Journalists pushed and shoved, yelling at each other to move but no one did,\" the White House pool reporter said.Both presidents \"appeared amused\" by the screaming and yelling.With the temperatures reaching 32 degrees Celsius (98 degrees Fahrenheit) outside, mercifully, air conditioning had been installed in the villa to help the presidents keep their cool.SHADES AND SCULPTUREBiden gave Putin a pair of his favourite sunglasses - custom Aviators made by Randolph USA - and a crystal sculpture of an American Bison.The summit meant Putin missed the entirety of Russia's 1-0 win over Finland in the Euro 2020 football championships.But when asked afterwards, Putin refused to draw comparisons and say what the score was in his encounter with Biden.Putin characterised the meeting as a \"frank and candid\" encounter.However, \"it doesn't necessarily mean that we need to ... pledge eternal love\", he said.The Russian concluded his press conference by saying: \"You've got to look around and think to yourself: it's a wonderful world.\"Biden struck a more brusque tone, saying: \"I did what I came to do.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Biden-Putin,fine art,Joe Biden,summit,US,Russia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/little-warmth-despite-the-heat-at-biden-putin-summit-15029672", "Source": "google"}