{"Type": "Asia", "Time": "2021-06-17", "Headline": "Myanmar junta troops burn village in escalation of violence", "Text": "YANGON: Government troops in Myanmar have burned most of a village in the country’s central heartland, a resident said on Wednesday (Jun 16), confirming reports by independent media and on social networks.The action appeared to be an attempt to suppress resistance against the ruling military junta.The attack is the latest example of how violence has become endemic in much of Myanmar in recent months as the junta tries to subdue an incipient nationwide insurrection.After the army seized power in February, overthrowing the elected government of Aung San Suu Kyi, a non-violent civil disobedience movement arose to challenge military rule, but the junta's attempt to repress it with deadly force fuelled rather than quelled resistance.Photos and videos of devastated Kinma village in the Magway region that circulated widely on social media on Wednesday showed much of the village flattened by fire and the charred bodies of farm animals.A villager contacted by phone said that only 10 of 237 houses were left standing.The villager, who asked that his name not be used because of fear of government reprisal, said that most residents had already fled when soldiers firing guns entered the village shortly before noon on Tuesday.He said he believed that the troops were searching for members of a village defence force that had been established to protect against the junta’s troops and police. Most such local forces are very lightly armed with homemade hunting rifles.The village defence force gave residents advance warning of the troops' arrival, so only four or five people were left in the village when they began searching houses in the afternoon. When they found nothing, they began setting the homes on fire, he said.“There are some forests just nearby our village. Most of us fled into the forests,” he said.The villager said he believed there were three casualties, a boy who was a goat-herder who was shot in the thigh, and an elderly couple who were unable to flee. He believed the couple had died but several media reports said they were missing.Asked if he planned to go back to the village, he said: “No, we dare not to. We think it isn’t over. We will shift to other villages. Even if we go back to our village, there is no place to stay because everything is burnt.”The village defence forces are committed to forming a future opposition federal army, and some have allied themselves with ethnic minority groups in border areas that have been fighting for decades for autonomy from the central government.Most of the fiercest fighting takes place in the border regions, where government forces are deployed in areas controlled by ethnic groups such as the Chin in the west, the Kachin in the north and the Karenni in the east.The incident in Kinma attracted special attention because the Burman, or Barmar ethnic group, the country’s power-holding majority, is predominant in the Magway region and it is unusual for them to be targeted for such severe measures.The army burned many villages of the Muslim Rohingya minority in 2017 in a brutal counterinsurgency campaign in the western state of Rakhine that drove more than 700,000 to seek safety across the border in Bangladesh.There is widespread prejudice against the Rohingya, and few in Myanmar protested the army’s treatment of them, though international courts are now considering whether it constituted genocide.Some people commenting on Wednesday on social media said that the burning of Kinma made Rohingya claims of mistreatment more credible.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Myanmar,Myanmar coup,Myanmar junta,Aung San Suu Kyi", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/myanmar-junta-troops-burn-village-in-escalation-of-violence-15027552", "Source": "google"}