{"Type": "World", "Time": "2021-06-14", "Headline": "AstraZeneca COVID-19 shots have good risk-benefit profile for over-60s: EMA official", "Text": "MILAN: The head of the EU drug regulator's COVID-19 task force said on Sunday that AstraZeneca's coronavirus vaccine had a favourable risk-benefit profile for all age groups and particularly for those aged over 60.Italian newspaper La Stampa earlier quoted European Medicines Agency (EMA) task force chief Marco Cavaleri as saying countries should avoid giving the vaccine to people aged over 60 in addition to younger age groups, amid fears over very rare blood clotting and as alternative vaccines become available.\"Unfortunately my words have not been interpreted correctly in a recent interview with La Stampa,\" Cavaleri said in a statement to Reuters. The AstraZeneca shot \"maintains a favourable benefit-risk profile in all ages but particularly in the elderly above 60\", he said.The EMA's position is that the AstraZeneca shot is safe and can be used for all age groups over 18. However several European Union member states have stopped administering it to people below a certain age, usually ranging from 50 to 65, restricting its use to older people, due to very rare cases of blood clotting, mainly among young people.On Sunday evening, La Stampa changed the headline on its article online and added a clarification with Cavaleri's later comments to its article. La Stampa editor Massimo Giannini said he had no further comment.Earlier this week the Italian government said it would restrict the use of the AstraZeneca vaccine to people aged over 60, after a teenager who had received the shot died from a rare form of blood clotting.Italian Health Minister Roberto Speranza told reporters on Sunday that Italy will continue to use the AstraZeneca vaccine on the over 60s, including those who have not received a first jab.Like many European countries, Italy briefly halted AstraZeneca inoculations in March over concerns about the rare blood clotting problems.It resumed them the following month with the recommendation that the product be \"preferably\" used for people over the age of 60, after the EMA said its benefits outweighed any risks.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,vaccine", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/astrazeneca-covid-19-vaccine-ban-over-60s-eu-ema-15005544", "Source": "google"}