{"Type": "", "Time": "2021-06-14", "Headline": " Covid roundup: G7 vows action on vaccines; curbs to ease in several states from today | India News - Times of India", "Text": "India is battling a vaccine crisis as the country is reeling under the second wave of the pandemic. Was government's decision to split vaccine purchase between public and private sector-wise? For: Shobana Kamineni Focus should be on fixing vaccine supply rather thanBENGALURU: Karnataka government on Saturday announced that economic and other activities will be allowed from 6am of June 14 to 6am of June 21, in a graded manner. However, weekend and night curfew are proposed to be imposed in the state. Weekend curfew would be in force from 7pm on June 18 to 5amPM Modi on Sunday said that India is a \"natural ally\" of the Group of 7 nations that share common values and concerns. Virtually addressing the G7 Summit, PM Modi highlighted India's civilisational commitment to democracy, freedom of thought and liberty. He said that India is a natural ally toLast year, PM Modi told the UN his country would make enough Covid-19 vaccines \"to help all humanity.\" Now India is struggling to meet its own domestic needs for the shots amid a startling surge of infections. But a mixture of overconfidence, poor planning and bad luck has prevented that fromAmid the second wave of Covid-19, Oxygen Express trains have delivered more than 30,000 metric tonnes (MT)of Liquid Medical Oxygen (LMO) to states and UTs so far across the country.More than 1.53 crore Covid-19 vaccine doses are still available with states and union territories, and over 4 lakh more will be delivered to them within the next three days, the Union health ministry said Sunday. More than 26 cr doses have been provided to states and UTs so far, through Centre (freeAround the world, from Bangladesh to Nepal to Rwanda, vulnerable hotspots have been grappling with stalled Covid-19 vaccination programs as they run out of doses. Many of those shortages can be traced back to a single company: The Serum Institute of India. The company was named a top supplier ofIndiaWorld", "Section": "", "Writers": "", "URL": "https://timesofindia.indiatimes.com/india/covid-roundup-centre-gives-26cr-vaccine-doses-to-states-religious-places-open-in-delhi-80-tibetans-gets-first-dose/articleshow/83484909.cms", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}