{"Type": "", "Time": "2021-06-14", "Headline": "Stock Market Today: Dow, S&P Live Updates for June 14, 2021 - Bloomberg", "Text": "Treasury yields edged higher Monday as investors prepared for a key Federal Reserve meeting later in the week. Stocks were mixed in thin trading.Ten-year Treasury yields inched up to around 1.46% after hitting three-month lows on Thursday and notching their biggest weekly slide since December last week. Stocks saw modest gains in Japan and a drop in South Korea. Trading volumes were light with a number of holidays in the region including in Australia, China and Hong Kong. U.S. futures were little changed after stocks staged a late rally Friday, closing at another record after a choppy day of trading.The dollar was steady against Group-of-10 peers during early Asia trading in the wake of a Group-of-Seven leadership meeting that emphasized unity.With Treasury yields trending downward, investors are anticipating the Fed will reaffirm that its ultra-loose policy remains appropriate, and that it’s too soon to start even contemplating tapering bond purchases. Still, officials could project interest-rate liftoff in 2023 amid faster economic growth and inflation, according to economists surveyed by Bloomberg.“The FOMC continues to see the jump in inflation as transitory, and may acknowledge, even at the margin, that they are discussing the pace of monthly purchases but won’t yet commit to a date for slowing the purchases,” said Prudential Financial Inc. strategist Quincy Krosby in emailed comments.Elsewhere, Bitcoin jumped over the weekend after Elon Musk said Tesla would resume transactions with the cryptocurrency when mining it is done with more clean energy. Oil futures advanced.For market commentary, follow the MLIV blog.Here are some key events to watch this week:These are some of the main moves in markets:", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-13/asia-stocks-set-for-muted-start-with-focus-on-fed-markets-wrap", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}