{"Type": "", "Time": "2021-06-14", "Headline": "Football: Eriksen's toughest battle on road to recovery will be mental, says Muamba, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.LONDON (Reuters) - Former Bolton Wanderers midfielder Fabrice Muamba said Christian Eriksen's collapse brought back painful memories of his own cardiac arrest and that the Dane's toughest challenge in recovering from the incident will be a mental one.Eriksen suffered a cardiac arrest after he collapsed in the 42nd minute of Saturday's (June 12) Euro 2020 match against Finland and was later rushed to the hospital.Jakob Hoeyer, communications director at the Danish football association, told reporters on Monday that Eriksen's condition is still \"stable, good\".Muamba, who collapsed on the pitch in an FA Cup match in 2012 and was technically dead for 78 minutes, said it took him more than a year to come to terms with the incident, which forced him to retire at the age of 24.\"It's too early to know about his physical health, but I can share something of the mental battle which, in many ways, is the toughest part of the journey ahead,\" Muamba wrote in his column for The Times.\"My advice is to take a step back and take all the time he needs because it will definitely affect him mentally, and his family.\"That worry plays in your head, whatever the doctors tell you. It's not easy to get over.\"Muamba said Eriksen's team mates, who shielded him from the crowd and cameras as he received CPR on the field, would also need support.\"They didn't know if their friend was going to survive,\" Muamba added. \"I thought the way the Denmark players surrounded him - to protect him - was amazing to witness.\"\nDenmark players shielding Eriksen from the crowd and cameras as he received CPR on the field. PHOTO: EPA-EFE\nDr Sanjay Sharma of St. George's University of London, Eriksen's cardiologist at former club Tottenham Hotspur, said the Inter Milan playmaker will have to decide if he wants to resume playing but strict federal laws in Italy might stop him.\"In Italy, the laws are very, very strict, and I understand that it would be against the law for him to now play competitive sport in Italy,\" Sharma said.\"Other countries are a little bit more liberal and respect the autonomy of the athlete, so at best he may get a defibrillator put in and be allowed to play in some countries.\"But in most situations like this, it's a career-ending situation.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-eriksens-toughest-battle-on-road-to-recovery-will-be-mental-says-muamba", "Source": "google"}