{"Type": "", "Time": "2021-06-14", "Headline": "Out-of-control shipping costs fire up prices from coffee to toys, Business News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.(BLOOMBERG) - The skyrocketing price of shipping goods across the globe may hit your pocketbook sooner than you think - from that cup of coffee you get each morning to the toys you were thinking of buying your kids.Transporting a 40-foot steel container of cargo by sea from Shanghai to Rotterdam now costs a record US$10,522, a whopping 547 per cent higher than the seasonal average over the last five years, according to Drewry Shipping.With upwards of 80 per cent of all goods trade transported by sea, freight-cost surges are threatening to boost the price of everything from toys, furniture and car parts to coffee, sugar and anchovies, compounding concerns in global markets already bracing for accelerating inflation.\"In 40 years in toy retailing I have never known such challenging conditions from the point of view of pricing,\" Gary Grant, the founder and executive chairman of the UK toy shop The Entertainer, said in a interview. He has had to stop importing giant teddy bears from China because their retail price would have had to double to add in higher freight costs. \"Will this have an impact on retail prices? My answer has to be yes.\"A confluence of factors - soaring demand, a shortage of containers, saturated ports and too few ships and dock workers - have contributed to the squeeze on transportation capacity on every freight path. Recent Covid outbreaks in Asian export hubs like China have made matters worse. The pain is most acutely felt on longer-distance routes, making shipping from Shanghai to Rotterdam 67 per cent more expensive than to the US West Coast, for instance.Often dismissed as having an insignificant impact on inflation because they were a tiny part of the overall expense, rising shipping costs are now forcing some economists to pay them a bit more attention. Although still seen as a relatively minor input, HSBC Holdings estimates that a 205 per cent increase in container shipping costs over the past year could raise euro-area producer prices by as much as 2 per cent.At the retail level, vendors are faced with three choices: halt trade, raise prices or absorb the cost to pass it on later, all of which would effectively mean more expensive goods, said Jordi Espin, strategic relations manager at the European Shippers' Council, a Brussels-based trade group that represents about 100,000 retailers, wholesalers and manufacturers.\"These costs are already being passed to consumers,\" he said.Prices for customers are rising in other ways, too. For instance, anchovies from Peru have largely stopped being imported into Europe because with the higher freight costs they're not competitive relative to what's available locally, Espin said. Also, European olive growers can no longer afford to export to the US, he said.Meanwhile, shipping bottlenecks and costs are hurting the transport of arabica coffee beans, favoured by Starbucks, and robusta beans used to make instant coffee, which are largely sourced from Asia.Few industry observers expect container rates to retreat much any time soon. Lars Jensen, CEO of consultant Vespucci Maritime in Copenhagen, said on a Flexport webinar last week that there's \"zero slack in the system.\"Closely held French shipping company CMA CGM SA, which raked in net income of US$2.1 billion in the first quarter compared with US$48 million in the year-ago period, indicated recently that it expects \"sustained demand for the transportation of consumer goods\" to continue throughout the year.Freight costs are more painful for companies that move clunky, low-value items like toys and furniture. \"If they are bulky products it means you can't get very many in the container and that will have a significant impact on the landed price of the goods,\" said The Entertainer's Grant.For some lower-value furniture makers, freight now makes up about 62 per cent of the retail value, according to Alan Murphy, CEO of consultant Sea-Intelligence in Copenhagen.\"You simply can't survive on this,\" he said. \"Someone is bleeding very hard.\"Companies are desperately trying to work around the higher costs. Some have stopped exporting to certain locations while others are looking for goods or raw materials from nearer locations, according to Philip Damas, founder and operational head of Drewry Supply Chain Advisors.\"The longer these extreme shipping freight rates last, the more companies will take structural measures to shorten their supply chains,\" Damas said. \"Few companies can absorb a 15 per cent increase in total delivered costs for internationally traded products.\" Some firms in Europe are resorting to extreme methods, like using truck convoys to get products including automotive parts, bikes and scooters from China, said Espin at the European Shippers' Council.Central bankers have so far been sanguine about the phenomenon, arguing that the rise in consumer prices tied to supply hiccups won't last. European Central Bank President Christine Lagarde said on June 10 that while supply-chain bottlenecks would push up production prices and the headline inflation rate is expected to rise further in the second half of this year, the effect will fade.Several factors explain the relative lack of concern. Shipping costs only constitute a small fraction of the final price of a manufactured good, with economists at Goldman Sachs Group estimating in March - when China-Europe rates were about half of current levels - that internationally they made up less than 1 per cent.To top that, companies have annual contracts with the container lines, so the prices they've locked in are considerably lower than the headline-grabbing spot rates. Although the latest round of contract negotiations in May reflected the stronger spot market, HSBC trade economist Shanella Rajanayagam said that \"the longer-term rates are much much lower than the spot rates, even if they are feeding through.\"With the end of lockdowns consumer demand is likely to shift to services from goods, but \"the risk of course is that higher shipping costs persist - especially given ongoing shipping disruption - and that producers become more willing to pass these higher costs on to consumers,\" Rajanayagam said.While many economists note that even a full pass-through of higher shipping fares to consumers will have a marginal effect on headline inflation, Volker Wieland, a professor of economics at the Goethe University in Frankfurt and a member of the German government's council of economic advisers, warns that they might not be sufficiently factored in.\"Even if the order of magnitude is smaller than estimated, the dynamic builds over a year and has significant effects,\" he said. \"That means there's a danger we're underestimating the impact.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/out-of-control-shipping-costs-fire-up-prices-from-coffee-to-toys", "Source": "google"}