{"Type": "", "Time": "2021-06-14", "Headline": "Why did Kwang Soo leave Running Man? Episode 559 leaves cast members in tears!", "Text": "\nHITC\n\n\n\n\n\nPhoto by The Chosunilbo JNS/Imazins via Getty ImagesLee Kwang Soo has officially left Running Man after his 11-year stint on the variety program. Health issues were the factor for his resignation. South Korean variety show Running Man is an international favourite, so much that China, Vietnam, the Philippines and Indonesia have created a spin-off of the show. The show sees the cast attempting missions and games to avoid punishment and win prizes such as sets of prime Korean beef (Hanwoo) and a trip to Rome. Now that Kwang Soo is leaving, he won’t be able to bag prizes like these and the last episode left the members in tears as they read their messages to him. His agency confirmed that the actor has chosen to leave since he could no longer comfortably keep up with the physical demands of the show. Kwang Soo sustained an injury in a car accident in 2020 and despite regular physical therapy, his agency states that he “felt that it was difficult to maintain the top physical condition during Running Man filming”.The statement read: We notify that Lee Kwang Soo will be leaving the cast of SBS’s ‘Running Man’ after his final recording on May 24. After becoming involved in his car accident last year, Lee Kwang Soo has received regular physical therapy; despite the continued treatment, there were times when he felt that it was difficult to maintain top physical condition during ‘Running Man’ filmings. As a result, Lee Kwang Soo held lengthy conversations with the production staff, crew, his fellow cast members, as well as the agency, and ultimately arrived at the conclusion that he needed time to recuperate, both physically and mentally.Because it is a program that Lee Kwang Soo called his home for the past 11 years, it was difficult for him to come to this decision. However, it was inevitable when considering his intention to show viewers a better image in the future. We sincerely thank all of the viewers for the love they showed Lee Kwang Soo on ‘Running Man’, and Lee Kwang Soo promises to greet you all again with a bright and healthy image.”The actor and model thanked the cast and the fans once again in an Instagram post: *SPOILERS*As per Kwang Soo’s request, the latest episode began at the location of the first episode. The concept for this show revolved around Kwang Soo’s list of ‘sins and crimes’ that he committed over the 11 years, which the production staff sentenced him to 1050 years in prison.Instead of pitting the cast against each other like usual, the members were to help the actor and model minimise his time behind bars by successfully completing missions. The episode concluded tearfully as the members exchanged letters.Kwang Soo said: In his final letter, Lee Kwang Soo said, “The members helped me get to where I am today. They feel like another family, and I am so, so grateful to them. I’m sorry. I’m sorry again. I wasn’t always great in the past eleven years, but I always did my best. ‘Running Man’ is a show where everyone without exception does their best and throws their whole bodies into filming. I ask that people continue to show it more love and interest in future. Thank you.”At the end, he said to viewers, “I am so happy and thankful for the time we’ve shared.”In other news, Who is Anne Cline? Orange is the New Black's Taryn Manning is engaged!", "Section": "", "Writers": "", "URL": "https://www.hitc.com/en-gb/2021/06/14/why-did-kwang-soo-leave-running-man-episode-559-leaves-cast-members-in-tears/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}