{"Type": "", "Time": "2021-06-14", "Headline": "Rolls-Royce Ghost Extended review: A luxurious experience unlike any other, Lifestyle News - AsiaOne", "Text": "The Rolls-Royce Ghost Extended is a masterpiece of engineering with its impressive power, immense comfort, and innovative technology providing you with a luxurious experience unlike any other.When the original Ghost debuted in 2009, it had a mixed reception. Some argued that it was not a proper Rolls Royce, conceived as the \"baby version\" of the Phantom. However, the model soon attracted a loyal customer base, and has gone on to become Rolls-Royce's most successful model in the marque's 116-year history.Wanting to raise the bar and meet the demands of their customers, this new second generation Ghost was curated with direct feedback from Rolls-Royce's existing customer base. The company spared no expense in engineering a car that is dynamic, extremely comfortable and minimalistic at the same time. What they ended up with, is nothing short of brilliant.The new Ghost Extended is completely hand-built from the ground up, using a new proprietary aluminium spaceframe that gave designers the freedom to create a truly bespoke car.The first thing you'll immediately notice when you approach the car is the sheer size. The new Rolls-Royce Ghost comes in two variants: the standard model comes in at 5.5metres long, while this Extended version stretches that to 5.7metres.To put that into perspective, a regular Toyota Altis is only 4.5metres long, thus making the Ghost feel like an actual yacht on the road.Even though the Ghost Extended is ridiculously long, the new 'post opulent' design theme and sharp bow lines give this car a sleek and modern look.Upfront, the Spirit of Ecstasy sits elegantly on the front bonnet. A showpiece that symbolises speed with silence, the hood ornament is virtually impossible to steal, retracting into the car as soon as it senses that someone is tampering with it.The width of the car has also been increased by 30mm. Combined with the angular headlights, this gives the Ghost Extended an assertive yet beautiful front end.Moving to the sides, a single stroke is used to provide depth to the silhouette of the car. The car sits on big 21-inch wheels, bearing the Rolls-Royce logo that always remains upright while the vehicle is in motion, a feature on all modern Rolls-Royce vehicles.100 kilograms of acoustic damping materials are used throughout the car, and some are even incorporated into the tyres, ensuring the quietest ride possible.The roofline slowly tapers off towards the rear, with squarish tail lights that have been modernised to fit the new design profile.The boot is massive, with a volume of 500 litres. This means that whatever you're carrying, be it golf bags or luggage, can easily fit in the rear.Like the previous generation, the car has rear suicide doors. With power-assisted functionality included, it enables passengers to effortlessly open and closes the doors without needing to use any kind of force.The iconic Rolls-Royce umbrellas are embedded within each rear door. These special umbrellas are coated with Teflon, and when stowed inside the doors, air can be channelled through to dry them, ready for their next use.When designing the new Ghost Extended, Rolls-Royce envisioned a car that was not only predominantly chauffeur-driven, but a vehicle that also enabled its customers to drive with confidence. As such, much of the interior is very driver-centric.Instead of going all out with modern technology like most other manufacturers, the designers chose to integrate technology into their signature traditional designs, resulting in a \"retro-modern\" feel that looks gorgeous.The gauge cluster is one good example, with digital tachometers placed within analogue metal frames. Most of the buttons in the car are physical too, a welcome sight in an industry where most car features are now toggled via touchscreens.Speaking of touchscreens, the Ghost Extended does come with a very responsive centre console touchscreen.An all-new illuminated fascia is also mounted on the passenger side dashboard. Crafted with 152 LEDs and crafted with more than 90,000 laser-etched dots across the surface, it illuminates while the vehicle is in operation, giving out what the Rolls-Royce designers call a \"post opulent\" feel to the cabin.Moving on to the rear, you'll enter a cocoon of lush and very expensive materials. All of the leather in a Rolls-Royce are sourced from cattle raised at high altitudes and are subjected to the automotive industry's most exhaustive quality control checks, ensuring that only the best ends up in the cars.Similar to the illuminated fascia at the front, the roof lining is also fitted with Rolls-Royce's signature Starlight Headliner. Over 1000 individual LEDs are hand-woven into the custom roof liner, and can be toggled to give the cabin the ambience of a beautiful night sky.Upon request, Rolls-Royce can even produce custom star constellations that only appear on your birthday, or shooting stars that cross the cabin at random intervals.The rear legroom is fantastic, thanks to the extra 170mm of length which starts from behind the B-pillars of the Ghost Extended.Once seated, two gigantic screens can be deployed from the front seats, allowing rear passengers to enjoy multimedia entertainment such as movies or even satellite television. The screens also come with HDMI connectivity, allowing passengers to connect things such as laptops or gaming consoles.ALSO READ: Rolls-Royce creates 'most refined picnic facility on Earth'There is one downside to this car; the rear screens are only 720p resolution. In a world where high-definition screens are commonplace, you can notice a slight difference in quality when browsing content. However, I'm sure with the seemingly limitless customisation that Rolls-Royce offers, fitting better screens should be no issue.The most impressive feature of the cabin by far is the sound system. A powerful amplifier controls 18 speakers. Additionally, the design of certain elements of the car, such as the door sills and materials used across the cabin, help to create an enclosed resonance audio chamber. The result? A cabin with near cinema-grade acoustics. It is truly an experience unlike any other.Oh, did I mention that each seat in the cabin also comes with heating and ventilation, as well as massage functionality? Of course, the Ghost Extended has it all.Client feedback asking for near-instant torque led engineers to further develop the Rolls-Royce 6.75-litre twin-turbocharged V12 petrol engine. This new engine profile is unique to the Ghost, delivering 563bhp and a whopping 850Nm/627lb-ft of torque. Maximum torque is available from just 1600RPM.This enables the car to accelerate from 0-100km/h in just 4.8 seconds, a massive feat considering the Ghost Extended weighs over 2.5tonnes. Why someone would want to do that in a Rolls-Royce is beyond me, but the car is able to do it if you so wish.The satellite-aided 8-speed automatic transmission pre-selects gears based on the behaviour of the driver and its location geographically, ensuring the smoothest ride possible in any condition. Power is delivered effortlessly to all four wheels, with the Ghost now being offered with all-wheel drive as well as all-wheel steering.Our resident host Jackie had the esteemed opportunity to test drive the new Ghost Extended. In his words, he summed up the car as \"driving a cloud with wheels\". It has an extremely refined drive, and nothing else comes close. Even though the steering is light, there is still good road feedback while driving.The two things that surprised him the most were the power delivery and handling. The Ghost Extended looks gentle, until he puts his foot down. Obviously, the acceleration is not as brutal as traditional sports cars, but the power does come quickly, and he could overtake other vehicles on the road with ease.In a car that is as heavy as the Ghost Extended, it truly is amazing.Handling on the other hand is where the car really shines. The Ghost Extended now comes with what Rolls-Royce dubs the Planar Suspension System. This extensive suspension assembly works alongside the Flagbearer system, which uses cameras to read the road conditions ahead and prepares the suspension system for any changes.All of these features enable the car to handle corners with ease. The team expected the car to have lots of body roll, but it was civilised through the corners. It grips well to the road, and the suspension system ironed out virtually everything that crossed the Ghost's path.The Rolls-Royce Ghost Extended, the ultimate gentlemen's entourage. Of course, with such insane features, this car has to have a ridiculous price tag. Starting at $1.2 million for the regular Ghost and $1.5 million for the Extended variant, it's not a sum most people can pull out of their left pocket at any time.Plus, with the limitless number of options available for each Rolls-Royce, you'll start to see the price skyrocket. This example that we tested is on sale for a cool $1.95 million, and even Rolls-Royce claims this is still a \"base model\".However, if you're a person that spares no expense when it comes to the finer things in life, and you are able to glance past (and afford) the hefty price tag, then this car is a definite must-have.ALSO READ: Rolls-Royce creates its latest Phantom Collection of 25 super-luxury carsYou won't get the same stares as other individuals who prance around in flashy Ferraris or Lamborghinis. However, those that do stare, know that you're a king.Price:From S$1,418,888**Performance:Engine: 6750cc, Twin-Turbocharged V12, PetrolPower: 563bhp @ 5000rpmTorque: 850Nm/627lb-ft @ 1600rpmFuel Consumption:0-100km/h: 4.8 secondsTop Speed: 250km/hDrivetrain: 8-speed Automatic, All-wheel driveBrakes: Disc BrakesMeasurements:Wheelbase: 5,716mmDimensions (LxWxH): 5,716mm x 2,148mm x 1,571mmFuel Tank Capacity:Boot Capacity: 500 litresWeight: 2,530kgFeatures:Front & Rear Massage seatsExtended Leather HeadlinerIlluminated FasciaShooting Star HeadlinerRolls Royce Bespoke AudioEffortless DoorsHead-Up DisplayActive Cruise ControlPark AssistantHigh-Beam AssistanceApple Carplay(Features are subject to bespoke customisation)This article was first published in Motorist.", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/lifestyle/rolls-royce-ghost-extended-review-luxurious-experience-unlike-any-other", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}