{"Type": "", "Time": "2021-06-14", "Headline": "P1 to 3 pupils to do one week HBL when school reopens as MOE gradually allows students back to school, Parenting & Education News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Primary 1 to 3 pupils will continue with a week of home-based learning from June 28 when Term 3 begins, said the Ministry of Education (MOE) on Monday (June 14).This is part of a move to progressively allow students back to school after the June holidays to keep students and staff safe.Secondary 1 and 2 students will be on home-based learning till June 30, and return to school on July 1 (Thursday).Only Primary 4 to 6 pupils, Secondary 3 to 5 students and all junior college and Millennia Institute students will return to school on June 28, when the new term begins.All students will be back in school from July 6. July 5, a Monday, is a school holiday.MOE said for centre-based classes such as third language or art and music elective programmes, graduating students will resume in-person lessons from the first week of Term 3, while non-graduating students will continue with home-based learning.Centre-based classes will resume in-person for all students from the second week of Term 3.MOE also said that institutes of higher learning will also progressively allow students back on campus.From June 21, small-group classes or consultations that were previously conducted online can resume on campus.Students will continue to return for essential in-person sessions such as labs and practicals. In-person examinations will also continue to be held with no more than 50 persons per venue.All in-person classes and other activities on campus are subject to strict safe management measures.Classes and lectures with more than 50 persons will continue to be held online, said MOE.For those who require care arrangements for their young children, MOE Kindergartens and school-based Student Care Centres will resume fully from June 28.Special education school students will also have a staggered return to school from June 28 onwards, based on their needs. All students will be back in school from July 6.MOE also said that it plans to gradually resume in-person co-curricular activities from the second week of Term 3, beginning with low-risk activities.Given the need to minimise intermingling of students from different schools, in line with the gradual resumption of student activities, the National School Games for Junior and C Divisions as well as the remaining games for A Division will be cancelled, it said.All tuition and enrichment classes for individuals 18 years old and below can also resume in-person lessons from June 21. Get the ST Smart Parenting newsletter for expert advice. Visit the microsite for more.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/parenting-education/p1-to-p3-pupils-to-continue-with-one-week-hbl-in-term-3-as-moe", "Source": "google"}