{"Type": "Singapore", "Time": "2021-06-14", "Headline": "Singapore marine life enthusiasts ‘horrified’ over beach goers digging up sea creatures", "Text": "SINGAPORE: A Facebook post about the treatment of marine creatures by Changi Beach visitors recently has got wildlife enthusiasts riled up.The post was shared in the Singapore Wildlife Sightings Facebook group by one of its members, Ms Daphne Ting, who witnessed the happenings at Changi Beach on Sunday (Jun 13) morning while she was on an intertidal walk.An intertidal walk is one that traverses the coastal area at the edge of land and sea that is submerged at high tide, but dry and exposed to air during low tide.In the post, Ms Ting noted groups of beach goers, armed with shovels, tongs and pails, were digging up holes, “searching for these marine creatures and wrecking the entire shore”.Among the creatures they collected were crabs, fish, shells, sea cucumbers, eels, jellyfish and sea anemone, Ms Ting said in her post.“There were other beach goers who were very angry at this too. But even after telling these people not to collect the marine life, they just walked away and continued collecting more,” the 28-year-old wrote.Speaking to CNA over the phone, Ms Ting added that she'd shared her post hoping someone would shed light on what can be done, as this was the first time she'd seen people collecting marine creatures \"on a mass scale\".\"When my boyfriend and I saw them collecting the creatures in the pail, we saw the way they handled the tongs. They'd pick up soft creatures in a very rough manner. If you were there, you'd also feel horrified at the way they handled the creatures,\" she told CNA.WHY THE UPROARSuch a sight is, unfortunately, common, according to marine biodiversity enthusiasts who spoke to CNA.“It’s not that people aren’t aware of these creatures, but they’re unaware of how the creatures behave. They don’t know that putting them into buckets with other creatures can cause stress or harm to them. If you’re going to stuff them into a pail, the oxygen level depletes rapidly and might cause them to die,” said Dennis Chan, 27.The founder of The Untamed Paths, an organisation that attempts to raise awareness of unconventional biodiversity in Singapore, said that \"putting these creatures in buckets also increases the temperature of water, causing more distress\".Some marine creatures that suffer in this way include starfish and anemone.“Starfish will detach their arms when stressed; anemones will die when forcefully uprooted and taken out of the water. Like most marine life, starfish are also stressed by natural elements like the influx of freshwater or rain. They become pale and die off slowly. So imagine human impact on these delicate creatures,” said Mr Jianlin Liu, who has been going on intertidal walks at least thrice a month for nine years.“Prying soft invertebrates like marine flatworms and nudibranchs off rocks can also severely hurt or kill the animal.”The 31-year-old, who has flown to Bali twice a year for the last five years to do intertidal surveys, reasoned that such behaviour usually stems from a “lack of education”, an “others do, so I follow” mentality and being able to see the creatures clearer in the pail.“But other reasons include to harvest and consume marine life, sell the animals for money to aquariums or to collect for one’s personal aquarium,” he added.Aside from harming the creatures, Mr Liu added that the behaviour mentioned in the Facebook post also destroys the habitat.“No matter how gentle we are on the shores, there will be some impact. With the huge crowd, a lot of marine life residing, breeding and feeding in the sand or seagrass will be killed due to excessive trampling,” he said.Mr Liu added that wearing inappropriate attire, like being barefoot or walking in slippers, during intertidal walks might also harm the individual, as many marine life “defend themselves with venom that can be fatal to humans”.“While our shores are beautiful, there are known dangers around. We have past incidents of Singaporeans stepping on the venomous stonefish and the pain is extreme,” he said.WHAT CAN BE DONEEven though collecting marine creatures during intertidal walks is harmful, it seems that regulation around marine biodiversity has many “grey areas”, said Ms Ting.\"But just because it might be legal doesn't mean it's ethical,\" she said.As such, whenever Mr Chan and his team at The Untamed Paths guide participants during intertidal walks for 10 to 15 days a month, he cannot tell beach goers who pick up marine creatures that their actions are against the law.“Instead what we can do is show people how they can experience an intertidal zone and show respect to the creatures they encounter,” he said.“When you go to nature reserves, you aren’t going to catch a frog. That rule should apply here too.”Mr Chan’s advice to people who wish to go on intertidal walks is to leave their pails and tongs at home.“Just go to these zones and experience it with your phone or camera. But leave those other items at home so you’re not encouraged to pick things up. There’s no need to,” he said.CNA contacted the National Parks Board (NParks) for a statement.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "marine life,intertidal walks,wildlife", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/changi-beach-goers-digging-up-sea-creatures-horrified-15011376", "Source": "google"}