{"Type": "", "Time": "2021-06-14", "Headline": "Chris Hemsworth trolls birthday boy Chris Evans by posting photo with Chris Pratt, Entertainment News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.LOS ANGELES - Actor Chris Hemsworth wished Avengers co-star Chris Evans, who turned 40 on Sunday (June 13), a happy birthday on Instagram.\"Happy 40th birthday, Chris Evans, you'll always be number 1 in my book,\" he wrote to the actor who played Captain America in the Marvel movies.However, the photo he posted was of himself and a different Chris - actor Chris Pratt.The photo appeared to have been taken on the set of the recently wrapped Marvel movie Thor: Love And Thunder, in which both Hemsworth, 37, and Pratt, 41, are reprising their roles as Thor and Star-Lord respectively.Fans lapped up the joke in the comments section, with one saying: \"Man. Chris has changed over the years.\"Others brought up yet another famous Chris, saying: \"Come on…. That's obviously Chris Pine.\"Not a part of the Marvel Cinematic Universe, Pine, 40, has appeared in two Wonder Woman films, which are based on the rival DC Comics.Another commenter then added to the confusion by referring to Hemsworth's actor brother with: \"Good one, Liam.\"The birthday boy Chris has yet to respond.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/life/entertainment/chris-hemsworth-trolls-birthday-boy-chris-evans-by-posting-photo-with-chris-pratt", "Source": "google"}