{"Type": "", "Time": "2021-06-14", "Headline": "Unelected fanatics in EU showing how much they loathe citizens who give them power COMMENT | Express Comment | Comment | Express.co.uk", "Text": "When you subscribe we will use the information you provide to send you these newsletters. Sometimes they'll include recommendations for other related newsletters or services we offer. Our Privacy Notice explains more about how we use your data, and your rights. You can unsubscribe at any time.EU vice-president Maros Sefcovic asserts that the Northern Ireland Protocol obliges us to begin imposing restrictions and disruptive checks on sausages and other chilled meats entering Northern Ireland at the end of this month. His demand that we “respect the rule of law” on the Northern Ireland Protocol misses the point. The rule of law means being true to your constitution and your laws. It means respecting your courts and their judgments. Above all, it means remembering that, in a democracy like ours, all power comes from the people. This principle is enshrined in the Magna Carta.Our duty is to follow our constitution, and to listen to, and to act upon, the wishes of our people. And what do those people say?My constituents in Wakefield think it is bonkers that food produced in the UK cannot be sold in Northern Ireland, which is as much a part of the UK as our town is.Nor do I think that ordinary people, whether in the UK or the EU, have any time for politicians or bureaucrats unable to show enough flexibility or goodwill to resolve this issue amicably.Ordinary citizens in the UK and the EU don’t obsess about the Northern Ireland protocol.They want the politicians and bureaucrats to get off their high horses and cut a deal.They cannot understand why an English, Scottish or Welsh sausage that has been happily munched in Northern Ireland for decades suddenly requires intrusive checks which frustrate consumer choice and impose excessive costs.The EU’s bureaucratic obsession with creating pointless barriers between England, Scotland and Wales trading freely with Northern Ireland has done little except increase the risk of a long-buried conflict erupting again.  Humankind is planning trips to Mars! Is the EU really telling the world that organising the supply of food between two parts of the same country without unnecessary delay is beyond it?The Protocol itself is hardly sacrosanct anyway. Brussels agreed to delay implementing the border checks in the original Withdrawal Agreement. There is no reason why our decision to extend the delay should prove problematic. If implementing the Protocol will cause unintended hardship for ordinary people and impede business, why not simply change it?I have no doubt that the people of the United States, our most stalwart ally, will support our cause.The British and American people are bonded by a common civilisation predicated on democracy, freedom and fairness.Joe Biden, speaking at RAF Mildenhall last week, was clear-sighted in setting out his priorities: “Democracies of the world are standing together to tackle the toughest challenges and the issues that matter most to our future.” He had in mind things long dead stirring in Russia, Ukraine, and the Baltic states, and fears of new conflicts in China and the Far East.Yet the EU is choosing to focus on fighting irrelevant battles with its friends such as the UK and Switzerland with whom the EU shares so much. That is bureaucratic blindness at its worst.   To build barriers does not make the EU stronger. It does not improve choice or increase wealth for EU citizens. It will merely irritate people, and make the EU an irrelevant laughing stock.I congratulate the Prime Minister on concluding the new Atlantic Charter with President Biden. Just like Churchill and Roosevelt before them, the two leaders have pledged to work together to tackle the greatest challenges of our time, including defending democracy, reaffirming collective security, and building a fair global trading system.The free world needs a strong and engaged United States. I celebrate the fact the American President has picked up the mantle of leadership. I am confident he knows that in defending democracy, he is compelled to support the wishes of a sovereign state against unelected bureaucrats.It is my hope that our two nations set an example to Brussels and the world by concluding an expansive, comprehensive free- trade deal.By acting together, the United Kingdom and the United States can forge a better future. It is time for us to lead the world guided by our citizen-centric democracy.In contrast, by holding us to a fanatical interpretation of the Northern Ireland Protocol, Brussels achieves nothing. It merely displays its own citizen-loathing half-baked protectionist ideology.By Imran Ahmad Khan MP (@imranahmadkhan)  See today's front and back pages, download the newspaper, order back issues and use the historic Daily Express newspaper archive.", "Section": "", "Writers": "", "URL": "https://www.express.co.uk/comment/expresscomment/1449159/g7-summit-boris-johnson-trade-deal-joe-biden-comment", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}