{"Type": "", "Time": "2021-06-14", "Headline": "White House Says G7 Rally Around Need To \"Counter And Compete\" With China", "Text": "Joe Biden walks with Jake Sullivan as he arrives for the final session of the G7 summit.White House national security adviser Jake Sullivan said on Sunday G7 leaders rallied around the need to \"counter and compete\" with China on challenges ranging from safeguarding democracy to the technology race.On China, the G7 meeting was \"a significant move forward from where the G7 has ever been before and reflects a growing convergence that wasn't there a few years ago,\" Sullivan said aboard Air Force One on its way to Brussels.\"There is a broad view that China represents a significant challenge to the world's democracies,\" Sullivan said, adding that leaders agreed the need for a common agenda in addressing China, including elements where they would \"stand up and counter and compete.\"\"Words like counter and compete were words coming out of the mouths of every leader in the room, not just Joe Biden,\" he said.The Group of Seven rich nations pledged on Sunday to tackle China's growing influence, singling out China in their communique over human rights in Xinjiang and demanding freedoms and a high degree of autonomy for Hong Kong.Asked to comment on China's remarks about the G7 summit that days were over when \"a small group of countries\" decided the fate of the world, Sullivan said:\"That is sad. If their claim is that all of the other world's largest economies count as small countries, then they have a massive problem of perspective.\"G7 leaders also sought to counter China's growing influence by offering developing countries an infrastructure plan that could rival Beijing's Belt and Road Initiative by supporting projects such as railways in Africa and wind farms in Asia.Beijing has repeatedly hit back against what it perceives as attempts by Western powers to contain China. It says many major powers are still gripped by an outdated imperial mindset after years of humiliating China.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)Track Latest News Live on NDTV.com and get news updates from India and around the world. Watch Live News:Follow Us:................................ Advertisement ................................", "Section": "", "Writers": "", "URL": "https://www.ndtv.com/world-news/white-house-says-g7-rally-around-need-to-counter-and-compete-with-china-2463149", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}