{"Type": "", "Time": "2021-06-14", "Headline": "G-7 commits to one billion extra Covid-19 vaccine doses , Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.CARBIS BAY, ENGLAND (REUTERS, BLOOMBERG) - The Group of Seven (G-7) nations confirmed a promise to deliver at least one billion extra doses of Covid-19 vaccines over the next year, even as they laid out plans to tackle any future pandemic.The vaccine pledge was the most dramatic element of the bloc’s effort to work together to bring an end to the Covid-19 pandemic spelled out in a joint communique issued at the end of the three-day summit. But the grouping also cast an eye to the future.It pledged, among other things, to increase early warning systems and to shorten the cycle for the development of safe and effective vaccines from 300 days to 100.United States President Joe Biden said the summit had rallied the world’s democracies to deliver on the challenges of the age.“America is back at the table and fully engaged,” he told reporters after the summit in south-west England, adding that the North Atlantic Treaty Organisation’s mutual defence was a “sacred obligation” and that democracies were in a “contest with autocracies”.On a busy final day, the group of leading economies also agreed to raise contributions to meet an overdue spending pledge of US$100 billion (S$133 billion) a year by rich countries to help poorer ones cut carbon emissions and cope with global warming, but campaigners said firm cash promises were missing. The leaders had strong words for China and Russia. The G-7 condemned Russia for “destabilising behaviour”, and called on Moscow to pursue hackers carrying out ransomware attacks from its soil. “We reaffirm our call on Russia to stop its destabilising behaviour and malign activities, including its interference in other countries’ democratic systems, and to fulfil its international human rights obligations and commitments,” the leaders said. The G-7 cited China explicitly on human rights issues in Xinjiang and Hong Kong, but omitted any mention of Beijing in the section on forced labour practices.  The G-7 called “on China to respect human rights and fundamental freedoms, especially in relation to Xinjiang, and those rights, freedoms and high degree of autonomy for Hong Kong enshrined in the Sino-British Joint Declaration and the Basic Law”.Still, the coronavirus was clearly the priority during the summit. The communique said: “Total G-7 commitments since the start of the pandemic provide for a total of over two billion vaccine doses, with the commitments since we last met in February 2021, including here in Carbis Bay, providing for one billion doses over the next year.”Many of the doses will flow through Covax, a global vaccine-buying system backed by the World Health Organisation and Gavi, the vaccine alliance. Experts said the plan is a boost to Covax, which has so far distributed only 83 million shots worldwide. Covax has struggled to secure deliveries as wealthy nations reserve enough shots to vaccinate their populations several times over. “It’s going to rescue Covax from its pretty dire predicament right now, so it’s a very significant step,” said Mr Stephen Morrison, director of the Global Health Policy Centre at the Centre for Strategic and International Studies, a think-tank.At the same time, some experts said the commitment falls far short of the five billion to six billion doses needed by poorer nations.The figure of more than two billion doses includes a much wider array of contributions already offered, as well future exports, according to a European official. So far, the G-7 countries have promised only as many as 700 million truly new doses, funded in part by previously announced aid. If doses already announced in recent weeks by G-7 and EU nations are included, the tally grows to 870 million doses, as the communique notes. To reach the 1 billion figure, G-7 officials included pledges made starting back in February.The biggest batches come from countries that had cornered the market early on for domestic use. The US and Britain account for nearly all the new pledges – after they steered hundreds of millions of doses produced on their soil for their own citizens, while restricting exports for months.The pledges come as the bloc grapples with another question – whether and how to lift intellectual-property rights protections for the vaccines. Biden threw his weight behind that idea but it has languished after German Chancellor Angela Merkel opposed it. The communique pledged only to “support manufacturing in low-income countries,” but didn’t say specifically how.It noted the “importance of intellectual property” and the “positive impact” of voluntary licensing – both clauses that reflect the view of countries opposed to a waiver.“We will explore all options to ensure affordable and accessible Covid-19 tools for the poorest countries,” it said.Despite some lingering resentment, the new doses pledged at the summit are a welcome sign to nations without domestic vaccine production that have been desperately awaiting shots. The new and existing pledges include:- 500 million Pfizer doses pledged by the US, for delivery beginning in August and through 2022, on top of 80 million Biden previously announced;- 100 million doses pledged by Britain from a mix of manufacturers;- As many as 100 million doses pledged by Canada at the summit; and- 100 million doses pledged by the EU at a meeting last month, including 75 million from Germany, France and Italy – the EU’s G-7 members.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/g-7-provides-1-billion-covid-19-vaccine-doses-will-work-to-give-more-communique", "Source": "google"}