{"Type": "", "Time": "2021-06-14", "Headline": "Heart inflammation after Covid-19 jab rare, link to mRNA vaccines still unknown: Experts, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Heart conditions associated with the Covid-19 mRNA vaccine are extremely rare, and it remains unclear if the vaccines are responsible for them, experts told The Straits Times after a handful of cases raised some concerns.Six individuals here were reported to have suffered myocarditis (inflammation of the heart muscle) and pericarditis (inflammation of the lining outside the heart) after getting an mRNA vaccine, among whom four are young men less than 30 years old. The other two are a man and a woman both aged above 40.The Health Sciences Authority (HSA) said most of the cases had occurred within a few days after receiving the second dose of the vaccine, and that all have recovered or been discharged well from hospital.The United States and Israel - two major users of the mRNA vaccines - have also reported a slightly increased risk of myocarditis and pericarditis in young men after the second dose of mRNA vaccination.But there is no need to be overly concerned as these events are rare, experts said.Professor Ooi Eng Eong, an expert on emerging infectious diseases at Duke-NUS Medical School, said it also remains unclear if it is indeed mRNA vaccines causing these adverse events and how vaccination could have resulted in them.As at June 7, more than 1,888,000 people in Singapore have received both doses of mRNA vaccines by either Pfizer BioNTech or Moderna.An article on Friday (June 11) by the American Academy of Paediatrics cited a rate of 16 cases of myocarditis/pericarditis per million second doses in people aged 16 to 39 years old.Such inflammation of the heart was also reported in some Covid-19 patients last year, most likely the result of an overactive immune system giving rise to the inflammation.Vaccine maker Moderna issued a statement on Friday stating that it is aware of reports of such cases after people took its vaccine, but added that it has not established a causal association with its vaccine after carefully reviewing the available safety data to date.As mRNA vaccines lead to a similar, but milder, immune response, they could also give rise to inflammation, said Prof Ooi.\"But these cases, if indeed caused by the vaccine, will be much fewer compared with Covid-19-induced heart inflammation ones.\"It is also important to note that the occurrence of some rare events is natural for any vaccine, especially when large numbers have been vaccinated, he stressed.\"No other vaccine has come under the scrutiny as Covid-19 vaccines. In about six months, over 1.5 billion people have been vaccinated under close observation,\" he added.He said it is unclear why young men may be more susceptible, and that it is difficult to conduct the necessary studies to determine a correlation.\"Nonetheless, we can expect more detailed description of what happens to these cases in the coming months, from those that have been treated in the US and Israel. The picture may become clearer then.\"Some 1.5 million cases of myocarditis are reported worldwide a year, with population prevalence varying widely, said cardiologist Chuang Hsuan-Hung, who practises at the Asian Heart & Vascular Centre.Myocarditis is triggered by various factors and is not a distinct cardiovascular disease.Its exact prevalence in Singapore is not known.The HSA said that in general, five to seven individuals per 100,000 people a year are hospitalised for myocarditis or pericarditis.Worldwide, viral infections are the most frequent cause of myocarditis. Other causes include drugs, autoimmune diseases and other kinds of infections, including by bacteria and parasites.Although inflammation of the heart can affect all age groups, myocarditis and pericarditis do occur more often in young adults, and pericarditis more commonly affects middle-aged adults, Dr Chuang added.Dr Chuang said that enforced rest was crucial when one is recovering.Dr Mak Koon-Hou, a cardiologist at Gleneagles Medical Centre, said young adults are more prone to these conditions as they are more likely to mount a greater inflammatory response.Exercising increases the risk of myocarditis. When a person exercises, the demand on the heart increases. If the heart muscle is already inflamed, strenuous physical activity may worsen the amount of damage to the heart muscle, adversely affecting its function, Dr Mak said.\"It may result in abnormal heart rhythm and become potentially lethal.\"In general, activities such as jogging, skipping, aerobic dancing, hiking - especially with a load - and cycling at least 16kmh are considered strenuous activities.It is important to note how one feels and check with the doctor regarding the most suitable type and intensity of exercise, Dr Mak said.\"If a person feels tired, breathless, discomfort in the chest, palpitations and giddiness, it is best to stop or reduce the intensity. Heart rates are easily measured nowadays with phones and oximeters.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/heart-inflammation-after-covid-19-vaccination-rare-link-to-mrna-vaccine-still-unknown", "Source": "google"}