{"Type": "", "Time": "2021-06-14", "Headline": "KL, Putrajaya expect to reach herd immunity by August as Malaysia begins drafting Covid-19 exit plan, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.KUALA LUMPUR - Malaysia's federal territories of Kuala Lumpur and Putrajaya are expected to reach herd immunity by August - earlier than planned - as the government said more people were able to receive their jabs with the opening of more vaccination centres (PPV).As of July 11, the country has vaccinated more than 13 per cent or 4,227,554 of its 32 million population with at least one dose, Health Minister Adham Baba said, adding that more than half of the adults in the country have registered for the immunisation programme. Selangor recorded the highest number of people who completed both doses at 170,855 people, followed by Sarawak (133,516), Kuala Lumpur (122,564), Perak (121,740) and Johor (118,317).There were no figures on how many people have been vaccinated in Putrajaya, Malaysia's administrative capital located about an hour's drive south of Kuala Lumpur. The federal territory of KL has 1.8 million people and Putrajaya 92,000, according to government estimates.As the country gradually emerges from the pandemic, the government has begun working on a National Recovery Plan, which will outline its strategy and the phased easing of restrictions, Prime Minister Muhyiddin Yassin was quoted by Bernama news agency as saying on Sunday (June 13).The plan, he said, will take into account current statistics and existing policies on containment measures, the economy and vaccination progress and it will be presented to the National Security Council within the next week.\"Some of the key ministers involved have already sat down with me to present the draft. Basically good, but not yet refined.\"It is time we want to set an exit strategy or National Recovery Plan for us to get out of this problem, but this is a big challenge depending on the cooperation and support of all parties,\" he said, as quoted by Bernama.Mr Muhyiddin said the plan could help hospitals manage their capacity.\"We have to help the Ministry of Health manage (its) healthcare (capacity) to ensure that our healthcare system does not collapse ... there must be enough hospitals, bed facilities, ventilators and hospital staff,\" he said.Dr Adham had said in June that Malaysia would be able to inoculate 80 per cent of its population and reach herd immunity by December.Mr Muhyiddin was speaking to reporters after visiting a mobile vaccine truck at a low cost housing project in Kuala Lumpur.The mobile vaccination programme is a continuation of a pilot project that took off on June 7 at another low-cost housing estate in the capital city. The elderly and people with disabilities are given priority in the programme, which was introduced in June with an aim to inoculate 80 per cent of residents in the federal territories by the end of August. Mr Muhyiddin said the government will increase the number of mobile vaccine trucks in the federal territories.Separately, Senior Minister Ismail Sabri Yaakob on Sunday said the government could relax the current lockdown restrictions if daily Covid-19 cases fall below 4,000 but it would subject to the health ministry advice.\"This does not mean the end of restrictions but perhaps reviewing the rules which can be relaxed a bit and so on. This is because the impact will only be visible after 14 days because that is the incubation period of the virus,\" Datuk Seri Ismail Sabri was quoted by The Star newspaper as saying.\"We pray after 14 days the cases go down; we can review the SOP (standard operating procedure) which we think may be a little strict, but I cannot promise because it depends on the advice from the Health Ministry. \"He was speaking after visiting the army field hospital at Sultanah Aminah Hospital in Johor Bahru.He also acknowledged the existence of a National Recovery Plan, saying that it will be discussed at a special meeting in due course though herd immunity remains a priority.Malaysia reported 5,304 new infections on Sunday with 64 new deaths, bringing the cumulative caseload to 657,508 with 3,908 total deaths, according to the health ministry.Selangor recorded the highest number of cases at 1,973, followed by Sarawak (544) and Kuala Lumpur (462).Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/kl-putrajaya-expect-to-reach-herd-immunity-by-august-as-malaysia-begins-drafting-covid", "Source": "google"}