{"Type": "", "Time": "2021-06-14", "Headline": "Jamahal Hill releases statement on horrific armbar injury at UFC 263 - MMAmania.com", "Text": "Filed under:Despite the involvement of an ‘Arizona Mazzagatti,’ Hill’s arm was not broken during an intense armbar submission delivered by Paul Craig.UFC 263 was a long event — the longest event in terms of actual fight time in UFC history at a whopping 3 hours 19 minutes and 32 seconds. One fight that did not last long and contribute to that monster tally was Paul Craig vs. Jamahal Hill, which ended in just 119 seconds. The two came in with bad blood and when Craig got Hill down to the canvas into an armbar position, he didn’t hesitate to crank that sucker as hard as he could.This bent Hill’s arm backwards and normally would have ended the fight, but regional ref Al Guinee let things continue. Paul mangled Jamahal’s arm thoroughly to the point where it was flopping around like a dead fish as Craig mercilessly punched Hill in the head repeatedly.Well, good news regarding Hill’s arm: somehow it wasn’t broken.“And if you can believe this one, because I can’t f—king believe it,” UFC president Dana White reported at the UFC 263 post-fight press conference. “Jamal Hill’s arm was not broken. It was dislocated. They popped it back in and he has full range of motion and the guy’s okay. That’s nuts.”STOP THE FUCKING FIGHT WTF!!!! HE BROKE HIS FUCKING ARM AND KEPT FIGHTING BACK WTF #UFC263 respect to hill and Paul Craig holy pic.twitter.com/oNH0eG8nGAICYMI: Jamahal Hill had his elbow dislocated against Paul Craig...  #UFC263 #MMATwitter pic.twitter.com/YEsRT7rSGZAs for the referee Guinee, White was not impressed.“If you don’t know a guy’s arm is broken ... it looked broken,” White said. “When an arm is flopping around like this and going both ways, you should probably stop the fight. Listen, Arizona has been very good to us, I don’t want to shit on Arizona after they’ve been so good to us. But that’s a rough one. The guy’s ... I head he’s a local ref, I heard this guy’s a jiujitsu black belt.”“If you go to a local fight and see him reffing, you know something’s going to happen,” one of the assembled press corps said.“Oh, he’s the Arizona Mazzagatti?” White replied. “It makes sense then.”There’s no hard feeling from Hill, towards Craig or Guinee.I'm ok!!! To the ppl that support me I love u all!! @PCraigmma thank u for the lesson I will be back and stronger because of it!!! This is part of the game an I will accept it and keep moving forward!!!The ref doesn't suck I wasn't tapping i was trying to stack but my arm wasn't there lol I tried to knock him out quick but he just was the better fighter tonight!!! I've been dominate for 12 years tonight was my turn to lose!!!!A post shared by Big Gangsta SD (@sweet_dreams_jhill)Here’s hoping the Arizona athletic commission rethinks this guy’s participation in future events, especially if he’s built up a reputation as an unsafe ref amongst the local scene. This is where you as the A/C have to take responsibility. Did you put the very best person in that cage with the fighters? You like your local guy who does all your local events, but when your referee stands by unaware that a man’s arm has been dislocated, we have serious issues https://t.co/Skr9IObYU5Not holding our breath, obviously. Commissions never seem to hesitate on circling the wagons around the most inept of refs and judges. But this was a pretty outrageously bad non-stoppage, so we can hope?", "Section": "", "Writers": "", "URL": "https://www.mmamania.com/ufc-263-results-live-stream-fight-card-start-time-date-location-odds-highlights-adesanya-vettori-2-espn-ppv-mma/2021/6/13/22532580/jamahal-hill-releases-statement-on-horrific-armbar-injury-at-ufc-263", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}