{"Type": "", "Time": "2021-06-14", "Headline": "AsiaOne announces new Chief Executive Officer, Business News - AsiaOne", "Text": "[Singapore, June 14, 2021] AsiaOne Online (AsiaOne) is pleased to announce the appointment of Mr Sean Ler 吕治卫 as CEO of the digital news site, effective June 16, 2021. Mr Ler takes over from interim CEO of AsiaOne and Group CEO for mm2 Asia Mr Chang Long Jong. Mr Chang will remain as the Group CEO for mm2 Asia and on the board of directors of AsiaOne. Mr Ler is a proven executive with more than 18 years of experience in business operations and strategy. He joined AsiaOne's parent company, mm2 Asia in May this year as Head of Group Digital Strategy. Prior to his joining mm2, he served as the Head of Programmes and Partnerships at Temasek Foundation in which he spearheaded their Covid-19 community projects, such as the distributions of masks and hand sanitiser. Mr Ler has also held various roles in the Singapore Navy, the Prime Minister's Office, and the Ministry of Home Affairs Singapore. Mr Ler will be overseeing AsiaOne's strategy to grow audiences both locally, and in the region. \"AsiaOne is an established digital brand strategically positioned as 'Off Centre, On Trend'. We will continue to deliver relevant and high-quality content while increasing our offerings. Audiences can look forward to more diverse content from the region, including those in Chinese,\" says Mr Ler. Mr Chan Cheow-Pong, Head of Media Strategy at SPH and board director of AsiaOne says, \"We are delighted to welcome Sean as the new CEO of AsiaOne. Sean's strong leadership qualities will help chart a new course for AsiaOne towards excellence in digital media. With his background in digital outreach and community building, he will further strengthen AsiaOne and its brand in the exciting era ahead.\" Mr Chang Long Jong, Group CEO for mm2 Asia says, \"The Board would like to express its thanks and appreciation to Mr Ler for accepting the role at AsiaOne. His significant public and private sector experience will be invaluable as we continue to expand and grow in Asia. We look forward to his leadership in steering AsiaOne to its future milestones of success.\"AsiaOne was founded in 1995 by Singapore Press Holdings (SPH) and is one of Singapore's earliest digital media sites with a focus on social news and trending topics in Singapore, Malaysia and the region. mm2 Asia acquired 51 per cent equity interest in 2018, and AsiaOne is now operated as a joint venture between mm2 Asia and SPH Invest, a wholly-owned subsidiary of SPH. Presently the site is the third most-read news site in Singapore, serving over 5 million unique users monthly.About AsiaOne (www.asiaone.com)At AsiaOne, we deliver the latest trending news on entertainment, lifestyle, digital culture, and money to our readers from across the region. Founded over 25 years ago in Singapore, AsiaOne is one of Asia's top pure-play digital content sites that gives readers a fresh perspective of what's happening, packaged in a relatable way that matters.Our readers have access to daily articles that are on-trend reporting which has a unique, fun and quirky perspective on the day's happenings. We are focused on informing and inspiring our readers with positivity and trustworthiness.In 2020, we refreshed our logo to a zesty orange colour, representing the boldness and vocality we are committed to in bringing our readers stories with a unique \"On trend, off centre\" spin. The digital platform is a joint venture between mm2 Asia and SPH Invest, a wholly-owned subsidiary of SPH.Follow AsiaOne on social media:\r\nFacebook: @asiaonecom / facebook.com/asiaonecom\r\nTwitter: @asiaonecom / twitter.com/asiaonecom\r\nInstagram: @asiaonecom / instagram.com/asiaonecom\r\nYouTube: youtube.com/asiaone\r\nTelegram: @asiaonecom / t.me/AsiaOnecom \r\nTikTok: @asiaone / tiktok.com/@asiaone\r\nLinkedIn: @asiaonecom / linkedin.com/company/asiaonecomeditor@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/business/asiaone-announces-new-chief-executive-officer", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}