{"Type": "", "Time": "2021-06-14", "Headline": "Malaysian Born Journalist Awarded 2021 Pulitzer Prize For Explanatory Reporting | TRP", "Text": "This was not an overnight success story. It took him over a year.Subscribe to our Telegram channel for the latest stories and updates.He anticipated the course of the coronavirus pandemic, clarified its dangers, and illuminated the American government’s disastrous failure to curb it, no wonder he won the 2021 Pulitzer Prize for explanatory reporting.Meet Ed Yong, a Malaysian born journalist who has been a journalist for the Atlantic since 2015, and his wife, Liz Neeley.Last night, we celebrated @edyong209’s #Pulitzer win. I’d like to say the same thing to you as I did in my speech: for the past year+, we have all struggled to make sense of a global crisis while attempting to survive it. We will continue to cope with it all for years. (1/3) pic.twitter.com/mNmfjwN8BBHe was awarded with the Pulitzer prize on 12 June!!!!!!!! https://t.co/2NLaHKoVqv“I count around 300 sources who took time to share their expertise with me during a year when we all had little time to spare. I learned SO MUCH from you all and I’m grateful to you for helping our readers,” wrote Yong in a tweet.He added that he will be splitting the prize money between everyone who worked on the stories with him last year. “Every editor, copy editor, fact checker, artist, and more. Even when individuals win Pulitzers, their work depends on a community. I want to honor mine”.Yong’s achievement was a result of his trailblazing work for the past 16 months. Check out this post from The Atlantic for a list of the stories that Youg did.1/ The Atlantic’s @edyong209 has won the 2021 Pulitzer Prize for explanatory reporting. In a series of articles, Yong anticipated the course of the coronavirus pandemic, clarified its dangers, and illuminated the American government’s failure to curb it. https://t.co/c6RwLqypSh“He correctly predicted an interconnected set of dangers: breakdowns in international communication, chronic underfunding of public health, shortages of supplies and scientific expertise at the federal level, President Donald Trump’s inadequacies as a leader,” said The Atlantic about Yong.Share your thoughts with us on TRP’s Facebook, Twitter, and Instagram.Your email address will not be published. Save my name, email, and website in this browser for the next time I comment.Please enter an answer in digits: \n\n© 2021 The Rakyat Post. All Rights Reserved. Owned by 3rd Wave Media Sdn Bhd", "Section": "", "Writers": "", "URL": "https://www.therakyatpost.com/2021/06/14/malaysian-born-journalist-awarded-2021-pulitzer-prize-for-explanatory-reporting/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}