{"Type": "", "Time": "2021-06-14", "Headline": "When ash from Philippines blanketed Singapore, Environment News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.He had left home on the morning of June 18, 1991, and walked to his car like on any other day, only to find it coated with a film of light grey powder.\"What a nuisance, I first thought, and wiped it away as best as I could,\" recounted Associate Professor Simon Tay, 60, chairman of the Singapore Institute of International Affairs.He thought it was dust the wind had blown from a nearby construction site, but soon learnt that the impossible had happened.Fine ash from a volcano more than 2,400km across the sea in the Philippines had been blown to Singapore, blanketing the ground, cars and even the floors of houses islandwide with a layer of ash.Over at the weather observation point at Changi Airport, Mr Mah King Kheong, then an operational meteorologist for Meteorological Service Singapore (MSS), saw a fine layer of whitish-grey \"dust\" on the ground and side railings.\"The ash in the atmosphere was quite fine, like what we observe on a hazy day,\" recalled Mr Mah, 56, who is now a principal meteorologist at MSS.The 24-hour Pollutant Standards Index was in the \"moderate\" range, between 57 and 70, from June 17 to 19, he said.After more than 500 years in deep slumber, Mount Pinatubo on Luzon island awakened with a vengeance, rocking the planet with a series of eruptions in mid-June 1991. The biggest explosion on June 15 blew ash to Singapore on the evening of June 17.Mr Mah said MSS received calls from the public, asking about the cause of the ash. The Straits Times' newsline also received more than 50 calls.It took about three weeks for the amount of dust in the air to return to normal. Water quality here was unaffected.On June 17 and 18, several members of the public complained about sneezing and coughing more than usual, while others complained of itchy skin, reported ST.While people were inconvenienced by having to wash their clothes and cars again, car wash facilities had a windfall.\"The TV coverage of the Mount Pinatubo eruption was stark and disturbing - not only the eruption itself, but also the heavy rain and surging mudflows that destroyed so much in their path,\" Prof Tay recalled.As the assistant director of the Singapore International Foundation then, he sent a small team of medical volunteers to the Philippines to help. \"We are glad to be safe (in Singapore), spared from hardships, but should we be inured to disasters?\"Shabana BegumJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/environment/when-ash-from-philippines-blanketed-singapore", "Source": "google"}