{"Type": "", "Time": "2021-06-14", "Headline": "Aung San Suu Kyi: Trial of ousted Myanmar leader begins - BBC News", "Text": "The trial of ousted Myanmar leader Aung San Suu Kyi has got under way, four months after a military coup removed the elected government from office. She is charged with owning unlicensed walkie-talkies and violating Covid restrictions. Later trials will focus on allegations of corruption and breaking the official secrets act. Human rights groups have condemned the trial, describing it as an attempt to stop her running in future elections. Ms Suu Kyi, 75, has been held under house arrest since the 1 February coup in Myanmar (also called Burma), and little has been seen or heard of her apart from her brief court appearances. On Monday, Ms Suu Kyi's lawyers, who have met her only twice since she was detained, will cross-examine witnesses over the claims. Another trial will begin on 15 June over sedition charges. If convicted of that charge alone, she faces up to 14 years in prison. Last week, she was handed additional corruption charges over allegations that she illegally accepted $600,000 (£425,000) in cash and around 11 kilos of gold.\"There is an undeniable political background to keep her out of the scene of the country and to smear her prestige,\" her lawyer Khin Maung Zaw told AFP last week. \"That's one of the reasons to charge her - to keep her out of the scene.\"The military has justified seizing power in February, alleging voter fraud in general elections held last year. But independent election monitors say the election was largely free and fair, and the charges against Ms Suu Kyi have been widely criticised as politically motivated.The coup triggered widespread demonstrations, and Myanmar's military has brutally cracked down on pro-democracy protesters, activists and journalists. On Monday, a US journalist detained in Myanmar since March was released after charges against him were dropped. Nathan Maung is due to fly out of Myanmar on Tuesday, according to his lawyers. Security forces have killed more than 800 people and detained nearly 5,000 to date, according to the monitoring group Assistance Association for Political Prisoners (AAPP).Myanmar coup: What is happening and why?The embattled town that stood up to Myanmar's armyStreet tales from Myanmar: 'Take care of our baby if I die'Nato warns of military challenge posed by ChinaA summit of alliance leaders in Brussels describes China's behaviour as a \"systemic challenge\".Lockdown easing in England delayed to 19 JulyWhat Putin really wants from BidenWhat Putin really wants from BidenHow China’s youth are shunning the rat race'We make it or we die' Video'We make it or we die'Netanyahu: A shrewd leader who reshaped Israel‘My little girls don’t know their mum died of Covid’Tech firms use remote monitoring to help honey beesWhat happened when the Soviets tried to dig to the centre of the Earth?How Islamic State has expanded into Central AfricaFormer farmer, 84, is accidental ASMR YouTube star. VideoFormer farmer, 84, is accidental ASMR YouTube starFootball phrases15 sayings from around the worldStaff arrested for not giving police free burgers1Nato warns of military challenge posed by China2Lockdown easing in England delayed to 19 July3Canada truck attack suspect charged with terrorism4Fate of Japan wartime leader's ashes revealed5Belarus parades detained journalist at media event6Performance issue reported at China nuclear plant7Headache and runny nose linked to Delta variant8What Putin really wants from Biden9Ned Beatty, Deliverance and Superman actor, dies10© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "Section": "", "Writers": "", "URL": "https://www.bbc.com/news/world-asia-57449884", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}