{"Type": "", "Time": "2021-06-14", "Headline": "Vietnam company could make Covid shots in tech transfer deal", "Text": "published :\n\t\t\t\t\t\t\t\t\t\t\t\t\t13 Jun 2021 at 19:14\t\t\t\t\t\t\t\t\t\t\t\twriter: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBloomberg News Vietnam’s health ministry said a local company is expected to manufacture Covid-19 vaccines after negotiating a technology transfer deal with an unidentified US producer.The vaccine will be mRNA-based, the health ministry said on its website on Saturday. It initially identified the company as Vingroup JSC before updating the statement to remove the reference.Vingroup declined to comment on the initial statement, while representatives for the health ministry couldn’t immediately be reached outside of business hours to comment on the change.Moderna Inc and Pfizer Inc deploy the mRNA technology in their vaccines. The country has approved the use of Pfizer’s vaccine, a health ministry publication reported separately on Saturday. Other shots permitted include those made by China’s Sinopharm and AstraZeneca Plc.A factory that the local company invested in can produce as much as 200 million doses per year and is expected to start manufacturing the vaccines from the fourth quarter or the first quarter of 2022, the health ministry said.Vietnam has secured deals to purchase 170 million vaccine doses. While more than 1.4 million injections have been given, only just over 53,000 people in the nation of 98 million are fully vaccinated as of June 11.The country is battling a significant domestic outbreak. The nation had 10,241 total infections as of Saturday with 58 deaths.Gen Prayut Chan-o-cha says he will serve his full term as prime minister, ending speculation he may dissolve the House and call a fresh election before his term ends in 2023.NEW DELHI: A 76-year-old man who had 39 wives and 94 children and was said to be the head of the world's largest family has died in northeast India, the chief minister of his home state said.Novavax Inc on Monday reported late-stage data from its US-based clinical trial showing its vaccine is more than 90% effective against Covid-19 across a variety of variants of the virus.", "Section": "", "Writers": "", "URL": "https://www.bangkokpost.com/world/2131687/vietnam-company-could-make-covid-shots-in-tech-transfer-deal", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}