{"Type": "", "Time": "2021-06-14", "Headline": "Football: Ex-players Schmeichel, Laudrup criticise Uefa after Eriksen's collapse, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.COPENHAGEN (Reuters) - Former Danish internationals Peter Schmeichel and Michael Laudrup have harshly criticised governing body Uefa over their handling of the collapse of Christian Eriksen during Denmark's Euro 2020 opener against Finland on Saturday (June 12).Eriksen collapsed just before halftime and was taken to hospital after receiving CPR on the pitch, with Uefa offering the players the choice of either resuming the game on Saturday night, or beginning again on Sunday at 12pm local time.\"It's a ridiculous decision by Uefa, they should have tried to work out a different scenario and shown a little bit of compassion, and they didn't,\" Schmeichel, whose son Kasper was in goal for Denmark when the incident occurred, told the BBC.\"Something terrible like that happens and Uefa gives the players an option to go out and play the game or come back at 12pm on Sunday. What kind of option is that?\"After a long suspension, the game resumed at 8.30pm and the Finns went on to win 1-0 but Peter Schmeichel, who was part of the Danish side that won the Euros in stunning fashion in 1992, would have preferred to see it called off.\"There is no way that game should have been played last night. Not one player on that pitch was in the right mindset to be playing a game of football,\" he said.His sentiments were echoed by Laudrup, widely considered to be one of the greatest players ever to play for Denmark.\"When such things happen, you are in the throes of your emotions, and you do not have the capacity and oversight to make important decisions. There must be someone who says 'now we're going to do this, and now we stop here',\" he told Denmark's TV3.\"They were given a choice that is not a choice - play tonight, or play tomorrow at 12. I think that, I'm sorry, but that is not a choice,\" Laudrup said.The Danish Football Association said on Sunday that the 29-year-old Eriksen was in a stable condition in a nearby hospital, where further tests were being carried out to establish the cause of his collapse.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-ex-players-schmeichel-laudrup-criticise-uefa-after-eriksens-collapse", "Source": "google"}