{"Type": "", "Time": "2021-06-14", "Headline": "The EU has shown embarrassing and dangerous ignorance", "Text": "\nMacron's failure to recognise the true status of Northern Ireland reflects a cynical, manipulative organisation\nThe global unity boosted by the weekend’s G7 meeting was undermined only by Britain’s partners making false statements about a subject they do not seem to understand: Northern Ireland. Emmanuel Macron was reported to have said that the province is not even part of the UK, which is either staggeringly ignorant or, if the remark was intended to highlight the peculiarity of Northern Ireland’s status, disingenuous (and still wrong). Belfast is in the UK: as Vernon Bogdanor writes, the Good Friday Agreement that America and the Europeans say they are so keen to protect makes this abundantly clear, establishing that this situation can only change when a majority wills it. It is the Northern Ireland Protocol that has threatened the integrity of the UK by placing a customs border down the Irish Sea, all to protect the sacrosanct purity of the European internal market. The British are very keen to resolve this matter; it is Brussels, not London, that would sacrifice the welfare of Northern Ireland to uphold an obscure principle.  Is Mr Macron really unaware of the history of such statements and of how dangerous they can be? So much for European concern for the peace process. This kind of arrogant behaviour is one of the many reasons Britain voted to leave the EU. The mistake was not to make a cleaner break of it, though the protocol was deemed to be the price for being allowed to exit at all.The change in US leadership has not helped matters. Donald Trump was pro-Brexit; Joe Biden instinctively sides with the EU, even though the United States would never submit to its strictures if invited. He also has a poor understanding of Irish politics, exhibiting a one-dimensional view of history that totally excludes Unionist identity (some have argued that he is more romantically nationalist than the government in Dublin, which appears to recognise the need to handle the situation as sensitively as possible). At the moment Britain seeks to be global, it finds itself hitting a wall of misunderstanding, deliberate or uninformed. And yet, everything else Britain agreed to at the weekend – from vaccines to emissions – contradicts the absurd European idea that Brexit is a nationalist fantasy. It is the EU – protectionist, cynical and manipulative – that stands in the way of progress, not the self-confident United Kingdom.We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage.", "Section": "", "Writers": "", "URL": "https://www.telegraph.co.uk/opinion/2021/06/14/eu-has-shown-embarrassing-dangerous-ignorance/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}