{"Type": "Singapore", "Time": "2021-06-14", "Headline": "Man, 85, fined and banned from driving for colliding into motorcyclist, causing severe injuries", "Text": "SINGAPORE: An 85-year-old man was fined S$5,000 and banned from driving for a year on Monday (Jun 14) for colliding with a motorcyclist, leaving him with a fractured leg and dislocated toe.Khoo Tea Wah, who appeared in court with a walking stick, pleaded guilty to one count of causing grievous hurt by a negligent act.He admitted to failing to give way to the 29-year-old motorcyclist while he was driving his car out from a car park at Block 40, Bedok South Road.The incident happened at about 11.30am on Sep 25, 2019.The court heard that Khoo's wife was in the front passenger seat as he exited the car park gantry and stopped to check for oncoming vehicles.He wanted to make a right turn into Bedok South Road towards Bedok South Avenue 1. Khoo saw the victim's motorcycle approaching in the first lane, furthest away from him, but still proceeded to make the turn even though the victim had the right of way.Khoo drove across the third and second lanes of the road. Just as he was about to enter the motorcyclist's lane, his wife said \"motorbike, motorbike\", asking him to stop.However, Khoo continued to drive forward and stopped only after his wife said \"motorbike\" a third time.It was too late at this point and his vehicle collided into the motorcyclist. The victim was flung off the bike and landed on his back three to four metres away.He was taken to hospital with injuries including a knee wound, a fractured femur and a dislocated toe. He was warded for 25 days, given more than a year's hospitalisation leave and underwent multiple surgical procedures for his wrist and thigh.He still has follow-up appointments for his wrist injury, which he sustained on his dominant hand, and is unable to carry heavy items with it.The prosecutor asked for the sentence that was meted out, which included the maximum fine possible. However, she noted Khoo's lack of prior convictions, his plea of guilt and his advanced age.He had also stopped to help the victim, she said.In mitigation, Khoo pleaded for leniency.\"I have been driving for a long time and have always maintained a clean driving record,\" he said through an interpreter.\"I know I did wrong, and I plead guilty. Please impose a light sentence on account that I'm already advanced in age.\"He could have jailed up to two years, fined up to S$5,000, or both for causing grievous hurt by a negligent act.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "court,crime", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/elderly-man-banned-from-driving-colliding-motorcyclist-bedok-15011818", "Source": "google"}