{"Type": "", "Time": "2021-06-14", "Headline": "G7 leaders warn Russia on cyberattacks, chemical weapons usage", "Text": "The Group of Seven leaders ended their summit on Sunday by demanding that Russia take action and investigate the use of chemical weapons within its territory and hold accountable those behind ransomware attacks and other cyber crimes.Why it matters: The allied language come as all eyes turn to President Biden's Wednesday meeting with Russian President Vladimir Putin in Geneva.Get market news worthy of your time with Axios Markets. Subscribe for free.The state of play: The leaders called on Russia to \"end its systematic crackdown on independent civil society and media.\"They also reiterated their support for Ukraine and pressed Russia to deescalate tensions between the two nations by withdrawing troops from Ukraine's eastern border and the Crimean peninsula.The big picture: Secretary of State Antony Blinken made the rounds on the Sunday talk shows and tried to temper expectations about the upcoming meeting between Biden and Putin, saying that it would not be a \"flip-the-light switch moment\" for U.S.-Russia relations.Biden himself told reporters on Sunday that he agreed with Putin's recent comments that U.S.-Russia relations are at their lowest point in years, per Reuters.A recent ABC News/Ipsos poll found that 49% of Americans trust Biden to negotiate on their behalf with Putin.But, but, but: Lawmakers from both parties want Biden to take a tough stance with Putin on the issue of ransomware gangs, and convey the message that if Russia doesn't crack down on cybercriminals within its borders, the United States will, according to Politico.Putin has expressed willingness to hand over cybercriminals to the United States if the United States returns the favor, per Reuters.Ukraine's President Volodymyr Zelensky has also expressed reservations about the upcoming Biden's decisions vis-a-vis Russia.Of note: The issues of chemical weapons and cyberattacks are in the spotlight at this year's G7 summit in light of the poisoning of Russian opposition leader Alexei Navalny with a chemical nerve agent and the ransomware attack on America's Colonial Pipeline, reports Reuters.The Colonial Pipeline attack was carried out by Darkside, a Russia-based cybercrime group.More from Axios: Sign up to get the latest market trends with Axios Markets. Subscribe for freeIn addition to attacks on Colonial Pipeline and meat producer JBS, hackers have targeted local governments, TV stations, and water treatment plants.Here's the latest for Sunday June 13th: From vaccine sharing to climate, G-7 talks yield agreements; Biden says he’s reestablishing US credibility; Gas explosion in central China kills at least 12; Man jumps into Lake Michigan for 365th straight dayYou may be surprised by how pressure washing can transform your home. See for yourself. Look for nearby pressure washing services.Moscow's mayor has effectively declared a public holiday for all of next week to combat a surge in COVID-19 cases.  Sergei Sobyanin announced the decision on Saturday, saying it would not affect organisations that maintain the Russian capital's infrastructure, the military, and other strategically important enterprises.  Monday is anyway a public holiday, and the mayor told people to also stay off work for the rest of the week.Trudeau led a G7 discussion of China on Saturday and called for a unified approach, a source said.  The grouping needed to \"stand strong and united\" on China and agreed to measures to do that, Trudeau said.  One concrete example of G7 action was its offer to help developing nations with an infrastructure plan that could rival Beijing's Belt and Road initiative, he said.A sizable stock market decline is inevitable. But that also means opportunity is right around the corner.Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.WASHINGTON (Reuters) -The White House said on Sunday ahead of Monday's NATO summit that alliance leaders would launch an \"ambitious\" set of initiatives to ensure it continues providing security through 2030 and beyond.  It said the 30 member countries would agree to revise NATO’s \"Strategic Concept\" to guide its \"approach to the evolving strategic environment, which includes Russia’s aggressive policies and actions; challenges posed by the People’s Republic of China to our collective security, prosperity, and values; and transnational threats such as terrorism, cyber threats, and climate change.\"  The White House statement said the new Strategic Concept would be prepared for adoption at the 2022 NATO Summit.Comedian John Mulaney, who recently completed rehab, opened the show - NYC's first full-capacity indoor concert of its size since the pandemic.Former Thunder guard Chris Paul poured in 37 points, his most since 2018, to help the Suns sweep the Nuggets.Read This Before Going Solar in Texas.  [You'll Likely Qualify!]\"The result was satisfying, though my body was not in top form,\" Su told China's state news agency Xinhua after Friday's run.  The time, the seventh legal sub 10-second run of Su's career, was the joint 13th fastest in the world this year.  Su is set to compete in his third Olympics in Tokyo this summer and will be a key member of China's 4x100m relay team, which he helped to a silver medal at the 2015 world championships in Beijing and fourth at the Rio Games.Photo Illustration by Sarah Rogers/The Daily Beast/Photo via Getty/YoutubeWhen Billie Eilish graced the June cover of British Vogue, jaws dropped. Gone was her signature dark, shaggy hair with slime-green roots and her usual ensemble of baggy pants, paired with oversized shirts and hoodies. Instead, she presented as a soft femme fatale with angelic platinum-blonde hair in old Hollywood curls, strappy, blush-colored lingerie, and corsets.The images sent a shock wave through the internet, with fanRome prosecutors are investigating the disappearance of at least 120 paintings, etchings, sculptures and tapestries from the offices of Italy’s public broadcaster, Rai. Some of the missing artworks – which include valuable etchings by Amedeo Modigliani, Claude Monet and Alfred Sisley – disappeared completely from Rai offices, while others were replaced with fakes. Authorities suspect disgruntled employees may be behind the thefts from the impressive collection, which includes 1,500 artworks wortIf you pay more than $99/month for power and own a home in Texas, you better read this.Two attorney generals and a deputy attorney general said they did not know the phone records of Democratic lawmakers critical of Trump being seized.Mahmoud Abu Jubbah and his family have the grim task of clearing the aftermath of war, removing what's left of homes, offices and personal belongings.But the razor-thin 60-59 vote of confidence in a coalition of left-wing, centrist, right-wing and Arab parties with little in common except for a desire to unseat Netanyahu, only underscored its likely fragility.Hundreds also attended a support rally outside the official residence of Netanyahu in Jerusalem.\"We are so excited, we are close to get heart attacks from excitement,\" one supporter of Israel's new government, Batya Aviram, said. \"We understood the danger of [Netanyahu] to continue to control our democracy as a dictatorship.\"The new government, formed after an inconclusive March 23 election, plans largely to avoid sweeping moves on hot-button international issues such as policy toward the Palestinians, and to focus on domestic reforms.So mad that I just learned this...Myanmar’s civilian government-in-exile has called on Boris Johnson to lead the world by formally recognising its right to rule the crisis-torn Southeast Asian nation after a February military coup. In an interview with the Telegraph, Dr Sasa, the government’s minister for international cooperation, said the UK had a unique responsibility to lead efforts to end the suffering of its former colony after the military ousted a democratically elected government and seized power four months ago. “We neThe remarks come after international leaders of the G7, including the US, France, UK, Germany, and Japan, met in England over the weekend.Biden says he's 'satisfied' with G7's final stance on ChinaTop Surgeon and Author of the Best Selling Book \"Dr. Gundry's Diet Evolution\" Discovers Link Between Gut Health and the Rising Number on the Scale.A 25-year-old man died Sunday of injuries sustained in a mass shooting that wounded 13 other people in downtown Austin, Texas, the previous day, police confirmed.Driving the news: Austin police named the victim as Douglas John Kantor, as they continued to search for one of two suspects. One suspect was taken into custody on Saturday following the shooting on 6th Street, a popular area with bars and restaurants.Get market news worthy of your time with Axios Markets. Subscribe for free.Two peopleThe graph displays total transaction consideration for U.S. and Canadian M&A transactions since 2019. In the first half of 2019 the U.S and Canada were closely matched with approximately $2.1 billion of total consideration. From the 2nd half of 2019 through 2020, Canadian M&A ground to a near standstill while U.S. activity remained robust. The U.S. dominance was supported by large transactions like Curaleaf’s $949 million Select deal in Q1:20 and $830 million Grass Roots deal in Q3:20. In Q1:21,Taproot opens up new possibilities for privacy, multisignature wallets and security, as well as scaling.", "Section": "", "Writers": "", "URL": "https://news.yahoo.com/g7-leaders-warn-russia-cyberattacks-163053054.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}