{"Type": "", "Time": "2021-06-14", "Headline": "Denmark's Christian Eriksen given cardiac massage in Euro 2020 game, able to speak before going to hospital, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.COPENHAGEN (REUTERS) - Denmark's Christian Eriksen received life-saving cardiac massage treatment on the pitch after collapsing on Saturday (June 12) in his side's Euro 2020 opening match with Finland. He was able to speak before being taken to hospital, team doctor Morten Boesen said.Eriksen was surrounded by his teammates while he was treated on the pitch. The game was restarted an hour and 45 minutes later after news came that he had regained consciousness.\"We were called onto the field when Christian collapsed. He was lying on his side when we approached him and there was respiration and pulse,\" Dr Boesen told a news conference after the game, which Finland won 1-0 with their only goal attempt.\"But that picture changed and he then received life-saving cardiac massage. We quickly got help from the stadium doctor and we got Christian back,\" he said.Denmark coach Kasper Hjulmand said several of his players had been too overwhelmed to finish the match.\"I completely understand that you can't play a soccer match at this level after watching one of your best friends fight for his life,\" a visibly drained Hjulmand said.Players were given the option to finish the game on Saturday evening or on Sunday, he added, noting there had been no pressure from Uefa to finish the match on Saturday.\"It was more manageable to go in again and honestly just get it over with,\" Hjulmand said.Several players, including captain Simon Kjaer who plays for Milan in Italy, were too upset to finish the game, he added.\"Simon Kjaer was deeply, deeply touched. He was in doubt whether he could continue and gave it a shot, but ultimately he couldn't. I completely understand that,\" Hjulmand said.A hush fell over the crowd of 16,000 fans while Eriksen received treatment on the pitch, and outside bars around central Copenhagen, people gathered, many in tears, while his condition remained unclear.Hjulmand said the players came together in the dressing room, supporting one another and allowing themselves to show their emotions.\"I cannot be more proud of this group of people who take such good care of each other at this time, when a loved one is fighting for his life,\" he added.\"It was a very tough night and we were all reminded what's the most important in life.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-denmarks-eriksen-had-cardiac-massage-on-pitch-was-able-to-speak-before-going", "Source": "google"}