{"Type": "", "Time": "2021-06-14", "Headline": "3 S'pore medical bodies say risk to heart from Covid-19 mRNA vaccines very small, public should get jabs, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Three independent bodies of medical experts here have reiterated that the risk of heart conditions associated with the Covid-19 mRNA vaccine is \"very small\", and have recommended that people still receive the vaccines in the interest of public health.The Chapter of Cardiologists at the College of Physicians, the Academy of Medicine and the Singapore Cardiac Society said on Monday (June 14) that the risk posed by Covid-19 to health is much greater than the risk of the jabs.\"We continue to recommend that eligible members of the public go for Covid-19 vaccination as the risk of complications from Covid-19 infection continues to significantly exceed the risk from Covid-19 vaccines,\" they said in a joint statement.\"The vaccination helps keep the majority of individuals from getting seriously ill from Covid-19 and facilitates herd immunity in the community.\"Six people here have been reported to have suffered myocarditis, or inflammation of the heart muscle, and pericarditis, or inflammation of the lining outside the heart, after getting an mRNA vaccine, among whom four are young men less than 30 years old. The other two are a man and a woman both aged above 40.The Health Sciences Authority (HSA) said most of the cases had occurred within a few days after receiving the second dose of the vaccine, and that all have recovered or been discharged well from hospital.Current data suggests that there is a very small risk of myocarditis and pericarditis after receiving a second dose of mRNA Covid-19 vaccine, particularly in males under 30 years old.But the authorities and experts have both said that such cases are extremely rare and it remains unclear if the vaccines are responsible for them.As a precaution, experts have advised that vaccinated people, especially adolescents and younger men, should avoid strenuous physical activity for one week after their second dose.The Pfizer-BioNTech and Moderna vaccines, the two used in Singapore's national inoculation programme, are mRNA vaccines.The United States and Israel - two major users of the mRNA vaccines - have also reported a slightly increased risk of myocarditis and pericarditis in young men after the second dose of mRNA vaccination.The three medical bodies on Monday acknowledged that these two countries have observed increased risk of such heart conditions, but noted that the sample size of Singapore is too small to be conclusive.They added that they are monitoring the situation closely and will advise should there be updates.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/three-medical-bodies-in-spore-say-risk-of-heart-conditions-linked-to-mrna-vaccines-very", "Source": "google"}