{"Type": "", "Time": "2021-06-14", "Headline": "Gojek cuts its commission by half till at least end-2022 to improve drivers' earnings, Transport News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Ride-hailing operator Gojek will halve the commission it receives from its drivers from June 21 till at least the end-2022, in order to help them increase their earnings.This means Gojek drivers will get to keep 90 per cent of the fare from every trip, instead of 80 per cent.The move comes after Grab, the dominant ride-hailing operator here, said it would seek to improve drivers' earnings by introducing a $1 fare hike from this month.Gojek said on Monday (June 14) that the cut in commission, which it refers to as service fees, will help to lessen the impact of the Covid-19 pandemic on its drivers. It said a survey it conducted found that 50 per cent of drivers want lower service fees for better earnings.Gojek will also introduce a payout of $3 to drivers who have to drive 3km or more to pick-up their passenger, among other measures.Its general manager, Mr Lien Choong Luen, said: \"The ongoing impact of the pandemic is a consistent worry for our driver-partners as they try to sustain their earnings amidst the uncertainty.\"These measures will have a profound impact on the livelihoods of our driver-partners, increasing their take-home earnings while giving them more flexibility by reducing their dependence on incentives.\"Gojek said the changes reflect a significant investment in Singapore, as it seeks to grow its market share here.It also said that a recent campaign to provide free or discounted rides to and from vaccination sites for all riders in Singapore has registered 117,500 rides so far.Several drivers have been calling for ride-hailing operators to cut their commissions to help drivers tide over the impact of the pandemic.While Grab has not announced a cut of its 20 per cent commission rate, it said last month that it will permanently raise fares by $1 from this month to improve driver earnings amid rising fuel and maintenance costs.It will not collect commission on the additional $1 from June 1 to June 30. This means drivers will get $1 more for every ride they complete with Grab for a month.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/transport/gojek-cuts-its-commission-by-half-till-at-least-end-2022-to-improve-drivers", "Source": "google"}