{"Type": "", "Time": "2021-06-14", "Headline": "'Chris, I love you' - Lukaku pays tribute to stricken Eriksen after Belgium opener against Russia | Goal.com", "Text": "Romelu Lukaku paid tribute to Christian Eriksen after his opening goal for Belgium at Euro 2020 against Russia, dedicating his finish to the Denmark international following his collapse against Finland on Saturday.The Inter forward delivered a message of support for his club team-mate in St. Petersburg after rattling home an early strike against the hosts inside the first quarter-hour.Lukaku and Eriksen helped the Nerazzurri to a first Serie A title in over a decade this season, and were expected to face each other in five days in Copenhagen before the latter was rushed to hospital.After latching onto Dries Mertens' delivery inside the box - played onside by a deflection off a Russian defender - the striker was able to corral a cool shot past Anton Shunin to open his account for the tournament.Racing towards the sidelines, he waved away his team-mates coming to join him, instead heading for the nearest television camera to seize it with both hands and shout into its lens: \"Chris, Chris, I love you.\"After Belgium won the match 3-0 behind two Lukaku goals, the striker admitted it was hard for him to play the match after hearing the news.\"I enjoyed the game but for me, it was difficult to play because my mind was with my team-mate Christian Eriksen,\" Lukaku said. \"I hope he is healthy and I dedicate this performance to him.\"On hearing the news about Eriksen, Lukaku added: \"I cried a lot because I was scared, obviously. You live strong moments together. I spend more time with him than with my family.\"My thoughts are with him, his girlfriend, his two kids and his family.\"Eriksen was taken to hospital after collapsing during the first half of Denmark's Group B clash with Finland, having slumped to the turf untouched.Medics ultimately resuscitated him on-site after a lengthy interval, during which the player's team-mates shielded him while their opponents and the crowd voiced their support.The fixture was eventually resumed, following confirmation that the former Tottenham man was awake and in a stable condition. Finland would emerge as 1-0 victors in their first major tournament thanks to Joel Pohjanpalo's goal just before the hour mark.", "Section": "", "Writers": "", "URL": "https://www.goal.com/en-sg/news/chris-i-love-you-lukaku-pays-tribute-to-stricken-eriksen/vyu18n3cgl2p1xexg6l9gexfd", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}