{"Type": "", "Time": "2021-06-14", "Headline": "Vietnam business hub, Ho Chih Minh City, to extend social distancing curbs for 15 days | The Star", "Text": "\n                    Monday, 14 Jun 2021\n                HCM City's downtown area is deserted as the city enforces social distancing starting May 31, 2021, to curb the spread of coronavirus. - Vietnam News/ANNHANOI, June 14 (Reuters): Vietnam's business hub of Ho Chi Minh City will extend social distancing measures for a further 15 days starting from Tuesday (June 15), amid the emergence of new Covid-19 clusters, authorities said.Ho Chi Minh City has seen a spike in cases related to several clusters including at a factory, a residential building, hospitals and a religious mission.\"The city's current social distancing order is set to expire on Monday. However, since sources of some new infection chains have not yet been identified, the authorities have decided to extend the curb,\" a government statement said on Monday.Under the order, non-essential services and businesses will remain shut, while gatherings of five or more in public areas and 20 or more indoors are not allowed and people are advised to stay at home.Most of the city's infections have been linked to the Revival Ekklesia Mission, located in the Go Vap district, so this area will remain under stricter curbs, the statement said.Health authorities are also concerned as many clusters in the community of unknown source of infections have been discovered during surveillance screening or following hospital admission in recent days.The city has logged a total of 845 infections since late April, making it the third-biggest coronavirus hotspot during the current outbreak, official data showed. - Reuters  \nTags / Keywords:\nVietnam\n                                                                ,\n                                                                                                Ho Chi Minh City\n                                                                ,\n                                                                                                Business\n                                                                ,\n                                                                                                Hub\n                                                                ,\n                                                                                                Covid-19\n                                                                ,\n                                                                                                Measures\n                                                                ,\n                                                                                                Extended\n                                                                ,\n                                                                                                From Tuesday (June 15)\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/14/vietnam-business-hub-ho-chih-minh-city-to-extend-social-distancing-curbs-for-15-days", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}