{"Type": "", "Time": "2021-06-14", "Headline": "Aid groups appeal to G-7 for cash to get shots into arms - The Washington Post", "Text": "FALMOUTH, England — Rich nations must do more than just donate surplus vaccines if they hope to end the COVID-19 pandemic, according to public health experts and humanitarian groups that are calling for money, increased production and logistical support to help developing countries where the virus is still raging.The appeal came after U.K. Prime Minister Boris Johnson said he hoped leaders of the Group of Seven major industrialized nations will agree to provide at least 1 billion vaccine doses for poorer countries. The G-7 leaders, who are holding their annual meeting this weekend in Cornwall, southwest England, continue to debate other forms of aid to get lifesaving vaccine shots into arms.While almost half of the combined population of the G-7 nations has received at least one dose of vaccine the worldwide figure is less than 13%. In Africa, it’s just 2.2%.Wealthy nations must act quickly not just out of altruism, but to protect their own citizens, because the virus will continue to mutate as long as it is allowed to spread unchecked, resulting in potentially more dangerous variants, said Lily Caprani, head of COVID-19 vaccines advocacy for UNICEF.“(This) requires political will and urgent action now,” Caprani told The Associated Press. “So I think all of us should be urging our leaders to do it, not just because it’s the right thing to do, but it’s the smart thing to do, and it’s the only way out.”Johnson, who is hosting the G-7 summit, and U.S. President Joe Biden opened the meeting by announcing that their countries would donate a total of 600 million vaccine doses over the next year.But International Monetary Fund economists recently estimated it would cost $50 billion to vaccinate 60% of the world’s population by the middle of next year and that achieving that goal would generate $9 trillion in additional economic output by 2025.Those appealing for wealthier nations to do more to make vaccines available worldwide argue it would be a worthwhile investment in human capital.“If we do this, and everyone’s saying it’s the deal of the century, about 60% of those resources need to come from wealthy countries in the G-7,’’ said Robert Yates, director of the global health program at Chatham House, a London-based public policy think tank.Countries like the United States and Britain secured supplies of multiple COVID-19 vaccines while they were still in development, hoping to guarantee shipments of any successful candidates. That left them with enough doses to inoculate their entire populations two or three times over after regulators approved a number of shots.They are now under pressure to provide shots for low-income countries immediately and not wait until they have vaccinated younger age groups in their own countries. COVID-19 poses the greatest risk to older people and those with underlying health conditions, who account for the vast majority of those who have died from the disease.Ahead of the G-7 meeting, the IMF, the World Health Organization, the World Bank and the World Trade Organization said the group’s top priority should be ending the pandemic and securing the global economic recovery.“The current approach to COVID-19 vaccination — using limited vaccine supplies to protect low-risk populations in a handful of countries while low- and middle-income economies wait indefinitely for doses –- doesn’t make sense for anyone,” World Bank President David Malpass wrote last month. “A successful global vaccination effort must be equitable.”But vaccines alone aren’t enough to complete the task.Fragile health care systems in low-income countries need equipment, training and logistical support so they can mount the kind of turbocharged mass vaccination programs that have been successful in Europe and North America.The U.K., for example, turned to its National Health Service for staff and commandeered cathedrals, stadiums and museums as mass vaccination centers. More than 60% of the U.K. population, and almost 80% of adults, have received at least one dose of vaccine.While infections, hospitalizations and deaths have all plunged with the success of the vaccination program in Britain, public health officials are still concerned about new variants that may prove more resistant to existing vaccines. The government recently banned most travel from India to slow the spread of the delta variant discovered there.Epidemiologists say the best way to head off potentially dangerous variants is to vaccinate the most vulnerable people around the world as quickly as possible.“Talk is cheap, and talk isn’t going to get it done,” Jeevun Sandher, a former U.K. government economist who is studying inequality at King’s College London, said. “A finely worded communique with our ambitions and a commitment to global cooperation is just not going to get it done. We absolutely need to see the checks. Get out those pens and start signing.’’Developing nations are also calling on the U.S., Britain and the European Union — where the most widely used vaccines were developed — to relax patent protections and provide technical assistance so they can produce the shots for themselves.The Biden administration has backed a temporary waiver of patent protections, saying “extraordinary times and circumstances call for extraordinary measures.” But the European Commission, the EU’s executive arm, has opposed such a move, arguing that government assistance to vaccine makers and voluntary licensing agreements are the best way to increase supply.A decision on the matter will come from the World Trade Organization.Activists argue that the technology should be transferred to developing countries so they can produce vaccines and COVID-19 treatments for themselves, reducing their dependence on manufacturing elsewhere.Daphne Jayasinghe of the International Rescue Committee, noted that the debate is taking place against the backdrop of the U.K. government’s decision to cut spending on international aid, “which is deeply affecting health services in countries where they are needed the most.“The promises to deliver surplus vaccines are certainly welcome.., but they must be accompanied by more action,” Jayasinghe said. “We’d like to see other G-7 member states making similar commitments to share vaccines, but what needs to go with that is the infrastructure and the health services to deliver those vaccines.’’The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/politics/aid-groups-appeal-to-g-7-for-cash-to-get-shots-into-arms/2021/06/12/afa28a2e-cba0-11eb-8708-64991f2acf28_story.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}