{"Type": "", "Time": "2021-06-14", "Headline": "Denmark's Eriksen still in hospital, condition is stable", "Text": "published :\n\t\t\t\t\t\t\t\t\t\t\t\t\t13 Jun 2021 at 18:15\t\t\t\t\t\t\t\t\t\t\t\twriter: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tReutersCOPENHAGEN: Denmark midfielder Christian Eriksen remained in hospital and was in stable condition on Sunday, after collapsing during his side's Euro 2020 opening match with Finland and being given CPR on the pitch on Saturday, the Danish football association said.\"This morning we have spoken to Christian Eriksen, who has sent his greetings to his teammates. His condition is stable, and he continues to be hospitalized for further examination,\" Danish FA DBU said on Twitter.Eriksen, 29, collapsed suddenly in the 42nd minute of the match while running near the left touchline after a Denmark throw-in. As a hush fell over the 16,000-strong crowd, his teammates gathered around him while he was treated on the pitch and then carried off on a stretcher.\"The team and the staff of the national team has received crisis assistance and will continue to be there for each other after yesterday's incident,\" DBU said.\"We would like to thank everyone for the heartfelt greetings to Christian Eriksen from fans, players, the royal families from both Denmark and England, international associations, clubs etc,\" it said.Messages of support for Eriksen, who plays for Inter Milan, have poured in.The Group B game was halted and then eventually restarted an hour and 45 minutes later. Finland went on to win 1-0. AYUTTHAYA: Eighteen employees of Phra Nakhon Si Ayutthaya Hospital were found to be infected with Covid-19 but the situation was under control and it remains open, hospital director Chokchai Leetho-chawalit said.WELLINGTON: Polynesian seafarers likely reached Antarctica hundreds of years before the Western explorers usually credited with discovering the frozen continent, a new study has concluded.Health authorities reported 17 more Covid-19 fatalities on Monday and another 3,355 new transmissions, bringing the accumulated toll to 1,466 deaths and the number of cases since the start of the pandemic to 199,264.", "Section": "", "Writers": "", "URL": "https://www.bangkokpost.com/sports/2131679/denmarks-eriksen-still-in-hospital-condition-is-stable", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}