{"Type": "", "Time": "2021-06-14", "Headline": "4 Heartbreaking Moments From Episodes 9-10 Of “Doom At Your Service” | Soompi", "Text": "This week, “Doom At Your Service” contemplates the human response when dealing with upcoming loss. Sometimes, having time to prepare for the worst makes it that much harder to say goodbye. Tak Dong Kyung (Park Bo Young) does her utmost to make peace with the world and with those she loves, but the one person who gave her a new lease on life is the very person who’ll die if she doesn’t.Here are the moments that broke our hearts this week!Warning: spoilers for episodes 9-10 below.kimgoeunThe thing with moneymaking is that it doesn’t leave much time for money spending. Dong Kyung literally says that “work is the evil of our society” because she understands the strange rat race humans live in, where we work in order to live but sacrifice our time to live in order to work.For the first time, Dong Kyung finally has the time to do what she wants when she wants to, without worrying about the future. She drops money left, right, and center, and has no qualms about using her terminal condition to buy a handbag. But the heartbreaking part is that even this extravagance isn’t for her benefit, but it’s for those she’s leaving behind.She buys shoes for Sun Kyung (SF9‘s Dawon), a fountain pen for Na Ji Na (Shin Do Hyun), and a handbag for Kang Soo Ja (Woo Hee Jin). Dong Kyung spends the money she spent her whole life slaving away to earn for things she may never see the people she loves use. Her only gift to herself is that of memory, by having a couple photo shoot with Myeol Mang (Seo In Guk). And the man sees it and gives her the gift she desires most in that dream: a future where those she loves meets up with her, wearing all the things she got them. A future where she lives.dramaismBut Dong Kyung isn’t the only one with a bucket list, and that dream wasn’t just for her.dramaism“Doom At Your Service” meditates in many ways on the foibles of a human existence. How we’re temporary in nature and drawn to equally temporary things: dreams, love, and chasing laughter and joy every day. To Myeol Mang, whose existence consists of watching things fade, a human life is both bewildering and beautiful. He hungered for it at first, but then found himself doomed to exist for eternity while the world collapsed every day. However, his bargain with Dong Kyung has had the surprising side effect of making him human. And not in the sense that he’s no longer a super-powered deity of doom, but in the sense that his days are now numbered. Either Dong Kyung dies or he does. Destroying the world stopped being an option the second he fell in love with her, and Myeol Mang would literally rather die than see Dong Kyung die. So while she acts out her bucket list, so does he. Only his is much shorter. He apologizes to Sonyeoshin (Jung Ji So) for his resentment, and gives the girl he loves a dream that’ll make her happy.deokmisdeokmisdeokmisdeokmisIt’s a heartbreakingly short list, because no one else has loved Myeol Mang. At first, he doesn’t even realize that he’s doing exactly what Dong Kyung is. Once he does, he runs to her and says he loves her, repeatedly flirts with her, and teases her. He’s free with his compliments, surprising Dong Kyung who wonders at how easily romantic he is. But even she at some level realizes that they’re both trying to say goodbye. Which is why it’s so much harder when goodbye comes around.clarawhoclarawhodramaismMyeol Mang has learned how to be human a little too well. Gone is the man who had no idea what Dong Kyung is thinking. He’s learned to read her as humans read each other, and sees their goodbye coming. What he sees equally well is that Dong Kyung’s been holding back for too long.She’s always had to be strong, to be there for Sun Kyung, to earn money and take some of the burden off her aunt. She’s been so busy living a life that has drained her body and soul that she’s forgotten what it means to live. But that doesn’t mean she doesn’t want to. Myeol Mang saw it from the start, from the strange way she reacted to her diagnosis, to her severe depression, to her inability to cry. This was someone who was forcing it all down because she had to, not because she wanted to. And at some point, she forgot what it was like to live without forcing down the pain.But Myeol Mang and her cancer changed everything. She started to live her life the way she wanted: quitting her job, refusing to be a doormat, doing what made her happy. She finally remembers what it was like to live, and she wants to live some more. But even then she has to consider Ji Na, Sun Kyung, and her aunt. She knows that crying or talking about how much she wants to live will just make it harder on them when she dies. She can’t confide in Myeol Mang because he’ll just go on about how he’ll happily die for her, and she doesn’t want that either. So she says nothing. She forces it down again.But Dong Kyung’s finally hit her limit. And all it takes is sweet Myeol Mang coming to hold her hand because it’s midnight for her to finally break. Park Bo Young does a great job here because she cries at first like she doesn’t know how, like she wants to let it out but has forgotten how crying works. Then, she finally sobs her heart out in Myeol Mang’s arms, as they both mourn what could have been.dramaismdramaismdramaismdramaismdramaismdramaismThis isn’t so much heartbreaking in the traditional sense as it is a blow to the heart. Joo Ik’s (Lee Soo Hyuk) reasons are finally laid bare, and they’re harsh but honest, like the man himself. It wasn’t that Joo Ik fell in love with Ji Na, but he knew Lee Hyun Kyu’s (Kang Tae Oh) character and wanted Ji Na free of someone like him. Hyun Kyu might be a great friend and a great boss to Sung Kyung but that doesn’t make him boyfriend material.Ji Na is stunned as he lays out everything and blames him for the end of her relationship with Hyun Kyu, but he accurately points out that it wouldn’t have worked anyway. He’s right. Hyun Kyu has a habit of running away from confrontation. He did it nine years ago in that final text where Ji Na begged him to respond or their relationship would be over. He did it over nine years, where he had all the time to contact Ji Na and make things right or at least give her closure, but he never did. And he did it when he refused to hear what Joo Ik had to say and simply dashed off. Him and Ji Na would never have worked, and if they did, it would only be because Ji Na cared more. But that’s no way for a girl to live.There are no right answers here. If Joo Ik hadn’t intervened, Ji Na would have been stuck in a relationship that drained her. But because he did, Ji Na never got closure, wrote the worst male leads for years, and even used the first two syllables of Hyun Kyu’s name as her pen name. Yikes. Ji Na won’t see it, not now, but hopefully she’ll see it soon, and perhaps Joo Ik isn’t the right person for her either. All we’ve really seen is her obsessing over Hyun Kyu, so it’s confusing as to who’s the lead with this couple. But perhaps reason will reign supreme, and Ji Na will spurn Hyun Kyu. Going back to the ex who tossed you over for nine years and hasn’t changed his character is never a good idea!Next week doesn’t seem to bring much in the way of laughter as Dong Kyung and Myeol Mang navigate a rapidly approaching deadline to their lives. And they aren’t the only ones. Sonyeoshin’s condition appears to have gotten much worse, though she’s hiding it from both of them. In the preview, she proposes a solution to their dilemma, to erase themselves from the other’s life so their twisted bargain never comes into play. Myeol Mang stands to lose everything, but he might just agree if the girl he loves lives, even if they won’t remember each other.Will Dong Kyung and Myeol Mang find a way back to each other? Will next week end on a cliffhanger where they wake up with amnesia? So many questions! But for now, here are the two of them being way too cute!clarawhoclarawhoHe’s so smitten!Check out the drama below: Watch Now What did you think of this week’s episodes? Let us know your thoughts in the comments below!Shalini_A is a long time Asian-drama addict. When not watching dramas, she works as a lawyer, fangirls over Ji Sung, and attempts to write the greatest fantasy romance of all time. Follow her on Twitter and Instagram, and feel free to ask her anything!Currently Watching: “Dark Hole,” “Bossam: Steal the Fate,” “Sell Your Haunted House,” Law School,” “Doom At Your Service” Looking Forward to: “The Devil Judge“", "Section": "", "Writers": "", "URL": "https://www.soompi.com/article/1467715wpp/4-heartbreaking-moments-from-episodes-9-10-of-doom-at-your-service-that", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}