{"Type": "Business", "Time": "2021-06-14", "Headline": "World stocks near record high as investors await dovish Fed act", "Text": "TOKYO:     Global shares held firm near record highs on Monday while U.S. bond yields flirted with three-month lows as investors expect the Federal Reserve to stick to its dovish mantra later this week.Japan's Nikkei rose 0.35per cent while MSCI's broadest index of Asia-Pacific shares outside Japan was down 0.1per cent. Activity was limited with the region's largest markets - China, Hong Kong and Australia - closed for a holiday.Globally, equity markets were basking in the prospects of a broadening economic recovery from the coronavirus pandemic and anticipation of continuity in dovish monetary policy from the U.S. Federal Reserve.The MSCI all-country world equity index, the U.S. S&P 500 and the pan-regional STOXX Europe 600 index all closed at record highs on Friday.The rally came even as U.S. inflation data on Thursday exceeded market expectations.\"One big factor is that the Fed has been saying inflation will be transitory and that it will maintain loose monetary policy,\" said Norihiro Fujito, chief investment strategist at Mitsubishi UFJ Morgan Stanley Securities. \"But another factor to consider is that markets are simply awash with cash.\"Ample funds are finding their way to bonds, where the yield on 10-year U.S. Treasuries stood at 1.465per cent ahead of the Fed's policy meeting this week, having fallen to a three-month low of 1.428per cent on Friday.\"It is becoming painful for bond bears and I bet the 10-year yield will fall to 1.25per cent or even 1per cent,\" said Akira Takei, fund manager at Asset Management One, noting that U.S. economic recovery is likely to slow in coming months.\"The U.S. employment rate was 61per cent before the pandemic. It has recovered to 58per cent but I expect its recovery to slow. After the great financial crisis (of 2008), it has never recovered to its pre-crisis levels.\"Speculators are also building up long positions in U.S. debt, with their net long positions in U.S. bond futures hitting the highest level since October 2017, U.S. financial watchdog data showed.Many investors expect the Fed to repeat its dovish view at its two-day meeting from Tuesday.While some Fed board members have said the bank should start discussing tapering its bond buying, most investors think a majority of policymakers still prefer to wait a bit more.\"There will probably be no surprise from the Fed this week,\" said Mitsubishi UFJ's Fujito. \"But in the longer term, there's clear risk of the Fed's stimulus becoming excessive. There is little justification for buying mortgage bonds when housing markets are becoming so hot.\"In the currency market, the euro has lost steam after the European Central Bank last week showed no willingness to reduce its stimulus either.The euro traded at US$1.2111, having fallen to a one-month low of US$1.2093 on Friday.The yen stood little changed at 109.70 yen.The British pound changed hands at US$1.4113, near the lower end of its trading range over the past month, ahead of British Prime Minister Boris Johnson's announcement on Monday on whether its planned lifting of coronavirus restrictions can go ahead as scheduled on June 21.Hopes of ending the curbs hung in the balance as data showed a further rise in cases of the rapidly spreading Delta variant, which was identified first in India.British tabloid The Sun on Friday reported Johnson is set to delay lockdown lifting to July 19.Meantime, oil prices held near multi-year highs on an improved outlook for worldwide fuel demand.Brent crude futures inched up 0.2per cent to US$72.85 per barrel, near their highest levels since May 2019.U.S. West Texas Intermediate (WTI) crude futures added 0.2per cent to US$71.05 per barrel, near their highest since October 2018.(Reporting by Hideyuki Sano; Editing by Kenneth Maxwell)It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "business and finance,investor,U.S.,Fed", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/business/world-stocks-near-record-high-as-investors-await-dovish-fed-act-15010590", "Source": "google"}