{"Type": "", "Time": "2021-06-14", "Headline": "Lee Sun Bin and more celebrities leave supportive comments on Lee Kwang Soo's Instagram post bidding farewell to 'Running Man' | allkpop", "Text": "421Actress Lee Sun Bin has left a supportive comment on Lee Kwang Soo's Instagram.On June 13 KST, SBS aired the last episode of 'Running Man' to feature Lee Kwang Soo as one of the permanent cast members. As seen previously, Lee Kwang Soo took to Instagram and left a heartfelt message to all his supporters through the years. Under the post, his girlfriend Lee Sun Bin left a series of emojis, applauding and praying for Lee Kwang Soo. In addition to Lee Sun Bin, other celebrities including Code Kunst, Lim Joo Hwan, and former SISTAR member Bora left supportive comments and reactions.Code Kunst wrote: \"I love you hyung\", and Bora shared: \"Thank you for giving me the unforgettable joy of running together as one team!! You're the best!!\"'Running Man' is a special program for both Lee Kwang Soo and Lee Sun Bin, as the two have acknowledged their love for one another in an episode back in 2016. In related news, Kim Jong Kook and other cast members shed tears as they exchanged their final words of farewell on today's episode.A post shared by 이광수 (@masijacoke850714) Log in to comment3the \"acknowledge their love for each other in 2016 on the program\" was just a funny thing. they werent dating back then lol2 more replies0This episode was a tough one to get through. Goodbye Running Man's Lee Kwangsoo. His character on the show was one of a kind. It wasn't just about what he did, but how he did it as well. Pure genius. Plus, he was truly blessed by the variety gods. He had great chemistry with the other RM members, especially the original cast that he spent 3,991 days with. Oh! I'm going to miss him. SHOW ALL COMMENTS\n SEND\n", "Section": "", "Writers": "", "URL": "https://www.allkpop.com/article/2021/06/lee-sun-bin-and-more-celebrities-leave-supportive-comments-on-lee-kwang-soos-instagram-post-bidding-farewell-to-running-man", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}