{"Type": "", "Time": "2021-06-14", "Headline": "Football: Wales come back to hold Switzerland in Euro 2020 opener, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BAKU (AFP) - A header from the towering Kieffer Moore allowed Wales to come from behind and draw 1-1 with Switzerland in their opening Euro 2020 Group A game in Baku on Saturday (June 12).He nodded home in the 74th minute to cancel out Breel Embolo's headed opener at the other end, which had come just after half-time.The draw comes after Italy beat Turkey 3-0 in the same group in the tournament's opening match in Rome on Friday.Wales coach Robert Page named Gareth Bale on the left wing as the Real Madrid attacker was one of three Wales survivors in the starting line-up from the 2016 semi-final loss to Portugal.Switzerland boss Vladimir Petkovic kept Benfica’s Haris Seferovic and Borussia Monchengladbach’s Embolo up front despite Mario Gavranovic scoring four times in two pre-tournament friendlies.“We’re not too disappointed with the draw, it could have been worse,” Bale told S4C. “They’re a top 10 team in the world, they’re there for a reason so we knew in parts we would have to suffer and work hard as a team.“The best thing for us was to go 1-0 down. We showed a lot of character, like we always do, to fight back, be brave, get on the ball and get the equaliser.”Switzerland striker Gavranovic had a potential winner chalked off by VAR for offside after he had edged ahead of Wales back four.“Over the past year I’ve hated VAR but by now, I love it now, fair play,” Wales midfielder Joe Allen said.With Petkovic naming a narrow back three, Bale and fellow winger Dan James found space out wide early on in front of an estimated 10,000 crowd as the local authorities allowed up to 50-percent capacity in the 69,000-seater Olympic Stadium.After a quarter of an hour played, James broke free down the left before finding the 1.95m Moore, who forced Swiss goalkeeper Yann Sommer to tip the ball over the bar.From the resulting corner, Moore rose highest again and clashed in the air with Manuel Akanji, which left the Cardiff forward playing the remainder of the game with red tape around his head.With Moore bandaged, the momentum swung towards Petkovic’s side and they dominated the remainder of the half but Seferovic wasted three chances.Moore returned after the interval despite completing just one of his team’s 101 passes in the first half.Petkovic’s Switzerland, who reached the last 16 five years ago, remained in control with captain Granit Xhaka, Liverpool’s Xherdan Shaqiri and Atalanta’s Remo Freuler dominating midfield.\n They broke the deadlock four minutes into the second half as Embolo sparked into life after a quiet opening 45 minutes.He broke down the middle and forced Danny Ward into a save, which gave Shaqiri a corner on the right flank.\nHe delivered to Embolo who headed home after beating Wales right-back Connor Roberts with ease for just his sixth goal in 44 international appearances.Shaqiri, who played just 14 Premier League games for Liverpool last season, was substituted on 66 minutes for the more defensive Denis Zakaria.Despite Petkovic’s pragmatic change in personnel, Wales equalised with 16 minutes remaining.Manchester United’s James played a corner short which ended up at Joe Morrell’s feet and he crossed into the box.Moore lost his marker and headed a well-placed effort passed the out-stretched Sommer to send the roughly 300 travelling Wales fans into a frenzy behind the opposite goal.James was then replaced by David Brooks as both sides searched for a winner.Seferovic was substituted for 31-year-old Gavranovic on 84 minutes and the Dinamo Zagreb forward thought he had claimed all three points for his side with his first touch.After edging past the Wales backline he beat Ward but his effort was chalked off for offside by VAR.Switzerland pressed on in five minutes of injury time and Gavranovic was denied another potential winner, this time Ward saving with his finger tips.Ramsey left the field for Ethan Ampadu during time added on and Page’s men held on for a point.Wales stay in Baku for their next game when they face Turkey on Wednesday, with Switzerland taking on Italy in Rome later that day.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-wales-come-back-to-hold-switzerland-in-euro-2020-opener", "Source": "google"}