{"Type": "", "Time": "2021-06-14", "Headline": "Toshiba drops 2 board member candidates ahead of shareholder meeting - Japan Today", "Text": "\nJapanToday\nHigashi-Azabu IS bldg, 4F\n\t\t\t\t\t1-8-1 Higashi-Azabu\n\t\t\t\t\tMinato-ku\n\t\t\t\t\tTokyo 106-0044\n\t\t\t\t\tJapan\n\t\t\t\t\tTel: +81 3 5561 7755\n\t\t\t\t\tFax: +81 3 5561 7756\nEmail: editor@japantoday.com\n©2021 GPlusMedia Inc.\nToshiba Corp on Sunday dropped the names of two board directors responsible for auditing from its list of candidates pending shareholder approval later in June after revelations of the industrial conglomerate's inappropriate handling of foreign activist investors.The rare change to the lineup announced in May comes after a group of independent lawyers concluded earlier this month Toshiba had colluded with the Japanese government to fend off activist foreign investors in the company's general shareholders' meeting last summer.The exclusion of the two -- Junji Ota, chairman of Toshiba's audit committee, and its member Takashi Yamauchi -- brings the total number of nominees to 11 from 13.In announcing the decision unanimously made at a board of directors meeting on Sunday, Toshiba said it has taken the independent panel's report \"seriously.\"\"We will take action to identify the root cause without delay, in an objective and transparent manner, including the participation of third parties,\" Toshiba said in a statement.The audit committee in February found no issue with the general shareholders' meeting in July 2020, in stark contrast with the outcome of the independent investigation that said it was not managed fairly.Two senior executives mentioned in the independent panel's report -- Corporate Senior Executive Vice President Masayasu Toyohara and Corporate Senior Vice President Masaharu Kamo --will retire on June 25, when the shareholders' meeting is scheduled to be held.Conducted by independent lawyers at the request of foreign investors, the independent investigation revealed Toshiba and the Ministry of Economy, Trade and Industry sought to block proposals by activist investors by applying pressure.Such investors include major Toshiba shareholder Singapore-based fund Effissimo Capital Management Pte Ltd and 3D Investment Partners Pte Ltd, also based in Singapore.Toshiba has seen a bigger presence of overseas investors in recent years as it accepted foreign funds to cope with its financial struggles.Since the report was released four outside directors have issued a statement saying that they will not support all candidates.3D Investment Partners, Toshiba's second-largest shareholder, has sent a letter to Toshiba's board chairman Osamu Nagayama and three other executives demanding that they resign, according to Reuters news agency.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberThat is not enough! Anyone that Toshiba wants is probably corrupt and rotten to the core like Toshiba or Nissan! Foreign investors need to step up their pressure and let their voice heard with money.But because Biden and Suga desperately need friends, somehow I expect the Toshiba debacle will dissipate ...You going down Toshiba!Since the report was released four outside directors have issued a statement saying that they will not support all candidates.Slight mistranslation. \"They will not support all candidates\" suggests that they will support some, but not all, of them. It should read \"will not support any\" (they will oppose all).Sell Toshiba to foreigners and reap massive tax revenues!Toshiba is actually listening to the gaijin complains.there's some hope.Use your Facebook account to login or register with JapanToday. By doing so, you will also receive an email inviting you to receive our news alerts.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberA mix of what's trending on our other sites\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t", "Section": "", "Writers": "", "URL": "https://japantoday.com/category/business/toshiba-drops-2-board-member-candidates-ahead-of-shareholder-meeting", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}