{"Type": "", "Time": "2021-06-14", "Headline": "Gojek cuts its commission by half till at least end-2022 in Singapore | The Star", "Text": "\n                    Monday, 14 Jun 2021\n                Gojek will also introduce a payout of Sg$3 to drivers who have to drive 3km or more to pick-up their passenger, among other measures. — KELVIN CHNG/ST PhotoSINGAPORE: Ride-hailing operator Gojek will halve the commission it receives from its drivers from June 21 till at least the end-2022, in order to help them increase their earnings.This means Gojek drivers will get to keep 90% of the fare from every trip, instead of 80%.The move comes after Grab, the dominant ride-hailing operator here, said it would seek to improve drivers' earnings by introducing a Sg$1 fare hike from this month.Gojek said on Monday (June 14) that the cut in commission, which it refers to as service fees, will help to lessen the impact of the Covid-19 pandemic on its drivers. It said a survey it conducted found that 50% of drivers want lower service fees for better earnings.Gojek will also introduce a payout of Sg$3 (RM9.30) to drivers who have to drive 3km or more to pick-up their passenger, among other measures.Its general manager, Lien Choong Luen, said: “The ongoing impact of the pandemic is a consistent worry for our driver-partners as they try to sustain their earnings amidst the uncertainty.”“These measures will have a profound impact on the livelihoods of our driver-partners, increasing their take-home earnings while giving them more flexibility by reducing their dependence on incentives,” he added.Gojek said the changes reflect a significant investment in Singapore, as it seeks to grow its market share here.It also said that a recent campaign to provide free or discounted rides to and from vaccination sites for all riders in Singapore has registered 117,500 rides so far.Several drivers have been calling for ride-hailing operators to cut their commissions to help drivers tide over the impact of the pandemic.While Grab has not announced a cut of its 20% commission rate, it said last month that it will permanently raise fares by Sg$1 (RM3.10) from this month to improve driver earnings amid rising fuel and maintenance costs.It will not collect commission on the additional Sg$1 from June 1 to June 30. This means drivers will get Sg$1 more for every ride they complete with Grab for a month. – The Straits Times (Singapore)/Asia News NetworkRelated stories:Indonesian BTS 'army' initiate fundraising for gojek drivers, goes viral with generous tipsBTS fans in Indonesia raised RM44,000 for food delivery ridersGojek to begin car-hailing services in Vietnam\n\nTopic:\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/tech/tech-news/2021/06/14/gojek-cuts-its-commission-by-half-till-at-least-end-2022-in-singapore", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}