{"Type": "", "Time": "2021-06-14", "Headline": "All Saints Home in Hougang undergoes cleaning after staff member tests positive for Covid-19, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - All Saints Home in Hougang underwent cleaning and disinfection after a staff member tested positive for Covid-19 last Saturday (June 12).The 23-year-old male Indian national, who works as a nursing aide, tested positive for the virus during the home's surveillance testing for staff members on June 11.An individual test was done on him the same day, with a negative result for Covid-19. But another test administered on June 12 was positive.\"His CT (cycle threshold) value was very high, which is indicative of a low viral load, and his serology test result is positive,\" said the Ministry of Health (MOH) on Sunday.\"He is likely to be shedding minute fragments of the virus RNA from a past infection, which is no longer transmissible and infective to others, but we have taken all necessary public health actions.\"A high CT value, typically above 30, suggests that it is not a recent infection and very likely even past the period when a person could infect others. A positive serology test suggests that the infection is not so recent. The worker had received his first dose of Covid-19 vaccine on March 10 and the second dose on March 31.He is currently warded at the National Centre for Infectious Diseases.Staff members and families of the residents have been notified, said All Saints Home in a media release on Sunday.Staff and residents at the home were tested for the virus. All test results were negative.Visitation to all nursing homes continues to be suspended till June 20.This follows the discovery of a Covid-19 cluster at the MINDSville @ Napiri home, a facility in Hougang for adults with intellectual disabilities. The suspension will reduce the risk of importing Covid-19 into such settings, and the risk of cross-transmission, said MOH on June 4.Visits to homes serving the elderly resumed last year on June 19, after being suspended for almost three months. That suspension came after a cluster of Covid-19 infections emerged at Lee Ah Mooi Old Age Home in Thomson, followed by another cluster of 15 cases in Acacia Home - a welfare home in Admiralty for the destitute.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/all-saints-home-undergoes-cleaning-after-staff-member-tests-positive-for-covid-19", "Source": "google"}