{"Type": "", "Time": "2021-06-14", "Headline": "SHN rules for travellers from Fiji tightened", "Text": "SINGAPORE — All travellers entering Singapore who have travel history in the past 21 days to Fiji are required to serve a 21-day Stay-Home Notice (SHN) at dedicated SHN facilities given the \"worsening\" COVID-19 situation in the South Pacific country, the Ministry of Health (MOH) said on Monday (14 June).Previously, these travellers were subject to a 21-day SHN consisting of 14-day SHN at dedicated SHN facilities and seven days at a place of residence or self-sourced accommodation.Travellers who have not completed their 14-day SHN at dedicated SHN facilities by 16 June 2021, 11.59pm, have to serve the additional seven days at their current dedicated SHN facility.Travellers who are currently serving their SHN at a place of residence or self-sourced accommodation have to complete their 21-day SHN at their current location to minimise risk of transmission.Meanwhile, given the \"improving situation in Israel\", travellers from the Middle Eastern country who have remained in Israel in the last 21 days before arrival in Singapore from 16 Jun 2021, 11.59pm, will be subject to a 21-day SHN comprising 14-day SHN at dedicated SHN facilities and seven days at a place of residence or self-sourced accommodation, the MOH said.Previously, all travellers from Israel are subject to a 21-day SHN at dedicated SHN facilities.All travellers serving 21-day SHN will undergo COVID-19 polymerase chain reaction tests on arrival, on the 14th day of their SHN, and before the end of their 21-day SHN period.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:COVID: Social gathering size can increase to 5 per group from 14 June – MTFWork-from-home remains default arrangement in Singapore's Phase 3 (HA)Man, 60, charged over stabbing at Choa Chu Kang void deckWith its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.China on Monday accused the G7 of \"political manipulation\" after it criticised Beijing over its human rights record in Xinjiang and Hong Kong.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.The executive condo is an alluring property in Singapore because it serves ‘sandwich class’ Singaporeans. Whether it’s EC grant, EC income ceiling or resale levy, read everything you need to know about executive condos here.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.Protect yourself from Mosquitoes the moment you turn it on. These are selling fast, here is how it works.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Canberra MRT opened in November 2019, and in the immediate quarter after (Q1 2020), property prices in District 27 jumped by over 6% QoQ. Read about what Canberra has to offer, as well as BTO and Condo projects in the area.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.You may be surprised by how pressure washing can transform your home. See for yourself. Look for nearby pressure washing services.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.Several hundred people gathered in London, Ontario on Saturday to pay homage to a Muslim family deliberately mowed down by the driver of a pick-up truck, in an attack that has shocked Canadians and which Prime Minister Justin Trudeau denounced as \"terrorist.\"Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.The Ministry of Health (MOH) on Sunday (13 June) reported the detection of 13 new cases of COVID-19 infection in Singapore, taking the country's total case count to 62,276.President Recep Tayyip Erdogan on Sunday said Turkey would be the \"only reliable\" country left to stabilise Afghanistan after the US pulls out its troops, indicating Washington could rely on its NATO ally.The trial of deposed Myanmar leader Aung San Suu Kyi was expected to hear its first testimony Monday, more than four months after a military coup ousted her government.Last chance to save big on thousands of finds. Don’t miss out!A 60-year-old man was charged on Monday (14 June) for allegedly stabbing another man at the void deck of a Choa Chu Kang HDB block.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Novak Djokovic claimed a 19th Grand Slam title and became the first man in 52 years to win all four majors twice when he came from two sets down to beat Stefanos Tsitsipas in a gripping French Open final on Sunday.This new car cloth can easily remove all the car scratches and dents from your car.Foreign forces should hold 'no hope' of keeping a military presence in Afghanistan after the US and NATO withdraw troops, the Taliban said Saturday, warning the security of embassies and airports would be the responsibility of Afghans.Most Singaporeans can't imagine owning an HDB flat without using their CPF money to pay for it.  While some complain about how their CPF money is “locked” up, the compulsory savings scheme is no doubt a major factor that has helped Singaporeans achieve such a high homeownership rate.  On top of using CPF money, the CPF Housing Grant, or HDB Grant, is another important policy that is helping Singaporeans cope with the high cost of home purchase.Dressed in a black turban and long religious coat, Ebrahim Raisi casts himself as an austere figure and an anti-corruption champion of the poor ahead of Iran's presidential election.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/shn-rules-travellers-fiji-tightened-israel-eased-073813671.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}