{"Type": "", "Time": "2021-06-14", "Headline": "Park Bo Young And Seo In Guk Enjoy A Peaceful Date In Jeju Island In “Doom At Your Service” | Soompi", "Text": "On June 14, tvN released stills of Park Bo Young and Seo In Guk from the upcoming episode of “Doom at Your Service.”The fantasy romance is about an ordinary woman named Tak Dong Kyung (Park Bo Young), who calls for ruin (myul mang) upon the world when she finds out she only has 100 days to live. Instead, she gets Myul Mang (Seo In Guk), the mysterious god of death and destruction, who offers her a dangerous contact.In the previous episode, Tak Dong Kyung chose death in accordance with the terms of her contract with Myul Mang, which says that someone she loves will die instead of her if she doesn’t wish for ruin on the world before her 100 days are up. But her emotions finally burst forth as she tearfully declared, “I want to live.” Myul Mang admitted, “I want to be alive too. That’s why I want to die with you.” The two shared a desperate embrace, and viewers are eager to find out what will happen next.The newly released stills depict Tak Dong Kyung and Myul Mang’s lovely date in Jeju Island. They walk together while holding hands as if they are vowing to never let go of each other again. The two also enjoy a sweet moment at a café like other couples. They look happier than ever, and Myul Mang especially can’t look away from Tak Dong Kyung.The drama’s production team shared, “The episode airing on June 14 will portray Tak Dong Kyung and Myul Mang’s romance that has deepened with love and trust. Their affectionate sincerity exploded as they came to a crossroad, so please tune in to see what kind of choices they make.”This episode of “Doom at Your Service” will air on June 14 at 9 p.m. KST.Check out the drama below! Watch Now Source (1)", "Section": "", "Writers": "", "URL": "https://www.soompi.com/article/1474562wpp/park-bo-young-and-seo-in-guk-enjoy-a-peaceful-date-in-jeju-island-in-doom-at-your-service", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}