{"Type": "", "Time": "2021-06-14", "Headline": "Ardern says NZ mosque attack film should focus on Muslim community not her", "Text": "\n        Show Ad\n      By Praveen MenonWELLINGTON (Reuters) - Prime Minister Jacinda Ardern said on Monday that New Zealand's Muslim community should be the focus of any film about the Christchurch mosque attacks after some people raised objections to a movie focussing on her response to the bloodshed.A film called \"They Are Us\" is being planned about the attacks on two mosques by a white supremacist gunman on March 15, 2019, in which 51 people were killed, the Hollywood Reporter said last week.The magazine described the film as an \"inspirational story\" about Ardern's response to the violence.Ardern's office said last week she and the government had no involvement with the film. Asked about it at a news conference, she said the Muslim community should be at the centre of any film about the shootings, not her.\"This is very raw event for New Zealand and even more so for the community that experienced it,\" Ardern said.\"I agree that there are stories that at some point should be told from March 15. But they are the stories from our Muslim community so they need to be at the centre of that. I don't consider mine to be one of the stories that needs to be told,\" she said.She said, however, it was not for her to say whether a project should go ahead or not.The film's title is drawn from Ardern's words on the day of the shootings. The 40-year-old leader's compassionate response united her shocked country and was praised globally.New Zealander Andrew Niccol would write and direct the film, the Hollywood Reporter said. It quoted him as saying it was not so much about the attacks but Ardern's handling of it.But some Muslims questioned the plan to make a film when the pain of victims' families, friends and the wider community was still so raw. They also questioned the plan to focus the film on the prime minister and not the victims.Muslim community advocate Guled Mire told the 1 NEWS network that he thought the film was \"distasteful\".\"It completely feeds into this white saviour mentality,\" he said.Armed with high-capacity semi-automatic weapons, Australian Brenton Tarrant killed the 51 people and injured dozens when he opened fire in the two mosques during Friday prayers in Christchurch.Tarrant was last year sentenced to life in prison without parole.(Reporting by Praveen Menon; Editing by Robert Birsel)Critics say the film project is poorly timed and pushes a \"white saviour\" narrative.Joe Biden and Vladimir Putin have an opportunity this week to push for deep cuts in their nuclear arsenals, a step which could help persuade China to back away from an arms race, the head of a Nobel Peace Prize-winning campaign group said on Monday.  Despite well-publicised friction between the U.S. and Russian leaders meeting on Wednesday in Geneva, Beatrice Fihn, head of the International Campaign to Abolish Nuclear Weapons (ICAN), said she believed it was possible that it could mark a \"turning point\" and yield a pledge for new nuclear arms talks.  In February, the United States and Russia extended the New START arms control treaty for five years, preserving the last treaty limiting deployments of the world's two largest strategic nuclear arsenals.Cut your monthly payment while rates are low. Free Quotes. Wont affect your credit. Calculate New Payment. (1.97% APR)Following a backlash against Cannes virtual market package They Are Us, one of the producers of the project has exited and one of the subjects of the movie, New Zealand Prime Minister Jacinda Ardern, has criticized the project. Since being announced on Thursday, the Rose Byrne-led film about Ardern’s response to the 2019 Christchurch mosques […]Image Source: Getty / Thitikarn Paothongthai Nearly every student in America has been negatively affected by the coronavirus pandemic, but the impact on LGBTQ+ children has not only been more severe but has proven to be more complicated as well. There are nearly two million LGBTQ+ youth in middle school and high school in the United States.Philippa Campbell, one of the producers on “They Are Us,” a new drama about the aftermath of the Christchurch attacks on New Zealand’s Muslim community, has quit the project after a media backlash. “I have listened to the concerns raised over recent days and I have heard the strength of people’s views. I now agree […]Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.Microsoft on Sunday showcased 30 upcoming games and said most of those titles will be available on its monthly subscription service, Xbox Game Pass.  The company said it would launch https://www.youtube.com/watch?v=1YnVzOA2wNs&ab_channel=Xbox new games on Game Pass every month through the end of the year, including titles such as PC strategy series \"Age of Empires IV\" and racing game \"Forza Horizon 5.\"  One of Microsoft's big-ticket games, \"Halo Infinite,\" is now set for a holiday launch this year after being delayed due to the challenge of developers being stuck at home during coronavirus restrictions.With hot girl summer upon us, thee founder herself, Megan Thee Stallion, recently made her red carpet debut with a boyfriend. The rapper is dating Pardison Fontaine, a.k.a. Pardi, who she brought as her date to the 2021 iHeartRadio Music Awards in May.Johnson infuriated after Macron suggested Northern Ireland not part of UK Looming sausage trade war makes G7 barbecue sizzle G7 leaders called 'hypocrites' for attending outdoor events Coronavirus latest news: We don’t want to ‘yo-yo' in and out of measures, says Raab Emmanuel Macron has said he wants Britain to respect its post-Brexit trade agreement with the European Union. The French President made the comments at a G7 press conference after responding to questions about the \"sausage war\" traAmerica's Top Dietician, Dr. Kellyann, explains the connection between this one fruit and your battle against agingThe top two executives at Lordstown Motors have resigned as problems at the Ohio electric truck startup mount.  CEO Steve Burns and Chief Financial Officer Julio Rodriguez stepped down, the company said Monday, sending shares already down 40% this year tumbling more than 17%.  The departures were announced on the same day that Lordstown responded to a scathing March report from the short-selling firm Hindenburg Research which questioned the number of preorders the company claimed to have received for its marquee Endurance vehicle.Beats by Dre launches its first product that is supported by both FindMy in iOS and Find My Device on Android.Pouring through the 2021 college football schedule, here are some of the games that will be fascinating to study for the 2022 NFL draft.So mad that I just learned this...Today’s headlines: China's Mars rover took a selfie, Everything from Microsoft’s Xbox showcase at E3 2021, and ‘Guardians of the Galaxy’ is your next Marvel videogame.Small transfers of bitcoin to El Salvador jumped over four-fold in May from a year ago but still represent a small amount when compared to remittances sent in dollars, data shared with Reuters showed.  The Central American country last week became the first country to adopt bitcoin as legal tender, with President Nayib Bukele touting the cryptocurrency's potential as a remittance currency for Salvadorans overseas.  Monthly bitcoin transfers of under $1,000 - a proxy for money sent to the country from Salvadorans working abroad - totalled $1.7 million in May compared to $424,000 year earlier, U.S. crypto researcher Chainalysis found.Why a movie about the Christchurch shootings is stirring controversy in New ZealandGet a $200 checking bonus when you apply for an eligible checking account online in minutes with qualifying direct deposits. Learn more.Mike & Molly alum Reno Wilson, who currently stars in NBC’s Good Girls, has signed with A3 Artists Agency for representation. Wilson is maybe best known for his role as Officer Carl McMillan on the comedy series Mike & Molly, alongside Melissa McCarthy and Billy Gardell, which aired for six seasons on CBS. He currently […]Comparisons have been made between the new channel and right-wing US channel Fox News.Costume designer Mitchell Travers shares how he achieved the grand scale of the new movie musical’s costumes, and bringing cultural authenticity to the big screen.Board certified internal medicine and obesity specialist reveals what happens after drinking just 1 diet soda. Click here to watch video.Who says you need a barbecue to enjoy delicious grilled meals this summer?Brianna Turner (Phoenix Mercury) with an Assist vs. New York Liberty, 06/13/2021The Zacks Analyst Blog Highlights: National Vision, DaVita, Elanco Animal Health, Henry Schein and Phibro Animal Health", "Section": "", "Writers": "", "URL": "https://www.yahoo.com/news/ardern-says-nz-mosque-attack-050316602.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}