{"Type": "", "Time": "2021-06-14", "Headline": "Euro 2020: Netherlands 3-2 Ukraine full match reaction & quotes: Defiant De Boer vows second-half struggles 'will not happen again' | Goal.com", "Text": "Netherlands manager Frank de Boer has vowed that his side will not concede another big lead under his watch, after Denzel Dumfries' maiden goal for his country rescued victory against Ukraine in their Euro 2020 opener.The PSV Eindhoven man bagged an 85th minute winner after finishes for Andriy Yarmolenko and Roman Yaremchuk had cancelled out Georginio Wijnaldum and Wout Weghorst's earlier efforts.De Boer's blushes were excused by the late intervention, but coming only weeks after a similar spate of concessions against Scotland, the 51-year-old has now sought to assure supporters that it will not become a recurring trait of his side's performances.“I saw a Dutch team that played very balanced and dominant,\" the former Ajax and Atlanta United boss told his post-match press conference. \"We can be proud.\"We analyze such games almost to the death. We want to do everything we can to ensure that something like this [comeback] doesn't happen again.\"Playing in front of a vocal home crowd at Johan Cruyff Arena, the Netherlands often seemed buoyed by the strength of their support, even at limited capacity, with several players quick to highlight the impact.Wolfsburg striker Weghorst, who snagged the Oranje's second, was one who delighted in the response, stating: “It was a great thing.\"I'm glad there were 16,000 people in the stadium today. I've seen a lot of orange. I am happy that we could celebrate the three points together with the fans. That was great.\"Matchwinner Dumfries agreed, adding:  \"It's great to hear the fans in the stadium again.\"The Dutch's struggles- which echoed their aforementioned 2-2 friendly draw with Scotland earlier this month - continues to mark out the fragile nature of De Boer's tactical formations, having eschewed the 4-3-3 his players have professed to be more comfortable with before for a 3-5-2.Nevertheless, there was little criticism post-match, with Dumfries adding on the madcap finale: “It was a great moment, a great relief. We believed in ourselves. I knew we would still get chances.\"Weghorst's contribution to the game was also hailed by his team-mates, with defender Stefan de Vrij quick to praise his ethic throughout.“He worked very hard for the team and held balls when we were under pressure,\" the Inter star stated. \"He defended very well and helped his colleagues. I am very happy with him.”The Netherlands now turn to their next Group C clash, welcoming fellow matchwinners Austria to Amsterdam on June 17, knowing that victory will likely ensure their progression to the knockout stages.They will be wary of a time who ultimately ran out comfortable victors over North Macedonia in the end, but will likely take confidence from their high-energy showing on home turf as they look to end their seven-year tournament exodus with an impressive comeback run.", "Section": "", "Writers": "", "URL": "https://www.goal.com/en/news/euro-2020-netherlands-3-2-ukraine-full-match-reaction-quotes/14rdyzgbpecqf1cg0zmnwcqpd2", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}