{"Type": "", "Time": "2021-06-14", "Headline": "New Covid-19 cluster at Bukit Merah View Market and Food Centre; visitors from May 25 to June 12 to get free swab tests, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - All visitors who went to the 115 Bukit Merah View Market and Food Centre between May 25 and June 12 will be offered free Covid-19 tests, after four more cases were linked to form a new cluster there.The Ministry of Health (MOH) on Sunday (June 13) said all staff and tenants who had been working at the market from May 25 have been quarantined, and will be swabbed during quarantine.In addition, all staff and tenants who had been working in 116 Bukit Merah View from May 25 will be tested for Covid-19 as well, \"to disrupt any wider, undetected community transmission\", said MOH.Members of the public who visited shops at 116 Bukit Merah View between May 25 and June 12 will also be offered free Covid-19 testing.The 115 Bukit Merah View Market and Food Centre cluster now has six cases, after four cases were linked to it on Sunday.MOH said: \"Our epidemiological investigations have found that there is likely ongoing transmission among individuals who work at the location.\"The ministry urged all visitors to 115 and 116 Bukit Merah View between May 25 and June 12 to monitor their health closely, and minimise social interactions as far as possible, for 14 days from their date of visit.All 182 stalls in the market and hawker centre have been closed from Sunday till Tuesday for cleaning, after Covid-19 cases were detected there.The four new cases from the market comprise a 50-year-old man who is a conservancy worker, a 72-year-old man who works at a sundry shop, a 67-year-old woman who works as a food stall vendor, and a 65-year-old male food stall vendor. All four are close contacts of a 74-year-old man who was fully vaccinated and works at a sundry store in the market.Only the 72-year-old man developed symptoms of Covid-19 – he came down with a runny nose on Sunday. The remaining three were asymptomatic.They were among a total of 10 Covid-19 cases in the community reported on Sunday.Two are currently unlinked, while the remaining eight Covid-19 cases in the community are linked to earlier cases.Five of the linked cases had been quarantined earlier, while the remaining three were detected through surveillance.A 27-year-old engineer from India who tested positive for Covid-19 as part of routine testing was one of the two unlinked cases on Sunday. The engineer, who works for local firm Ecoxplore, had been tested for the disease as part of rostered routine testing (RRT) on June 10, and subsequently developed a fever the same day. MOH said that his pooled RRT test result came back positive for the disease on June 11. An individual test was then administered, which came back positive for infection on June 12. His serology test result is negative, meaning he did not have a past infection.The second unlinked case from Sunday is a 23-year-old man from India who works as a nursing aide at All Saints Home in Hougang. He is asymptomatic, and was detected when he was tested for the coronavirus on June 11 as part of the nursing home’s surveillance testing for staff. His pooled test result came back positive for Covid-19 that day, and he was administered an individual test on June 11 as well. The result for this individual test result came back negative for the disease.But another test on June 12 came back positive for Covid-19 infection, said MOH, adding: “His CT value was very high, which is indicative of a low viral load, and his serology test result is positive.” The ministry said he is likely to be shedding minute fragments of the virus from a past infection which are no longer transmissible and infective to others. The man received his first dose of the Covid-19 vaccine on March 10, and the second dose on March 31.Of the eight linked cases, one quarantined case was linked to a 57-year-old woman who works as a promoter at Ion Orchard mall. Two of the three cases detected through surveillance are household contacts of the Ecoxplore engineer. The other case is linked to a 68-year-old male Singaporean who works as a landscape gardener at a firm called Amozonia. The gardener was confirmed to have Covid-19 on June 12. There were also three imported cases who had been placed on stay-home notice on arrival in Singapore. Two of these cases are Singaporeans or permanent residents.No new cases from workers' dormitories were reported.Singapore's total number of Covid-19 cases is now at 62,276.Read the full MOH press release here.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/new-covid-19-cluster-at-bukit-merah-view-market-and-food-centre-visitors-from-may-25-to", "Source": "google"}