{"Type": "", "Time": "2021-06-14", "Headline": "13 months' jail for former part-time taxi driver who molested female passenger, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A former part-time taxi driver was sentenced on Monday (June 14) to 13 months' jail for molesting a female passenger in 2019.In April this year, District Judge John Ng convicted Haji Mohamed Yusoof A. P. M. Adam, now 56, of one count of molestation following a trial.The 30-year-old victim cannot be named due to a gag order to protect her identity.Lawyer Raphael Louis, who represents Yusoof, earlier told The Straits Times that his client is a truck driver who was a part-time taxi driver at the time of the offence.He added that Yusoof is no longer holding that part-time job.During the trial, the court heard that after a drinking session with friends, the woman boarded the taxi on Jan 5, 2019, before she fell asleep in the rear seat.Deputy Public Prosecutor (DPP) Benedict Chan stated in his submissions that Yusoof molested the victim after the taxi arrived at a carpark in Lorong Ah Soo near Upper Paya Lebar Road at around 5.20am. The DPP added that the woman woke up and shouted at Yusoof after feeling his hands on her body.Yusoof then returned to the driver's seat and dropped her off at her intended destination a short distance away, said DPP Chan.The woman later lodged a police report, the court heard.Yusoof claimed that he did not touch the victim, saying he tried to wake her up by calling out to her after the taxi reached the carpark.He also stated that he later alighted from the vehicle, opened the rear passenger door and called out to her again. She then woke up, he claimed.In delivering his verdict in April, Judge Ng noted that Yusoof and the woman had given different accounts of the incident. There were also no other witnesses present.The judge found the woman to be a truthful witness and that her evidence was cogent and reliable. He, however, found that Yusoof was evasive.On Monday, the court heard that Yusoof intends to appeal against his conviction and sentence. His bail has been set at $10,000.Offenders convicted of molestation can be jailed for up to two years and fined or caned. Yusoof cannot be caned because he is over 50 years old.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/13-months-jail-for-former-part-time-taxi-driver-who-molested-female-passenger", "Source": "google"}