{"Type": "", "Time": "2021-06-14", "Headline": "Brexit Tensions Are A Test For Europe, Says French Minister Clement Beaune", "Text": "Clement Beaune says tension between UK and European Union over Brexit is a test for Europe.French European Affairs junior minister Clement Beaune said on Monday that current tensions over Brexit between British Prime Minister Boris Johnson's government and the European Union were \"a test\" for Europe.The tensions between Britain and the EU threatened to overshadow the Group of Seven summit's conclusion on Sunday, with London accusing France of \"offensive\" remarks that Northern Ireland was not part of the United Kingdom.\"Mr Johnson thinks that you can sign deals with the Europeans and not respect them and that Europe will not react. It is a test for Europe,\" Beaune told Europe 1 radio.\"I am telling the British people, (Brexit) commitments must be respected... If it is not the case, retaliatory measures could be taken,\" Beaune added.During talks with Emmanuel Macron at the G7 summit, Johnson queried how the French president would react if Toulouse sausages could not be sold in Paris markets, echoing London's accusation that the EU is preventing sales of British chilled meats in Northern Ireland.\"In Northern Ireland there are sausage import problems... Why? Because when you leave the European Union, you have necessarily some (trade) barriers,\" Beaune said.\"I cannot tell the French or the Europeans that Britain can export via (EU member) Ireland some products such as meat without any control... That is what it is all about. Brexit has consequences.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)Track Latest News Live on NDTV.com and get news updates from India and around the world. Watch Live News:Follow Us:................................ Advertisement ................................", "Section": "", "Writers": "", "URL": "https://www.ndtv.com/world-news/brexit-tensions-are-a-test-for-europe-says-french-minister-clement-beaune-2463428", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}