{"Type": "Asia", "Time": "2021-06-14", "Headline": "Children pay the price in Pakistan's mass HIV outbreak", "Text": "RATO DERO: Since his son was diagnosed with HIV during a mass outbreak in Pakistan among babies and children, hard-up Shahzado Shar has often been forced to choose between food and medicine.His five-year-old was one of hundreds who tested positive in 2019 after a whistleblower doctor uncovered a scandal involving the re-use of needles in southern Sindh province.The number of patients quickly swelled and two years later the figure stands at more than 1,500, according to data from the provincial health ministry.Pakistan's largest HIV testing and treatment centre was established in the rural town of Rota Dero in the wake of the disaster, dishing out life-saving anti-retroviral drugs.But affected families must cover further costs arising from the illness themselves.\"They tell us to go for further tests in private hospitals, but we don't have sufficient money,\" Shar told AFP, describing how his son continues to suffer from regular fever, abdominal and kidney pain.Around 30 other children are also HIV positive in their small village of Subhani Shar, just a few kilometres from Rato Dero.Pakistan's public hospitals, located largely in cities, are often chaotic and inefficient, leaving rural families to rely on private clinics they can seldom afford that are often stuffed with unlicensed doctors.At least 50 children have died since they were diagnosed, said paediatric specialist Fatima Mir, from Aga Khan University in Karachi, who has analysed the data - though she had expected the number to be higher given the malnutrition and poverty among families in the area.Authorities blamed a single physician - a popular child specialist in Rato Dero - for causing the outbreak.Muzaffar Ghangro is currently out on bail, with court hearings repeatedly pushed back, much to the anger of many families.He denies the charges laid against him, saying other doctors have pinned the outbreak on him because of his successful practice.'RUTHLESS' MALPRACTICEPoor infection control is rife across impoverished Pakistan, where doctors often re-use equipment to cut costs - out of necessity or greed.The doctor who first exposed Sindh's dirty needle scandal says little has changed since 2019.\"Things are as bad as they were at the time of the outbreak,\" said whistleblower Imran Akbar Arbani, who called malpractice in the country \"ruthless\".Arbani took his data on the outbreak to local media after discovering an alarming number of babies with HIV in Rato Dero, where he has a private clinic.He said authorities were quick to react at the time, but that discipline has since slipped.\"In the first three months, quacks and unauthorised medical practitioners were banned and their clinics were sealed, but they obtained clearance later on,\" he said.Rafiq Khanani, a doctor and the president of the Infectious Diseases Society of Pakistan, said regulations were ineffective or routinely ignored.\"The regulatory departments exist only on documents and in offices... practically, they are ineffective.\"In the wake of the scandal, the government banned the import of conventional syringes, insisting only on single-use auto-lock needles which cannot be re-deployed.But a Sindh health official who did not want to be named told AFP that many doctors were circumventing the ban and still buying the cheaper models.'WE ARE DOOMED'At Rato Dero's HIV testing and treatment centre, patients sit facing a television screen churning out healthcare advice in the local Sindhi language.A frail 20-year-old man sits silently with his father, waiting for the results of rapid HIV test.Paediatric specialist Fatima Mir said successful mass testing helped to identify victims of the crisis and slow down onward transmissions.But Pakistan now has to go beyond the vital antiretrovirals and offer more rounded care to patients, Ayesha Isani Majeed, the head of the government's National AIDS Control Programme, told AFP.As the sun sets in Subhani Shar, a mother sits with her daughter draped across her lap, suffering another bout of fever.Hakima Shar says she sometimes forgets to administer the drugs - which can control the virus and help prevent onward transmission - to her four-year-old, who often refuses to take them.\"We are very poor ... I wake up with the sun and start working, so who else will give her the medicine regularly?\" said the 25-year-old mother, who has also contracted the virus.Many families had never heard of HIV, but now it dominates their lives.\"The government doesn't provide us with antibiotics or multivitamins and we can't afford to buy them ourselves,\" she said.\"We are doomed.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Pakistan,HIV,children", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/children-hiv-outbreak-scandal-pakistan-sindh-province-doctor-15010776", "Source": "google"}