{"Type": "", "Time": "2021-06-14", "Headline": "Engineer, 27, among two unlinked cases, Latest Singapore News - The New Paper", "Text": "A 27-year-old engineer from India was one of two unlinked Covid-19 cases announced yesterday by the Ministry of Health (MOH).The two unlinked cases, detected through surveillance testing, were among the 10 confirmed cases in the community yesterday.The engineer, who works for local firm Ecoxplore, was tested as part of rostered routine testing (RRT) last Thursday, and developed a fever on the same day.MOH said his pooled RRT result came back positive for the disease on Friday. An individual test was then administered, which came back positive for infection on Saturday. His serology test result was negative.Two of his household members - two Singaporean women aged 19 and 39, who are related - also tested positive.The second unlinked case from yesterday is a 23-year-old man from India who works as a nursing aide at All Saints Home in Hougang.He is asymptomatic and was tested on Friday as part of the nursing home's surveillance testing for staff.He was administered an individual test the same day after his pooled test result came back positive. The result came back negative for the disease, but another test on Saturday came back positive for Covid-19.\"His Ct value was very high, which is indicative of a low viral load, and his serology test result is positive,\" said MOH.The ministry added he is likely to be shedding minute fragments of the virus from a past infection, which are no longer transmissible and infective to others.The man received his first dose of Covid-19 vaccine on March 10 and the second dose on March 31.Four of the new linked cases worked at Bukit Merah View Market and Food Centre, which was announced as a new cluster yesterday.They had already been placed on quarantine when they tested positive for Covid-19.The fifth linked case is a 59-year-old part-time cleaner at Crystal Lodge.She had already been quarantined as she was identified as a close contact of a 57-year-old woman who works as a promoter at Ion Orchard and who was confirmed with the virus last Thursday.A 66-year-old Singaporean man was the final linked case. He is a family member of a 68-year-old landscape gardener at a company called Amozonia Landscape, who was confirmed to have Covid-19 on Saturday. - THE STRAITS TIMES13 New cases34 Deaths8 Community, linked130 In hospital2 Community, unlinked62276 Total cases3 Imported61854 Total recoveredGet The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/engineer-27-among-two-unlinked-cases", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}