{"Type": "", "Time": "2021-06-14", "Headline": "Covid-19 cases in Jakarta surged 50% in past week amid rise in Delta variant, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.JAKARTA - Jakarta governor Anies Baswedan has warned that the Indonesian capital may return to a strict restriction regime as coronavirus cases surged 50 per cent in the past week amid a rise of infections of the Delta variant.Active cases in Jakarta rose to 17,400 cases on Sunday (June 13) from 11,500 on June 6.\"The capital is in a state that needs extra attention. If the current situation gets out of hand, we would enter an emergency phase, and if that happened, we would have to take drastic steps like we did in September and February. We do not want that to recur,\" Mr Anies said in a statement on Monday morning.The Delta variant, first detected in India, has started to dominate cases in Indonesian cities, with Health Minister Budi Gunadi Sadikin confirming that Covid-19 cases in Jakarta, Kudus (Central Java province), and Bangkalan (East Java province) are dominated by the Delta variant, based on genome sequencing tests.Bed occupancy rate for isolation wards in Jakarta reserved to treat Covid-19 patients also increased to 75 per cent on Sunday, from 45 per cent a week ago.One out of four Covid-19 patients in Jakarta, however comes from outside the city, mostly the surrounding satellite towns.Mr Anies urged residents to strictly comply with health protocols in order to avoid another round of strict social distancing restrictions.Currently, dining in eateries is allowed with limited capacity, and non-essential staff are partially required to work from home.The governor also stressed that the positivity rate in Jakarta increased to 17 per cent on Sunday, from 9 per cent the previous week.The positivity rate indicates the percentage of positive Covid-19 cases detected out of the total tests conducted.The threshold set by the World Health Organisation (WHO) for adequate testing is a 5 per cent positivity rate.Mr Anies pointed out that the testing rate in Jakarta rose to eight times what the World Health Organisation recommended, from four times in the previous week.He ordered all his personnel on Sunday night to take stricter measures and to step up enforcement of the health protocols on individuals as well as in places.To ensure that residents comply with the strict health protocols, President Joko Widodo on Monday decided to beef up the deployment of military and police officers across 7,000 sub-regencies in the country.Indonesia’s 34 provinces are made up of more than 500 regencies and cities, which in turn consist of 7,000 sub-regencies.  Mr Widodo also decided to speed up daily vaccination rate from the current 500,000 doses a day to 700,000 later this month and then one million next month.People living in Covid-19 red zones – places with hospital bed occupancy ratio exceeding 60 per cent – will get priority in vaccination, said Mr Budi, following a meeting with the president.  In addition, places of worship in the Covid-19 red zones will be closed for the next two weeks.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/covid-19-cases-in-jakarta-surge-50-in-past-week-amid-rise-in-delta-variant", "Source": "google"}