{"Type": "", "Time": "2021-06-14", "Headline": "China is quite right – the G7 countries cannot dictate to the rest of the world | The Independent", "Text": "The worry is that a G7 meeting encourages the illusion that the west is still in charge. It is not, writes Hamish McRaeFind your bookmarks in your Independent Premium section, under my profileUltimately Europe cannot side with president Xi Jinping’s China against the US but it will seek to distance itself from some assets of American policy as far as it canChina was less than delighted by the G7 meeting and you can see why. “The days when global decisions were dictated by a small group of countries are long gone,” the Chinese embassy in London said. “We always believe that countries, big or small, strong or weak, poor or rich, are equals, and that world affairs should be handled through consultation by all countries.” China has a point. The G7 does account for only around 40 per cent of global GDP, though with the other invitees including India that nudges up to about half. But China is still the world’s most populous country (though soon to be overtaken by India) and is likely by the end of this decade to become the world’s largest economy, passing the US. And Russia, also not at the summit, controls the world’s largest landmass. As for the bit about equals – well, that is what diplomats are paid to say, isn’t it?This G7 meeting will be remembered as one more step towards a bipolar world. There will be a sphere of American influence and there will be one of Chinese influence. At worse this heralds a new cold war, akin to that between the west and Russia. At best it is the start of a couple of decades of more explicit competition between China and the US, but with an adequate working relationship between the two giants.Join thought-provoking conversations, follow other Independent readers and see their repliesUltimately Europe cannot side with president Xi Jinping’s China against the US but it will seek to distance itself from some assets of American policy as far as it canGettyWant to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.Log inNew to The Independent?Want an ad-free experience?Subscribe to Independent Premium.", "Section": "", "Writers": "", "URL": "https://www.independent.co.uk/independentpremium/voices/china-europe-g7-belt-and-road-global-infrasctructure-b1865063.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}