{"Type": "", "Time": "2021-06-14", "Headline": "People's Association withdraws offer to meet couple over wedding photo incident, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The People's Association (PA) has withdrawn its offer to meet a Malay/Muslim couple whose photo was used as a standee for Hari Raya Aidilfitri decorations without permission, citing disagreements with them over the purpose of the meeting and how they had characterised the incident.Communications specialist Sarah Bagharib, 30, had posted on social media on May 28 about the inappropriate use of her wedding photograph at a Housing Board estate in Radin Mas constituency.This drew a public apology from the PA and an offer from the government agency to meet her and her husband, Mr Razif Abdullah, to apologise in person for the distress caused by its mistakes.However, in a Facebook post on Monday (June 14), the PA, which oversees various grassroots groups, said it saw no point in going ahead with the meeting, citing Ms Sarah's recent comments on the matter.The PA said Ms Sarah had shared claims that the incident \"perpetuate(s) the racist culture\" and was \"racist\".The agency rejected these claims, saying: \"While the error was culturally insensitive, it was certainly not racist. It is not right to raise the allegation of racism, without basis, to stoke emotions and sentiments.\"It also noted that she had made a public call for messages and suggestions ahead of the meeting.\"We find this odd. We do not see why our meeting should be appropriated as a platform for her to funnel the views and comments of persons unrelated to the incident,\" the PA added.\"All these lead us to believe her purpose in agreeing to meet us has gone far beyond the Radin Mas incident. We therefore see no point in proceeding with the meeting.\"The couple's wedding photo had been used by a vendor to create a standee alongside a decorative platform and banner depicting Radin Mas MP Melvin Yong and his Hari Raya Aidilfitri greetings to residents.The PA had explained in an earlier statement that its Radin Mas constituency office had engaged a vendor, Warabi Enterprise (Art Studio), to design and put up Hari Raya Aidilfitri decorations at the Tiong Bahru Orchid estate.The vendor came up with the concept and design, and downloaded and used the photo from an online source for the standee.After Ms Sarah drew attention to the matter, the PA removed the standee, and offered to meet the couple.On Monday, the PA said it had wanted to clarify its position, elaborate on the steps it had taken to prevent such incidents from recurring, and hear her suggestions of how it might improve at the meeting.It also said it had, over e-mail, explained to Ms Sarah that it values racial and religious harmony in Singapore.The PA also made references to two Instagram Stories Ms Sarah had posted recently in explaining its response.\nIn the first Instagram Story, Ms Sarah reshared an Instagram Story by another Instagram user, @jeanpsychologist and in the second, Ms Sarah penned a series of reflections on the incident. PHOTOS: SARAHBAGHARIB/INSTAGRAM\nIn the first, she reshared an Instagram Story by another Instagram user, @jeanpsychologist, who had responded to an Instagram post Ms Sarah had made.User @jeanpsychologist thanked Ms Sarah for posting on the incident, and called for Chinese Singaporeans to \"educate ourselves on our conditioned racism\", saying this is \"long overdue towards our friends in minority communities who have to put up with our ignorance - which continues to perpetuate the racist culture that hurts them\".In the second Instagram Story, Ms Sarah penned a series of reflections on the incident, and said she was thankful to those who had stood in solidarity with her and her husband as well as other ethnic minorities in the aftermath of \"this incident (and other racist attacks and incidents that have been filmed)\".The PA also claimed Ms Sarah had insinuated in an online talk show on June 7 that PA's staff and volunteers did not find anything wrong with the standee as they might be \"blind to racism\".She had been asked by host Walid Jumblatt Abdullah, an assistant professor from Nanyang Technological University, whether she would accept an invitation from Mr Yong to meet in person if he had made such an offer.Ms Sarah replied she would, wondered if the MP had seen the standee, and added that \"something is definitely wrong\" if he had seen the standee and did not say anything about it.She also referred to someone’s comment about internalised racism, and spoke about how some people are blind to racism, or feel there is nothing wrong with racism as it does not impact them.In its post, the PA stressed it remains steadfast in its mission to promote racial harmony, and that its grassroots organisations, such as the Malay Activity Executive Committees Council and Narpani Pearavai, play a key role in representing the interests of the Malay and Indian communities.\"We regularly reach out to numerous community partners among all our races and religions to ensure their concerns are actively considered when designing our programmes,\" it added.The PA also said that what happened at Radin Mas was an isolated incident, but nevertheless shows that it can fall short.\"We agree it is important for our staff and volunteers to be sensitive to and knowledgeable about the cultures of all our ethnic groups. We are now looking at establishing a resource panel to guide and advise our staff on cultural matters,\" it said.\"We will also step up training efforts to enhance staff and volunteers' understanding and appreciation of our different cultures. Singaporeans becoming \"one people\" is a work in progress - and so is the PA.\"The PA also said Ms Sarah's allegation in her e-mail on June 1, that the PA was \"hasty in sharing the name of the vendor\" to \"distance and deflect blame\" from itself, was untrue.It said the vendor had identified himself directly to Ms Sarah on May 28 and apologised, before the PA issued its statement on May 29.The Straits Times has contacted Ms Sarah for comment.She had written on Instagram on June 1, after acknowledging PA's apology: \"As an ethnic minority, this isn't new - seeing others have a superficial understanding of my culture and then feeling like I have to explain it is... exhausting. But I want to help bridge that gap where possible through real and respectful conversations so that we can move beyond superficial understanding and promote deeper social cohesion.\"A post shared by sarah bagharib (@sarahbagharib)In her June 7 talk show, she also said she had spoken up about the incident as she would like to see more \"tangible accountability\" from the PA to ensure such incidents do not happen again.This includes hearing about steps that they will take.She also noted that when minorities speak up about their experiences, they are not doing so in order to incite racial disharmony.The PA said in its post: \"Enhancing our understanding of Singapore's various races, religions and cultures is a ceaseless effort - this lapse having been a good reminder of this... We hope that this incident will not tar the other good work which our staff and volunteers have done.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/peoples-association-withdraws-offer-to-meet-couple-over-wedding-photo-incident", "Source": "google"}