{"Type": "", "Time": "2021-06-14", "Headline": "Man, 65, arrested for allegedly hitting his neighbour with bicycle chain in Ang Mo Kio", "Text": "Click here to submit a story or submit it to our WhatsApp.Click here to submit a story or submit it to our WhatsApp.A 65-year-old man was arrested for allegedly hitting his neighbour with a bicycle chain, causing him to bleed profusely and to be taken to hospital.Several Stompers alerted Stomp to a Facebook post by Alex Tohsw who shared his \"horrifying\" experience with his next-door neighbour.According to him, he was cleaning the window panel outside his unit while standing on a metal ladder when his neighbour attacked him from behind with a bicycle chain that was attached to a lock pad.\"He claimed that I was blocking his path to go back home just because I placed his bicycle by the walkway,\" Alex wrote.\"He hit me twice on the head and shoulder with the bicycle chain.\"I shouted for help as my head was bleeding profusely and I was in severe pain.\"My two kids were in the living room and were startled to see me covered in blood.\"He said another neighbour intervened and stopped the older man from attacking Alex.In response to a Stomp query, the police said they were alerted to a dispute at Block 130 Ang Mo Kio Avenue 3 on June 12 at 10.26am.\"A 47-year-old man had sustained a laceration on his head, and was conscious when conveyed to the hospital,\" a police spokesman said.\"A 65-year-old man was arrested for voluntarily causing hurt with a dangerous weapon.\"Police investigations are ongoing.Get more of Stomp's latest updates by following us on Facebook, WhatsApp, Twitter, Instagram and YouTube.View the discussion thread.View the discussion thread.Download the new STOMP app today.SPH Digital News | The Straits TimesAll rights reserved | Terms & Conditions | Data Protection Policy | Advertise with usSPH Digital News / STOMP / Copyright (c) 2019 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E.", "Section": "", "Writers": "", "URL": "https://stomp.straitstimes.com/singapore-seen/man-67-arrested-for-allegedly-hitting-his-neighbour-with-bicycle-chain-in-ang-mo-kio", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}