{"Type": "", "Time": "2021-06-14", "Headline": "Vaccination begins for ITE students as 3 out of 4 MOE centres open, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Vaccination has begun for all Institute of Technical Education (ITE) students on Monday (June 14) now that three out of four Ministry of Education vaccination centres have opened.Vaccination centre operations started at ITE College Central in Ang Mo Kio on June 7, at ITE College East in Simei on June 9 and at ITE College West in Choa Chu Kang on June 11. The fourth centre, at Raffles City Convention Centre, will open on Tuesday.More than 300,000 students across Singapore have registered for their vaccination appointments thus far, of whom over 101,000 have taken their first dose, said Second Education Minister Maliki Osman.About 345,000 SMSes and invites had been sent to eligible students.Dr Maliki gave reporters an update on student vaccination numbers during a visit to ITE College West in Choa Chu Kang on Monday.\"Our first batch, our graduating students, about 90 per cent of them have already registered, and about 75 per cent received their first doses.\"It's very encouraging to see how the students are responding to all these invitations and SMSes that have been given to them.\"The hope is that all students will be able to get fully vaccinated by the end of August, Dr Maliki added, although this will depend on the response rate.Schools are contacting parents of students who did not respond to the vaccination bulletins to find out more about their concerns, he said.\"It could be an issue where the parents may not know how to (register)... that they are not quite familiar with the online system.\"It could also be that parents have some concerns about issues of safety and so for that, we are asking teachers to reach out to them,\" he said.Some working parents may also face challenges in getting their children, especially the younger ones, to the vaccination centres.\"So for those groups, we can assure them that all they need to do is when school reopens, get in touch with the teachers.\"The schools are ready to help, for example, with transport arrangements, he said.The new school term starts on June 28.It was earlier announced that Singapore would roll out its vaccination exercise to more than 400,000 students in schools and institutes of higher learning, including autonomous universities, polytechnics and ITE, amid more Covid-19 infections among children.Those affected included students in primary and secondary schools, junior colleges, the Millennia Institute, madrasahs, special education schools, and the international arms of Hwa Chong Institution, Anglo-Chinese School and St Joseph's Institution.Students had been invited to sign up for vaccination slots from June 1, starting with about 56,000 students who will be sitting major examinations like the O and A levels this year.Those aged 18 and above can opt for either the Pfizer-BioNTech or Moderna vaccine, while those aged between 12 and 17 will be offered only the Pfizer jab as the Moderna vaccine has not been approved for use on this younger age group.\nJemima Yap Ning, 17, a student at ITE College West, receiving the Covid-19 vaccine on June 14, 2021. ST PHOTO: ONG WEE JIN\nDr Maliki said the ITE centres will be able to administer 1,600 doses of the vaccine a day, while the Raffles City centre can do 2,000 doses a day.This week, the three centres will provide vaccinations for ITE students in the morning from 8.30am to 11.30am, and for all other students from 1.30pm to 4.30pm.He added that there are currently around 28,000 ITE students.From next week, the centres will be open to all students.\nStudents in the observation area after receiving their vaccines at the ITE College West vaccination centre on June 14, 2021. ST PHOTO: ONG WEE JIN\nDr Maliki also reiterated that vaccinating students is one of the many protective measures in place to ensure their safety, with the majority of students expected to receive the first dose of their vaccine by end-June when school reopens. However, safe management measures such as mask wearing, safe distancing and staggered recess times will continue to prevail. Business student Danial Norizam, 16, was among the ITE students vaccinated on Monday morning. He told The Straits Times that he was a little anxious about the side effects initially, but felt that it was important to get his vaccine in order to keep himself safe. Both his parents, who have already been vaccinated, had also encouraged him to do so. Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/three-covid-19-vaccine-centres-open-at-ite-campuses-for-students-more-than-101000-have", "Source": "google"}