{"Type": "", "Time": "2021-06-14", "Headline": "Christian Eriksen and the intimation of mortality | Opinion | Malay Mail", "Text": "Loading...Monday, 14 Jun 2021 09:26 AM MYTBy Alwyn LauJUNE 14 — Two nights ago, Danish footballer Christian Eriksen collapsed on the pitch during the Denmark-Finland game. For about 10 excruciating minutes, the whole world watched as medics tried to revive the 29-year-old who suffered what is most likely a heart attack. With much relief, it was later reported that Eriksen is in stable condition, and generally recovering. A leading sports cardiologist suggested, however, that the Danish footballer — who plays for Serie A team Inter Milan and formerly for Tottenham Hotspur of England — may not be able to  play professional football ever again.When I first heard the news, I was shocked not only because I’m a Tottenham fan (and thus have seen Eriksen play countless times) but also because I recall shaking this young man’s hand at the AIA Building in KL back in 2015 (when Tottenham toured Malaysia).The scenes of shock and grief in the stadium during those 10 minutes when it wasn’t sure if Eriksen would make it — not to mention the profound sight of Eriksen’s teammates making a wall around the fallen footballer — drives home not only the point that life is so absolutely precious but that fighting for it is an intensely private matter.It is commendable that a majority of news agencies have refused to make public raw footage of the deaths of celebrities like Princess Diana, Argentine football megastar Diego Maradona, Steve Irwin (the 'Crocodile Hunter') and so on. Follow us on Instagram and subscribe to our Telegram channel for the latest updates.It’s good to know that in an age where privacy is almost non-existent, when media and social media can peer into almost every corner of our lives, most people still respect the need to “back away” whenever someone is in the throes of death.Perhaps life’s fragility brings forth something of the sacred which still moves us; death is among the most unpredictable of visitors.In Eriksen’s case, he was among the most finely tuned athletes in the world, not even in his 30s yet and for whom fitness and health is embedded into his lifestyle and job. I’d imagine the chances of him collapsing would be far below that of mine, an overweight over-eating dude almost pushing 50 who’s either sitting or lying down about 22 hours a day and probably works out less in a year than Eriksen does in a week.Long and short, if mortality is something a person like Eriksen can’t take for granted, it’s surely something we all can’t ignore.One may think that with Covid-19 this is a foregone conclusion. One would hope that with the pandemic deaths hitting daily records, all of us have learned to slow down and simply enjoy being with loved ones, taking every breath, every meal, every moment with gratitude, and quit being assholes.Alas, no.You still see people speeding on the highway like they’re auditioning for the Fast & Furious franchise where no vehicle or oil slick can stop them. You still see corporate leaders pushing and pressuring their subordinates like their heavenly salvation depended on raising revenue by 20 per cent. You still see parents screaming at their kids because it’s plain unacceptable for “my son” to score less than 80 per cent for Modern Math. These folks are incapable of imagining consequences such as a highway pile-up or the sudden hospitalisation of a colleague or the traumatic breakdown of one’s kid.For these folks, there is no sense of the fragility of life because life has been translated into purely material terms (like speed or profit or academic results). Imagine if the people in Parken Stadium on Saturday night didn’t understand this and demanded for play to resume no matter what happened to Eriksen. The challenge, of course, is to value and cherish life before it becomes urgent and not when someone collapses on the ground.Christian Eriksen’s collapse on Saturday night should remove all doubts about how life may suddenly end for us. In view of that, the #1 thing which should be on our minds is whether we’re doing everything we can to show our loved ones how much they mean to us, to do less of those things which serve only our pride, and to nurture an appreciation of, and engagement with, matters which endure. Or which are everlasting.* This is the personal opinion of the columnist.Loading...© 2021, Malay Mail, All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.malaymail.com/news/opinion/2021/06/14/christian-eriksen-and-the-intimation-of-mortality/1981997", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}