{"Type": "", "Time": "2021-06-14", "Headline": "Victoria on track for further easing of Covid restrictions after recording one new case | Victoria | The Guardian", "Text": "The new local case is a primary close contact of another coronavirus case and has been self-isolating First published on Sat 12 Jun 2021 18.42 EDTMelbourne is on track for a further easing of restrictions later in the week after recording one new locally acquired Covid case on Sunday.The Health Department on Sunday confirmed the new case is a close contact of an already infected person and has been quarantining throughout their infectious period.The case is a close contact of a case linked to the Arcare Mainstone aged care outbreak, however they are not a resident.Some 17,102 Victorians were tested in the 24 hours to Sunday morning, while 14,390 received a Covid-19 vaccine dose at state-run hubs.On Sunday morning, acting premier James Merlino said “it is a good thing” that the new case was “already in quarantine”, but stressed “we are not over this (outbreak) yet”.Merlino was also pressed about a further easing of Covid restrictions, but provided no specific details claiming he didn’t want to give “a false indication” ahead of public health advice.“I’ve got no announcements today. I know that people are very keen on the answer, and we want to get crowds back to, whether it is AFL or netball basketball or whatever sport, and theatre production, we want to get crowds and attendances back to these events and back to where we were just a few short weeks ago,” he said.“My expectation is by later in the week, we will be in a position to announce further easing of restrictions for regional Victoria and further easing for metropolitan Melbourne,” Merlino said.At a press conference later on Sunday, Victoria’s health minister, Martin Foley, said Australia was “nowhere near” ready to discuss reopening its international border.“Other countries are already having that conversation but those countries are at 50, 60, 70% vaccination rates. We are just over three per cent fully-vaccinated,” he said.“What we need to do is have our focus on firstly keeping the virus at bay through dedicated risk-based quarantine facilities and keeping on top of outbreaks.”Overnight, Scott Morrison reaffirmed Australia’s suppression strategy to contain Covid-19.Speaking on the sidelines of the G7 summit in the United Kingdom, where he is an observer, Morrison faced questions about when Australians would be able to travel like he had done.“In Australia, we’ve been in a position where we have been able to suppress the virus and keep it out. That sadly hasn’t been able to be achieved here and across Europe and the United States and so their experience has been very very different,” the prime minister said.“We’ll continue to take an Australian path on this which protects the lives and livelihoods and learn from the experiences of other countries,” Morrison said.Sunday’s new case in Victoria comes as authorities work to link Saturday’s local virus case to the Kappa strain outbreak. Saturday’s case, a man living in central Melbourne with his young family, is a “mystery case” until a connection is found.Testing commander Jeroen Weimar said he was confident this link would be found but said he was more concerned about undiscovered cases because of low testing rates.“There may well be more out there,” he told reporters on Saturday.He asked Victorians to make each other accountable for possible coronavirus symptoms and to encourage each other to get tested.“Call them out in the nicest possible way,” he said.There were just over 15,000 tests on Friday and similar numbers the day before. This is compared to 30,000 to 40,000 daily tests earlier in the outbreak.There are now 74 active cases in the state, including returned travellers in hotel quarantine.Merlino also welcomed the news that premier Daniel Andrews will return to work on 28 June as he recovers from fracturing his spine and ribs.If you can, you must.Let's beat this, Victoria. pic.twitter.com/GvZKCE5jpSAndrews, who tweeted a picture of himself getting vaccinated on Sunday, said he had been given the all-clear by doctors to return to work.“I will happily hand him back the keys, but it is great news,” Merlino said. “I am sure I speak for all Victorians in that we are really pleased, everyone, every Victorian who has had a severe back injury knows how long and painful the recovery is.”Following a two-week lockdown that ended on Friday, Melburnians are allowed to travel up to 25km from home and meet outside in groups of up to 10. Masks are required indoors and outdoors and hospitality, retail and schools have reopened.There are more than 3,000 primary close contacts in quarantine as a result of community cases, as well as 122 exposure sites.Additional reporting by Australian Associated Press.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/world/2021/jun/13/victoria-records-one-new-covid-case-as-daniel-andrews-prepares-to-return-to-work", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}