{"Type": "", "Time": "2021-06-14", "Headline": "Arsenal keen on La Liga star Liverpool agreed personal terms with and nearly signed | Football | Sport | Express.co.uk", "Text": "When you subscribe we will use the information you provide to send you these newsletters. Sometimes they'll include recommendations for other related newsletters or services we offer. Our Privacy Notice explains more about how we use your data, and your rights. You can unsubscribe at any time.Arsenal are plotting a move for Real Betis midfielder Nabil Fekir this summer, it has emerged. The Gunners are in the market for a new attacking midfielder in the current transfer window and will hope to strengthen ahead of the new Premier League season.Get ready for England to bring it home in this year's Euros by wearing England's official football kitMikel Arteta missed out on the signing of Norwich City’s Emi Buendia to Aston Villa, who spent a club-record fee to secure the services of the Argentina international.There is still some debate as to whether or not Martin Odegaard could return to the Emirates after a positive loan spell, though it is unclear how new Real Madrid boss Carlo Ancelotti views the situation of the Norwegian.A new candidate has now appeared as a possible purchase, with rumours circulating that Fekir is being looked at by Arsenal.Spanish publication AS have reported that there is interest from the north London side, though the two sides are not close to agreeing a transfer fee.JUST IN: Liverpool told to let Arsenal sign Bissouma and chase £70m man instead  Arsenal are believed to have made an opening offer of £20m, which they must now be prepared to raise.The French midfielder joined Betis in 2019 after a number of successful years at Lyon in Ligue 1.Fekir was famously on the verge of completing a move to Liverpool in the summer of 2018, having completed a medical ahead of his proposed switch.But the deal bizarrely fell apart at the last minute, prompting confusion from Liverpool supporters who thought the 27-year-old was on his way to Anfield.DON'T MISSLeno facing Arsenal axe as Arteta plans huge transfer overhaulArsenal transfer plan emerges as Edu wants new deal for Gunners duo Arsenal facing two problems with Tyler Adams transfer  It was reported that the transfer was called off due to concerns about Fekir’s knee, though he later addressed those claims in an interview with L’Equipe in 2019.\"Lots of lies were told and they affected me,” he said.\"Especially those told about my family. It hurt them and me. Especially when you know that’s what being told is false.\"What was said is not the truth. My knee is good, I had a quick medical check at Clairefontaine, my knee wasn’t even mentioned. If my knee had been in such a bad state, would [Jean-Michel] Aulas have made [an offer to keep me].“But the worst thing is the idea that people could suggest that it’s because of my family that the transfer didn’t happen. It’s a lie. But you have to live with it.“You want the truth? Even I don’t know, I promise you! Added Fekir.“I did my medical and then [Liverpool] decided not to sign me. At some point they wanted to have me believe it was because of my knee but an excuse needed to be found.“The medical tests that I did at Clairefontaine were very clear, my knee is perfectly fine and I feel fine. There are no issues at all with my knee.” See today's front and back pages, download the newspaper, order back issues and use the historic Daily Express newspaper archive.", "Section": "", "Writers": "", "URL": "https://www.express.co.uk/sport/football/1449382/Arsenal-Liverpool-La-Liga-signing-transfer-news-SNT", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}