{"Type": "World", "Time": "2021-06-14", "Headline": "Israel's Knesset convenes to vote on new government that will end Netanyahu's rule", "Text": "JERUSALEM: Israeli Prime Minister Benjamin Netanyahu's record 12-year hold on power was set to end on Sunday (Jun 13) when parliament votes on a new government, ushering in an administration that has pledged to heal a nation bitterly divided over his departure.Netanyahu, the most dominant Israeli politician of his generation, had failed to form a government after a Mar 23 election, the fourth in two years.Naftali Bennett, a hawkish hi-tech millionaire, was poised to replace him as head of a new government of unlikely allies that include left-wing, centrist and Arab legislators, which he cobbled together with opposition leader Yair Lapid.Parliament convened at 4pm (9pm, Singapore time) to approve the government in a confidence vote that will follow speeches and a debate that could take about four hours. After its ratification, the new Cabinet will be sworn in.Bennett, 49, an Orthodox Jew, will serve as premier for two years before Lapid, a former TV host, takes over.\"Thank you Benjamin Netanyahu for your lengthy and achievement filled service on behalf of the State of Israel,\" Bennett said in a speech at the start of the session.The government, including for the first time a party that represents Israel's 21 per cent Arab minority, plans largely to avoid sweeping moves on hot-button international issues such as policy toward the Palestinians, and to focus on domestic reforms.With little to no prospect of progress toward resolving the decades-long conflict with Israel, many Palestinians will be unmoved by the change of administration, saying Bennett will likely pursue the same right-wing agenda as Netanyahu.That looked likely regarding Israel's top security concern, Iran. A Bennett spokesman said he would vow \"vigorous opposition\" to any US return to the 2015 Iranian nuclear deal but would seek cooperation with the administration of US President Joe Biden.\"Love you, thank you!\" Netanyahu wrote in a message, illustrated with a heart emoji, to the Israeli public on Twitter that featured a photo of the 71-year-old leader against the backdrop of an Israeli flag.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Benjamin Netanyahu,Israel,Knesset,election", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/israel-knesset-vote-new-government-benjamin-netanyahu-15005072", "Source": "google"}