{"Type": "", "Time": "2021-06-14", "Headline": "Unlikely allies set to govern as Netanyahu faces exit in Knesset vote, Middle East News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.JERUSALEM • Israeli Prime Minister Benjamin Netanyahu's record 12-year hold on power was set to end yesterday when the Knesset, or Parliament, votes on a new government, ushering in an administration that has pledged to heal a nation bitterly divided over his departure.Mr Netanyahu, the most dominant Israeli politician of his generation, had failed to form a government after the March 23 election, the fourth in two years.Mr Naftali Bennett, a hawkish tech millionaire, was poised to replace him as head of a new government of unlikely allies that include left-wing, centrist and Arab legislators, which he cobbled together with opposition leader Yair Lapid.Parliament convened to approve the government in a confidence vote that would follow speeches and a debate set to take several hours. After its ratification, the new Cabinet would be sworn in.Mr Bennett, 49, an Orthodox Jew, will serve as premier for two years before Mr Lapid, a former TV host, takes over.\"Thank you Benjamin Netanyahu for your lengthy and achievement-filled service on behalf of the State of Israel,\" Mr Bennett said in a speech at the start of the session.The government, including for the first time a party that represents Israel's 21 per cent Arab minority, plans largely to avoid sweeping moves on hot-button international issues such as policy towards the Palestinians, and to focus on domestic reforms.With little to no prospect of progress towards resolving the decades-long conflict with Israel, many Palestinians will be unmoved by the change of administration, saying Mr Bennett will likely pursue the same right-wing agenda as Mr Netanyahu.That looked likely regarding Israel's top security concern, Iran. A Bennett spokesman said he would vow \"vigorous opposition\" should the United States return to the 2015 Iranian nuclear deal but would seek cooperation with the administration of US President Joe Biden.\"Love you, thank you!\" Mr Netanyahu wrote in a message yesterday, illustrated with a heart emoji, to the Israeli public on Twitter that featured a photo of the 71-year-old leader against the backdrop of an Israeli flag.On the international stage, with his polished English and booming baritone voice, the telegenic Mr Netanyahu has become the face of Israel.Serving his first term as prime minister in the 1990s and since 2009 winning four more terms in succession, he has been a polarising figure, both abroad and at home. He is loved by his supporters and loathed by critics.His ongoing corruption trial - on charges he denies - has only deepened the chasm. His opponents have long reviled what they see as Mr Netanyahu's divisive rhetoric, underhanded political tactics and subjection of state interests to his own political survival.Celebrations by his opponents to mark the end of the Netanyahu era began late on Saturday outside his official residence in Jerusalem, the site of weekly protests for the past year, where a black banner stretched across a wall read: \"Bye Bye, Bibi, Bye bye\", referring to him by his nickname, Bibi. Demonstrators sang, beat drums and danced.But for Mr Netanyahu's large and loyal voter base, the departure of \"King Bibi\" may be difficult to accept.His supporters are angered by what they see as Israel turning its back on a leader dedicated to its security and a bulwark against international pressure for any steps that could lead to a Palestinian state, even as he clinched diplomatic deals with the United Arab Emirates, Bahrain, Morocco and Sudan.None of those moves, however, nor the role he played in securing Covid-19 vaccines for Israel's world-beating inoculation campaign, were enough to grant his Likud party sufficient votes to secure him a sixth term.Mr Bennett has drawn anger from within the right-wing camp for breaking a campaign pledge by joining forces with Mr Lapid. He has countered that another election - a likely outcome if no government were formed - would have been a disaster for Israel.REUTERSJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "http://www.straitstimes.com/world/middle-east/unlikely-allies-set-to-govern-as-netanyahu-faces-exit-in-knesset-vote", "Source": "google"}