{"Type": "", "Time": "2021-06-14", "Headline": "Asgardians of the Galaxy Reunite in BTS Chris Photo | CBR", "Text": "Thor's Chris Hemsworth and Guardians of the Galaxy's Chris Pratt reunite in a behind-the-scenes photo posted for a third Chris' birthday.Thor the Asgardian and the one of the Guardians of the Galaxy have reunited once again for a special occasion: Chris Evans' birthday.Thor: Love and Thunder's Chris Hemsworth posted a behind-the-scenes photo featuring himself and costar Chris Pratt, who is returning in the upcoming film as Peter Quill, also known as Star-Lord. In a caption, Hemsworth wrote, \"Happy 40th birthday Chris Evans, you'll always be number 1 in my book.\"RELATED: Thor 4 Set Photos Reveal 'New Asgard,' a Viking Ship and MoreA post shared by Chris Hemsworth (@chrishemsworth)Thor and Quill met for the first time in Avengers: Infinity War, when the Guardians of the Galaxy found the God of Thunder floating in space after Thanos destroyed The Statesman and half of the Asgardian refugees aboard the ship. Thor, Quill and the rest of the Guardians of the Galaxy departed from Earth in Avengers: Endgame, leaving Earth and New Asgard with Valkyrie appointed as the settlement's ruler.Taika Waititi's upcoming Thor: Love and Thunder wrapped production in late May. The next instalment in the Thor film series will see Jane Foster return in her first MCU appearance since Thor: The Dark World. More importantly, as announced in 2019, Foster will take on the mantle of the God of Thunder.RELATED: Loki’s Time-Keepers Tried to Stop the Avengers from FormingIt has been confirmed that the Guardians of the Galaxy will return in the film and, though plot details have been kept under wraps, will aid the Asgardians as they go head to head against the villainous cosmic entity known as Gorr the God Butcher, played by Christian Bale. Additionally, several other major names are attached, such as Russell Crowe, who will play the Greek god Zeus, as revealed by a leaked audio clip.Actor Matt Damon, who played a stage version of Loki in Thor: Ragnarok, will return for the fourth Thor film, alongside actors Sam Neill and Luke Hemsworth, who also appeared in the play recounting the events of Thor: The Dark World. Photos taken from the set reveal that Melissa McCarthy will appear in a play within the film retelling the events of Thor: Ragnarok, with McCarthy playing Hela.Directed by Taika Waititi, Thor: Love and Thunder stars Chris Hemsworth as Thor, Tessa Thompson as Valkyrie, Natalie Portman as Jane Foster, Jaimie Alexander as Lady Sif, Chris Pratt as Star-Lord, Dave Bautista as Drax, Karen Gillan as Nebula and Christian Bale as Gorr the God Butcher. The film arrives in theaters May 6, 2022.KEEP READING: Thor 4: Chris Hemsworth and Taika Waititi Wrap Filming With BTS PhotoSource: InstagramNarayan Liu (/Nəraɪʌn Lɪʊ/ in IPA) is a contributing features and news writer, and junior editor at CBR. From Hong Kong, currently based in Sweden. Nowadays Narayan writes about films, TV shows, comic books and video games, or about anything related to The Witcher. He does this while studying language, culture, and communication at Linnaeus University. You can follow him on his blog (narayanliu.wordpress.com), on Twitter (@Narayan_Liu) or contact him directly at Narayan(dot)Liu(at)gmail.com.", "Section": "", "Writers": "", "URL": "https://www.cbr.com/asgardians-of-the-galaxy-reunite-in-bts-chris-photo/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}