{"Type": "Singapore", "Time": "2021-06-14", "Headline": "Security guard fined for taking laptop left behind by student at school canteen", "Text": "SINGAPORE: When a security guard who worked at a secondary school came across a student's laptop in the canteen, he took it instead of returning it to its owner.Ramdas Gurusamy, 61, was fined S$1,200 by a court on Monday (Jun 14) after making restitution to the victim. He pleaded guilty to one count of dishonest misappropriation.The court heard that the victim, a teenage student at Anglo-Chinese School (Barker Road), was issued a Chromebook laptop along with his schoolmates.The device came installed with a software called Goguardian, which allowed the school to carry out Internet filtering and to monitor the students' online activities.It also has a function that allowed the school to determine its geolocation should it go missing.At about 4pm on Jun 27, 2017, the victim packed his things to head home but forgot his laptop and its accompanying bag.He discovered this at about 7pm. His mother contacted the school and they checked the canteen the next day, but the laptop and its bag could not be found.The victim's mother lodged a police report on Jul 3, 2017.Investigations revealed that Ramdas was doing his security rounds at the canteen past 11pm on Jun 27, 2017. That was when he took the laptop bag with the device inside.At about 10.30am on Jul 25, 2017, the school detected activities from the laptop and traced its location to Ramdas' address.The laptop was used for purposes including searching for songs, said the state prosecutor.Ramdas made no attempt to return the laptop and its bag, worth S$542 in total, to the rightful owner or to the authorities.The judge accepted that Ramdas is remorseful and has made restitution. However, he noted that the offence was committed when Ramdas was a security guard. Instead of returning the laptop, he misappropriated it, said the judge.For dishonest misappropriation, he could have been jailed up to two years, fined, or both.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "court,crime", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/security-guard-took-students-laptop-fined-acs-barker-road-15011696", "Source": "google"}