{"Type": "", "Time": "2021-06-14", "Headline": "Tel Aviv fetes Netanyahu's departure with flags and foam, Middle East News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.TEL AVIV (AFP) - She stepped out to walk her dog only to witness history: Ossie joined the joined the throngs of Israelis watching the momentous election of an anti-Benjamin Netanyahu government on the streets of Tel Aviv.The 60-year-old's eyes were glued to the screen as the parliament speaker listed results of the vote, dozens of bar patrons clutching rainbow flags holding their breath.And then the results dropped: 60 for, 59 against.\"I can't speak,\" Ossie said, taking a seat. \"It's a dream come true.\"I hope it's going to last, at least one year.\"In winning the legislative vote in Israel's Knesset, the hodgepodge new government led by far-right lawmaker Naftali Bennett ends Netanyahu's record 12 years in power.In Tel Aviv's Rabin Square, where anti-Netanyahu demonstrators have been calling for him to step down for more than a year, the music blared.In the same spot where former Labour prime Yitzhak Rabin was assassinated in 1995 by a Jewish extremist, a cannon sends foam at the crowd drowning under a swarm of Israeli flags.\"Bibi go home,\" yells a man from the podium.In liberal Tel Aviv, turning the page on the Netanyahu era is considered a \"historic\" moment, says Chen Nevo.\"I'm little bit in shock because we waited so long for this moment,\" said the 49-year-old who came to the square with her small children despite the late hour.\"They are supposed to sleep right now, but I thought it was really an important moment.\"The new prime minister is a figure of the far right, a religious nationalist whose supporters include controversial settlers.And yet for Nevo, the government may be \"strange\", but \"I believe in these people.\" \"I don't know if the government will last, but it is a change, and we needed a change,\" she said, a Hebrew rendition of John Lennon's \"Imagine\" soundtracking the scene.Rubi Sofer, 48, also arrived at the celebration with his family in tow.The foursome all sported black tshirts emblazoned with the white letters signaling the anti-Netanyahu protest movement, which has been a feature of Israeli life every Saturday for a year under the slogan: \"Get out\".\"We don't like Bibi at all,\" said Sofer, adding that they've been attending protests every weekend for 10 months.Explaining that Bennett is not his \"dream\" replacement, the construction worker said that pragmatically \"in order to win a fight, sometimes you lose small battles. So in order to replace Bibi, we needed this.\"Israeli society needs a cure.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/middle-east/tel-aviv-fetes-netanyahus-departure-with-flags-and-foam", "Source": "google"}