{"Type": "", "Time": "2021-06-14", "Headline": "Book excerpt: Renault-FCA merger surprise further strains Nissan alliance", "Text": "Reprinted by permission of Harvard Business Review Press. Adapted from Collision Course: Carlos Ghosn and the Culture Wars That Upended an Auto Empire by Hans Greimel and William Sposato. Copyright 2021 Hans Greimel and William Sposato. All rights reserved. Publication date: June 22 ($32).By mid-2019, in the months following the arrest of former Nissan Chairman Carlos Ghosn, relations between Nissan and French partner Renault reached new lows. Clumsy attempts by Renault's new Chairman, Jean-Dominique Senard, to broker a surprise merger between Renault and Fiat Chrysler Automobiles, behind Nissan's back, only further strained the Franco-Japanese alliance. Sales, profits and share prices plunged — not only at Nissan and Renault, but at Mitsubishi, the auto group's third leg.This is the second excerpt from Collision Course: Carlos Ghosn and the Culture Wars That Upended an Auto Empire. It is drawn from Chapter 13, \"Alliance Upheaval.\" The passage describes how the alliance teetered without its longtime leader and includes Ghosn's take on why the companies faltered in his absence. The book was written by Automotive News Asia Editor Hans Greimel and William Sposato. Renault Chairman Jean-Dominique Senard's failed backroom dealing with FCA drew immediate backlash from Japan.At Nissan's annual shareholders' meeting in June 2019, just three weeks after FCA broke off the Renault deal, furious investors assailed Senard for trying the end-run around Nissan CEO Hiroto Saikawa and blasted the incoming vice chairman of Nissan for not even owning shares in the Japanese carmaker. One attendee, channeling the palpable distrust in the room, said he feared a foreign takeover of Nissan and attacked the entire French nation as duplicitous.Greimel and Sposato.\"They are really sly,\" the shareholder said of the French. \"Can you behave as a Nissan director and not just as the chairman of Renault? You would like to take advantage of the merger for Renault. That's obvious.\"A clearly shaken Senard poured forth an emotional riposte in English delivered to the 2,800 shareholders through a Japanese interpreter. He repeatedly implored shareholders to trust him. \"The last thing that came in my mind was to be aggressive toward a company of which I am a director. I beg you to believe me on that,\" he said, conceding Nissan-Renault relations were in a \"much worse state than I thought.\"Senard defended the aborted FCA merger as ultimately benefiting all the Alliance partners, including Nissan. \"You know who was very pleased after the announcement that this deal was stopped? All our competitors in the world,\" he said. \"They understood that if this deal had gone through, it would have been a very, very strong feature for the alliance.\" Senard concluded: \"There are no bad intentions at all.\"But the damage was done. Trust in Renault's new boss melted away.It didn't help that Senard was chauffeured away from the Nissan shareholders' meeting not in a Nissan-made vehicle but in an Alphard van, sold by archrival Toyota. And insult followed injury just four months later. With Renault and the Alliance in its rearview mirror, FCA announced it would merge instead with PSA Group, the maker of Peugeot and Citroën brand vehicles, and Renault's French archrival. FCA and PSA claimed their proposed 50-50 tie-up would create the world's fourth-biggest automaker — not No. 3 but plenty big enough to pressure the Alliance. The merged auto group was called Stellantis, a name rooted in the Latin verb stello, meaning \"to brighten with stars.\"\"Senard appeared to be a very reasonable, gentle businessperson,\" recalled one high-level Nissan executive involved with Renault relations. \"In reality, he wasn't.\"As the Alliance staggered on in limbo during its first year after the arrest of its Chairman Carlos Ghosn, Nissan's performance began to plunge, amid sliding sales, especially in the key US market. Nissan's operating profit dove 99 percent in the April–June quarter of 2019, and it fell another 70 percent in the July–September period. By the end of that fiscal year, on March 31, 2020, Nissan booked its first net loss in eleven years, the worst loss since Ghosn's first year at the company in 1999. By early 2020, Nissan's earnings were being throttled by the COVID-19 pandemic, as dealerships worldwide closed their doors and customers from Beijing to Los Angeles were forced to stay at home under lockdown. Looking ahead, Nissan forecast its worst-ever operating loss in the fiscal year ending March 31, 2021.But the reality was Nissan's business was already in brisk decline before the pandemic. Operating profit margin stood at a robust 6.3 percent in March 2017, when Ghosn made Saikawa sole CEO. Three years later, Nissan was a money pit.Investors reacted by racing to ditch their Nissan shares. From the beginning of 2019 until March 2020, the company's stock price shed 55 percent of its value.The contagion soon spread to Renault and Mitsubishi. In 2017, while Renault was still under Ghosn's leadership, the French automaker posted record vehicle sales and operating profit. But in 2019, the year he was dismissed, Renault recorded its first annual net loss in a decade. By the spring of 2020, Renault's corporate bond rating was slashed to junk status. Mitsubishi, already mired in red ink before the pandemic hit, also booked a net loss for its full fiscal year through March 31, 2020, as operating profit caved 89 percent. Renault's share price plummeted 68 percent from the beginning of 2019 through the first quarter of 2020. Mitsubishi's sank 48 percent. It was an across-the-board reversal of fortunes.To Ghosn, the Alliance needed someone just like him, a strong central figure to hold it all together. In a 2020 interview with Automotive News from his home in Lebanon, he called that the secret to his success: Being able to calm Alliance conflicts that constantly bubbled under the surface.\"Between 1999 and 2018, you never heard about any problem, because, obviously, I was the final decision maker, I installed a spirit of cooperation against the extremes. But we knew that the extremes were always there. They were always going to take advantage of any situation to have their opinion prevailing,\" Ghosn said. \"They accused me of being a dictator, but frankly I was a decision maker.\"Many of his former lieutenants agreed, even after his arrest.\"Mr. Ghosn had a huge impact and influence in maintaining the Alliance because there were differences on business decisions between the companies, there were conflicts, and Mr. Ghosn is the one who, in the end, had to solve the conflicts and take a decision for the good of the Alliance,\" said one former high-level Nissan executive.Ghosn wasn't shy about saying the Alliance was nothing without him and a vision.\"They thought that the guys after me would be able to run each company and the Alliance like nothing happened. But they were wrong, as the results have shown,\" Ghosn said in an interview for this book from Lebanon.Still, others noted one of Ghosn's biggest failures, explosive allegations of rampant misconduct aside, was never cultivating a successor up to the task. One after another, heirs apparent vanished from the scene as Ghosn kept his grip on the auto group.Patrick Pelata, Ghosn's No. 2 at Renault from 2008 to 2011, was once tipped as the chosen one. He was a well-liked product guru with a stellar record in leadership positions at Nissan and Renault. But he was forced to resign to shield Ghosn after the fake spy scandal at Renault, in which three employees were wrongly accused of handing secrets to the Chinese. Another contender with cross-company competence, Carlos Tavares, was pushed out as Renault's No. 2 when he confided in a news interview that he wanted to be CEO himself someday. He eventually was, at PSA Group, the French carmaker that outflanked Renault and hooked up with Fiat Chrysler. Meanwhile at Nissan, it once seemed chief planning officer Andy Palmer was being polished for the top post. But he also bolted, to become CEO of British sports car maker Aston Martin in 2014.Even at age sixty-four, Ghosn showed no signs of leaving. That's when he signed on for another four years with Renault, through 2022. A whole generation of potential leaders felt frustrated that there was no road to the top for them.\"One of the things that was Ghosn's kryptonite over the years was his inability to successfully groom successors,\" said one former Alliance aide who worked closely with him. \"It's not for lack of trying. It's because he's such a cult of personality.\"As the Alliance wobbled without him, Ghosn seemed to relish in sniping at its troubles from the sidelines. He derided the group's new consensus-based approach as \"Santa Claus management.\" He called Nissan's downward spiral \"sickening.\" And he mocked Senard's botched attempt to broker a megamerger with FCA.\"The Alliance missed the unmissable, which is Fiat Chrysler,\" Ghosn said. \"How can you miss that huge opportunity to become the dominant player in the industry?\"They said they want to turn the Ghosn page. Well, they have been very successful,\" he continued. \"They turned the Ghosn page because there is no more growth. There is no more increase of profit. There is no more strategic initiative. There are no more initiatives, and there is no more Alliance.\"Please enter a valid email address.Please enter your email address.Please verify captcha.Please select at least one newsletter to subscribe.You can unsubscribe at any time through links in these emails. For more information, see our Privacy Policy.\nView the discussion thread.\n Sign up and get the best of Automotive News Europe delivered straight to your email inbox, free of charge. Choose your news – we will deliver.\nYou can unsubscribe at any time through links in these emails. For more information, see our Privacy Policy. Get 24/7 access to in-depth, authoritative coverage of the auto industry from a global team of reporters and editors covering the news that’s vital to your business. Founded in 1996, Automotive News Europe is the preferred information source for decision-makers and opinion leaders operating in Europe.1155 Gratiot Avenue\nDetroit MI  48207-2997\nTel: +1 877-812-1584Email UsISSN 2643-6590 (print)\nISSN 2643-6604 (online) ", "Section": "", "Writers": "", "URL": "https://europe.autonews.com/automakers/book-excerpt-renault-fca-merger-surprise-and-sniping-sidelines", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}