{"Type": "", "Time": "2021-06-14", "Headline": "Paul Craig dislocates Jamahal Hill's arm for gruesome win at UFC 263", "Text": "Paul Craig kicked off UFC 263 with a gruesome win on Saturday night.Craig beat Jamahal Hill in their light heavyweight bout at the Gila River Arena in Glendale, Arizona, via a first round TKO, and completely dislocated Hill’s left arm in the process.Craig got Hill on the ground early and went to flip him around. As he did that, Craig got a hold of Hill’s arm between his legs.As he flipped Hill around, Craig completely snapped the lower half of Hill’s arm out of the socket, making for a wild scene. At one point, HIll’s arm was just dangling and flopping around in the hold before the referee stopped the fight.Craig actually said he could feel Hill’s arm pop as it went, too. After he made the move, Craig then looked up at the referee, Al Guinee, and seemingly questioned why they were still fighting, given how clearly injured Hill was.The fight was then called shortly after, which marked Hill’s first career loss and Craig's fourth straight victory. Craig was a +225 underdog to win the bout on BetMGM. Guinee, per MMA Fighting, is not working any other fight on Saturday night. Hill seemed to be handling it well, but his arm did not look great as he walked off the arena floor. UFC president Dana White told the broadcast team later in the night that Hill's arm did not break, but was just severely dislocated.Naturally, the method of victory sent plenty of fans rushing to Twitter. Many felt the fight was allowed to go on for too long after seeing Hill’s arm flapping around.More from Yahoo Sports:Denmark’s Eriksen given CPR after collapsing at Euro 2020Unseeded Krejcikova wins first Grand Slam title at French Open Wetzel: Michigan legend Bo Schembechler nothing but a fraudHaynes: Nuggets have been all talk falling into 3-0 hole vs. SunsIt is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.The executive condo is an alluring property in Singapore because it serves ‘sandwich class’ Singaporeans. Whether it’s EC grant, EC income ceiling or resale levy, read everything you need to know about executive condos here.Discover the benefits of a cloud that offers limitless scale, performance—and possibilities for what you can achieve.President Recep Tayyip Erdogan on Sunday said Turkey would be the \"only reliable\" country left to stabilise Afghanistan after the US pulls out its troops, indicating Washington could rely on its NATO ally.Several hundred people gathered in London, Ontario on Saturday to pay homage to a Muslim family deliberately mowed down by the driver of a pick-up truck, in an attack that has shocked Canadians and which Prime Minister Justin Trudeau denounced as \"terrorist.\"Newly-crowned French Open champion Barbora Krejcikova hailed her mentor and former Wimbledon champion Jana Novotna who died in 2017, saying: \"At the end of her life, I had to be there.\"Amazon.comEven in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.The trial of ousted Myanmar leader Aung San Suu Kyi will hear its first testimony in a junta court Monday, more than four months after a military coup.Foreign forces should hold 'no hope' of keeping a military presence in Afghanistan after the US and NATO withdraw troops, the Taliban said Saturday, warning the security of embassies and airports would be the responsibility of Afghans.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Novak Djokovic claimed a 19th Grand Slam title and became the first man in 52 years to win all four majors twice when he came from two sets down to beat Stefanos Tsitsipas in a gripping French Open final on Sunday.What if China were to cut off the United States and Europe from access to rare minerals that are essential to electric vehicles, wind turbines and drones?Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.An American father-son duo accused of packing former Nissan chief Carlos Ghosn into an audio equipment case so he could escape trial in Japan will appear in a Tokyo court for the first time Monday.When you want protection that goes beyond just covering your medical costs, critical illness insurance is the logical choice. But with so many options out there, which ones are best for you? We investigate in this article. In a nutshell, critical illness insurance is insurance […] The post Best Critical Illness Insurance Plans In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.New $89 Portable Air Cooler Everyone In The U.S. Is Talking AboutGrab Holdings CEO Anthony Tan said he’s confident the SPAC merger will be completed by year-end, following a delay caused by a review of its financials.US President Joe Biden on Sunday congratulated incoming Israeli prime minister Naftali Bennett after an alliance of parties ousted Benjamin Netanyahu and formed a new government.Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.Search for private jet membership. The affordable price makes these private jet offers hard to resistAt least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.High coverage, no-fuss application and early benefit payout makes this a great plan for those seeking cancer protection. As many as 1 in 4 Singaporeans could develop cancer in their lifetimes. Hence, getting a protection plan specifically for cancer may be a prudent move, especially […] The post FWD Cancer Insurance (Review): Fuss-free Plan That Pays Out At All Stages appeared first on SingSaver Blog - We Compare, You Save.Two strategies to consider when making investment decisions. The post Getting Started: What is Averaging Up and Averaging Down appeared first on The Smart Investor.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/paul-craig-snaps-jamahal-hills-arm-for-gruesome-win-to-kick-off-ufc-263-023856963.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}