{"Type": "", "Time": "2021-06-14", "Headline": "Lee Kwang Soo Shares His Gratitude And Love For The Members And Fans In Final “Running Man” Appearance | Soompi", "Text": "On June 13, SBS’s “Running Man” aired their final race with Lee Kwang Soo.Back in April, Lee Kwang Soo announced that he was stepping down from the show after eleven years due to persisting issues with the ankle injury he sustained last year.In the June 13 episode, Lee Kwang Soo met with the production staff ahead of time to create a race full of memories to share with the other members. He said, “First, I want to go to the place where we first started filming. We also went to the Han River a lot on the show, and the weather is nice these days. Of the things I want to eat, I have fond memories of the chicken and kalguksu I had when we filmed at my house. If possible, I also want to eat grilled pork belly. It would also be nice to go to the LP bar again.”He added, “Personally, I want it to feel like normal. That’s my honest feeling.”Just as Lee Kwang Soo wished, the race opened at the same location where “Running Man” had started filming eleven years ago. Ji Suk Jin said, “Even the staff members are sad for Kwang Soo’s final recording. Let’s talk about him a lot today.” But Lee Kwang Soo quipped, “You didn’t say anything while we weren’t recording, but as soon as the cameras turned on, you came out with that line ready.”Hilariously, the production staff sentenced Lee Kwang Soo to 1050 years in prison after reviewing all the actions he had committed during the past eleven years of filming “Running Man.” The “race” this episode was about the other members helping him to commute and reduce his sentence.After Lee Kwang Soo had changed into his prison clothes and the cast were on their way to their next mission, Yoo Jae Suk said jokingly, “You should rethink your decision. If you suddenly said right now, ‘I’m sorry!’, then the viewers would understand. They’d be like, ‘that rascal,’ and laugh, and move on.” HaHa asked Lee Kwang Soo what he would do on Mondays now that he wouldn’t film “Running Man,” and Yoo Jae Suk said, “He’ll just lie there.”One of the missions featured the other cast members answering questions about Lee Kwang Soo, which Ji Suk Jin, HaHa, and Jun So Min failed. However, Yoo Jae Suk moved Lee Kwang Soo by getting the name of Lee Kwang Soo’s father correct. Song Ji Hyo and Kim Jong Kook also got their answers correct and the sentence was reduced by 120 years. In the final mission, Lee Kwang Soo succeeded on his first try and reduced his sentence to zero.At the end, the cast members and Lee Kwang Soo wrote letters to each other. Ji Suk Jin wrote, “It’s been eleven years since I first met you. At first, I only knew you from TV as that tall kid, but now you’re a younger brother whom I’ll always be with. Even though it wasn’t much when we first started it, it somehow became a meaningful moment for me. I was happy every time we did the ‘Pil! Chok! Cross!’ together. Let’s go together always, even if it isn’t on ‘Running Man.'”Yoo Jae Suk said, “It’s been eleven years since we started ‘Running Man’ together. You’ve been through a lot and worked hard during that time. I’m not sure who I’ll keep interrupting and piggybacking now, but I think it will probably be Yang Se Chan or Ji Suk Jin. It will feel empty without you, but you should do all the things that you wanted to do now without worrying about us. Let’s see each other often, and call me when something happens. Thank you, Kwang Soo. Thanks to you, it was never dull.”Kim Jong Kook said, “I’m not sure what was so funny now, thinking about all the times we started laughing while just looking at each other. It felt like we would go on like this forever without changing. The regret is even stronger because it’s Kwang Soo, with whom I thought I would go until the end. Even though we aren’t able to go on with ‘Running Man’ together anymore, let’s go for the rest of our lives together. Stay healthy.”HaHa said, “Since I’ve seen you every week for 11 years, it feels like I’ll see you again next week still. I think that the viewers are so sad about this because they could see that Lee Kwang Soo had always done his best and showed his passion until now. Kwang Soo, you worked hard. Who will I tease now? Who will I con now? Who will I talk all night with now? I’ll pray for you to shine wherever you are and achieve all the dreams you want.”Although the atmosphere was a tearful one, Song Ji Hyo’s letter prompted laughter when Lee Kwang Soo was unable to decipher her handwriting. She had written, “When I was annoyed, happy, having a hard time, weighed down, moved, when I was in a strange place or saw something strange. Thanks for spending all these moments of the past 11 years with me. You worked hard.” At the end of the recording, she wrote a longer letter that said, “I said this earlier, but I still can’t believe that you, who has always been there, won’t be there anymore. I feel like it will all collapse once I realize it, but visit us whenever you’re sad. I love you.”Jun So Min said, “I’m grateful that we’ve known each other for this time that feels long at times and short at others. Thank you for gifting me with memories that I will never forget. I’ll pray for each step you take in future. We’ll keep things going strong! Also, please visit whenever. We’ll be waiting for you.” Yang Se Chan said, “You worked hard for the past 11 years. I was really happy spending the past four years with you. We always call each other after the end of every recording and talked about a lot of things, but now we can’t do that. I’ll miss you, and it will feel empty without you. Do everything you want in a world without punishments.”In his final letter, Lee Kwang Soo said, “The members helped me get to where I am today. They feel like another family, and I am so, so grateful to them. I’m sorry. I’m sorry again. I wasn’t always great in the past eleven years, but I always did my best. ‘Running Man’ is a show where everyone without exception does their best and throws their whole bodies into filming. I ask that people continue to show it more love and interest in future. Thank you.”At the end, he said to viewers, “I am so happy and thankful for the time we’ve shared.”Watch “Running Man”: Watch Now Source (1) (2) (3) (4) (5) (6)", "Section": "", "Writers": "", "URL": "https://www.soompi.com/article/1474454wpp/lee-kwang-soo-shares-his-gratitude-and-love-for-the-members-and-fans-in-final-running-man-appearance", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}