{"Type": "", "Time": "2021-06-14", "Headline": "Doc on Eriksen, who had cardiac arrest: He was gone, we got him back , Latest Football News - The New Paper", "Text": "The scoreboard at Copenhagen's Parken Stadium read Denmark 0 Finland 1 yesterday morning (Singapore time).But the more important result was delivered at the nearby Rigshospitalet medical facility - Danish playmaker Christian Eriksen was awake, stable and responsive after suffering cardiac arrest during the Euro 2020 Group B opener. Tests so far have returned normal results.Many feared the worst after the 29-year-old Inter Milan midfielder had collapsed on the field while he was about to receive a throw-in in the 42nd minute, with no one challenging him.Cardiologists hailed the quick response from various parties as being crucial to the successful resuscitation of Eriksen.Referee Anthony Taylor promptly stopped play and called for medical attention.Denmark captain Simon Kjaer, the first to attend to Eriksen, checked to make sure that his teammate's airway was clear, before administering the first dose of cardiopulmonary resuscitation (CPR).Dr Scott Murray, a cardiologist with the UK's National Health Service, told MailOnline that Kjaer did the right thing.\"We're just lucky that the players on the pitch knew what to do, to put him in a safe position and make sure he wasn't choking and alert the medical team,\" said Dr Murray.Denmark's players and staff - some of whom were in tears - quickly formed a protective human wall around their stricken teammate as he received medical attention from the physios and paramedics.Eriksen was then revived with a defibrillator and taken to hospital.Team doctor Morten Boesen said yesterday: \"He was gone; we did cardiac resuscitation, it was a cardiac arrest. We got him back after one defib (defibrillation).\"The match resumed one hour and 45 minutes later, after news came through that Eriksen had regained consciousness.Denmark coach Kasper Hjulmand said several of his players had been too overwhelmed by the incident to finish the match.\"I completely understand that you can't play a soccer match at this level after watching one of your best friends fight for his life,\" a visibly drained Hjulmand said at the news conference.Players were given the option of finishing the game a day later, said the 49-year-old, adding there was no pressure from Uefa to complete it on the same day.\"It was more manageable to go in again and honestly just get it over with,\" said Hjulmand. His side lost 1-0 to a Joel Pohjanpalo header.The Danes used video conferencing to communicate with Eriksen, who told Hjulman he did not remember much from the collapse and that he was keen to get back on to the pitch.Professor Sanjay Sharma, who is chairman of the expert cardiology consensus panel for England's Football Association, told the BBC \"the thing that saved Eriksen's life was very urgent and rapid medical attention\".Dr Sharma, who was Eriksen's former cardiologist, also told The Mail on Sunday that the player had no history of heart concerns while he was with English Premier League club Tottenham Hotspur from 2013 to 2019.\"I thought, 'Oh my God? Is there something there that we didn't see?' But I have looked at all the test results and everything looked perfect,\" said Dr Sharma.\"From the day we signed him, it was my job to screen him and we tested him every year. So certainly his tests up to 2019 were completely normal, with no obvious underlying cardiac fault. I can vouch for that because I did the tests.\"Former Bolton Wanderers midfielder Fabrice Muamba said that Eriksen's collapse evoked memories of his cardiac arrest on the pitch in an FA Cup match in 2012.\"To watch it from that distance and not know what was going to happen, it was scary, but credit to the medical staff,\" Muamba, who had to retire soon after his cardiac arrest at the age of 24, told the BBC.\"They have done an amazing job on Christian. I like how his teammates got together to protect him.\"Eriksen's former Spurs teammates Jan Vertonghen, Toby Alderweireld and Nacer Chadli were distraught when they heard the news ahead of their 3-0 Group B win over Russia.His Inter teammate Romelu Lukaku, who bagged a brace, dedicated his goals to him.While the cause of Eriksen's cardiac arrest is uncertain, the quick intervention definitely made a key difference, with cardiologists emphasising the importance of recognising the signs and having life-saving CPR skills.Dr Yeo Tee Joo, consultant cardiologist and director of cardiac rehabilitation at Singapore's National University Heart Centre, tweeted: \"Praying for #ChristianEriksen's full recovery. Early recognition + prompt CPR + defibrillation saves lives regardless of aetiology of cardiac arrest.\"Extremely important knowledge and skill that ALL should have.\"UK-based cardiologist Dr Sam Mohiddin told the BBC: \"The moment of extreme peril is the time of the cardiac arrest and treating that is a matter that requires people to promptly recognise what is happening and really address it quickly with CPR and a defibrillator.\"CPR saves lives. Most of us should learn how to perform CPR for all sorts of reasons and not just because cardiac arrests can affect sportspeople.\" - AFP, REUTERSGet The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/sports/football/doc-eriksen-who-had-cardiac-arrest-he-was-gone-we-got-him-back", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}