{"Type": "", "Time": "2021-06-14", "Headline": "E-scooter, PAB riders must pass theory test from 1 Jan, 2022", "Text": "SINGAPORE — Power-assisted bicycle (PAB) and e-scooter riders must soon pass a mandatory online theory test before they are able to ride on cycling paths and roads, the Land Transport Authority (LTA) said on Monday (14 June). The rule, which will take effect from 1 January 2022, will improve awareness of active mobility rules, code of conduct and safe riding practices, said LTA. Separate tests for PAB and e-scooter users will be available on Singapore Polytechnic’s (SP) Professional & Adult Continuing Education (PACE) Academy at www.pace.sp.edu.sg from 30 June in English, Chinese, Malay and Tamil. To help riders prepare for the tests, e-handbooks in these languages have been made available at go.gov.sg/amrules.This will comprise 30 multiple-choice questions for the e-scooter test and 40 for the PAB test, with 30 minutes and 40 minutes given respectively to complete the tests. A digital certificate, with no expiry date, will be issued to those who pass. The passing score is 80 per cent.Riders, who must be at least 16 years old, must register for an account on the theory test portal using their SingPass at least a day before taking the test. E-scooter riders below the age of 16 can only ride under adult supervision, and the supervising adult will need to have passed the test.Those who register for the test from 30 June to 30 September will enjoy a discounted fee of $5 per test, with a free second attempt should they fail on the first. Riders who register after 30 September must pay $10 per test attempt. There will be a transition period of six months – 30 June to 31 December – for riders to prepare, take and complete the test before enforcement kicks in. From 1 January 2022, riders must show their digital certificate when requested by enforcement officers.  Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:Singapore reports 13 new COVID-19 cases, 10 from the communityStudents to gradually return to school from 28 June: MOESHN rules for travellers from Fiji tightened, for travellers from Israel easedWhen you want protection that goes beyond just covering your medical costs, critical illness insurance is the logical choice. But with so many options out there, which ones are best for you? We investigate in this article. In a nutshell, critical illness insurance is insurance […] The post Best Critical Illness Insurance Plans In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.Search for private jet membership. The affordable price makes these private jet offers hard to resistThe Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.The Philippines will extend a key military pact with the United States for another six months, its foreign minister said Monday, after months-long negotiations between the two countries.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.An American father-son duo accused of orchestrating former Nissan chief Carlos Ghosn's audacious escape from Japan admitted their role Monday as they made their first appearance before a Tokyo court.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Looking for travel insurance? Save more with these promo codes and discounts from insurers such as FWD, MSIG, AXA, and more! To find out if your travel insurance covers COVID-19, read this article for the latest updates. No matter your travel itinerary, travel insurance is […] The post Travel Insurance Promotions and Discounts appeared first on SingSaver Blog - We Compare, You Save.Certainly, The Apprentice: ONE Championship Edition lived up to its billing as the toughest iteration of the show yet. Sixteen global candidates were subjected to taxing physical tasks and high-stakes business competitions for the better part of the past three months that truly, the best of the best came through and ended with Jessica Ramella … Continue reading \"The Apprentice: ONE Championship Edition’s Success To Open More Doors, Says Chatri\"Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.Every PC user must read this in 2021 - Do it now.Canberra MRT opened in November 2019, and in the immediate quarter after (Q1 2020), property prices in District 27 jumped by over 6% QoQ. Read about what Canberra has to offer, as well as BTO and Condo projects in the area.A French nuclear firm said Monday it was working to resolve a \"performance issue\" linked to a gas build-up at a plant it part-owns in southern China following a US media report of a potential leak there.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.If you own a computer, this smart USB stick is an absolute must have!Polynesian seafarers likely reached Antarctica hundreds of years before the Western explorers usually credited with discovering the frozen continent, a new study has concluded.Dubai earned a reputation for delivering luxury for those with cash to splash years ago, but amid the Covid-19 pandemic, a new mode of travel has become popular -- yachts.Ukrainian leader Volodymyr Zelensky Monday said US President Joe Biden should have met him before his high-profile summit with Russia's Vladimir Putin as they could resolve nothing on Ukraine without Kiev at the table.Amazon.comEuropean and US stocks diverged on Monday as investors marked time ahead of a meeting of the Federal Reserve this week that may provide fresh clues about prospects for higher interest rates as inflation soars.High coverage, no-fuss application and early benefit payout makes this a great plan for those seeking cancer protection. As many as 1 in 4 Singaporeans could develop cancer in their lifetimes. Hence, getting a protection plan specifically for cancer may be a prudent move, especially […] The post FWD Cancer Insurance (Review): Fuss-free Plan That Pays Out At All Stages appeared first on SingSaver Blog - We Compare, You Save.Prime Minister Jacinda Ardern announced Monday she will offer a formal apology to New Zealand's Pacific community over \"demeaning\" police raids that targeted them in the 1970s.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/e-scooter-pab-riders-pass-online-theory-test-1-jan-2022-102449409.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}