{"Type": "", "Time": "2021-06-14", "Headline": "Euro 2020: Denzel Dumfries rescues Netherlands with late winner, Latest Football News - The New Paper", "Text": "Flying fullback Denzel Dumfries scored a late winner to earn the Netherlands a 3-2 victory over Ukraine in a thrilling Group C opener at the European Championship on Monday morning (June 14, Singapore time) after the Dutch had thrown away a two-goal lead.Dumfries rescued all three points for the home team five minutes from time after Ukraine had fought their way back into the match at the Johan Cruyff Arena.The Dutch were 2-0 up with 15 minutes left, only to allow their opponents two quick goals and the chance to share the points before Dumfries headed home a dramatic winner to the delight of the home fans.Captain Georginio Wijnaldum and striker Wout Weghorst netted within seven minutes early in the second half as the Dutch sought a successful return to a major tournament – after a seven-year absence – in front of 16,000 spectators.Wijnaldum’s left-foot finish in the 52nd minute opened the scoring before Weghorst quickly added a second.That put the Dutch in command but Ukraine ensured a nervy finish when captain Andriy Yarmolenko pulled one back in the 75th minute with a superb strike and Roman Yaremchuk equalised four minutes later.Wijnaldum scored for a fifth time in his last eight appearances for his country as he snapped up a clearance from Ukraine goalkeeper Georgiy Buschcan, who was attempting to push a square pass away from the dangerous Memphis Depay.It was set up after another strong run down the flank from the Dutch, whose right wing-back Dumfries was particularly dangerous and deserved his big moment at the end.Dumfries was also the provider of the second in the 59th minute although Ukraine complained he had fouled Rutland Malinovskyi in trying to wrestle his way closer to goal.Weghorst reacted quickest to a poor clearance from Mykola Matviyenko for his second goal in as many games as he repaid coach Frank de Boer’s faith in his hustling ability up front.Yarmolenko brought Ukraine back into the game with a fine curling shot from outside the box after exchanging quick passes with Malinovskyi.It was a first goal in six matches at the finals for Ukraine and was followed by an equally adept finish as Yaremchuk headed home Malinovskyi’s perfectly-weighted free-kick.Parity lasted only six minutes, however, as Dumfries headed home Nathan Ake’s cross.\n“I am relieved,” Wijnaldum said. “Overall, we played a good game, but we gave them two chances in 10 minutes which were two goals. We need to learn that if we play such a match we need to finish it off well. We let them get back into the game and that needs to improve.”  – REUTERSGet The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/sports/football/euro-2020-denzel-dumfries-rescues-netherlands-late-winner", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}