{"Type": "Sport", "Time": "2021-06-14", "Headline": "Tennis: Djokovic beats Tsitsipas to win French Open title", "Text": "PARIS: Novak Djokovic captured his second French Open title as he recovered from being outplayed for two sets by Stefanos Tsitsipas to win 6-7(6) 2-6 6-3 6-2 6-4 victory on Sunday (Jun 13).Djokovic's seismic semi-final win over 13-times champion Rafa Nadal looked like being in vain as an inspired Tsitsipas moved to the brink of becoming Greece's first Grand Slam champion.After failing to convert a set point in an enthralling 72-minute opener full of brutal rallies and then crumbling in surprising fashion in the second set, Djokovic looked drained.His hopes of banking a 19th Grand Slam title were hanging by a thread but he rediscovered his mojo in the nick of time to turn the match around in emphatic fashion.The 34-year-old, who won his first French crown in 2016, rattled through the third and fourth sets as Tsitsipas, playing in his first Grand Slam final, struggled to maintain the intensity that had put him in charge.Fifth seed Tsitsipas appeared to be struggling physically but valiantly tried to dig in at the start of the fifth set as the shadows spread across a sunlit Court Philippe Chatrier.But Djokovic got the early break in the decider and although he was pushed hard, he was never threatened again.There were nerves as he served at 5-4, netting an easy volley and then seeing a Tsitsipas backhand flash past him on championship point. But Djokovic would not be denied as he claimed victory by angling away another volley at the second time of asking after four hours 11 minutes.In moving just one behind the record of 20 shared by Nadal and Roger Federer, Djokovic became the first player in the professional era to win each Grand Slam title at least twice.\"It was again an electric atmosphere. Nine hours of tennis in less than 48 hours,\" Djokovic said on court.\"It's not easy; physically and mentally it was very, very difficult for me, these three days. I believed in my capacities and in my game. It's a dream come true.\"Djokovic earned his 19th Grand Slam title the hard way.Not only did he inflict only a third ever defeat on Nadal, he also became the first player in the professional era to win a Grand Slam title having twice come back from a two sets down, having also found himself staring at defeat against Lorenzo Musetti in the fourth round.There was no easing in to his first Grand Slam final for Tsitsipas who had to save two break points in his opening service game, one with a backhand and one with an ace.ROCK SOLIDTsistipas settled quickly, however, marking out his territory with his backhand looking rock solid.Favourite Djokovic was thrown off his stride when he took a heavy tumble chasing down a drop shot at 3-3 and the Serb found himself in trouble at 4-5, framing a forehand high into the stands to hand Tsistipas a set point.The players traded backhands but Djokovic produced a clever angle to save fend off the set point.He then served for the set at 6-5 but produced a poor game and a tiebreak was needed to separate them.It was Djokovic who looked to be feeling the strain as he double-faulted on the way to falling 4-0 behind.But he regrouped and produced a sensational drop volley at 3-5 before forging 6-5 ahead only to see his set point whipped away by a fizzing Tsitsipas forehand.Djokovic then shunted a backhand wide to hand Tsitsipas a second set point and this time the Greek took advantage as Djokovic's forehand misfired.There was a hint of despondency in Djokovic's body language and Tsitsipas sensed it, seizing control of the match to dominate the second set after breaking early.Djokovic netted a forehand to fall 2-5 down and offered scant resistance as Tsitsipas held to take a two-set.Just as against Musetti in the fourth round, the backlash was instant.Djokovic began striking the ball more aggressively and closer to the lines and he engineered five break points in an energy-sapping fourth game - eventually converting for a 3-1 lead when the Greek missed a backhand down the line.After winning the third set Djokovic carried the momentum into the fourth and Tsitsipas, who had some treatment on his lower back, appeared to be crumbling as he dropped serve twice.The crowd tries to spur Tsitsipas on in the fifth but there was no escape as Djokovic rolled to victory.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Stefanos Tsitsipas,sports,Novak Djokovic,French Open,title", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/tennis-djokovic-beats-tsitsipas-to-win-french-open-title-15007918", "Source": "google"}