{"Type": "", "Time": "2021-06-14", "Headline": "Malaysia-born science journalist Ed Yong wins 2021 Pulitzer Prize | The Star", "Text": "\n                    Monday, 14 Jun 2021\n                PETALING JAYA: Malaysia-born journalist Edmund Yong has won the 2021 Pulitzer Prize for his explanatory reporting of the Covid-19 pandemic.A tweet by the The Pulitzer Prizes on June 12 stated that Yong, a science writer with the American magazine The Atlantic since 2015, has been awarded the 2021 Pulitzer Prize in explanatory reporting.Responding to this, Yong said in a tweet that reporting on the pandemic was the most fulfilling and difficult challenge of his professional life.\"I did my best to give our readers a stable platform from which to make sense of a crisis that defied sense. I’m sad these stories were ever necessary but I hope they made a difference,\" he tweeted on Saturday (June 12).Yong thanked the Pulitzer board and jurors for his win as well as the 300 sources who had taken the time to share their expertise with him, and he also thanked his colleagues at The Atlantic.\"It really takes a village, and in recognition of that I’ll be splitting the prize money between everyone who worked on my pieces last year - every editor, copy editor, fact checker, artist, and more. Even when individuals win Pulitzers, their work depends on a community. I want to honour mine,\" he said.He also thanked his wife - science communicator Liz Neeley - in a tweet on his account.\"@lizneely kept me afloat through all of it. Her ferocious intellect, boundless empathy, and ability to maintain optimism while facing cold reality, are all part of the DNA of my work. I love you, Liz. You’re my whole, my hope, my home,\" said Yong.Meanwhile, The Atlantic said through a page on its website compiling Yong's articles on the pandemic in the US that he \"anticipated the course of the coronavirus pandemic, clarified its dangers, and illuminated the American government’s disastrous failure to curb it\".The Atlantic added that Yong correctly predicted an interconnected set of dangers for the US, including breakdowns in international communication, chronic under-funding of public health, shortages of supplies and scientific expertise at the federal level. \nTags / Keywords:\nCovid-19\n                                                                ,\n                                                                                                Malaysian journalism\n                                                                ,\n                                                                                                Journalism\n                                                                ,\n                                                                                                Pulitzer Prize\n                                                                ,\n                                                                                                Ed Yong\n                                                                ,\n                                                                                                Edmund Yong\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/news/nation/2021/06/14/malaysia-born-science-journalist-ed-yong-wins-2021-pulitzer-prize", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}