{"Type": "", "Time": "2021-06-14", "Headline": "Experts: Novak Djokovic's gift to young fan could be lucrative", "Text": "The happiest person at the French Open on Sunday might not have been the newly crowned men's champion. A young fan displayed even more jubilance than Novak Djokovic after receiving a one-of-a-kind souvenir. Moments after rallying from a two-set deficit to defeat Stefanos Tsitsipas and secure his 19th major title, Djokovic generously gifted his match-used racket to a boy in the first row of the stands. The boy clutched the racket with both hands and jumped up and down in a mixture of elation and disbelief.Asked about the heartwarming moment after the match, Djokovic explained that the boy had remained in his corner when he appeared destined to lose, encouraging him and even offering some suggestions.He was like: ‘Hold your serve. Get an easy first ball and then dictate. Go to his backhand,'\" Djokovic told reporters with a laugh. He was coaching me, literally, and I found that very cute and very nice. To give the racket to the best person — it was him — after the match. That was kind of my gratitude for him sticking with me and supporting me.”Sports memorabilia experts told Yahoo Sports the boy had good reason to be excited about the gift. Djokovic's racket would be worth tens of thousands of dollars if the boy put it up for auction. The racket could fetch between $25,000 and $35,000 today, estimated Ken Goldin, founder and executive chairman of Goldin Auctions. Ezra Levine, CEO of the sports memorabilia investment platform Collectible, went even higher, calling more than $50,000 a \"conservative estimate.\"Both Goldin and Levine told Yahoo Sports the racket could appreciate quickly with Djokovic within one major title of tying Roger Federer and Rafael Nadal for most all-time by a male player. Goldin valued the racket at $50,000 if Djokovic secures 20 or more major titles and $75,000-$100,000 if he wins this year's Wimbledon and U.S. Open to complete a 2021 grand slam.While Djokovic's French Open racket is a lucrative souvenir for tennis, it's nowhere close to the value of a comparable item from a more popular sport. For example, Goldin says Tom Brady's game-worn 2021 Super Bowl jersey could fetch more than $1 million. Of course none of this may matter to the boy who received Djokovic's racket. Judging from his reaction, he may not be looking to sell anytime soon. To him, that piece of tennis history may be priceless.More from Yahoo Sports:Wetzel: Entertaining Diaz wins even after losing at UFC 263Clippers win Game 3 as Jazz star Mitchell sits down stretchDenmark team doc: Eriksen resuscitated after cardiac arrestEx-Chief Bell: ‘I’d retire’ before playing for Andy Reid againWith its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.China on Monday accused the G7 of \"political manipulation\" after it criticised Beijing over its human rights record in Xinjiang and Hong Kong.Today's mortgage refi rates at 1.77% FIXED - No hidden points or fees! 1.97% APR. Takes 2 minutes to start. Calculate new payment.The executive condo is an alluring property in Singapore because it serves ‘sandwich class’ Singaporeans. Whether it’s EC grant, EC income ceiling or resale levy, read everything you need to know about executive condos here.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.The current rates for Medicare Plan F may not be what people expect. Look for Medicare Plan F rates.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Canberra MRT opened in November 2019, and in the immediate quarter after (Q1 2020), property prices in District 27 jumped by over 6% QoQ. Read about what Canberra has to offer, as well as BTO and Condo projects in the area.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Amazon.comRight-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.Several hundred people gathered in London, Ontario on Saturday to pay homage to a Muslim family deliberately mowed down by the driver of a pick-up truck, in an attack that has shocked Canadians and which Prime Minister Justin Trudeau denounced as \"terrorist.\"Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.We need 73 more Democrats from San Antonio to add their names in defense of the constitutional right to vote!The Ministry of Health (MOH) on Sunday (13 June) reported the detection of 13 new cases of COVID-19 infection in Singapore, taking the country's total case count to 62,276.President Recep Tayyip Erdogan on Sunday said Turkey would be the \"only reliable\" country left to stabilise Afghanistan after the US pulls out its troops, indicating Washington could rely on its NATO ally.The trial of deposed Myanmar leader Aung San Suu Kyi was expected to hear its first testimony Monday, more than four months after a military coup ousted her government.The World’s Most Awarded Luxury Cruise Line returns to sea this July with new 7-night Luxury Bahamas Escapes on Crystal SerenityA 60-year-old man was charged on Monday (14 June) for allegedly stabbing another man at the void deck of a Choa Chu Kang HDB block.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Novak Djokovic claimed a 19th Grand Slam title and became the first man in 52 years to win all four majors twice when he came from two sets down to beat Stefanos Tsitsipas in a gripping French Open final on Sunday.Shop Unique Art, Decor and more!Foreign forces should hold 'no hope' of keeping a military presence in Afghanistan after the US and NATO withdraw troops, the Taliban said Saturday, warning the security of embassies and airports would be the responsibility of Afghans.Most Singaporeans can't imagine owning an HDB flat without using their CPF money to pay for it.  While some complain about how their CPF money is “locked” up, the compulsory savings scheme is no doubt a major factor that has helped Singaporeans achieve such a high homeownership rate.  On top of using CPF money, the CPF Housing Grant, or HDB Grant, is another important policy that is helping Singaporeans cope with the high cost of home purchase.All travellers entering Singapore who have travel history in the past 21 days to Fiji are required to serve a 21-day Stay-Home Notice at dedicated SHN facilities given the worsening COVID-19 situation in the country.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/experts-djokovics-gift-to-young-fan-could-fetch-tens-of-thousand-of-dollars-200606665.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}