{"Type": "Business", "Time": "2021-06-14", "Headline": "Airline industry sees long-term rebound for sector amid COVID-19", "Text": "PARIS: After flying into the financial turbulence of the COVID-19 pandemic, the airline sector expects passenger traffic to take off despite concerns about the industry's impact on climate change.In its latest look at trends for the sector, the International Air Transport Association (IATA) said it doesn't expect world air traffic to resume to its pre-pandemic level before 2023.But over 20 years, air traffic should almost double, from 4.5 billion passengers in 2019 to 8.5 billion in 2039.That is, however, a drop of one billion passengers from IATA's pre-crisis forecast.Nevertheless that will be good news for aircraft manufacturers, who slowed down production during the crisis as airlines cancelled orders to stay financially afloat.Airbus has already announced it plans to step up the manufacturing cadence of its best-selling A320 single-aisle aircraft and should reach a record level already in 2023.Boeing, for its part, forecasts that airlines will need 43,110 new aircraft through 2039, which will result in a near doubling of the global fleet. Asia alone will account for 40 per cent of that demand.As with the Sep11 attacks or the global financial crisis of 2007-2009, \"the industry will prove resilient again\", Darren Hulst, vice president of marketing at Boeing, said last year.Marc Ivaldi, research director at the Paris-based School for Advanced Studies in the Social Sciences, noted that only 1 per cent of the population currently uses air travel.\"With the simple demographic rise and the fact that people become richer there will be rising demand for air travel and thus for aircraft,\" he told AFP.If the biggest aircraft fleets are currently in the United States and Europe, the biggest increases are expected in Asia and the Middle East, the consulting firm Oliver Wyman said in a recent study.\"FLIGHT SHAMING\"Airbus delivered 19 per cent of its planes to China, more than the United States, and this trend is not expected to change.In many emerging countries where the middle class is expanding air travel is becoming possible for more and more people.\"Among Asia's emerging nations, one of the greatest aspirational goals is simply the ability to fly internationally,\" said the Center for Aviation (CAPA).\"It is a sign of social and economic maturity and permits experiences which were unthinkable for their parents.\"It noted that these people were unlikely to share the growing sentiment among some people in the West towards reducing air travel to reduce one's carbon footprint.\"For these new would-be flyers, the whole concept of 'flight shaming' at a grass roots level is grossly alien,\" said CAPA.\"Consequently, in Asia flight shaming is unlikely to gain much traction,\" it added.The \"flight shaming\" or \"flygskam\" movement took off in Sweden in 2018 to challenge the growing popularity of air travel, which had boomed in Europe thanks to budget airlines that made weekend getaways across the continent affordable to a wider public.In 2019, air traffic declined by four percent in Sweden - but it hit a record across Europe, according to the air traffic control body Eurocontrol.EHESS's Ivaldi believes flight shaming will have little long-term impact.\"Someone who makes one flight per year in a plane, do you really believe that they will say that it is too polluting and give it up?\" he said.But countries like Sweden have begun to reintroduce night trains to give travellers greener options to travel.France, which is boosting its night trains, is also cutting domestic flights when it is possible to make the journey by train in under two and a half hours.Ivaldi believes that to be a largely empty gesture as fast trains have already taken most of the market on such routes.The air sector has pledged to cut its carbon emissions in half by 2050 from their level in 2005.Airlines have an economic incentive to do so, as adopting more fuel efficient planes reduces operating costs.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,aviation", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/business/airline-industry-sees-long-term-rebound-for-sector-amid-covid-19-15005184", "Source": "google"}