{"Type": "", "Time": "2021-06-14", "Headline": "Singapore: Seven arrested over attack on 3 young people on Friday night (June 11) in Jalan Bukit Merah | The Star", "Text": "\n                    Sunday, 13 Jun 2021\n                One of the men is suspected to have attacked the victims with a karambit knife.- Photo from SINGAPORE POLICE FORCE via The Straits Times/ANNSINGAPORE, June 13 (The Straits Times/ANN): Seven men aged between 15 and 29 were arrested on Saturday (June 12) for rioting armed with a deadly weapon. Five will be charged in court on Monday (June 14).They were involved in a fight last Friday night where three young people were attacked in Jalan Bukit Merah.One of the men is suspected to have attacked the victims with a karambit knife, police said on Sunday. Two victims, aged 14 and 15, were taken to hospital.A karambit knife recovered from one of the men was also seized.Police investigations are ongoing.Preliminary investigations revealed that the three victims are known to the assailants and they were allegedly attacked due to a dispute.The offence of rioting armed with a deadly weapon carries a jail term of up to 10 years, as well as caning.\"The police will not tolerate such brazen acts of violence and blatant disregard of the law,\" said the police in a statement.\"We will spare no effort to apprehend such offenders and deal with them in accordance with the law.\" - The Straits Times/ANN\nTags / Keywords:\nSingapore\n                                                                ,\n                                                                                                Cops\n                                                                ,\n                                                                                                Seven\n                                                                ,\n                                                                                                Men\n                                                                ,\n                                                                                                Arrested\n                                                                ,\n                                                                                                Rioting\n                                                                ,\n                                                                                                Three Youngsters\n                                                                ,\n                                                                                                Hurt\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\n", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/13/singapore-seven-arrested-over-attack-on-3-young-people-on-friday-night-june-11-in-jalan-bukit-merah", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}