{"Type": "", "Time": "2021-06-14", "Headline": "Taiwan president's ex-bodyguards sentenced in smuggling case", "Text": "A Taiwanese court on Friday handed prison terms to a dozen former presidential security agents and airline employees over their roles in a cigarette smuggling scandal on the island two years ago.A bodyguard in President Tsai Ing-wen's entourage tried to bring in 9,800 cigarette cartons as he returned from an official trip accompanying Tsai to the Caribbean.The president said at the time that she had no idea her security team was involved and ordered an investigation.The agent, identified as Wu Tsung-hsien of the National Security Bureau, received the heaviest sentence of 10 years and four months on corruption and tax evasion charges, according to Taipei district court.Wu tried to pass the cigarettes off as cargo from Tsai's presidential plane in an effort to smuggle them past customs, authorities said.It was later discovered that the scam was not a one-off when China Airlines released figures showing huge amounts of duty-free cigarettes were routinely purchased during presidential visits.The defendants \"deprived the government of tax revenue, and seriously damaged the nation's image\", judge Huang Pei-chen told a virtual press conference.The value of duty evaded on the cigarettes amounted to nearly Tw$8.2 million ($273,000), according to the court.Wu's colleague and main accomplice Chang Heng-chia was sentenced to 10 years and two months while six other ex-agents received jail terms ranging from six years and two months to seven years.Four airline employees implicated in the scandal were handed prison terms ranging from two years to five years and four months.They can appeal the ruling.The bureau's internal investigation found that most agents bought a few dozen cartons of cigarettes into the island on the trip -- the majority ordering between 11 and 50 cartons.Around 100 others involved in presidential security who have bought cigarettes into Taiwan reached deferred prosecution agreements in 2019 and last year.Taiwan's customs law limits travellers to a maximum of five cartons of cigarettes -- and only one can be tax-free.aw/axnIt is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.The executive condo is an alluring property in Singapore because it serves ‘sandwich class’ Singaporeans. Whether it’s EC grant, EC income ceiling or resale levy, read everything you need to know about executive condos here.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.President Recep Tayyip Erdogan on Sunday said Turkey would be the \"only reliable\" country left to stabilise Afghanistan after the US pulls out its troops, indicating Washington could rely on its NATO ally.Several hundred people gathered in London, Ontario on Saturday to pay homage to a Muslim family deliberately mowed down by the driver of a pick-up truck, in an attack that has shocked Canadians and which Prime Minister Justin Trudeau denounced as \"terrorist.\"Newly-crowned French Open champion Barbora Krejcikova hailed her mentor and former Wimbledon champion Jana Novotna who died in 2017, saying: \"At the end of her life, I had to be there.\"Protect yourself from Mosquitoes the moment you turn it on. These are selling fast, here is how it works.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.The trial of ousted Myanmar leader Aung San Suu Kyi will hear its first testimony in a junta court Monday, more than four months after a military coup.Foreign forces should hold 'no hope' of keeping a military presence in Afghanistan after the US and NATO withdraw troops, the Taliban said Saturday, warning the security of embassies and airports would be the responsibility of Afghans.Amazon.comDressed in a black turban and long religious coat, Ebrahim Raisi casts himself as an austere figure and an anti-corruption champion of the poor ahead of Iran's presidential election.Novak Djokovic claimed a 19th Grand Slam title and became the first man in 52 years to win all four majors twice when he came from two sets down to beat Stefanos Tsitsipas in a gripping French Open final on Sunday.What if China were to cut off the United States and Europe from access to rare minerals that are essential to electric vehicles, wind turbines and drones?Discover the benefits of a cloud that offers limitless scale, performance—and possibilities for what you can achieve.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.An American father-son duo accused of packing former Nissan chief Carlos Ghosn into an audio equipment case so he could escape trial in Japan will appear in a Tokyo court for the first time Monday.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.Grab Holdings CEO Anthony Tan said he’s confident the SPAC merger will be completed by year-end, following a delay caused by a review of its financials.The Ministry of Health (MOH) on Saturday (12 June) confirmed 18 new COVID-19 cases in Singapore, bringing the country's total case count to 62,263.When you want protection that goes beyond just covering your medical costs, critical illness insurance is the logical choice. But with so many options out there, which ones are best for you? We investigate in this article. In a nutshell, critical illness insurance is insurance […] The post Best Critical Illness Insurance Plans In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.You may be surprised by how pressure washing can transform your home. See for yourself. Look for nearby pressure washing services.As nuclear nations commit to renewing and sometimes expanding their arsenals, a decline seen since the early 1990s seems to have stalled, with some signs of a numerical increase, researchers said MondayAt least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Two strategies to consider when making investment decisions. The post Getting Started: What is Averaging Up and Averaging Down appeared first on The Smart Investor.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/taiwan-presidents-ex-bodyguards-sentenced-130317365.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}