{"Type": "Asia", "Time": "2021-06-14", "Headline": "China cautions G7: 'Small' groups don't rule the world", "Text": "CARBIS BAY, England: China on Sunday (Jun 13) pointedly cautioned Group of Seven leaders that the days when \"small\" groups of countries decided the fate of the world was long gone, hitting back at the world's richest democracies which have sought a unified position over Beijing.\"The days when global decisions were dictated by a small group of countries are long gone,\" a spokesman for the Chinese embassy in London said.\"We always believe that countries, big or small, strong or weak, poor or rich, are equals, and that world affairs should be handled through consultation by all countries.\"The re-emergence of China as a leading global power is considered to be one of the most significant geopolitical events of recent times, alongside the 1991 fall of the Soviet Union that ended the Cold War.The G7, whose leaders are meeting in southwestern England, has been searching for a coherent response to the growing assertiveness of President Xi Jinping after China’s spectacular economic and military rise over the past 40 years.Leaders of the group - the United States, Canada, Britain, Germany, Italy, France and Japan - want to use their gathering in the English seaside resort of Carbis Bay to show the world that the richest democracies can offer an alternative to China’s growing clout.Canadian Prime Minister Justin Trudeau led a G7 discussion of China on Saturday and called on leaders to come up with a unified approach to the challenges posed by the People's Republic, a source said.The G7 are planning to offer developing nations an infrastructure scheme that could rival Xi's multi-trillion-dollar Belt and Road Initiative.Beijing has repeatedly hit back against what it perceives as attempts by Western powers to contain China, and says many major powers are still gripped by an outdated imperial mindset after years of humiliating China.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "G7,China", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/g7-small-groups-dont-rule-world-china-biden-15005312", "Source": "google"}