{"Type": "", "Time": "2021-06-14", "Headline": "Blind admits he almost pulled out of Netherlands' Euro 2020 opener after Eriksen hospitalisation | Goal.com", "Text": "Netherlands defender Daley Blind admitted that he considered pulling out of his side's Euro 2020 opener with Ukraine follow Christian Eriksen's collapse during Denmark's game with Finland the day before.The Inter playmaker was taken to hospital after suffering cardiac arrest during his country's Group B clash in Copenhagen on Saturday, and was subsequently resuscitated on the pitch by medics before he was transferred to hospital in a stable condition.The events struck home particularly close for Blind, a former Ajax team-mate who was diagnosed with a heart condition in 2019 following his own collapse in a Champions League game against Valencia, and the 31-year-old admitted he came close to withdrawing from his side's eventual 3-2 win in Group D this weekend, while asking for the Dane to be afforded privacy over his future.\"I had to overcome a mental hurdle to play,\" Blind admitted. \"I'm proud that I did it. Then eventually the emotion comes out.\"[To see what happened], that had such an impact. For me, they were things that I recognised. That made it all the more intense.\"To hear that he is doing well now gives everyone the strength to be able to play on anyway. As for his future, please leave it alone.\"Eriksen began his senior career in the Netherlands with Ajax, where he was a disciple of Oranje manager Frank de Boer, and is also an Inter team-mate of Dutch international Stefan de Vrij, with whom he won Serie A this season.Both men found it tough to deliver their thoughts following Sunday's victory against Ukraine, acknowledging that they were particularly affected by the events that transpired at Parken Stadium.“It was very difficult for me to see those pictures,\" De Boer stated. \"We watched the game together and I had to retreat to my room.\"I've worked with him for years. We should have had a meeting, but we postponed it until this morning. I didn't want to talk about football at the time.”De Vrij concurred, adding: “I was devastated. I followed it with goosebumps and felt great emotions.\"Of course you think about it, you wake up with it - but when the referee starts the game, you have to focus on your own game.”", "Section": "", "Writers": "", "URL": "https://www.goal.com/en-sg/news/blind-admits-he-almost-pulled-out-of-netherlands-euro-2020/1dtzkur44sp6j1llud3am79tn6", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}