{"Type": "", "Time": "2021-06-14", "Headline": "Engineer, nursing aide are two new unlinked cases here, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.A 27-year-old engineer from India was one of two unlinked Covid-19 cases announced yesterday by the Ministry of Health (MOH).The two unlinked cases, detected through surveillance testing, were among the 10 confirmed cases in the community yesterday.The engineer, who works for local firm Ecoxplore, had tested for Covid-19 as part of rostered routine testing (RRT) last Thursday, and subsequently developed a fever on the same day.MOH said his pooled RRT test result came back positive for Covid-19 last Friday. An individual test was then administered, which came back positive for infection the next day. His serology test result is negative.Two of his household members - two Singaporean women aged 19 and 39, who are related - also tested positive.The second unlinked case from yesterday is a 23-year-old man from India who works as a nursing aide at All Saints Home in Hougang.He is asymptomatic, and was tested for the coronavirus last Friday as part of the nursing home's surveillance testing for staff.He was given an individual test that same day after his pooled test result came back positive.The result for this individual test was negative for Covid-19, but another test on Saturday came back positive.\"His CT value was very high, which is indicative of a low viral load, and his serology test result is positive,\" said MOH.The ministry added that he is likely to be shedding minute fragments of the virus from a past infection, which are no longer transmissible and infective to others.The man had received his first dose of Covid-19 vaccine on March 10, and the second dose on March 31.Four of the new linked cases worked at Bukit Merah View Market and Food Centre, which was announced as a new cluster yesterday. They had already been placed on quarantine when they tested positive for Covid-19.The fifth linked case is a 59-year-old part-time cleaner at Crystal Lodge. She had already been quarantined as she was identified as a close contact of a 57-year-old woman who works as a promoter at Ion Orchard. The promoter was confirmed last Thursday to be infected.A 66-year-old Singaporean man was the final linked case. He is a family member of a 68-year-old landscape gardener at Amozonia, who was confirmed to have Covid-19 on Saturday.There were also three imported cases announced yesterday. They had been placed on stay-home notice upon arrival in Singapore. Two of the imported cases are Singapore permanent residents.The third imported case is a work permit holder who arrived from Indonesia and is a foreign domestic worker.No new cases from workers' dormitories were reported.Singapore's total number of Covid-19 cases now stands at 62,276.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/engineer-nursing-aide-are-two-new-unlinked-cases-here", "Source": "google"}