{"Type": "", "Time": "2021-06-14", "Headline": "Cynical, shameful and disastrous: Johnson’s handling of Northern Ireland | Letters | The Guardian", "Text": "Brexit ministers always intended to ignore the agreement they signed and blame the EU for the consequences, argues Adrian Ward. Plus letters from Mike Pender, Steve Fildes, Chris Webster and Amin Kassam Last modified on Sun 13 Jun 2021 13.06 EDTIf you make an agreement with someone, you have to honour it (Boris Johnson to face pressure from EU on Northern Ireland, 12 June). If you unilaterally decide to change the terms, you have broken the agreement and the other party will not trust you to keep your word in future and may penalise you.But Boris Johnson and his ministers knew exactly what they were doing in December 2019 to “get Brexit done” and never had any intention of sticking to the agreement over Northern Ireland – get it signed, then just ignore it and blame the EU for all the repercussions. Johnson’s political playbook, page one. Adrian WardLe Bez, France The EU has suggested a temporary food standards agreement that would do away with 80% of the checks required under the Northern Irish protocol. However, the UK has ruled out following EU rules even for few years because “it fears this would hinder its trade negotiations elsewhere” (Brexit: what is the Northern Ireland row about?, 9 June).The UK’s stance is illogical and disingenuous. Boris Johnson and his ministers have repeatedly promised that the UK’s food standards would not be relaxed after Brexit and, if anything, would be higher than in the EU. If this is truly the government’s intention, why not make temporary alignment with EU food standards the minimum requirement for foodstuffs going to Northern Ireland?Such an approach would be relatively straightforward to implement, given that the UK’s food standards have not changed since Brexit. And it should not impact adversely on trade deals with other countries unless the UK, contrary to its stated policy, wishes to import food from countries with less rigorous standards than in the UK. Mike PenderCardiff We should not let the government obscure the Northern Ireland protocol problems by throwing a dead cat, or in this case a dead pig, on to the table. It is nothing to do with anything as trivial as sausages, which is what the PM wants the public to believe.We signed an agreement and now want the EU to break their own rules because they do not, and never did, suit our purpose.How can we expect 27 countries to compromise their principles to meet ours? That is plainly absurd. The rules were clear before we started negotiations, so to now claim not to understand them is either a big lie or incompetence.The EU has offered a solution: that we align our standards with theirs, which they already do. Result, sausages back on the table. Steve FildesAlfrick, Worcestershire Dominic Raab wants the EU to be “less purist, more pragmatic and more flexible” in its approach to the Northern Ireland protocol. If Brexit fanatics in his party had shown similar pragmatism or flexibility in implementing Brexit, then the protocol would never have been necessary. Labour MPs too should consider the consequences of their endorsement of Tory Brexit purism. Chris Webster Gümligen, Switzerland David Frost regards the EU stance on the Northern Ireland protocol as “legal purism”. It seems the Tories would prefer “impurism”, so that they could have enough wriggle room to interpret the protocol whichever way they want. Amin Kassam Voorburg, the Netherlands Have an opinion on anything you’ve read in the Guardian today? Please email us your letter and it will be considered for publication.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/politics/2021/jun/13/cynical-shameful-and-disastrous-boris-johnsons-handling-of-northern-ireland", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}