{"Type": "", "Time": "2021-06-14", "Headline": "LIVE Transfer Talk: Arsenal looking to bring Real Betis' Nabil Fekir to Premier League", "Text": "With most of the major European seasons now complete, the rumour mill has been sent into overdrive as clubs ponder their moves ahead of what will be a busy transfer window. Check out the latest gossip below, and see all official deals here.AS says that Arsenal have turned their attention to Real Betis attacking midfielder Nabil Fekir, but negotiations over a transfer fee are not close to the La Liga club's demands.The former Lyon captain was left out of Didier Deschamps' 26-man France squad for this summer's European Championships but, despite a mixed campaign last season, the Spanish club consider the 27-year-old to be one of their best players after contributing to 10 goals in La Liga. And the stance is that Betis have no intention of letting their playmaker leave for a low price.Fekir was close to joining the Premier League in 2018 after a move to Liverpool broke down at the 11th hour. But if any deal is to take place this time, Arsenal must be prepared to raise their initial offer, which is reported to be around £20m.The news comes as Mikel Arteta's side continue their search for an attacking midfielder after recently missing out on Emi Buendia, who was linked to the Emirates before agreeing a £33m deal with Aston Villa. Martin Odegaard and Dani Ceballos are unlikely to return on loan and will head back to Real Madrid, leaving the Gunners short in midfield.- Stream ESPN FC Daily on ESPN+ (U.S. only)\n- Euro 2020 fixtures: Match dates, times and venues22.00 BST: That will do it for the latest edition of our LIVE Transfer Talk blog. We hoped you enjoyed following along with us and remind you to check back shortly for the latest transfer rumours, reports and completed deals. Goodnight!21.55 BST: Arsenal have opened up talks with Lazio winger Joaquin Correa but will need to up their offer in order to make any headway.Il Messaggero and La Repubblica writes that Arsenal have starting the bidding for the Argentine at €20 million but that Lazio are looking for more along the lines of €35m for the 26-year-old, who new Maurizio Sarri wants to work with. Correa has tallied 30 goals and 18 assists in 117 games for Lazio, including eight and four in 2020-21.21.04 BST: Gianluigi Donnarumma has agreed to a five-year contract with Paris Saint-Germain, according to Fabrizio Romano.The transfer guru suggests that Donnarumma will put pen to paper soon, on a deal that will see Donnarumma bank around £10million (€12m) per year, plus add-ons.The 22-year-old goalkeeper, who is currently on international duty with Italy at Euro 2020, is set to become a free agent at the end of the month.Donnarumma has already made 251 appearances for Milan at the tender age of 22, having debuted at 16 for the Rossoneri.20.17 BST: Leicester City are considering a shock €20 million move for Barcelona midfielder Philippe Coutinho, according to Mundo Deportivo.The move would reunite the 28-year-old with former manager Brendan Rodgers, with whom the Brazilian had his best season. Barcelona are looking to sell the midfielder, who has struggled with form and injury since arriving for £142 million in 2018.19.29 BST: United States international Konrad de la Fuente looks set to depart Barcelona.RAC 1 journalist Gerard Moreno claims that Barcelona are nearing a deal to sell De la Fuente to Marseille. Moreno claims the two are in negotiating a deal that will see the 19-year-old wide man move to OM for around €5 million.📂💣 KONRAD DE LA FUENTEBarça y Olympique de Marsella NEGOCIAN por KonradLos dos clubes estudian la fórmula de la operación* Traspaso puro, inferior a 5M con opción de recompra FCB* Cesión y obligatoriedad de compra#mercato en @EsportsRAC1 pic.twitter.com/tlqsVg8DfvDe la Fuente, who recently was named Barca's youth player of the year, has been at the Catalan club since 2013.18.43 BST: Widely tipped with a move to the United States and MLS, former Chelsea and Arsenal man David Luiz is also reportedly drawing interest from France.La Provence have confirmed that Marseille are in talks with the 34-year-old Brazilian over a potential return to Ligue 1. Luiz, who previously played at PSG between 2014-16, is reportedly intrigued by Jorge Sampaoli's project at OM.Luiz's wages could prove a stumbling block to a potential deal but La Provence writes that a deal \" would not be impossible.\"18.01 BST: New Tottenham sporting director Fabio Paratici is not wasting time.A day after being announced by the club, the Italian is already working hard to put his stamp on the club. The Express claims that Paratici has his eyes on making Stuttgart and Argentina forward Nicolas Gonzalez his first signing with the club. The 23-year-old bagged six goals in the Bundesliga last season, having fired 14 the year before in helping Stuttgart achieve promotion to the top flight.Brighton and Fiorentina have also been credited with interest in the versatile forward, with the Italian side having already had a bid of £21.4 million rejected.17.06 BST: With Carlo Ancelotti leaving Everton for Real Madrid, has James Rodriguez played his last game for the Toffees?Maybe not, with the 29-year-old Colombian revealing he could still have a future at Goodison Park.\"I don't know. I think not.... If I stay another year [at Everton] that's fine.\"I don't think Ancelotti is going to take me.\"The cycle for me with Real Madrid is closed.\"Rodriguez scored six goals and dished out nine assists last season in 26 games for Everton, flashing signs of his old self while playing under Ancelotti.16.18 BST: Scottish champions Rangers have rejected multiple bids for defender George Edmundson, Football Insider has learned.The centre-back, 23, spent the second half of last season on loan playing for Wayne Rooney at Derby County, and multiple English clubs have shown interest in acquiring the youngster on a permanent basis.15.33 BST: Inter Milan striker Lautaro Martinez has reportedly ended talks over a new contract and could move on, says Sport.Barcelona will be most keen as they have been tracking the 23-year-old Argentine for some time, but Inter will want around €80m from clubs to sign him.14.00 BST: Eden Hazard has said that \"it didn't occur to me for a second\" to leave Real Madrid this summer after two injury-hit seasons at the Bernabeu, insisting that \"I won't leave there as a failure.\"Hazard played a part in Belgium's 3-0 win over Russia in their Euro 2020 group opener on Saturday in St Petersburg, coming off the bench after 72 minutes.He has only started two matches for Real Madrid since January, the last being a 2-0 Champions League semifinal defeat to Chelsea on May 5, after a series of muscular injuries severely limited his impact in 2020-21. He signed for the club for €100m, possibly rising to €160m, from Chelsea in July 2019.\"I'm only myself when I can enjoy myself on the pitch. That hasn't happened in the last two years at Madrid,\" Hazard told Belgium's Het Nieuwsblad. \"If you have one or two injuries you can flip the switch, you recover to come back stronger, but if it's five, six, seven it's much more difficult mentally. But I keep going.\"13.05 BST: With Inter's financial woes, Romelu Lukaku should be one of the top targets for clubs this summer.Jurgen Klinsmann marvels at the rise of Romelu Lukaku over the past two years after Belgium's 3-0 win over Russia.12.32 BST: Major League Soccer's New England Revolution are tracking Real Betis forward Juanmi, sources have told ESPN, while the La Liga side's winger Cristian Tello has also attracted interest from several MLS clubs.Juanmi, 28, was an €8m signing for Betis in 2019 after impressing at Real Sociedad but has scored just three league goals in two seasons at the club. The former Spain international missed most of 2019-20 with a heel spur setback that kept him out of action for nine months. He has a contract until 2024 and Betis would be open to moving him on, sources said, to free up space in the squad and on their wage bill.Barcelona youth product Tello -- who had more of an impact in La Liga last year, scoring five goals -- is also available with just a year left on his contract.Toronto FC were one of the MLS clubs to make enquiries about him earlier this year, sources told ESPN, although as with New England Revolution, their three Designated Player spots are currently full.11.47 BST: Bayern Munich will not be amongst the clubs making big moves this summer, club president Herbert Hainer has said.\"People should not underestimate the effects of Corona, even if we have been able to make ends meet comparatively well up to now, there will be considerable abrasion marks on us,\" Hainer said to Bayern Munich club magazine \"51\". \"With the exception of Dayot Upamecano, no more large transfers are possible with us this summer.\"We signed Omar Richards and seven players are returning who were on loan. The aim is to strengthen the squad across the board. However, the quality is so high that we don't need any further top transfers for it. The mix is ​​right.\"So far we've only seen the tip of the iceberg, and that won't be caught up in twelve months. When I am currently hearing some transfer rumors and sums again, I seriously ask myself how the clubs want to finance this, especially since many are burdened with high mountains of debt. It urgently needs to be more sensible. It cannot go on in such a way that many constantly live beyond their means.\"Bayern star striker Robert Lewandowski has been linked with clubs like Real Madrid and Chelsea, but Hainer insists he won't go.\"Robert is the best striker in the world,\" he added. \"He's still got a two-year contract here, and I can well imagine we'll keep him here even longer.\"- Borden: How Lewandowski's drive to become a world-class striker was kickstarted by tearful setback11.04 BST: The Mirror says that Real Madrid left-back Marcelo is on the radar of both Everton and Leeds United.Marcelo, 33, had been linked with Juventus and doesn't look likely to stay at the Bernabeu this summer as he is reportedly not in the plans of new Madrid manager Carlo Ancelotti.10.30 BST: Inter Milan are looking to get around €80m from clubs who want to sign full-back Achraf Hakimi.Gab & Juls suggest Inter's hopes of a bidding war for Achraf Hakimi are unlikely.09.51 BST: Liverpool are set to make a move for Udinese midfielder Rodrigo De Paul, says the Daily Star.De Paul, 27, scored nine goals for Udinese in Serie A last season and has hinted that he could move on this summer.Arsenal and Juventus have also been linked with the Argentina international.09.11 BST: ICYMI - Tottenham Hotspur have confirmed the appointment of Fabio Paratici as \"Managing Director, Football\" from July 1.Spurs announced in a statement that the 48-year-old will be \"responsible for managing and developing the club's sporting operations, facilities and footballing infrastructure.\"Paratici left Juventus earlier this month after 11 years at the club and is increasingly likely to be joined by Paulo Fonseca as talks continue with the former AS Roma boss over becoming Tottenham's new head coach.09.00 BST: New Paris Saint-Germain signing Georginio Wijnaldum has said he thought he was going to join Barcelona this summer after leaving Liverpool but the move to Camp Nou never materialised.The Netherlands captain joined PSG this week as a free agent despite being heavily linked with Barca for the past year. \"What I can say is that I made a different choice,\" Wijnaldum said in Saturday's news conference.\"It was a difficult choice. We negotiated with Barcelona for four weeks, but we have not come to an agreement. PSG was more decisive and faster. The project also really appealed to me. But it was difficult. I have to say that I also thought I would go to Barcelona. That was the only club that was really interested in me for a long time.\"Janusz Michallik picks which potential transfer would have a greater impact in the Premier League title race next season.- Manchester City are set to cool their interest in Sporting's Nuno Mendes until after Euro 2020. The Portugal left-back has been linked with the Premier League champions since the transfer window opened, but the Daily Mail reports that a deal won't happen until after the conclusion of the tournament. The 18-year-old is currently with the Portugal squad as they prepare for their opening game against Hungary.- Barcelona president Joan Laporta is keen to sign Manchester City defender Joao Cancelo, claims Mercato. The report says that Barca are interested in a player-exchange deal, with Ousmane Dembele rumoured as one who could go the other way. The 27-year-old Cancelo joined Manchester City in 2019 and featured 28 times in Pep Guardiola's title-winning campaign last season.- Leeds United have identified Borna Barisic as a transfer target, according to Football Insider. The left-back played a prominent role in Steven Gerrard's title win with Rangers last season, starting 43 games while scoring four and assisting seven goals. The 28-year-old is currently at Euro 2020 where he is expected to start for Croatia in defence.- Philip Billing could return to the Premier League with Norwich City keen on a deal for the midfielder. The Mirror says that a fee in the region of £15M will be required to land the Denmark international, who started 36 times in Bournemouth's league campaign last season that saw the Cherries fall short on their hopes for promotion.- FC Salzburg's Patson Daka is continuing to attract Premier League interest and Leicester City are the latest team to join the race. The Mirror reports that the Foxes see the striker as an ideal replacement for Jamie Vardy for a fee in the region of £17m, though interest from Liverpool and Chelsea could see the Austrian club raise their desired fee for their star man.", "Section": "", "Writers": "", "URL": "https://www.espn.com/soccer/blog-transfer-talk/story/4406988/transfer-talk-arsenal-looking-to-bring-real-betis-nabil-fekir-to-premier-league", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}