{"Type": "", "Time": "2021-06-14", "Headline": "Biden should follow G7 pragmatism in approach to China  | South China Morning Post", "Text": "OpinionEditorial  by SCMP EditorialPublished: 8:41pm, 14 Jun, 2021Updated: 8:41pm, 14 Jun, 2021The Group of Seven, comprising the world’s most developed economies, has the financial and technological clout to take on the greatest global challenges of our times. Most immediate is the Covid-19 pandemic, and close behind is climate change. But its recent summit, the first in-person gathering of leaders since the coronavirus crisis began, seemingly had China above all else on its mind, worries about the nation’s rise stalking many discussions.US President Biden used the summit to announce the return of his country to multilateralism after the four years of his predecessor, Donald Trump, who had adopted an insular foreign policy. There was obvious relief among the leaders of the fellow member nations, host Britain, Canada, France, Germany, Italy and Japan. The last time they met in person, in 2018, Trump withdrew support from the group’s final communique.But there was another noticeable difference; while China was not mentioned in the statement that year, this time it featured prominently, being referred to four times in 25 pages and often alluded to. The G7 urged But while the G7 is more united with Biden at the helm of the United States, its leaders do not speak with one voice on China. The hawkish language of the US and Canada is not shared by Europe and Japan, which favour a practical approach towards the important trading and investment partner. They have divergent views on the depth of the Chinese challenge, apparent in disagreement over funding for the belt and road alternative plan. They also failed to come up with a Recommended Video\n                SCMP Editorial\n                Editorials represent the views of the South China Morning Post on the issues of the day.Read moreChina accuses G7 leaders of ‘small circle’ power politics after rebukeRead moreG7 singles out China, calls for respect for rights in Hong Kong and XinjiangRead moreG7 leaders fail to agree on deadline for ending use of coal for electrical powerRead moreTaiwan looks for deeper partnerships after unprecedented G7 support", "Section": "", "Writers": "", "URL": "https://www.scmp.com/comment/opinion/article/3137260/biden-should-follow-g7-pragmatism-approach-china", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}