{"Type": "Sport", "Time": "2021-06-14", "Headline": "Football: Austria see off debutants North Macedonia to secure first ever Euro win", "Text": "BUCHAREST: Substitutes Michael Gregoritsch and Marko Arnautovic scored late goals as Austria sealed a 3-1 victory over major tournament debutants North Macedonia in their Group C opener at Euro 2020 on Sunday (Jun 13).Stefan Lainer put the Austrians ahead early on in Bucharest, but 37-year-old captain Goran Pandev levelled before the half-hour mark to become the second-oldest scorer in Euro history and delight the vocal Macedonian fans.But Gregoritsch diverted home the deciding goal 12 minutes from time and Arnautovic added a third to ensure Austria claimed their first-ever European Championship win and struck first blood in a group also containing the Netherlands and Ukraine, who meet in Amsterdam later in the day.\"Above all, the substitutions really paid off,\" said Austria coach Franco Foda. \"Gregoritsch and Arnautovic gave the team a new impulse. Overall I think it was a deserved win.\"Austria next visit the Dutch on Thursday, while North Macedonia stay in the Romanian capital to face Ukraine.\"There's no room for disappointment, we have to improve not to repeat the mistakes we've done in this game,\" said North Macedonia coach Igor Angelovski.\"Now we have to prepare for the next game against Ukraine. I cannot not be proud of my players who qualified for this championship.\"I feel sorry for the supporters, I'm speechless about the atmosphere they've created, I hope we will reward them.\"After a bright start by Angelovski's Macedonians on Sunday, Austria struck against the run of play in the 18th minute as right-back Lainer met Marcel Sabitzer's cross at the back post to volley past goalkeeper Stole Dimitrievski.Lainer celebrated by holding up a shirt with the words \"Eriksen stay strong\" after Denmark midfielder Christian Eriksen suffered a cardiac arrest in their game against Finland on Saturday.It was the first time Austria had taken the lead in a European Championship game.They quickly threatened a second goal as Sasa Kalajdzic turned Sabitzer's pass too close to Dimitrievski.PANDEV SCORES HISTORIC GOALBut North Macedonia continued to press and levelled in the 28th minute as Austria goalkeeper Daniel Bachmann lost the ball as he slid out to collect it after some comical defending, and Pandevgleefully accepted the giftto slot into an empty net.It was a record-extending 38th goal for the former Inter Milan forward for his country, making him the second-oldest player to net in the tournament after Austrian Ivica Vastic at the age of 38 against Poland in 2008.Foda sent on Arnautovic and Gregoritsch as his side dominated the early stages of the second half, but North Macedonia remained a danger on the break and Boban Nikolov was denied on the hour mark by an onrushing Bachmann.Minutes later it was Austria who almost forged ahead, but Gregoritsch's header was excellently palmed away by Dimitrievski.Neither side sat back to protect their point, but it was the underdogs who continued to look threatening and Ezgjan Alioski and Eljif Elmas both had efforts well blocked.Austria's quality shone through in the closing stages, though, as Gregoritsch nipped ahead of Dimitrievski to stab home David Alaba's low cross.In the 89th minute, Shanghai Port forward Arnautovic ran clear, rounded the goalkeeper and tapped in to give the scoreline a slightly flattering complexion.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Austria,Stole Dimitrievski,sports,Michael Gregoritsch,Macedonian,Euro 2020", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/euro-2020-austria-see-off-debutants-north-macedonia-15008206", "Source": "google"}