{"Type": "", "Time": "2021-06-14", "Headline": "No conclusion yet on Covid-19's origin, access to China labs needed, says Biden, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.LONDON (REUTERS) - United States President Joe Biden said on Sunday (June 13) China had to be more transparent and allow access to their laboratories so the West could determine whether or not the Covid-19 virus was the result of \"an experiment gone awry\".\"We haven't had access to the laboratories to determine whether or not - I've not reached a conclusion because our intelligence community is not certain yet - whether or not this was... from the market place of a bat interfacing with animals and the environment that caused this Covid-19, or whether it was an experiment gone awry in a laboratory,\" he said.\"It's important to know the answer to that,\" Mr Biden told reporters at the conclusion of a Group of Seven leaders' summit in Britain.The G-7 leaders had called for a transparent, science-based study, including in China, into the origins of Covid-19, to be convened by the World Health Organisation.Mr Biden, meanwhile, said Western democracies are in a race to compete with autocratic governments.“We’re in a contest, not with China per se... with autocrats, autocratic governments around the world, as to whether or not democracies can compete with them in a rapidly changing 21st century,” he told reporters.On China specifically, Mr Biden said: “I think you’re gonna see just straightforward dealing with China.“As I’ve told (President) Xi Jinping myself, I’m not looking for conflict. Where we cooperate, we’ll cooperate; where we disagree, I’m going to state this frankly, and we are going to respond to actions that are inconsistent,” he said.Italian Prime Minister Mario Draghi said the G-7 countries had to be frank about differences between the West and China in its post-summit communique that called out Beijing on issues ranging from rights to the origins of the coronavirus.“It’s an autocracy that does not adhere to multilateral rules and does not share the same vision of the world that the democracies have,” Mr Draghi told reporters on Sunday after the summit in Britain.“We need to cooperate but we also need to be frank about things that we do not share and do not accept. The US president said that silence is complicity,\" Draghi said,About the origins of the Covid-19 virus, President Biden said last month he had ordered aides to find answers to the origin of the virus. He asked for another update in 90 days.Intelligence agencies in the US are considering two likely scenarios - that the virus resulted from a laboratory accident or that it emerged from human contact with an infected animal - but they have not come to a conclusion, Mr Biden said.A still-classified intelligence report circulated during former president Donald Trump's administration alleged that three researchers at China's Wuhan Institute of Virology fell so ill in November 2019 that they sought hospital care, US government sources have said.China has strongly denied any of the three were ill or that the lab was the source of the pandemic.A WHO-led research mission on Wuhan early this year concluded the Sars-CoV-2 virus most likely spilled over to humans from animals - either directly from a bat or via another mammal, possibly one sold at the Huanan seafood and fresh produce market in Wuhan, the provincial capital of Hubei.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/biden-says-no-conclusion-yet-on-origin-of-covid-19-needs-access-to-china-labs", "Source": "google"}