{"Type": "", "Time": "2021-06-14", "Headline": "Front-line workers, including cleaners, at Changi Airport to get $50 ez-link card, Transport News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A thousand front-line workers at Changi Airport will receive ez-link cards with a stored value of $50 as a gift next month.The move to help with their transport costs is the result of a ground-up initiative by about 70 Civil Aviation Authority of Singapore (CAAS) officers who wanted to show their appreciation for the workers.Calling themselves Friends for Aviation (FFA), the group of officers said on Saturday (June 12) that cleaners, trolley and baggage handlers will be among the workers to benefit.FFA said that some of these workers now needed to travel more often for their routine Covid-19 testing, following stepped-up measures at the airport last month to guard against another cluster of Covid-19 cases emerging.A total of 43 workers at Changi tested positive for Covid-19 last month. This resulted in the closure of the terminal buildings to the public for an initial two weeks. The closure has now been extended indefinitely to allow the airport community to adjust to new safety measures.FFA's founder, Ms Angela Ng, who works as an aviation policy officer at CAAS, said the Covid-19 outbreak at Changi has added to the challenges in the aviation sector, which has been hit hard by the coronavirus pandemic.\"So everybody needs some encouragement, especially our front-liners who don't have the opportunity to work from home to stay safe,\" she said.\"Their jobs and livelihoods are tied to what they do at the front line.\"FFA said it has pooled together $25,000 to fund the ez-link card distribution.The remaining $25,000 needed will come from Temasek Trust's oscar @ sg fund, which has agreed to match FFA's contribution on a dollar-for-dollar basis.CAAS director-general designate Han Kok Juan said that the initiative complements the $15 million fund that the authority and Changi Airport Group had set aside to help aviation workers.He praised the initiative as \"a great example of the strong community spirit\" at Changi Airport.Members of the public who want to show support to aviation front-liners can submit messages of appreciation and encouragement by June 25. The messages will be printed and given out together with the ez-link cards.Submission details can be found on the Friends For Aviation Instagram page.A post shared by Friends for Aviation (@friendsforaviation)Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/transport/frontline-workers-including-cleaners-at-changi-airport-to-get-50-ez-link-card", "Source": "google"}