{"Type": "Sport", "Time": "2021-06-14", "Headline": "French Open done and dusted, Djokovic on track for calendar Slam", "Text": "Novak Djokovic has a real shot at becoming the first man in more than 50 years to win all four Grand Slam titles in a calendar year after the Serb added the French Open to his Australian Open title on Sunday, seven-times major winner Mats Wilander said.PARIS:     Novak Djokovic has a real shot at becoming the first man in more than 50 years to win all four Grand Slam titles in a calendar year after the Serb added the French Open to his Australian Open title on Sunday, seven-times major winner Mats Wilander said.The claycourt Grand Slam has been the most difficult major for Djokovic to win, Sunday's victory only his second at Roland Garros, and he heads to Wimbledon next where he is the two-time defending champion.The 34-year-old world No.1 is a force to be reckoned with on hardcourts too, having won a record nine titles in Melbourne and three U.S. Open trophies, making him a favourite to win at Flushing Meadows in September.Djokovic agreed it was possible he could match the achievement of Rod Laver, the last man to win all four singles titles in 1969, and that he could even complete a 'Golden Slam' by adding the Olympic title at the Tokyo Games.\"We are now heading into the season where we would have to put Novak as the favourite to win Wimbledon most probably, favourite at the U.S. Open because of what he does on hardcourts,\" Eurosport pundit Wilander said.\"So yes, it's on and the way he looks – he looks young, he looks so fresh at the end, he looks scary good and motivated.\"Djokovic displayed mental strength and physical fitness on Sunday to come back from two sets down and beat Greek 22-year-old Stefanos Tsitsipas after battling for four hours and 11 minutes, the exact time he took to get past 13-time French Open winner Rafa Nadal in the semi-finals less than 48 hours earlier.Mischa Zverev, the brother of world number six Alexander, said Djokovic already looked like he had turned his attention to Wimbledon.\"He is a legend, and he is on the way to winning all four in the same year,\" Zverev said on Eurosport. \"I don't know if it's going to happen but his achievement is incredible, especially the way he won today.\"I was looking at Novak when they were preparing the trophy ceremony and he looked like he was getting ready for Wimbledon. He was so focused.\"I think in his mind already he was thinking about who he was going to play at Wimbledon, how am I going play, I need to get ready with my preparation and recovery – he is a machine.\"(Reporting by Sudipto Ganguly in Berhampore, India; editing by Peter Rutherford)It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Wimbledon,sports,Novak Djokovic,dust", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/french-open-done-and-dusted--djokovic-on-track-for-calendar-slam-15011256", "Source": "google"}