{"Type": "", "Time": "2021-06-14", "Headline": "Paul Craig receives BJJ black belt following spectacular finish over Jamahal Hill at UFC 263 | BJPenn.com", "Text": "UFC light heavyweight contender Paul Craig received his BJJ black belt following his spectacular finish over Jamahal Hill at UFC 263.Craig pulled guard in the first round of his main card fight against Hill on Saturday night and quickly proceeded to pull off one of the most stunning finishes we have seen on the ground in quite some time. Craig was able to grab a hold of Hill’s arm and he dislocated it with an armbar, but the referee didn’t see the injury, nor did he see Hill’s attempt at a tap, and the fight continued on, with Craig raining down hammer fists while having Hill tied up with a triangle. The referee, Al Guinee, then stopped the fight due to TKO (punches).Ironically, while the official ruling of the finish was a technical knockout, Craig has been rewarded by his coaches for his unbelievable ground game. The 33-year-old Scot, who is the No. 14 ranked light heavyweight in the UFC, was a brown belt coming into this fight with Hill, but now he’s a black belt, as his coaches gave him his promotion last night. Craig’s training partner Chris Bungard at Scottish Hit Squad posted a video of Craig’s coach Brian Gallagher rewarding “Bearjew” with a well-deserved black belt in Brazilian jit-jitsu.My brother @PCraigmma receiving his Brazilian Jiu jitsu black belt after his massive win at #UFC263 from my coach @CoatbridgeMMA toasting and giving respect to a proper warrior @JamahalH #ScottishHitSquad #DumbAsARock #HadyourBackSinceDayOneLetsblowThisShit pic.twitter.com/RlxBvGnlPY— Chris Bungard (@CowaBungard) June 13, 2021My brother @PCraigmma receiving his Brazilian Jiu jitsu black belt after his massive win at #UFC263 from my coach @CoatbridgeMMA toasting and giving respect to a proper warrior @JamahalH #ScottishHitSquad #DumbAsARock #HadyourBackSinceDayOneLetsblowThisShitWith the win over Hill, Craig (15-4-1) improved to 7-4-1 in the UFC, with all but one of his fights ending inside the distance. In his MMA career, all 15 of his wins have come by stoppage, including 13 wins by submission. Craig has won his last three fights in a row and is unbeaten over his last five, so he figures to get a top-10 opponent in his next fight.Who do you want to see Paul Craig fight next after finishing Jamahal Hill at UFC 263?", "Section": "", "Writers": "", "URL": "https://www.bjpenn.com/mma-news/ufc/paul-craig-receives-bjj-black-belt-following-spectacular-finish-over-jamahal-hill-at-ufc-263/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}