{"Type": "", "Time": "2021-06-14", "Headline": "Delta variant blamed for Covid-19 spike in Indonesia's Kudus district | The Star", "Text": "\n                    Sunday, 13 Jun 2021\n                Man reacts while receiving a dose of a COVID-19 vaccine inside a public bus, used as a coronavirus disease vaccination venue, outside the Madani hospital in Pekanbaru, Riau province. - ReutersJAKARTA, June 13 (Xinhua): Indonesia has detected the highly infectious Delta coronavirus variant in the recent spike in Covid-19 cases in Kudus district of Central Java province, the province's governor Ganjar Pranowo said on Sunday.The governor said that 86.11 perccent or 62 out of a total of 72 samples of recent Covid-19 cases in Kudus emanated from the Delta variant first reported in India.\"The spread of this virus variant is very fast.\"Three weeks ago Covid-19 in Kudus affected only three sub-districts but today they are happening in 11 sub-districts,\" Pranowo said.\"Kudus experienced a significant increase in positive cases of Covid-19 in a week, jumping more than 30 times from 26 to 929 cases,\" Wiku Adisasmito, the national COVID-19 task force spokesperson, said recently.Kudus has so far recorded 10, 525 confirmed cases of Covid-19 including 7, 322 recoveries and 861 deaths.Health Minister Budi Gunadi Sadikin said the Delta variant in Kudus came from Indonesian migrant workers returned from India and seaport activities.\"We have been taking good care of airports and seaports in Indonesia,\" said the minister. - Xinhua\nTags / Keywords:\nIndonesia\n                                                                ,\n                                                                                                Delta Variant\n                                                                ,\n                                                                                                Covid-19\n                                                                ,\n                                                                                                Confirmed\n                                                                ,\n                                                                                                Kudus District\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\n", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/13/delta-variant-blamed-for-covid-19-spike-in-indonesia039s-kudus-district", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}