{"Type": "", "Time": "2021-06-14", "Headline": "Mandatory Covid-19 testing under way for 85 stallholders at Bukit Merah View, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Mandatory Covid-19 testing started at 10am on Monday (June 14) for about 85 stallholders at Block 116 Bukit Merah View.A temporary site has been set up at Block 125A for this.The testing follows MOH's announcement on Sunday that a new cluster had formed at 115 Bukit Merah View Market and Food Centre.All 182 stalls there were closed from Sunday for cleaning, until Tuesday. The staff and tenants who had been working at the market from May 25 have been quarantined and will be swabbed during quarantine.The Health Ministry said all staff and tenants who had been working in the nearby 116 Bukit Merah View from May 25 are also being  tested for Covid-19  \"to disrupt any wider, undetected community transmission\".Most of those who were tested at the temporary site said they are not worried about getting Covid-19.Ms Theresa Neo, 52, who works in a nail salon at Block 116, said she had been working there for only a few months before the cluster was detected on Sunday. “I’m fully vaccinated so I’m not worried,” she said, adding that the salon would remain open as it had not been instructed to close.A food stallholder at Block 116 who wanted to be known only as Mr Than, 50, said he received a text message informing him that he should get tested. Mr Than, who sells Teochew porridge, came out of the temporary testing site teary-eyed but said it was a painless process. “It’s very normal now to get tested. There’s nothing to worry about. I’m not worried about getting Covid-19,” he said. He said he would be returning to work, adding: “We need to earn money, what to do?”Free testing is also being offered to residents and members of the public who visited either 115 Bukit Merah View Market and Food Centre or shops at 116 Bukit Merah View between May 25 and June 12.However, the testing is not being done at Block 125A. They can visit Bukit Merah polyclinic and several other Swab and Send Home clinics nearby.  Residents can go to this website and enter their postal code to find the nearest such clinic.Some residents who went to Block 125A were unhappy when they were turned away.Tanjong Pagar GRC MP Joan Pereira, who spoke to journalists near the swab test site, said: \"Many residents have actually reached out to me, sharing with me that they hoped the swab testing can be conducted in an area that is close to them, without them having to travel very far away.\"She has put up a request to the Ministry of Health (MOH) to ask if the venue could be open to residents as well.\"It's really very convenient for them, and if MOH gives the go-ahead. I think most of our residents will really appreciate that.\"The Straits Times understands that arrangements are being made for this from Tuesday (June 15).Mr Wang Da Feng, 70, made the trip down to the temporary testing site on Monday morning with his 71-year-old wife, but both were turned away.The retiree, who lives in Telok Blangah Crescent, said the couple are concerned about potentially having Covid-19 as they visit the market and hawker centre every day.\"We both felt a bit unwell, and my wife started coughing last night so we wanted to get tested,\" he said.\"It's a wasted trip today, but it's okay, we will just come back tomorrow,\" he added.A Bukit Merah resident who only wanted to be known as Madam Lim, 60, said she had visited the market on Sunday for about 20 minutes.\nCleaning underway at Block 116 Bukit Merah View. All 182 stalls there were closed from Sunday for cleaning, until Tuesday. ST PHOTO: TIMOTHY DAVID\n\"I'm not worried about getting Covid-19. I feel fine, I don't have any symptoms, but testing would give me some assurance because my job requires me to visit clients,\" said Madam Lim, who works in accounting.Mr Chia Foo Keng, 65, who lives at Block 117 Bukit Merah View, said he is worried about getting Covid-19 as he visits the market at Block 115 every day. “I’m fully vaccinated, but I still feel it’s better to get tested because who knows whether I have Covid-19 or not?” said Mr Chia, who is a fishmonger at a market in Ang Mo Kio.Ms Pereira told ST that there are residents who are worried as there is a confirmed cluster in the market and hawker centre at Blk 115, which they frequent for their daily food and groceries.\"This is especially so as there are many elderly living in the area, and their children have also written to me as they are worried,\" she said.\"I have asked them to continue monitoring their health closely, see a doctor immediately if unwell and minimise physical interactions.\"The 115 Bukit Merah View Market and Food Centre cluster now has six cases, after four cases were linked to it on Sunday.Five of the cases detected so far are either food stall vendors or sundry shop workers at the market and food centre. Their ages range from the 60s to the 80s.Affected stallholders can tap MOH's Quarantine Order Allowance Scheme, which provides assistance in the form of an ex-gratia payment of $100 per day, to self-employed individuals.The scheme aims to provide financial assistance to affected self-employed individuals, employers whose employees have been placed on a quarantine order, or ordered by MOH to cease operations until their premises are decontaminated.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/mandatory-covid-19-testing-for-85-stallholders-at-bukit-merah-view-temporary", "Source": "google"}