{"Type": "", "Time": "2021-06-14", "Headline": "What Putin really wants from Biden - BBC News", "Text": "By Sarah RainsfordBBC News, MoscowThe Geneva summit between Vladimir Putin and Joe Biden on 16 June will not be a friendly encounter. For a start, Russia recently included the US on its official list of \"unfriendly states\".Both sides describe relations as at rock bottom and neither currently has an ambassador in-country; senior Russian officials are under American sanctions for everything from annexing Ukraine's Crimea to alleged election meddling, and two former US marines are now in Russian prisons - one serving 16 years accused of espionage. On top of all that, there's the moment in March when Joe Biden agreed with an interviewer that Vladimir Putin was \"a killer\".And yet, the two men are set to meet as presidents for the first time, and some in Russia see that as an achievement in itself.\"The summit is important in terms of symbolism; it puts Russia in the same league as the US, and for Putin symbolism is not unimportant,\" says Andrei Kortunov, director of the RIAC think-tank in Moscow.The meeting comes early in Mr Biden's time in the White House, on his first foreign trip and at his request - all bonus points for the Kremlin. It's also a full summit - not a brief encounter appended to some other event. And despite a packed agenda, including meetings at Nato headquarters in Brussels on Monday, there's particular interest in Joe Biden's final stop on his European trip, his one-on-one on Wednesday with Vladimir Putin.\"Putin definitely wants to be equal to the US president. He wants to be respected on his terms,\" political analyst Lilia Shevtsova agrees. \"Putin wants to demonstrate macho muscle and to be a member of the club.\"The choice of Geneva as a setting harks back to a Cold War encounter in 1985: the first summit between Ronald Reagan and Mikhail Gorbachev. But there's little prospect that this week's event will match that either for personal rapport or political thaw.Today's White House says its aim is a \"stable\" and \"predictable\" relationship with Russia. But keeping people guessing - and wary - has been Vladimir Putin's way ever since his \"little green men\" entered Crimea in 2014 and the peninsula was annexed from Ukraine.It was the start of this slide in Russia-US relations.\"A more feasible goal would be to test where each other's 'red lines' lie,\" Ms Shevtsova suggests, as well as \"an understanding that dialogue is the way back from the abyss\".'If they're not talking, then Russia will become more unpredictable,\" she argues.This weekend, Vladimir Putin told state TV there were \"issues where we can work together\" with the US, starting with new nuclear arms control talks, discussing regional conflicts including Syria and Libya, and climate change. \"If we can create mechanisms for working on those issues, then I think we can say the summit was not in vain,\" Mr Putin argued. Some in Russia suggest a truce in the \"diplomatic wars\" may also be possible: the US has expelled dozens of Russian diplomats and shut down two compounds in recent years; now US missions in Russia are to be barred from employing locals, meaning dramatic cuts in services including visas.Moscow might allow its ambassador back to Washington as a minimum move.The US will also raise the fate of its prisoners in Russia, including Paul Whelan who was arrested in 2018 and convicted of espionage, which he has always denied. Russia recently renewed its push for a prisoner-swap - but its terms have so far been impossible for the US to meet, and a unilateral gesture of generosity by Mr Putin seems unlikely. Russia's president has gone out of his way lately to underline his view of the West as hostile.At this month's Economic Forum in St Petersburg, he claimed again that the US wants to \"contain\" Russia's development. A few days earlier, he had threatened to \"knock out the teeth\" of any foreign aggressor who wants to \"bite\" Russia, insisting that the world needs to wake-up to the country's restored status and strength.\"Clearly he believes the US is an adversary that doesn't wish Russia well, and I don't think this vision will change,\" Mr Kortunov says.Even so, he argues that Russia may be looking to lower the temperature a notch or two.\"As a rational politician, Putin would like to reduce the costs and risks associated with this adversarial relationship,\" Mr Kortunov believes. That includes economic sanctions: the latest round restricted the government's capacity to raise funds and new steps could be further reaching, adding more strain to the economy in a key election year. \"The Russian public has no appetite for foreign policy 'victories' now as a substitute for addressing burning social and economic problems at home,\" Mr Kortunov says. \"Whatever Putin might want, I don't think he can gain anything [domestically] by escalating.\"What Vladimir Putin doesn't want, but is braced for, is a lecture on human rights - including the case of Alexei Navalny, Russia's opposition politician first poisoned and now in prison.Navalny's political offices and anti-corruption organisation have just been banned as \"extremist\" by a Moscow court, a ruling that could easily have been delayed until after the summit. Instead, the timing seems meant to send a message: that Vladimir Putin will continue to crush dissent and that is none of America's business.  \"Biden will do his song - his prelude about Navalny and human rights; then Putin will do his song - that the US is the same,\" Ms Shevtsova predicts, dryly. \"But the fact this meeting is taking place means that after the human rights 'hors d'oeuvre', they'll move on to the main dish. And that is: let's do something to lower the tension.\"Awkward conversation looms for Biden and PutinPutin: Biden will be less impulsive than TrumpEngland faces longer lockdown as easing delayedCapacity limits for sports events, pubs and cinemas will remain and nightclubs will stay closed.Israel's new PM Bennett promises to unite nationWhat Putin really wants from BidenWhat Putin really wants from BidenHow China’s youth are shunning the rat race'We make it or we die' Video'We make it or we die'Netanyahu: A shrewd leader who reshaped Israel‘My little girls don’t know their mum died of Covid’Tech firms use remote monitoring to help honey beesWhat happened when the Soviets tried to dig to the centre of the Earth?How Islamic State has expanded into Central AfricaFormer farmer, 84, is accidental ASMR YouTube star. VideoFormer farmer, 84, is accidental ASMR YouTube starFootball phrases15 sayings from around the worldHead of 'world's largest family' dies in India1Lockdown easing in England to be delayed2What Putin really wants from Biden3Banker and rapper face Trump-related probe charge4Israel's new PM Bennett promises to unite nation5Producer resigns from New Zealand massacre movie6China to G7: Small groups do not rule the world7Fan falls from stand at England's Euro opener8Thousands join protests against Catalan pardons9How China’s youth are shunning the rat race10© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "Section": "", "Writers": "", "URL": "https://www.bbc.com/news/world-europe-57427055", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}