{"Type": "", "Time": "2021-06-14", "Headline": "CJ allows Law Society application to investigate complaint against non-practising lawyer, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The Chief Justice on Monday (June 14) allowed an application by the Law Society Of Singapore to investigate a complaint against a bankrupt non-practising lawyer.The complaint was made against Ms Helen Chia Chwee Imm, who has been a lawyer for more than 20 years.She was bankrupt and did not have a valid practising certificate when she allegedly claimed to be a practising lawyer and borrowed $60,000 from a client and the client's mother.The client engaged Ms Chia around December 2016 to represent her in matrimonial proceedings involving the care and custody of her child.In November 2017, the client applied to the Family Justice Courts for the care and custody of her child, after she was advised to do so by Ms Chia. Mediation was scheduled on Dec 18 that year.But, about a week before the mediation date, Ms Chia told the client that she was an undischarged bankrupt, and thus unable to represent her.Anxious, the client then lent Ms Chia $40,000, purportedly to allow her to discharge her bankruptcy and represent the client.The mediation did not proceed on the scheduled day as Ms Chia could not attend on behalf of the client, and the case was fixed for hearing in April 2018.Ms Chia is alleged to have approached the client's mother in February 2018 and borrowed another $20,000 from her.In March 2018, Ms Chia allegedly told the client that she was joining another firm, and that her case would also be transferred to the new firm.The client agreed to this, but did not know that Ms Chia was still an undischarged bankrupt without a valid practising certificate at the time.When the hearing took place in April, another lawyer turned up to represent the client instead of Ms Chia.The client's application failed, and the client later filed an appeal.Ms Chia was finally discharged as a bankrupt in May 2018.From June to September 2018, Ms Chia and the client discussed the appeal and the repayment of the sum owed by Ms Chia.Court documents said their relationship soured because of the unpaid loans and the client's unhappiness over how Ms Chia had handled the case.The client discharged Ms Chia in September 2018 and hired new lawyers.Ms Chia repaid the loans later that month after numerous acrimonious WhatsApp exchanges and a letter of demand sent by the client's new lawyers.The client's appeal for her case succeeded in August 2019, and she lodged a complaint with the Law Society against Ms Chia a month later.The Law Society formed an inquiry committee to look into the complaint, and Ms Chia claimed that she was suffering from depression because of \"several emotionally draining matters\", but did not produce any medical reports to show this.The inquiry also discovered that Ms Chia did not have a valid practising certificate from December 2016 to May 2018.As a result of this, the committee did not make any further findings as the Law Society requires leave to investigate a non-practising lawyer.It then made the application to the court to be allowed to investigate the complaint.Ms Chia objected to this, saying the application could only be made by the client, and not the Law Society.On Monday, Chief Justice Sundaresh Menon allowed the application for leave to be granted.In his 29-page grounds of decision, he noted the severity of the allegations of misconduct and the strong evidence.The Law Society had also made the application to the court without delay once it realised Ms Chia was not a practising lawyer at the time.The Chief Justice said the prior proceedings by the Law Society's inquiry committee did not prejudice Ms Chia, and there was no evidence given proving her purported depression.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/lawyer-was-bankrupt-allegedly-claimed-to-be-practising-and-borrowed-money", "Source": "google"}