{"Type": "", "Time": "2021-06-14", "Headline": "Christchurch attack film slammed over ‘white saviour’ narrative | Islamophobia News | Al Jazeera", "Text": "Community members, leaders slam planned movie for not focusing on the victims of the attack which killed 51 Muslims.A planned film about the 2019 Christchurch mosque killings has sparked an intense backlash in New Zealand, with community members and leaders slamming the project for pushing a “white saviour” narrative.The film, “They Are Us”, aims to focus on New Zealand Prime Minister Jacinda Ardern’s handling of the horrific shootings in March 2019 when a white supremacist gunman ran amok at two mosques during Friday prayer, killing 51 and seriously injuring another 40.The attacker killed 44 people at the Al Noor mosque before driving to the Linwood mosque, where he killed seven more.The National Islamic Youth Association said the proposed film “sidelines the victims and survivors and instead centres the response of a white woman”, saying that it focused on the role played by Ardern, rather than the victims of the attack.A petition by the association calling for the production to be shut down gathered more than 60,000 signatures. You do not get to tell this story.You do not get to turn this into a White Saviour narrative.This is not yours.This pain is still fresh and real.This is upsetting, obscene and grotesque. I am tired. https://t.co/WqyIbBWQ8p— Mohamed Hassan (@mohamedwashere) June 10, 2021It said the Muslim community had not been properly consulted about the project, which has been scripted by New Zealand writer Andrew Niccol.“Entities and individuals should not seek to commercialise or profit from a tragedy that befell our community, neither should such an atrocity be sensationalised”, association co-chair Haris Murtaza said.Muslim poet Mohamed Hassan said the filmmakers needed to focus on members of the community that bore the brunt of the attacks, not use them as props in a feel-good story about Ardern.“You do not get to tell this story. You do not get to turn this into a White Saviour narrative. This is not yours,” he tweeted.“The film has chosen to focus not on the tragedy and the victims, but instead on the prime minister and the rest of the country and their response,” Hassan wrote in an article for Radio New Zealand. “It is being sold as a feel-good story, a portrayal of heroism in the face of terror.”The Mayor of Christchurch has declared that the crew behind They Are Us are not welcomed into Christchurch for the movie. She states that it is not the appropriate movie to make. This comes after the petition reaching 40k signatures. Keep signing! #TheyAreUsShutDown— Shaneel Lal (They/Them) (@shaneellall) June 12, 2021Last year, the attacker, the Australian self-declared white supremacist Brenton Tarrant, was jailed for life without parole, the first time a whole-of-life term has been imposed in New Zealand.On Monday, Ardern also criticised the movie as poorly timed and focused on the wrong subject. She said the attacks remained “very raw” for many New Zealanders and the filmmakers had not consulted her about the movie, which is set to star Australia’s Rose Byrne as the centre-left leader.“In my view, which is a personal view, it feels very soon and very raw for New Zealand,” Ardern told TVNZ.“And while there are so many stories that should be told at some point, I don’t consider mine to be one of them – they are the community’s stories, the families’ stories.” Supporters of the mosque shooting victims sing outside the Christchurch High Court during the sentencing hearing for the shooter [File: Mark Baker/AP]Ardern won widespread praise for her empathetic and inclusive handling of the attacks, the worst mass shooting in modern New Zealand history, including covering her head with a scarf when meeting mourners.The movie’s title references a line from a speech she gave in the immediate aftermath of the atrocity when she pledged to support the Muslim community and tighten gun laws.One of the movie’s producers, Philippa Campbell, quit the project saying she regretted the shock and hurt it had caused.“I have listened to the concerns raised over recent days and I have heard the strength of people’s views,” Campbell said.“I now agree the events of March 15, 2019, are too raw for film at this time and do not want to be involved with a project that is causing such distress,” she said in a statement.The mayor of Christchurch, where the attacks took place, said movie crews would not be welcome in her city.“I’m just so outraged that they even think that this is an appropriate thing to do,” Lianne Dalziel told news outlet RNZ.Jesus the film was supposed to focus on the prime minister, Jacinda Adern, and HER response to the attacksThankfully she condemned this idea, and the mayor of Christchurch refused to let the movie be filmed there. Good for them.— Robert Evans (The Only Robert Evans) (@IwriteOK) June 14, 2021Police said no charges had yet been laid and did not provide further details on the nature of the threat.Several hundred gathered at the Christchurch Arena for the remembrance service, which was also livestreamed.Follow Al Jazeera English:", "Section": "", "Writers": "", "URL": "https://www.aljazeera.com/news/2021/6/14/film-on-christchurch-attack-panned-over-white-savior-narrative", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}