{"Type": "Sport", "Time": "2021-06-14", "Headline": "Football: Danish players lament 'no third option' for match after Eriksen's collapse", "Text": "COPENHAGEN: Danish players expressed dissatisfaction on Monday (Jun 14) at the position they were put in after team-mate Christian Eriksen's collapse during their Euro 2020 opener on Saturday, having to decide whether to finish the match that evening or the next morning.UEFA offered the players, who gathered in the locker room after witnessing Eriksen being treated on the pitch following a cardiac arrest, the choice of resuming the match on Saturday night or beginning again on Sunday at 12pm local time (8pm, Singapore time).\"We were put in a position which I personally don't think we should have been put in,\" Denmark's goalkeeper Kasper Schmeichel told reporters on Monday.\"It probably required that someone above us had said that it was not the time to make a decision and maybe should wait for the next day,\" he added.UEFA officials were not immediately available for comment, but European football's governing body wrote on Twitter on Saturday that the match would be restarted \"following the request made by players of both teams\".\"We had two options. None of the options were good. We took the least bad one. There were a lot of players, that weren't able to play the match. They were elsewhere (mentally)\", Danish player Martin Braithwaite said on Monday.\"You could have wished for a third option in this situation,\" he added.Eriksen collapsed just before half-time and was taken to hospital after receiving cardiopulmonary resuscitation on the pitch. After a long suspension, the game resumed at 8.30pm local time and the Finns went on to win 1-0.The comments echoed criticism from former Danish internationals Peter Schmeichel and Michael Laudrup on Sunday.\"Something terrible like that happens and UEFA gives the players an option to go out and play the game or come back at 12pm on Sunday. What kind of option is that?\" Peter Schmeichel, father of Kasper, told the BBC on Sunday.Denmark's coach Kasper Hjulmand also said on Sunday that he did not think that the players should have been back on the pitch.The Danish Football Association said on Monday that the 29-year-old Eriksen remained instable conditionin a nearby hospital.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "football,UEFA,Euro 2020,Denmark,Christian Eriksen", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/eriksen-danish-players-lament-no-third-option-match-euro-2020-15012354", "Source": "google"}