{"Type": "", "Time": "2021-06-14", "Headline": "G-7 leaders agree on vaccines, China and taxing corporations - The Washington Post", "Text": "CARBIS BAY, England — Leaders of the Group of Seven wealthy nations staked their claim Sunday to leading the world out of the coronavirus pandemic and crisis, pledging more than 1 billion coronavirus vaccine doses to poorer nations, vowing to help developing countries grow while fighting climate change and backing a minimum tax on multinational firms.At the group’s first face-to-face meeting in two years, the leaders dangled promises of support for global health, green energy, infrastructure and education — all to demonstrate that international cooperation is back after the upheavals caused by the pandemic and the unpredictability of former U.S. President Donald Trump.During their three-day summit in southwest England, the G-7 leaders wanted to convey that the club of wealthy democracies — Canada, France, Germany, Italy, Japan, the United Kingdom and the United States — is a better friend to poorer nations than authoritarian rivals such as China.“This isn’t about imposing our values on the rest of the world,” British Prime Minister Boris Johnson told reporters at the end of the seaside summit on the rugged Cornwall coast. “What we as the G-7 need to do is demonstrate the benefits of democracy and freedom and human rights to the rest of the world.”U.S. President Joe Biden, who was making his first foreign trip as leader, said it was an “extraordinary, collaborative and productive meeting” that showed “America’s back in the business of leading the world alongside nations who share our most deeply held values.”But health and environmental campaigners were distinctly unimpressed by the details in the leaders’ final communique.“This G-7 summit will live on in infamy,” said Max Lawson, the head of inequality policy at the international aid group Oxfam. “Faced with the biggest health emergency in a century and a climate catastrophe that is destroying our planet, they have completely failed to meet the challenges of our times.”Despite Johnson’s call to “vaccinate the world” by the end of 2022, the promise of 1 billion doses for vaccine-hungry countries — coming both directly and through donations to the international COVAX program — falls far short of the 11 billion doses the World Health Organization said is needed to vaccinate at least 70% of the world’s population and truly end the pandemic.Half of the billion-dose pledge is coming from the United States and 100 million from Britain. Canada said it also would give 100 million doses, and France pledged 60 million. Altogether, the leaders said they pledged 870 million doses “directly over the next year,” with further contributions taking the total to the “equivalent of over 1 billion doses.”Former British Prime Minister Gordon Brown said the lack of a more ambitious vaccination plan was “an unforgivable moral failure.”But Biden said the leaders were clear that the commitments they made to donate doses wouldn’t be the end. The U.S. president said getting shots into arms around the world was a “gigantic, logistical effort” and the goal might not be accomplished until 2023.The G-7 also backed a minimum tax of at least 15% on large multinational companies to stop corporations from using tax havens to avoid taxes, a move championed by the United States.Biden also wanted to persuade fellow democratic leaders to present a more unified front to compete economically with Beijing and strongly call out China’s “nonmarket policies and human rights abuses.”The language on China in the G-7 leaders’ communique from the meeting was more muted than the United States has used, but Biden said he was satisfied. On China’s economic behavior, the group said it would “consult on collective approaches to challenging non-market policies and practices which undermine the fair and transparent operation of the global economy.”The leaders also said they would promote their values by calling on China to respect human rights and fundamental freedoms in Xinjiang, where Beijing is accused of committing serious human rights abuses against the Uyghur minority, and in the semi-autonomous city of Hong Kong.Not every European power has viewed China in as harsh a light as Biden, who has painted the rivalry with the techno-security state as the defining competition of the 21st century.“The G-7 is not a club hostile to China,” French President Emmanuel Macron said. “It’s an ensemble of democracies that (would) work with China on all world topics that China is ready to work on with us.”Johnson, the summit’s host, wanted the three-day meeting to fly the flag for a “Global Britain,” his government’s push to give the midsized country, newly detached from the European Union, outsized global influence.Yet Brexit cast a shadow over that goal during the summit on the coast of southwest England. European Union leaders and Biden voiced concerns about problems with new U.K.-EU trade rules that have heightened tensions in Northern Ireland.But overall, the mood was positive: The leaders smiled for the cameras on the beach at cliff-fringed Carbis Bay, a village and resort that became a traffic-clogged fortress for the meeting.The prime ministers and presidents also mingled with Queen Elizabeth II at a royal reception, ate steak and lobster at a beach barbecue and watched an aeronautic display by the Royal Air Force Red Arrows during their stay by the sea.America’s allies were visibly relieved to have the U.S. back as an engaged international player after the “America First” policy of the Trump administration.Johnson called Biden “a breath of fresh air.” Italian Premier Mario Draghi said the president “wanted to rebuild what were the traditional alliances of the United States after the period of Trump, during which these alliances were seriously cracked.”Biden flew from the summit in Carbis Bay to have tea with the queen at Windsor Castle. He is scheduled to attend a NATO summit in Brussels on Monday and to hold talks with Russian leader Vladimir Putin in Geneva on Wednesday.The G-7 also made ambitious declarations during their meetings about girls’ education, preventing future pandemics and financing greener infrastructure globallyOn climate change, the “Build Back Better for the World” plan promises to offer financing for infrastructure — “from railways in Africa to wind farms in Asia” — to help speed up the global shift to renewable energy. The plan is a response to China’s “belt and road” initiative, which has increased Beijing’s worldwide influence.All G-7 countries have pledged to reach net-zero carbon emissions by 2050, but many environmentalists say that will be too little, too late.Naturalist David Attenborough addressed the leaders by video Sunday, warning that humanity is “on the verge of destabilizing the entire planet.”“If that is so, then the decisions we make this decade — in particular the decisions made by the most economically advanced nations — are the most important in human history,” the veteran documentary filmmaker said.As the leaders met behind fences and barbed wire, thousands of environmental protesters gathered throughout the weekend outside the ring of steel to accuse the G-7 of missing a chance to prevent climate catastrophe.Members of the Extinction Rebellion climate activism group blocked the main road of the town of St. Ives on Sunday, banging drums and sitting on the road. Elsewhere, hundreds of surfers and kayakers paddled out to sea to urge better protection for the world’s oceans.“G-7 is all greenwashing,” protesters sang during one march. “We’re drowning in promises, now’s the time to act.”___Lawless, Kirka and Hui reported from Falmouth, England. Nicole Winfield in Rome and Kirsten Grieshaber and Frank Jordans in Berlin contributed.___Follow all AP stories on climate change issues at https://apnews.com/hub/Climate.The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/politics/as-summit-ends-g-7-urged-to-deliver-on-vaccines-climate/2021/06/13/1de77036-cc13-11eb-8708-64991f2acf28_story.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}