{"Type": "", "Time": "2021-06-14", "Headline": "Treasuries Dip With Focus on Fed; Stocks Mixed: Markets Wrap", "Text": "(Bloomberg) -- Treasury yields edged higher Monday as investors prepared for a key Federal Reserve meeting later in the week. Stocks were mixed in thin trading.Ten-year Treasury yields inched up to around 1.46% after hitting three-month lows on Thursday and notching their biggest weekly slide since December last week. Stocks saw modest gains in Japan and South Korea. Trading volumes were light with a number of holidays in the region including in Australia, China and Hong Kong. U.S. futures edged up after stocks staged a late rally Friday, closing at another new high after a choppy day of trading.The dollar was steady against Group-of-10 peers in the wake of a Group-of-Seven leadership meeting that emphasized unity.With Treasury yields trending downward, investors are anticipating the Fed will reaffirm that its ultra-loose policy remains appropriate, and that it’s too soon to start even contemplating tapering bond purchases. Still, officials could project interest-rate liftoff in 2023 amid faster economic growth and inflation, according to economists surveyed by Bloomberg.“The FOMC continues to see the jump in inflation as transitory, and may acknowledge, even at the margin, that they are discussing the pace of monthly purchases but won’t yet commit to a date for slowing the purchases,” said Prudential Financial Inc. strategist Quincy Krosby in emailed comments.Elsewhere, Bitcoin jumped over the weekend after Elon Musk said Tesla would resume transactions with the cryptocurrency when mining it is done with more clean energy. Oil futures advanced.For market commentary, follow the MLIV blog.Here are some key events to watch this week:NATO holds a summit on MondayAn EU-U.S. summit takes place in Brussels on TuesdayData on U.S. industrial production, producer prices and retail sales come TuesdayThe Federal Open Market Committee rate decision comes on Wednesday, with a news conference from Jerome Powell afterU.S. President Joe Biden and Russia’s Vladimir Putin meet Wednesday in GenevaU.S. Treasury Secretary Janet Yellen testifies before a House panel Thursday on the federal budgetRate decisions come from Switzerland and Norway on ThursdayThe Bank of Japan’s monetary policy decision is on FridayThese are some of the main moves in markets:StocksS&P 500 futures rose 0.1% as of 1:00 p.m. in Tokyo. The benchmark climbed 0.2% to a record high Friday.Japan’s Topix Index gained 0.3%.South Korea’s Kospi Index advanced 0.1%.CurrenciesThe Bloomberg Dollar Spot Index was steady.The euro slid 0.1% to $1.2099.The British pound was steady at $1.4110.The Japanese yen gained 0.1% to 109.77 per dollar.BondsThe yield on 10-year Treasuries advanced about one basis point to 1.46%.CommoditiesWest Texas Intermediate crude rose 0.4% to $71.20 per barrel.Gold fell 0.8% to $1,863.02 an ounce.More stories like this are available on bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2021 Bloomberg L.P.Global shares held firm near record highs on Monday while U.S. bond yields flirted with three-month lows as investors expect the Federal Reserve to stick to its dovish mantra later this week.  Globally, equity markets were basking in the prospects of a broadening economic recovery from the coronavirus pandemic and anticipation of continuity in dovish monetary policy from the U.S. Federal Reserve.  The MSCI all-country world equity index, the U.S. S&P 500 and the pan-regional STOXX Europe 600 index all closed at record highs on Friday.Down-lite pays tariffs on Chinese feathers to stuff comforters and feather bedding, but China can export many of these products to the U.S. tariff-freeVehicle miles traveled in the United States declined more than 13% in 2020, according to IHS, while more than 15 million vehicles were scrapped - about 5.6 percent of the total vehicle population.  IHS researchers also said an ongoing shortage of semiconductors, which cut into vehicle production, resulted in lower dealer inventories and inflated transaction prices, in turn causing a concurrent rise in used vehicle prices.(Bloomberg) -- Royal Dutch Shell Plc is reviewing its holdings in the largest oil field in the U.S., a possible sale that could raise as much as $10 billion, according to Reuters.The potential sale could include all of Shell’s 260,000 acres in the Permian Basin, Reuters reported citing unidentified people familiar with the matter. Shell declined to comment on Reuters’ report.The oil and gas behemoth is under pressure to accelerate carbon emissions cuts after a Dutch court ruled last month that tGold prices slipped on Monday to their lowest in more than a week, weighed down by a stronger dollar, while investors awaited cues from the Federal Reserve policy meeting this week with recent spikes in U.S. consumer prices seen as a temporary blip.  Spot gold was down 0.6% at $1,864.58 per ounce, as of 0311 GMT, its lowest since June 4.  \"The market is starting to anticipate maybe a modest pivot towards discussing taper and it's sending investors into more of a either profit-taking or reducing gold and also currency positions,\" said Stephen Innes, managing partner at SPI Asset Management.‘People should never make this dangerous journey here. It’s bad for Americans. It’s bad for migrants. It’s bad all around,’ Lara Trump says“It’s a very tiny bird, the size of a sparrow, and I photographed him on a hill near my house in Pune,” the wildlife photographer Kunal Shah remembers of his recent encounter with a male Red Avadavat, also known as the Strawberry Finch, during the breeding season.  Sadly, the strawberry finch has historically been trafficked as part of the pet trade, so Shah was grateful to witness this one in the wild, free to explore it’s natural habitat.  Despite their regular presence in Pune, the photographer has never taken a Red Avadavat sighting for granted.Buying a stock is easy, but buying the right stock without a time-tested strategy is incredibly hard. So what are the best stocks to buy now or put on a watchlist?Transitory, or not transitory? Therein lies the question that the Federal Reserve needs to answer on Wednesday, at the conclusion of the FOMC's two-day gathering.(Bloomberg) -- Staring at a meme stock craze that shows few signs of abating, Wall Street is still wrestling with how to trade it.Many traders scroll through Reddit blogs that cheer on day traders to suss out the next big thing. Others obsessively track Stocktwits citations. There are even firms hiring WallStreetBets veterans to get inside the heads of the people who call themselves apes with diamond hands.The stakes are high. Meme stocks like AMC Entertainment Holdings Inc. and GameStop Corp. hVanguard's annual retirement savings report highlighted the power of what companies can do to promote saving as well as better investing practices.The company expects slower growth this year, but Peloton is continuing to expand its offering and expand internationally.Prices of the world's No. 1 crypto on Sunday trade sharply higher after digital-asset bull Elon Musk says Tesla would resume allowing transactions at the vehicle-maker's stores when key members of bitcoin infrastructure can confirm that 50% of the energy used to mine for bitcoin is derived from clean energy sources.(Bloomberg) -- Trying to keep up with the frenzied rise of so-called meme stocks might feel a bit like playing a game of whack-a-mole, bewildering analysts and investors alike.While there’s no steadfast definition of what constitutes a meme stock, one common thread across the many names being pitched on social media is a focus on heavily shorted companies. Shares of Reddit icon GameStop Corp. jumped as much as 2,500% in January after day traders noticed its short interest had ballooned to record(Bloomberg) -- Follow @crypto Twitter for the latest news.Bitcoin jumped above $39,000 after Elon Musk said Tesla Inc. would resume transactions with the cryptocurrency when mining is done with more clean energy.The electric-car maker will allow Bitcoin transactions again “when there’s confirmation of reasonable (~50%) clean energy usage by miners with positive future trend,” Musk, Tesla’s chief executive officer, said in a tweet.His posting was in reply to a report in Cointelegraph, which cited(Bloomberg) -- After the longest rally in almost a year, the Treasury market is ill-positioned for any surprises from the Federal Reserve next week.Bond investors, who have been abandoning short bets, are anticipating that officials will reaffirm that their ultra-loose policy remains appropriate, and that it’s too soon to start even contemplating tapering the central bank’s purchases of Treasury and mortgage-backed securities.Any hint that such discussions are in the works could provide a rude aThe classic mix of stocks and bonds may be a relic of an age long past.Wages are soaring and jobs opening are at record highs as workers feel empowered to put a price on their dignity.Let’s talk about growth stocks. These are stocks that have shown strong and sustained share price appreciation, sometimes ranging into triple-digit gains over the course of a year or more. In short, these are stocks that make investors say, “If only I’d bought in when…!” There’s no point dwelling on the past. A savvy investor, aiming to build a growth-oriented portfolio, will set up a profile for a solid growth stock, and look to match it. The factors to look for: that strong appreciation we menUsing technical analysis of the charts of those stocks, and, when appropriate, recent actions and grades from TheStreet's Quant Ratings, we zero in on five names.  While we will not be weighing in with fundamental analysis, we hope this piece will give investors interested in stocks on the way down a good starting point to do further homework on the names.  Workhorse Group Inc.  recently was downgraded to Sell with a D rating by TheStreet's Quant Ratings.", "Section": "", "Writers": "", "URL": "https://finance.yahoo.com/news/asia-stocks-set-muted-start-221037367.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}