{"Type": "", "Time": "2021-06-14", "Headline": "Opinion | Like the U.S., Israel bids goodbye to an unhinged leader - The Washington Post", "Text": "Right-wing nationalists make a practice of painting themselves as essential to the survival of their country even as they habitually undercut their nations’ greatest strengths by fanning internal dissension, scorning allies and engaging in personal corruption. Sometimes it requires their departure to fully appreciate how destructive they have become.The end of Benjamin Netanyahu’s 12 years as Israeli prime minister has been characterized by weeks of temper tantrums, threats and invectives. In his departing speech to parliament on Sunday, he combined the graciousness of Richard M. Nixon with the humility of Donald Trump. Yes, it was that bad.The Post reports: “Netanyahu delivered a bellicose parting shot to [incoming prime minister Naftali] Bennett and his allies, belittling the coalition as incapable of maintaining his record of economic growth, relative peace and standing up to U.S. pressure to acquiesce to a renewed nuclear deal with Iran.” The speech followed weeks of Netanyahu insinuating the coalition government’s election was fraudulent and its politicians liars and traitors. The Post continued:Netanyahu’s parliamentary allies proceeded to heckle, interrupt and insult Bennett and his main ally Yair Lapid, who canceled his prepared remarks to rebuke the bullies in his midst. Apologizing to his mother for having to witness the spectacle, Lapid declared that “she and every other Israeli citizen is ashamed of you and has again remembered why it’s time to replace you.”When a narcissistic leader loses his grip on power, we have learned that a meltdown is virtually inevitable. Although Netanyahu’s supporters did not storm Israel’s seat of government, they have taken to the streets to threaten and protest Netanyahu’s political opponents, leaving Bennett to beg Netanyahu not to leave a “scorched earth” behind. In his rage-filled departure, Netanyahu unintentionally reminded Israel and the United States that both countries have wisely decided to forgo cults of personality and the invective of would-be authoritarians.The unusual coalition that will make up Israel’s new government will include parties made up of Arab Israelis, the center-left and the far right (although not Ultra-Orthodox Haredi parties, dealing a blow to their influence). Israel, as in the United States following its 2020 election, now has the opportunity to normalize its domestic politics. Bennett, assuming the role of reasonable coalition-builder, declared in his speech before the Knesset: “I am proud that I can sit in a government with people with very different views.\" His address largely focused on domestic issues, on which he might find greater consensus among his diverse government.Bennett chided Netanyahu’s backers, saying, “The loud tone of the screams is the same as the failure to govern during your term in office.\" He then restated Israel’s opposition to the Iran deal, but without Netanyahu’s venom directed toward the United States. Instead, he thanked President Biden for support during the latest war with Hamas and has vowed to convey disagreements with the United States in private. (Ironically, it used to be U.S. conservatives who would criticize the public airing of grievances against Israel — when it was President Barack Obama doing the airing.)One could practically hear the sighs of relief from Biden, who swiftly reacted to the change in government in a written statement. “I congratulate Prime Minister Naftali Bennett, Alternate Prime Minister and Foreign Minister Yair Lapid, and all the members of the new Israeli cabinet. I look forward to working with Prime Minister Bennett to strengthen all aspects of the close and enduring relationship between our two nations,” he said. He added, “My administration is fully committed to working with the new Israeli government to advance security, stability, and peace for Israelis, Palestinians, and people throughout the broader region.” He also spoke with Bennett, a contrast to his first conversation with Netanyahu, which took several weeks to set up after Biden was elected.As Biden returns America to the place of respected leadership among Western democracies (inducing the G-7 to adopt his “build back better” framework and focus on threats from China), he may now enjoy a less acrimonious relationship with Israel — at least so long as its current government lasts.Read more:Submit your questions for Jennifer Rubin’s weekly live chat Read the transcript of Jennifer Rubin’s June 11 live chatYousef Munayyer: Why a new Israeli government won’t mean justice or peace for PalestiniansDavid Ignatius: Inside the palace intrigue in Jordan and a thwarted ‘deal of the century’Gershom Gorenberg: Netanyahu is on his way out. Why am I still nervous?Jackson Diehl: Netanyahu’s reaction to Biden’s victory is appallingThe Post’s View: Israel is at an impasse again, when what it needs is to end the era of NetanyahuThe most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/opinions/2021/06/14/like-us-israel-bids-goodbye-an-unhinged-leader/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}