{"Type": "", "Time": "2021-06-14", "Headline": "Sunny Sunday for Singapore: Only 13 new Covid-19 cases including 10 in community | The Star", "Text": "\n                    Sunday, 13 Jun 2021\n                Singapore reports 10 new Covid-19 community infections, including 2 unlinked. Singapore's total cases on Sunday (June 13, 2021) now stands at 62, 276. - The Straits Times/ANNSINGAPORE, June 13 (The Straits Times/ANN): There were 13 new coronavirus cases confirmed at noon on Sunday (June 13), taking Singapore's total to 62, 276.Sunday's figure comprises 10 community cases, said the Ministry of Health (MOH).Of these, two are currently unlinked.Of the eight linked cases, five had already been placed on quarantine, while three were detected through surveillance, said MOH.There were also three imported cases who had been placed on stay-home notice on arrival in Singapore. Two of the imported cases are Singaporeans or permanent residents.No new cases from within workers' dormitories were reported.Meanwhile, 266 people who have mild symptoms or are clinically well but still test positive for Covid-19 are being isolated and cared for at community facilities.Altogether 34 people have passed away from complications due to Covid-19 infection in Singapore.\nTags / Keywords:\nSingapore\n                                                                ,\n                                                                                                Cases\n                                                                ,\n                                                                                                Sunday (June 13)\n                                                                ,\n                                                                                                Only 13\n                                                                ,\n                                                                                                Situation\n                                                                ,\n                                                                                                Under Control\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/13/sunny-sunday-for-singapore-only-13-new-covid-19-cases-including-10-in-community", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}