{"Type": "", "Time": "2021-06-14", "Headline": "New Zealand's Ardern pans mosque attacks film amid backlash, Australia/NZ News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.WELLINGTON (AFP) - New Zealand Prime Minister Jacinda Ardern on Monday (June 14) criticised a planned movie about her response to the 2019 Christchurch mosque attacks as poorly timed and focusing on the wrong subject.The US-backed film They Are Us has sparked an intense backlash among New Zealand Muslims, with community leaders slamming the project for pushing a \"white saviour\" narrative.Ms Ardern said the attacks - when a white supremacist gunman ran amok at two mosques during Friday prayers, killing 51 and seriously injuring another 40 - remained \"very raw\" for many New Zealanders.She said film-makers had not consulted her about the movie, which is set to star Australia's Rose Byrne as the centre-left leader.\"In my view, which is a personal view, it feels very soon and very raw for New Zealand,\" Ms Ardern told TVNZ, New Zealand’s state-owned television network.\"And while there are so many stories that should be told at some point, I don't consider mine to be one of them - they are the community's stories, the families' stories.\"Ms Ardern won widespread praise for her empathetic and inclusive handling of the attacks, the worst mass shooting in modern New Zealand history, including wearing a scarf when meeting mourners.The movie's title references a line from a speech she gave in the immediate aftermath of the atrocity when she pledged to support the Muslim community and tighten gun laws.A petition from the National Islamic Youth Association calling for the production to be shut down has gathered more than 58,000 signatures.The association said the proposed film \"sidelines the victims and survivors and instead centres the response of a white woman\".It said the Muslim community had not been properly consulted about the project, which has been scripted by New Zealand writer Andrew Niccol.\"Entities and individuals should not seek to commercialise or profit from a tragedy that befell our community, neither should such an atrocity be sensationalised,\" association co-chair Haris Murtaza said.Muslim poet Mohamed Hassan said the film-makers needed to focus on members of the community that bore the brunt of the attacks, not use them as props in a feel-good story about Ms Ardern.\"You do not get to tell this story. You do not get to turn this into a White Saviour narrative. This is not yours,\" he tweeted.The attacker, Australian self-declared white supremacist Brenton Tarrant, was jailed for life without parole last year, the first time a whole-of-life term has been imposed in New Zealand.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/australianz/new-zealands-ardern-pans-mosque-attacks-film-amid-backlash", "Source": "google"}