{"Type": "", "Time": "2021-06-14", "Headline": "'We decided to spread joy instead': Indian musicians on viral remix of woman striking Chinese gong, Singapore News - AsiaOne", "Text": "Some say, music has the power to heal.Responding to the recent viral video, when a man's prayers was interrupted by a woman striking her gong animatedly, two local Indian musicians decided to put a creative spin on the incident on June 9.On Saturday (June 12), these musicians uploaded a 59-second video clip where they can be seen beating their traditional Tamil drums to a remix of the sound made by the woman's golden gong.In the post, Akshara Thiru, 33, one of the musicians drumming in the video, wrote this caption: \"When I saw this video, I decided to take a different approach.\"All I see, is a lady who wanted to be part of our culture so here’s my man Pravin and I giving her a shot!\"[embed]https://www.facebook.com/1008496055/videos/10221970487783806/[/embed] Their Facebook post has since gone viral with over 111,000 views and almost 8,000 shares. Netizens reacted positively to the video with some expressing laughter and others praising the positivity. One commenter wrote, \"Wonderful! Let's deal [with] it with fun and empathy\".\"When we saw the initial post, we, like most Indians were, upset. We felt powerless knowing that we can't do much to change the situation,\" Akshara, founder of traditional Indian Drum school Damaru Singapore, told AsiaOne. ALSO READ: Police investigating after woman filmed striking gong as neighbour carried out Hindu prayers at homeBoth Akshara and Pravin, the other musician in the video, used traditional Tamil drums named parai (left) and thavil (right) respectively.\"So we decided to use the magic of Indian drumming and spread the joy instead. In our stressful society, it's perhaps the one thing that we really need now,\" he said.alexanderkt@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/singapore/we-decided-spread-joy-instead-indian-musicians-viral-remix-woman-striking-chinese-gong", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}