{"Type": "", "Time": "2021-06-14", "Headline": "Chris Hemsworth trolls Chris Evans on 40th bday with Chris Pratt pic", "Text": "The long-running \"battle of the Chrises\" has been re-ignited with a 40th birthday salvo sent by Chris Hemsworth.The Thor actor gave June 13 birthday greetings to Captain America, Chris Evans, with an Instagram photo of the smiling Hemsworth alongside a different Chris: \"Guardians of the Galaxy\" star Chris Pratt.\"Happy 40th birthday Chris Evans, you'll always be number 1 in my book,\" Hemsworth wrote.The photo appears to be a behind-the-scenes shot from the set of \"Thor: Love And Thunder\" film, in which both Hemsworth, 37, and Pratt, 41, are both set to reprise their Marvel roles.Hemsworth's birthday post re-establishes long-simmering tension over the greatest Chris in Hollywood, between Hemsworth, Evans, Pratt and \"Star Trek\" actor Chris Pine.Battle of the Chrises:A 2017 breakdown of leading men named ChrisMore:Lizzo drunkenly sent a flirty DM to Chris Evans: See his hilarious responseThe \"battle of the Chrises\" took a new turn in January, when Pratt's father-in-law Arnold Schwarzenegger mistakenly referred to him as Evans during an IG charity live event hosted by Pratt.\"Hello, Chris Evans, oh not Chris Evans, sorry, I'm going to screw up this whole thing right from the beginning. Chris Pratt,\" Schwarzenegger said. \"I didn't look at the cue cards the right way. Sorry about that. I should know your name. That's for sure. My favorite son-in-law.\"I'm your only son-in-law,\" said Pratt.Chris Pratt, Katherine Schwarzenegger's anniversary: A look at their gushing love for each otherThe battle was seemingly over when Hemsworth and Pratt gave the last word in 2018 when the duo sat down with USA TODAY.\"They need to stop bringing Chris Evans into the discussion,\" said Hemsworth.More:Chris Hemsworth may be Thor, but his son wants to be another hero: 'Dad I wanna be Superman'\"I think at the end of the day, it's a 50/50 tie,\" said Pratt. \"I love America, but we have a captain already.\"\"His name is Chris Evans and it just really makes me mad,\" Hemsworth added.More:Anthony Mackie, the new Captain America, says getting his own movie 'would be everything'", "Section": "", "Writers": "", "URL": "https://www.usatoday.com/story/entertainment/movies/2021/06/13/chris-evans-birthday-chris-hemsworth-trolls-with-chris-pratt-photo/7678835002/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}