{"Type": "Asia", "Time": "2021-06-14", "Headline": "Gas blast in China kills at least 12, rescue operation ongoing: Officials", "Text": "BEIJING: At least 12 people were killed and nearly 140 others injured when a gas line explosion ripped through a residential compound in central China's Hubei province on Sunday (Jun 13), local officials said.Rescue efforts were continuing, according to a statement from the disaster management bureau in the city of Shiyan, although it was unclear how many people may still be trapped under the debris.The explosion took place at about 6.30am and an investigation was under way to determine the cause of the blast, the statement said.Responders sent 138 people to hospital, of which 37 were critically injured, according to a statement on the city's official website.Videos shot by witnesses and verified by Beijing News show several buildings reduced to rubble and rescue workers carrying shocked survivors on stretchers.The blast ripped through one of the city's vegetable markets that was filled with shoppers and local residents eating breakfast, an eyewitness told state-run Global Times.\"I heard a loud bang and immediately ducked under the table, thinking it was an earthquake,\" a man who owns a small restaurant near the explosion site told the newspaper.State broadcaster CCTV showed footage of buildings with charred walls and shattered windows. Rescuers are seen raking through the debris with shovels and gloved hands.People can be seen walking in a rubble-strewn street between damaged buildings.Images also show rescuers climbing over broken concrete slabs to reach those trapped inside.The blast occurred in a two-storey building that earlier housed a vehicle frame manufacturer.Several survivors told local media that the gas pipeline had fallen into disrepair after the factory was moved last year.\"In March, workers from the gas company came and asked whether I got a smell of gas,\" one survivor who runs a stall in the market told local website Health Times.\"After asking around (with) people they just left.\"Around 900 residents in the area have been evacuated as surrounding buildings may have been damaged by the blast, the city government said.About 2,000 rescue workers have been deployed on the site.Images verified by Health Times show a firefighter who was also injured and a fire truck damaged by a second, smaller blast. The severely injured were airlifted to bigger hospitals.Long lines of volunteers were seen outside blood banks as local hospitals put out a call for donors.The Ministry of Emergency Management has also sent a team to assist with the rescue operation.In a rare move, Chinese President Xi Jinping issued a statement urging local officials to \"learn profound lessons from the incident\" and double down on efforts to prevent such incidents.\"All regions and relevant departments must draw lessons from one another ... investigate various safety hazards and prevent major emergencies,\" he said.Industrial accidents are common in China due to weak safety standards and corruption among officials tasked with enforcing them.The blast came a day after eight people were killed and three others injured when toxic methyl formate leaked from a chemical handling facility in the southwestern city of Guiyang.Among the worst accidents was a massive 2015 explosion at a chemical warehouse in the port city of Tianjin that killed 173 people, most of them firefighters and police officers. The blast was blamed on illegal construction and unsafe storage of volatile materials.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "China,fatal accident", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/china-shiyan-hubei-gas-explosion-dead-injured-15005218", "Source": "google"}