{"Type": "", "Time": "2021-06-14", "Headline": "Easing of Covid-19 measures: Larger groups seen at parks; beauty services in high demand, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Larger groups of people were seen at some parks and several beauty salons were fully booked on Monday (June 14), the first day of the relaxation of Covid-19 curbs imposed since last month.When The Straits Times visited Bishan Park and Jurong Lake Gardens on Monday morning (June 14), many of those who had gathered in groups of up to five said they were glad they could do so after spending a month cooped up at home.With two weeks left in the June school holidays, many such groups had young children with them.Civil servant Anna Wong, 45, was at Jurong Lake Gardens for a walk with her two sons, her mother and a domestic helper.\"My mother lives in a different unit from us. Taking her to the park with the kids was something we wanted to do together,\" said Ms Wong. \"It can get pretty stifling if she were to stay indoors all day.\"Ms Siti Muslehat Mustaffa and Ms Mardina Majid, both 56, were at Bishan Park with Ms Siti's nephew, 10, and Ms Mardina's two nieces, age nine and 12. The women, who are friends living together, said the children are from two different households and were staying with them for a day.\"When we heard the new rules, we thought: Finally, we can all go out together. The kids are enjoying it the most because they get to meet one another,\" said Ms Siti.She added the five of them were planning to have lunch together at home after their walk.Ms Tessie Parro, 38, her son and daughter, and their domestic helper were also at Bishan Park. She said the last time they had all gone out together was before May 16.\"During phase two (heightened alert), I had to go out with only one of my kids,\" she said. \"I feel happy and relieved that it's safe to go out again. It's the school holidays so my kids have nothing to do and the house can get very chaotic. When they're outside, they can release their energy by running around.\"Ms Onda Badenova, 42, was spotted with three friends at a badminton court in a Housing Board estate in Kang Ching Road. The ballet teacher said she was glad she could resume her usual twice- or thrice-weekly badminton games with her friends, after a month of not being able to play together.From Monday (June 14), groups of up to five people can gather socially again, up from the limit of two imposed as part of heightened alert measures from May 16 to Sunday.Capacity limits at attractions like the Singapore Zoo and Gardens by the Bay have also been increased to 50 per cent of their usual operating capacity, up from 25 per cent previously.\nPeople at the Singapore Zoo on June 14, 2021. Capacity limits at attractions have been increased to 50 per cent of their usual operating capacity, up from 25 per cent previously. ST PHOTO: ALPHONSUS CHERN\nWith the relaxing of the measures, some businesses such as beauty salons that involve clients removing their masks are also allowed to resume.Ms Jerrie Man, director of the J Studios beauty salon, which has two outlets in Jurong East and Haji Lane, said all slots for facial treatments on Monday had been booked.Ms Man, 39, said business has been tough lately as customers had to postpone their treatments in the light of the restrictions.\"We closed for three weeks, from the first day of the restrictions till last Monday,\" she said.\"Our main source of income has been our regular customers who would contact us to buy products like facial wash.\"Madam Lim Joo Li, director of Beauty Horizon Aesthetics Salon in International Plaza, said she was fully booked for appointments for the rest of the week.\"I'm definitely relieved that I can finally open again. During the circuit breaker last year, we lost some customers who never returned afterwards,\" said Madam Lim, 50.\"These included the elderly, whose children felt it wasn't safe for them to be out and about.\"Ms Lim added she was planning to diversify her services and offer more body treatments that can be done even if customers need to put on their masks.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/larger-families-visit-parks-beauty-services-in-high-demand-as-covid-19-measures-ease", "Source": "google"}