{"Type": "", "Time": "2021-06-14", "Headline": "\n                                    Toshiba dumps 2 board members after report on shareholder pressure -\n                        Nikkei Asia\n                        ", "Text": "Audit committee members failed to uncover collusion over July 2020 meeting TOKYO -- Toshiba has removed two current directors from its list of board candidates less than two weeks ahead of a shareholder vote, the Japanese industrial group said Sunday as it deals with the aftermath of a probe into alleged influencing of investors.Junji Ota, Toshiba's audit committee chair, and Takashi Yamauchi, an audit committee member, will step down as of the June 25 annual general meeting.The announcement comes after an independent investigation found Toshiba's July 2020 annual general meeting was \"not fairly managed.\" The investigation turned up evidence the company had worked with the Ministry of Economy, Trade and Industry to put pressure on activist shareholders.Ota and Yamauchi were part of the audit committee when Toshiba conducted its own review of the July 2020 shareholders meeting and found nothing inappropriate with its conduct.Toshiba held an emergency board meeting on Sunday to respond to the independent report, which was sought by shareholders in a closely watched vote in March.\"We take it seriously\" that investigators found the July 2020 meeting \"was not conducted fairly as required by the Corporate Governance Code,\" Toshiba said in a statement Sunday. \"We will take action to identify the root cause without delay, in an objective and transparent manner, including the participation of third parties.\"Two Toshiba executives will step down. Masayasu Toyohara, senior executive vice president, and Masaharu Kamo, corporate senior vice president, were both named in connection with Toshiba's exchanges with METI on dealing with activist shareholders.Toshiba will hold an online briefing Monday 1 p.m. to discuss its response to the report, with its chairman of the board, Osamu Nagayama, due to attend.Toshiba has been rocked by governance turmoil in recent months.In April, then-CEO Nobuaki Kurumatani stepped down amid declining trust in his leadership both at the company and among investors.The abrupt change in leadership came after Nikkei reported on a $20 billion proposal by private equity firm CVC Capital Partners to take the Japanese industrial group private.Kurumatani had clashed with activist shareholders, and his past ties with CVC raised the possibility of a conflict of interest. Sign up to our newsletters to get our best stories delivered straight to your inbox.Discover the all new Nikkei Asia appDiscover the all new Nikkei Asia appStay ahead with our exclusives on Asia; the most dynamic market in the world.Stay ahead with our exclusives on AsiaGet trusted insights from experts within Asia itself.Get trusted insights from experts within Asia itself.\n                Stay ahead with our exclusives on Asia; the most dynamic market in the world.\n            \n                Get trusted insights from experts within Asia itself.\n            Offer ends January 31stYou need a subscription to... \n            You need a subscription to:\n        \n        Nikkei Asian Review, now known as Nikkei Asia, will be the voice of the Asian Century.\n    ", "Section": "", "Writers": "", "URL": "https://asia.nikkei.com/Spotlight/Toshiba-in-turmoil/Toshiba-dumps-2-board-members-after-report-on-shareholder-pressure", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}