{"Type": "", "Time": "2021-06-14", "Headline": "Why it is important to take breaks from work , Invest News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.(NYTIMES) - It's probably never been easier to acknowledge that a lot of us work too much and too hard, and should take more time off. Indeed, the very idea of burnout seems to be having a cultural moment.\"If you think you're burned out, you're burned out. And if you don't think you're burned out, you're burned out,\" Jill Lepore wrote recently in The New Yorker.To believe this is one thing, but to act on it is another. For years, surveys have found that American workers tend not to use all of their vacation days. And according to NordVPN Teams, a provider of virtual private network technology that is important to remote work set-ups, the stay-at-home workforce created by lockdowns and office closures put in more hours on the job than before the pandemic.Your biggest obstacle to getting time off is probably you: It can be hard to give yourself that permission to do nothing when there's just so much to do. Consider, however, that Amazon's founder and CEO Jeff Bezos has said he sets aside \"puttering time\" every morning before taking any calls or meetings - basically carving out a scheduled chunk of do-nothing time. Are you really that much busier than him?The point isn't just that it's nice to goof off every so often - it's that it's necessary. And that's true even if your ultimate goal is doing better work: downtime allows the brain to make new connections and better decisions. Multiple studies have found that sustained mental attention without breaks is depleting, leading to inferior performance and decision-making.In short, the prefrontal cortex - where goal-oriented and executive-function thinking goes on - can get worn down, potentially resulting in \"decision fatigue\". A variety of research finds that even simple remedies like a walk in nature or a nap can replenish the brain and ultimately improve mental performance.These findings aren't just limited to academic studies. In his recent book Richer, Wiser, Happier, veteran financial journalist William Green draws on many hours of interviews with highly successful investors, and, as you'd expect, a recurring theme is that these people tend to work hard, and out-think, out-research and out-hustle the crowd.But a counter-intuitive subtheme also emerges: how seriously his subjects tend to take breaks, time off and make space in their lives for definitive distance from the all-day, everyday 21st century work cycle. Many - including Mr Charlie Munger, Mr Warren Buffett's long-time collaborator - make a point to carve out time for quiet and contemplation. For Mr Munger, that means ignoring up-to-the-second market news and crowd noise and instead exercising extreme patience.For another one of Green's interviewees, Ms Laura Geritz, CEO at Rondure Global Advisors, it means taking time to sit by a stream and journal. Developing \"a regular meditation practice\", Green notes, has become \"a mission-critical habit for many successful investors\". This isn't an afterthought or a hobby or a personal wellness tactic, Green said. It's a reflection of the \"ruthless pragmatism\" that made his subjects successful in the first place - in the eternal hunt for an edge, they found their rest ethic. It's almost a \"counter-cultural\" move, Green said. \"I don't think you have deep thought without structuring your life this way,\" he said, at a time when everybody is constantly pinged and reacting to short-term stimuli.The good news is that at least some companies are starting to take breaks seriously. For starters, some are acknowledging that unlimited paid time off, a popular gesture among employers who have tried to address the issue, doesn't really do the trick, says John Fitch, the author with Max Frenzel of the 2020 book Time Off. It can end up feeling like just another responsibility, and nobody wants to be the employee who takes the most days off.Lately, companies including LinkedIn and Roblox have experimented with mandatory vacation for all or most employees in the form of \"spring break\" periods. Actions like these that emphasise the value of time off represent a \"profound\" shift, Fitch said. He and Frenzel, both tech entrepreneurs, are tinkering with a software tool that would help human resources departments prod workers to take days off.Still, those companies are outliers, and most of us will have to take the initiative on an individual level. Given the natural resistance to downtime that many of us evidently feel, it might make sense to start small - find a gateway drug equivalent to taking time off. Or, to use Fitch's related metaphor, try micro-dosing breaks.One obvious place to start? Unplugging. The dream of a weeks-long \"digital detox\" may not be practical, but consider the \"technology Shabbat\" strategy - taking one day a week off from technology - promoted by writer and filmmaker Tiffany Shlain, most recently in her book 24/6.For some, the advice to simply unplug or \"do nothing\" feels like a dead end; you need something to fill that space, or you just end up ruminating about work all over again. Fitch recommends an exercise called \"More of, less of\" - periodically taking a chunk of time to list both what you want more of and less of in your life. It's a \"higher altitude\" analysis to pull you out of the day-to-day rut of reacting to other people's stimuli and help you focus on what you need to create, and get rid of, in your life.Similarly, if you add to your routine a simple walk around the block to clear your head, make sure you really clear it. Spending the whole time checking social media and monitoring your step count is not a quality break. Leave your phone behind, and make a point to notice something new and different on every walk. Turning the walk into a game ensures that your mind is engaged with the world rather than brooding about the work you're supposedly taking a break from.But wait - don't such ideas sound kind of like another form of work? More goal-oriented tasks intended to boost productivity in the long run? Is developing a rest ethic ultimately another job? Perhaps so. But then again, maybe that's the only language the unhealthily work-obsessed really understand.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/invest/why-it-is-important-to-take-breaks-from-work", "Source": "google"}