{"Type": "", "Time": "2021-06-14", "Headline": "EU may further restrict AstraZeneca vaccine: COVID-19 Daily Bulletin - CGTN", "Text": " Share CopiedTOP HEADLINES â¢ Countries should also avoid giving the AstraZeneca coronavirus vaccine to people over 60, the head of the EU drug regulator EMA's vaccine strategy has been quoted as saying, amid fears over rare blood clotting, and as more alternative vaccines become available.â¢ Marco Cavaleri, who noted that incidents with the AZ vaccine were very rare and that the roll out appeared to be going well in the UK,  told Italy's La Stampa newspaper that the Johnson & Johnson jab should be preferentially used for the over 60s, AFP reports.â¢ Italy stopped use of the AZ vaccine for people under the age 60 on Saturday. Asked if it would not be better to ban it for all age groups, Cavaleri is quoted as saying: \"Yes, and it is an option that many countries, such as France and Germany, are considering in the light of the increased availability of mRNA vaccines.\"â¢ Germany's health ministry said Johnson & Johnson must deliver 6.5 million vaccine doses to the country in July to make up for a shortfall expected in June. The demand comes after the U.S. Food & Drug Administration told the company to dispose of millions of doses because of contamination concerns.â¢ Poland will further ease restrictions from Sunday as infections drop across the country. The government announced the new rules on Friday - cultural institutions like cinemas, theaters, and museums can reopen their food facilities in a limited capacity.â¢ South Korea will exempt some travelers who have received their vaccine shots overseas from its mandatory two-week quarantine starting July 1, health authorities said.â¢ Paris police said three people were detained after officers used tear-gas to disperse hundreds of youths gathered for a street party in defiance of social distancing limits and an 11:00 p.m. curfew. The parties have been called 'project x' by organizers. â¢ The head of the World Trade Organization said there was a pathway for a global deal to get more vaccines to developing countries, despite a split over whether drug firms should give up their intellectual property rights. â¢ A cluster of Delta-variant COVID-19 infections has been detected at an art school in the eastern French city of Strasbourg, the regional health authority said on Saturday. The four cases, confirmed as the more contagious variant first detected in India, were found at the Haute Ecole des Arts du Rhin, which was closed by authorities on June 10 until further notice.Commuters, some wearing face masks, walk on a platform at Moscow metro. /AFP/Dimitar DilkoffACROSS EUROPE Russia Russia, in particular Moscow, is now embroiled in what could be another wave of the virus. Russia on Sunday reported 14,723 new COVID-19 cases, including 7,704 in Moscow, the largest one-day national caseload since February 13.The number of new infections in Moscow was the most reported in one day since December 24. The city's mayor told residents on Saturday to stay off work this coming week, if they can, to curb the spread of the virus.The surge has been blamed in part on a vaccine-reluctant population, with some surveys suggesting that most Russians do not want to take Sputnik V despite trials and tests proving the vaccine effective and safe. In a promising sign for the country's vaccination program, the scientist who led the development of Sputnik V has tested a nasal spray form of its COVID-19 vaccine. The product is reportedly suitable for children aged 8-12 and could be launched in September. G7 The G7 countries announced they would provide a billion COVID-19 vaccine doses over the next year and work with the private sector, the G20, and other countries to increase the contribution over months to come, according to an almost finalized draft of the communique, seen by Reuters.The G7 said in the draft that the vaccine donations built on exports from domestic production with at least 700 million doses exported, or to be exported, this year, of which at least 50 percent have gone to non-G7 countries.The group added that it had \"a commitment to continue exporting in significant proportions, and the promotion of voluntary licensing and not-for-profit global production, which has so far accounted for 95 percent of the COVAX supply,\" the communique said.The COVAX facility, backed by the World Health Organization and the Global Alliance for Vaccines and Immunization, aims to secure 2 billion vaccine doses for lower-income countries by the end of 2021.A person in Mexico participates in the first in-person LGBT+ Pride march. /AFP/Ulises Ruiz Guy Henderson, LondonA maximum 22,500 fans are allowed in Wembley Stadium as England begin their Euro 2020 campaign in north London.As with all major sporting competitions, teams are tightly bubbled. And anyone entering the stadium - fan, journalist, volunteer, or support staff - will need to show proof of full vaccination or a negative lateral flow test. The UK has one of the most advanced vaccination programs globally, yet the danger, it seems, of going backward in terms of easing restrictions has still not entirely subsided.Reports continue to circulate that Prime Minister Boris Johnson will, on Monday, announce a delay of up to four weeks for the final easing of most, if not all, legally binding restrictions penciled for June 21. That could have implications for the largest sporting competition since the start of the pandemic. Wembley will host one of the semi-finals, and then the final itself on July 11.Hopes of a fully-packed stadium look increasingly remote. Rahul Pathak in MadridThousands of supporters of the far-right Vox party are expected to match against Spain's Socialist-led government in Madrid on Saturday.Officially protesting against the possible pardon of leaders of the Catalan separatist movement, the protest is a show of force by various right-wing Spanish movements, partly galvanized by their opposition to the government's handling the coronavirus crisis.Joining the Vox party are the supporters and politicians from the more moderate Popular Party.Their leader Pablo Casado is riding high in the polls right now and he's hoping the protests will increase the pressure on Spanish Prime minister Pedro Sanchez.However, many in Casado's party say they attend today's march as they don't want to share a platform with the extremist Vox.FROM OUR GLOBAL COLLEAGUESCGTN Europe: The backward running champion trying to conquer the Italian AlpsCGTN China: China plans to launch a Mars sample-return mission around 2030CGTN America: The roots of migration series CGTN Africa: Record number of refugees, migrants returned to Libya - UN Sign up here to get the COVID-19 Europe bulletin sent directly to your inbox.CGTN Europe has been providing in-depth coverage of the novel coronavirus story as it has unfolded.Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3", "Section": "", "Writers": "", "URL": "https://newseu.cgtn.com/news/2021-06-13/EU-may-further-restrict-AstraZeneca-vaccine-COVID-19-Daily-Bulletin-113V5tfwShW/index.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}