{"Type": "", "Time": "2021-06-14", "Headline": "Denmark's Eriksen still in hospital, condition is stable", "Text": "published :\n\t\t\t\t\t\t\t\t\t\t\t\t\t13 Jun 2021 at 18:15\t\t\t\t\t\t\t\t\t\t\t\twriter: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tReutersCOPENHAGEN: Denmark midfielder Christian Eriksen remained in hospital and was in stable condition on Sunday, after collapsing during his side's Euro 2020 opening match with Finland and being given CPR on the pitch on Saturday, the Danish football association said.\"This morning we have spoken to Christian Eriksen, who has sent his greetings to his teammates. His condition is stable, and he continues to be hospitalized for further examination,\" Danish FA DBU said on Twitter.Eriksen, 29, collapsed suddenly in the 42nd minute of the match while running near the left touchline after a Denmark throw-in. As a hush fell over the 16,000-strong crowd, his teammates gathered around him while he was treated on the pitch and then carried off on a stretcher.\"The team and the staff of the national team has received crisis assistance and will continue to be there for each other after yesterday's incident,\" DBU said.\"We would like to thank everyone for the heartfelt greetings to Christian Eriksen from fans, players, the royal families from both Denmark and England, international associations, clubs etc,\" it said.Messages of support for Eriksen, who plays for Inter Milan, have poured in.The Group B game was halted and then eventually restarted an hour and 45 minutes later. Finland went on to win 1-0. The government admits there is a shortage of Covid-19 vaccine with no deliveries expected this week.MOSCOW: When Vladimir Putin meets Joe Biden for their first summit on Wednesday the Russian leader will not be looking for progress on arms control, the lifting of sanctions or even an apology for the US president saying he is a \"killer\".KANCHANABURI: The Three Pagodas border pass has been closed for two weeks from Monday after more Covid-19 infections were detected at the border with Myanmar.", "Section": "", "Writers": "", "URL": "https://www.bangkokpost.com/sports/2131679/denmarks-eriksen-still-in-hospital-condition-is-stable", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}