{"Type": "", "Time": "2021-06-14", "Headline": "Stay-home guide for Monday: Take on a 10-week workout challenge, listen to a podcast on love and more, Life News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Stay in and help fight Covid-19. The Straits Times' Clara Lock recommends fun, uplifting things to do.\nCaroline Girvan's no-nonsense workouts range from strength training with dumbbells and kettlebells to high-intensity interval training with bodyweight exercises. PHOTO: CAROLINE GIRVAN/YOUTUBE\nWork out with fitness trainer Caroline Girvan, an Irish mother-of-two who became a YouTube fitness sensation last year. She began recording workout videos for her clients under lockdown and amassed a following when she posted them online.Her no-nonsense workouts range from strength training with dumbbells and kettlebells to high-intensity interval training with bodyweight exercises.There are dozens of videos on her YouTube channel, but if you are looking for somewhere to start, embark on her 10-week epic series, which comprises 50 different workouts lasting between 35 and 60 minutes.Apart from introducing each exercise, Girvan is not the sort to chatter. She keeps it real by doing the workouts too and is not above pausing to take a breather when the sets get intense. With 1.05 million subscribers to her channel, it is clearly a formula that works.Info: Caroline Girvan's website\nFunny, uplifting and bittersweet, the stories may make you laugh and cry. PHOTO: NYTIMES\nLove is patient, love is kind. It is also messy, complicated, tricky and beautiful.Since 2004, the New York Times' Modern Love column has covered all facets of love from real people and parlayed these stories into a television show, three books and a podcast.Plug into episodes such as actress Zawe Ashton reading Lilian Oben's 2017 essay, Confronting Race, Religion And Her Heart, where Oben writes about being broken up with because she is black and not Jewish.Other episodes deal with themes such as losing a loved one to death, alcohol addiction and being trapped in a romance scam.Funny, uplifting and bittersweet, the stories may make you laugh and cry, feeling alternately like a warm hug and someone whispering sweet nothings in your ear.Info: Spotify's website\nTelevision still of Ugly Delicious hosted by celebrity chef David Chang (left). PHOTO: NETFLIX\nSink your teeth into these tasty travelogues that showcase culture and cuisines from around the world.Celebrity chef David Chang of Momofuku fame takes on hearty fare such as pizza, tacos, dumplings and more in Netflix's Ugly Delicious (2018 to 2020).Meanwhile the affable Philip Rosenthal, creator of sitcom Everybody Loves Raymond, goes on a culinary sojourn in Somebody Feed Phil. His adventures include chowing down on ostrich and antelope in Cape Town and learning how to make tortillas in Mexico City.Also explore China's backcountry in Flavourful Origins, with short episodes that showcase food from provinces such as Gansu and Yunnan.For instance, people in a remote part of Gansu clean out a lamb stomach and place hot rocks and mutton inside, simulating a pressure cooker that steams and grills the meat at the same time.Info: Click here\nThere are three collaboration sets, each comprising different dishes. PHOTO: YUN NANS\nWith delivery becoming an increasingly important revenue stream, food brands are pooling their offerings to create a situation that benefits everyone.For example, stalls specialising in drinks or snacks may find it tough getting customers to pay a hefty delivery charge for a small order.By working with food outlets, they can find more takers. Restaurants benefit from the additions to their menus and diners have a bigger choice.READ MORE HERE\n\nDial A For Aunties By Jesse Q. Sutanto. PHOTOS: MICHAEL HART, BERKLEY\nDial A For Aunties\nBy Jesse Q. Sutanto\nBerkley/ Paperback/ 352 pages/ $27.82/ Major bookstoresWedding receptions! Remember those?It is at least another week before one can hold a wedding reception in Singapore, thanks to the extension of heightened alert measures. You can, however, get nuptially nostalgic with Jakarta-based Sutanto's dark comedy about murder and meddling relatives.Photographer Meddelin Chan, an American millennial raised by her Indonesian-Chinese mother and aunts, fears she will never gain her independence from the family wedding planning business (\"Don't leave your big day to chance, leave it to the Chans!\")READ MORE HEREJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/life/stay-home-guide-for-monday-take-on-a-10-week-workout-challenge-listen-to-a-podcast-about-love", "Source": "google"}