{"Type": "", "Time": "2021-06-14", "Headline": "EU adds another rare blood condition as side effect of AstraZeneca shot, World News - AsiaOne", "Text": "Europe's drug regulator on Friday (June 11) identified another very rare blood condition as a potential side effect of AstraZeneca's Covid-19 vaccine and said it was looking into cases of heart inflammation after inoculation with all coronavirus shots.The European Medicines Agency's (EMA) safety committee said that capillary leak syndrome (CLS) must be added as a new side effect to labelling on AstraZeneca's vaccine, known as Vaxzevria.People who had previously sustained the condition, where fluids leak from the smallest blood vessels causing swelling and a drop in blood pressure, should not receive the shot, the EMA added.The regulator first began looking into these cases in April and the recommendation adds to AstraZeneca's woes after its vaccine was associated with very rare and potentially lethal cases of blood clotting that come with a low platelet count.Last month, the EMA had advised against giving a second AstraZeneca shot to people with that clotting condition, known as thrombosis with thrombocytopenia syndrome (TTS).The committee reviewed six validated cases of CLS in people, mostly women, who had received Vaxzevria, including one death. Three had a history of the condition.More than 78 million Vaxzevria doses have been administered in the European Union, Liechtenstein, Iceland & Norway and Britain.In a statement, AstraZeneca pointed to the extreme rarity of CLS cases, at less than 1 in 10 million vaccinated individuals.\"We are working actively, in collaboration with regulatory authorities, on risk minimization measures... that includes information to those being vaccinated...information to drive early diagnosis and intervention, and appropriate treatment,\" the company said.Britain’s regulator, the MHRA said it was considering precautionary advice for people with a history of CLS but does not see a causal link with the vaccine.Two of eight reports of capillary leak syndrome following AstraZeneca vaccination in the UK were in people with a history of the condition, and 40 million doses of the vaccine had been given, it said.Separately, the EMA said it was continuing its probe into cases of heart inflammation known as myocarditis and pericarditis, primarily following inoculation with the Pfizer/BioNTech, and Moderna mRNA shots, but also after the J&J and AstraZeneca vaccines.U.S. health officials said on Thursday they had registered a higher-than-expected number of heart inflammation cases in young men who received a second dose of the mRNA shots, though a causal relationship could not be established.Israel’s Health Ministry said this month it had found a likely link to the condition in young men who received the Pfizer/BioNTech shot.Both Pfizer and Moderna have acknowledged the observations but said a causal association with their vaccines has not been established.BioNTech said adverse events, including myocarditis and pericarditis, are being regularly and thoroughly reviewed by the companies and regulatory authorities.\"More than 300 million doses of the Pfizer-BioNTech Covid-19 vaccine have been administered globally and the benefit risk profile of our vaccine remains positive.\"The United States and Israel have been months ahead of the EU in vaccinating men below 30, who are particularly prone to heart inflammation, giving them potentially more cases to analyse.", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/world/eu-adds-another-rare-blood-condition-side-effect-astrazeneca-shot", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}