{"Type": "", "Time": "2021-06-14", "Headline": "Putin says US-Russia relations at their lowest point in years, World News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.WASHINGTON • Russian President Vladimir Putin, in an interview with NBC News ahead of his meeting with US President Joe Biden this week, said relations between the two countries are at their lowest point in years.Mr Putin and Mr Biden will meet in Geneva on Wednesday. The White House has said Mr Biden will bring up ransomware attacks emanating from Russia, Moscow's aggression against Ukraine, the jailing of dissidents and other issues that have been soured the relationship.\"We have a bilateral relationship that has deteriorated to its lowest point in recent years,\" Mr Putin said, according to an NBC translation of excerpts of an interview broadcast on Friday.He praised former president Donald Trump and said Mr Biden, as a career politician, was \"radically different\" from Mr Trump, but also voiced hope that the new US leader will be less impulsive than his predecessor.\"It is my great hope that, yes, there are some advantages, some disadvantages, but there will not be any impulse-based movements on behalf of the sitting US President,\" he said.\"I believe that former US president Trump is an extraordinary individual, talented individual... He is a colourful individual. You may like him or not. But he didn't come from the US establishment,\" Mr Putin was quoted as saying.Mr Biden plans to raise a range of US complaints, including over purported interference in American elections and hacking by Russia, in the summit with Mr Putin, at the end of the new US President's first foreign trip.Mr Putin had openly admitted that in the 2016 vote he supported Mr Trump, who had voiced admiration for the Russian leader and notoriously, at their first summit, appeared to accept his denials of election interference.Asked about Mr Biden calling him a killer in an interview in March, Mr Putin said he had heard dozens of such accusations. \"This is not something I worry about in the least,\" Mr Putin said.He added that the term \"killer\" was part of \"macho behaviour\" common in Hollywood.Such discourse \"is part of US political culture where it's considered normal. By the way, not here, it is not considered normal here\", the Russian President said.Mr Biden, at the start of an eight-day visit to Europe this week, said: \"We're not seeking conflict with Russia.\"\"We want a stable and predictable relationship... but I've been clear: The United States will respond in a robust and meaningful way if the Russian government engages in harmful activities.\"Mr Putin was asked about several Russian dissidents whose deaths have been blamed on Moscow, including former KGB spy Alexander Litvinenko who was poisoned in 2006.The Russian leader dismissed the question as \"verbal indigestion\". He said some of those responsible for the deaths are in prison.On the issue of recent ransomware attacks that the US has traced to Russia, Mr Putin denied any knowledge of the hackings and called on Mr Biden to reach an agreement with him on cyberspace, NBC News said.Mr Putin also dismissed a report in The Washington Post last week that Russia was preparing to supply Iran with an advanced satellite that would enable it to track potential military targets across the Middle East.\"It's just fake news. At the very least, I don't know anything about this kind of thing,\" Mr Putin said, according to NBC News. \"It's just nonsense garbage.\"REUTERS, AGENCE FRANCE-PRESSEJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/putin-says-us-russia-relations-at-their-lowest-point-in-years", "Source": "google"}