{"Type": "World", "Time": "2021-06-14", "Headline": "Who is Naftali Bennett, Israel's incoming PM?", "Text": "JERUSALEM: Naftali Bennett, who was sworn in Sunday (Jun 13) asIsrael's new prime minister, embodies many of the contradictions that define the 73-year-old nation.He's a religious Jew who made millions in the mostly secular hi-tech sector; a champion of the settlement movement who lives in a Tel Aviv suburb; a former ally of Benjamin Netanyahu who has partnered with centrist and left-wing parties to end his 12-year rule.His ultranationalist Yamina party won just seven seats in the 120-member Knesset in March elections - the fourth such vote in two years. But by refusing to commit to Netanyahu or his opponents, Bennett positioned himself as kingmaker. Even after one member of his religious nationalist party abandoned him to protest the new coalition deal, he ended up with the crown.Here's a look at Israel's next leader:AN ULTRANATIONALIST WITH A MODERATE COALITIONBennett has long positioned himself to the right of Netanyahu. But he will be severely constrained by his unwieldy coalition, which has only a narrow majority in parliament and includes parties from the right, left and centre.He is opposed to Palestinian independence and strongly supports Jewish settlements in the occupied West Bank and east Jerusalem, which the Palestinians and much of the international community see as a major obstacle to peace.Bennett fiercely criticised Netanyahu after the prime minister agreed to slow settlement construction under pressure from President Barack Obama, who tried and failed to revive the peace process early in his first term.He briefly served as head of the West Bank settler’s council, Yesha, before entering the Knesset in 2013. Bennett later served as cabinet minister of diaspora affairs, education and defence in various Netanyahu-led governments.“He’s a right-wing leader, a security hard-liner, but at the same time very pragmatic,\" said Yohanan Plesner, head of the Israel Democracy Institute, who has known Bennett for decades and served with him in the military.He expects Bennett to engage with other factions to find a “common denominator” as he seeks support and legitimacy as a national leader.RIVALRY WITH NETANYAHUThe 49-year-old father of four shares Netanyahu's hawkish approach to the Middle East conflict, but the two have had tense relations over the years.Bennett served as Netanyahu's chief of staff for two years, but they parted ways after a mysterious falling out that Israeli media linked to Netanyahu’s wife, Sara, who wields great influence over her husband's inner circle.Bennett campaigned as a right-wing stalwart ahead of the March elections and signed a pledge on national TV saying he would never allow Yair Lapid, a centrist and Netanyahu's main rival, to become prime minister.But when it became clear Netanyahu was unable to form a ruling coalition, that's exactly what Bennett did, agreeing to serve as prime minister for two years before handing power to Lapid, the architect of the new coalition.Netanyahu's supporters have branded Bennett a traitor, saying he defrauded voters. Bennett has defended his decision as a pragmatic move aimed at unifying the country and avoiding a fifth round of elections.A GENERATIONAL SHIFTBennett, a modern Orthodox Jew, will be Israel's first prime minister who regularly wears a kippa, the skullcap worn by observant Jews. He lives in the upscale Tel Aviv suburb of Raanana, rather than the settlements he champions.Bennett began life with his American-born parents in Haifa, then bounced with his family between North America and Israel, military service, law school and the private sector. Throughout, he’s curated a persona that’s at once modern, religious and nationalist.After serving in the elite Sayeret Matkal commando unit, Bennett went to law school at Hebrew University. In 1999, he co-founded Cyota, an anti-fraud software company that was sold in 2005 to US-based RSA Security for US$145 million.Bennett has said the bitter experience of Israel’s 2006 war against the Lebanese militant group Hezbollah drove him to politics. The monthlong war ended inconclusively, and Israel’s military and political leadership at the time was widely criticised as bungling the campaign.Bennett represents a third generation of Israeli leaders, after the founders of the state and Netanyahu's generation, which came of age during the country's tense early years marked by repeated wars with Arab states.“He's Israel 3.0,” Anshel Pfeffer, a columnist for Israel's left-leaning Haaretz newspaper, wrote in a recent profile of Bennett.“A Jewish nationalist but not really dogmatic. A bit religious, but certainly not devout. A military man who prefers the comforts of civilian urban life and a high-tech entrepreneur who isn’t looking to make any more millions. A supporter of the Greater Land of Israel but not a settler. And he may well not be a lifelong politician either.”It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "news and politics,Jew,Naftali Bennett,Israel", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/who-is-naftali-bennett-israel-s-incoming-pm-15008514", "Source": "google"}