{"Type": "", "Time": "2021-06-14", "Headline": "Djokovic makes history with 19th Grand Slam title in French Open final - CGTN", "Text": " Share CopiedNovak Djokovic of Serbia kisses the trophy after winning the French Open final against Stefanos Tsitsipas of Greece in Paris, France, June 13, 2021. /CFPNovak Djokovic of Serbia claimed a 19th Grand Slam title and became the first man in 52 years to win all four majors twice when he came from two sets down to beat Stefanos Tsitsipas of Greece in a gripping French Open final on Sunday.The world No. 1 triumphed 6-7 (6/8), 2-6, 6-3, 6-2, 6-4 over the 22-year-old Greek who was playing in his first Slam final.Djokovic is now just one major away from equaling the all-time record of 20, jointly held by Roger Federer of Switzerland and Rafael Nadal of Spain.It was a second French Open crown for Djokovic after his 2016 victory, adding to his nine Australian Opens, five Wimbledon titles and three at the U.S. Open.Stefanos Tsitsipas of Greece reacts during the French Open men's final in Paris, France, June 13, 2021. /CFPThe 34-year-old is the first man since Rod Laver of Australia in 1969 to win all four Slams on multiple occasions and just the third in history.He is also the first man ever to win a Slam title by twice coming back from two sets down in same the tournament.Djokovic now has 84 career titles in total while Sunday's win pushed him to the brink of $150 million in prize money.\"It was an electric atmosphere,\" said Djokovic after the four-hour 11-minute final.\"It's a dream. It's difficult to win the title against a great player. It was difficult in three days physically and mentally.\" Djokovic had also spent more than four hours on court on Friday to knock out defending champion Nadal.Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3", "Section": "", "Writers": "", "URL": "https://news.cgtn.com/news/2021-06-14/Djokovic-makes-history-with-19th-Grand-Slam-title-in-French-Open-final-114Ss1r7C8w/index.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}