{"Type": "", "Time": "2021-06-14", "Headline": "A young fan never gave up on Novak Djokovic. His reward? A racket from his idol. - The Washington Post", "Text": "Novak Djokovic didn’t throw his racket to the sky after rallying for a five-set victory in the French Open final. He didn’t tuck it away as a cherished souvenir, either.Instead, Djokovic walked over to the Roland Garros stands and handed it to a youngster who was part coach, part fan and all heart during the match with Stefanos Tsitsipas. The boy was delirious with disbelief and joy, the moment one of those purely celebratory sports encounters between superstar and fan.Afterward, Djokovic explained that his gesture was a reward to a fan who had remained in his corner even when he lost the first two sets and appeared headed for defeat. He didn’t say it, but perhaps it was also Djokovic’s acknowledgment that he isn’t always a fan favorite.“I don’t know the boy, but he was in my ear the entire match, basically. Especially when I was two-sets-to-love down, he was encouraging me; he was actually giving me tactics as well,” Djokovic told reporters with a laugh. “He was like: ‘Hold your serve. Get an easy first ball and then dictate. Go to his backhand.’Novak Djokovic battles back in French Open final for 19th Grand Slam win“He was coaching me, literally, and I found that very cute and very nice. To give the racket to the best person — it was him — after the match, that was kind of my gratitude for him sticking with me and supporting me.”Djokovic secured his 19th Grand Slam win — and his second of 2021 — and will try at Wimbledon to tie the record of 20 held by Roger Federer and Rafael Nadal.Read more from The Post:Novak Djokovic outlasts Rafael Nadal in a French Open classic semifinalBarbora Krejcikova honors late coach and wins a French Open filled with twists and upsetsThe most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/sports/2021/06/13/young-fan-never-gave-up-novak-djokovic-his-reward-racket-his-idol/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}