{"Type": "", "Time": "2021-06-14", "Headline": "Two children infected with Covid in Victoria as authorities beg more people to get tested | Daily Mail Online", "Text": "By Brittany Chain For Daily Mail Australia   Published:  23:53 EDT, 13 June 2021   |  Updated:  23:57 EDT, 13 June 2021    12View  commentsThe two latest people to be infected with Covid in Victoria are children known to a previously recorded case. Victorian Health Minister Martin Foley said on Monday one of the children is linked to a household cluster in Reservoir while the other child is a close contact of the case in Melbourne that was picked up at the weekend.Both children have been quarantined during their entire infectious period so they pose no risk to the community, the Victorian Department of Health said. Mr Foley is yet to reveal the ages of each child.  'What these figures tell us, they continue to give us confidence that the system is working,' Mr Foley said. The two latest people to be infected with Covid in Victoria are children known to a previously recorded caseMr Foley also revealed contact tracers identified a link between two previously known cases. The case identified on Saturday lives in the same complex of 100 townhouses in Southbank where an aged care worker at Arcare Maidstone who tested positive to Covid also lives.Once the connection was established, contact tracers were able to contact other people in the building who may have been exposed to Covid to ask them to isolate while specialist nurses opened a pop up testing clinic out the front of the building on Monday.'Rather than wait for the community to come to the contact tracers and the testing facility, local public health took the view that they should go to them, and I think that is a good thing,' he said.Most of the residents will only be required to isolate until they receive a negative result, but there are a select amount of people in the complex who will be forced to undergo 14 days quarantine.  Victoria lifted many lockdown restrictions on Friday, but said the chances of all remaining measures being eased hinged largely on testing numbersVictorian Health Minister Martin Foley said on Monday one of the children is linked to a household cluster in Reservoir while the other child is a close contact of the case in Melbourne that was picked up at the weekendVictoria lifted many lockdown restrictions on Friday, but the chances of all remaining measures being eased hinged largely on testing numbers.The local authorities were concerned about the drop in numbers seeking Covid tests, with just 16,932 results received in the 24 hours to Monday. Ideally, government officials said upwards of of 20,000 per day were required for there to be a confidence the virus was not circulating undetected in the community. At the height of the latest outbreak, in excess of 50,000 people were turning out each day to get tested.Victoria's Covid-19 commander Jeroen Weimer said the sharp decline in those numbers was 'a little bit concerning' - days after urging Victorians to 'call out' people if they went out with the sniffles.  Melbourne's lockdown has ended - but overnight 19 new exposure sites were added to the Victorian Health website'While we're still dealing with new cases emerging, I would really encourage people to help us keep those testing numbers up,' he said.'That will give us a good feel that we're getting a good cross section of people coming forward.' There were 64 active cases of Covid in Victoria as of Monday morning, with just three people receiving hospital treatment and none in intensive care. The Victorian Health Department added six locations to the exposure list overnight which are listed as Tier Two exposure sites meaning anyone who visited must get tested and isolate until they receive a negative result.A confirmed positive case visited the McDonald's at Freshwater Place at Southbank in the CBD, between 5pm and 5.30pm on Friday, June 11. A popular McDonalds in the heart of Melbourne's Southbank has been forced to close after a customer infected with Covid dined in the restaurant last FridayThe person also went to Woolworths Melbourne Square on Hoff Boulevard, at Southbank, between 4pm and 5.30pm on Tuesday, June 8.The Medibank office on level seven of 720 Bourke Street, Docklands, was also visited between 7.45am and 4.15pm on May 18.The office building 4 Freshwater Place, Southbank, was also flagged as an exposure site, with the confirmed case visiting the site between 8.40am and 9.25am, and 4.35pm and 5.30pm on June 9.There are currently more than 130 venues on Melbourne's exposure list - down from 400 that were listed last week.Ideally, government officials are hoping to see testing numbers north of 20,000 each day to feel confident the virus is not circulating undetected in the community. Pictured: Australian swimmer Cate Campbell receives a Pfizer vaccineCovid fragments have also been detected in the sewage systems of a handful of suburbs, sparking concerns the virus could be in the region undetected.Wastewater in the northeastern suburbs of Balwyn North, Bulleen, Bundoora, Eaglemont, Heidelberg, Heidelberg Heights, Ivanhoe, Ivanhoe East, Kew East, Macleod, Rosanna, Viewbank, Watsonia and Yallambie are of particular concern.There are no confirmed cases in the areas, prompting fears there is an undiagnosed infectious case still in the community.Anybody who visited the areas between June 9 and 10 are urged to seek testing if they develop any Covid symptoms. \n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group", "Section": "", "Writers": "", "URL": "https://www.dailymail.co.uk/news/article-9683165/Two-children-infected-Covid-Victoria-authorities-beg-people-tested.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}