{"Type": "Sport", "Time": "2021-06-14", "Headline": "Tennis: Close but no cigar again for Tsitsipas, but he hopes for better days ahead", "Text": "PARIS: Stefanos Tsitsipas has learnt the hard way over the last two months that Novak Djokovic and Rafa Nadal will take some shifting from the top of the men's game.The Greek led world number one Djokovic by two sets in the French Open final on Sunday, but still ended up losing and it has become a familiar feeling to be so close and yet so far.Tsitsipas led Djokovic in the Rome Masters quarter-finals this year, but lost. He also pushed 13-time French Open champion Nadal to three tight sets in the Barcelona Open final, but again fell short.The 22-year-old, who was looking to become the first Greek player to win a Grand Slam title, is, however, confident that he is on the right path to break the dominance of the two players who have won 11 of the last 12 majors.\"I'm able to play for titles like this. Despite my loss today, I have faith in my game. I very much believe I can get to that point very soon,\" Tsitsipas told reporters after his 6-7(6) 2-6 6-3 6-2 6-4 defeat on court Philippe Chatrier.\"I was close today. Every opponent is difficult. There's a small difference between the player I played today and the ones from before.\"But I think with the same attitude and the same - if I don't downgrade myself, I see no reason for me not to be holding that trophy one day.\"On Sunday, he was left to wonder how Djokovic had turned his game around after losing the second set.\"What I learned today is that no matter what, in order for the match to be finished, you have to win three sets and not two. Two sets doesn't really mean anything. It's still one away from winning the entire match,\" said Tsitsipas.\"I don't think I changed much. I just kept the same pace. I kept the things that were working for me. But it ended up, I don't know, he left the court after two sets to love down, I don't know what happened there, but he came back to me like a different player suddenly.\"Djokovic took an off-court break after the loss of the second set and when he returned, the match was a different affair altogether.Asked if he felt that Djokovic was physically much better all of a sudden, Tsitsipas said: \"Felt physically, anticipation maybe, just movement on the court, everything felt much more fresh and much better than before.\"I don't know. I kind of felt like he could read my game a bit better suddenly. Good for him. He did well to get there.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Stefanos Tsitsipas,sports,Novak Djokovic", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/tennis-close-but-no-cigar-again-for-tsitsipas-but-he-hopes-for-15008738", "Source": "google"}