{"Type": "", "Time": "2021-06-14", "Headline": "Johnson defends G7 deal amid criticism of final communique | G7 | The Guardian", "Text": "Green campaigners and anti-poverty groups say Cornwall summit failed to address challenges facing the world Last modified on Sun 13 Jun 2021 18.59 EDTBoris Johnson has sought to defend the deal struck by G7 leaders at the Cornwall summit, as green groups and anti-poverty campaigners said the rich nations’ club had failed to match the scale of the challenges facing the world.The final communique contained no early timetable to eradicate coal-fired emissions, offered only 1bn extra coronavirus vaccines for the world’s poor over the next 12 months and made no new binding commitments to challenge China’s human rights abuses.Campaigners expressed profound disappointment at the failure to attach new cash to the communique’s aspirations to end the pandemic, “build back better” and tackle the climate emergency.Oxfam’s head of inequality policy, Max Lawson, said: “Never in the history of the G7 has there been a bigger gap between their actions and the needs of the world. We don’t need to wait for history to judge this summit a colossal failure, it is plain for all to see.”British officials said the task of a G7 summit was to set out a policy roadmap rather than make binding, detailed financial commitments, which are more likely to be made at the G20 or at the UN climate change summit in November.The former UK prime minister Gordon Brown said the G7’s 2021 summit would be remembered “only for a colossal failure to honour Boris Johnston’s promise to vaccinate the world, an unforgivable moral failure when Covid is destroying lives at the rate of one-third of a million every month”. He echoed the World Health Organization’s view that the G7 had needed to commit to distribute 11bn vaccines, and not just 1bn. He said he was also disappointed the group had not supported compulsory patent transfers to boost production in Africa.Johnson said at the close of the summit that he hoped it had lived up to the optimistic hopes and predictions. He knew “the world was looking to us to reject some of the selfishness and the nationalistic approaches that marred the initial early responses to the pandemic, and channel all our economic and scientific might into defeating Covid”, he said.He rejected Brown’s criticisms, saying the G7 had set a target to vaccinate the whole world by the end of the year. He said of the 1.5bn vaccines around the world, 500m were the result of the UK government’s deal with Oxford/AstraZeneca.The shadow foreign secretary, Lisa Nandy, said: “By every measure, the prime minister’s summit has come up short. No clear plan to vaccinate the world by the end of 2022. No ambitious commitments to place the world on the path to climate safety.“This should have been the summit that delivered health, environmental and economic security for people in Britain and across the world.“With less than six months until COP 26, the government must raise the ambition and work constructively with countries across the world to deliver for people in Britain and around the world.”Joe Biden said the US was back at the table, and that Washington might be able to find a further 1bn doses next year. Fighting pandemics “may be a constant project for a long time,” the US president said.The One campaign, however, said the WHO and other major multilateral bodies had set the G7 clear targets before the summit, which it had not met. The WHO called at the weekend for 70% of the global population to be vaccinated by time of the G7’s next summit in Germany next year. But One said the money would only “provide enough doses to vaccinate around 200 million people … by the end of the year. By the next G7 summit only 10.3% of the population in low and medium income countries would be vaccinated by this deal.”Johnson also came under attack over the climate crisis. Green groups said the G7 had agreed “to plan to make a plan”.Johnson said the G7 was committed to the net zero emissions target by 2050, and had made significant steps towards the pledge of $100bn a year in climate finance for developing countries first made at the Copenhagen summit.But Greenpeace UK’s executive director, John Sauven, said: “Despite the green soundbites, Boris Johnson has simply reheated old promises and peppered his plan with hypocrisy, rather than taking real action to tackle the climate and nature emergency.”The US was unable to secure a G7 consensus on China, but instead put out a separate statement on the use of forced labour in Xinjiang. The final communique made reference to keeping the Taiwan Strait open, the loss of democracy in Hong Kong and “called on China to respect human rights and fundamental freedoms, especially in relation to Xinjiang”. Some G7 leaders, notably Germany’s Angela Merkel, cautioned against alienating China at a time when Beijing’s help is needed to tackle climate change.Biden defended the commitments. “We are in a contest not with China per se but with autocrats around the world, and whether democracies can compete them in a rapidly changing world,” he said. He called for a further inquiry into the origins of the pandemic, saying “it is important to know if this is due to a trial that went awry in a laboratory. We have not had access to their laboratories.”Johnson said his official advice had been that it was unlikely the virus had spread from a leak in a Chinese lab, but that “anyone sensible would keep an open mind about it”. Asked about him being more ideologically in tune with Donald Trump than Biden, Johnson said there were ideological similarities between his plans to level up and the Democrat’s US infrastructure programme.The summit marked the return of in-person diplomacy after a near two-year hiatus and the departure of Trump’s chaotic style that effectively brought the G7 to a standstill.Merkel praised Biden, saying he had brought new momentum to the G7’s efforts to tackle global challenges.“It’s not like the world no longer has any problems because of the election of Joe Biden as US president,” she told reporters. “But we can work on solutions to those problems with new momentum. And I think it’s very good that we have become more concrete at this G7.”", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/world/2021/jun/13/johnsons-g7-after-all-the-hype-what-was-actually-achieved", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}