{"Type": "World", "Time": "2021-06-14", "Headline": "After G7, Biden says he's re-establishing US credibility", "Text": "NEWQUAY, England: US President Joe Biden on Sunday (Jun 13) said the United States had restored its presence on the world stage as he used his first overseas trip since taking office to connect with a new generation of leaders from some of the world’s most powerful countries and more closely unite allies on addressing the coronavirus pandemic and China’s trade and labour practices.As he wrapped three days of what he called “an extraordinarily collaborative and productive meeting” at the Group of Seven summit of wealthy democracies, Biden said there was “genuine enthusiasm” for his engagement.“America’s back in the business of leading the world alongside nations who share our most deeply held values,” Biden said at a news conference before leaving Cornwall to visit Queen Elizabeth II at Windsor Castle. “I think we’ve made progress in re-establishing American credibility among our closest friends.”The president, who is on an eight-day, three country trip, left his mark on the G7 by announcing a commitment to share500 million coronavirus vaccine doseswith the world and pressing allies to do the same. The leaders on Sunday confirmed their intent todonate more than 1 billion dosesto low-income countries in the next year.“This is going to be a constant project for a long time,” Biden said of the global vaccination campaign, adding that he hoped the world could stamp out the pandemic in 2022 or 2023. “It’s not just the right thing to do” from a moral standpoint, Biden said, but also the correct thing to do “in terms of our own health\".He also said the US might be able to donate an additional 1 billion vaccine doses to the world in the coming years.Biden also fought for the leaders' joint statement to include specific language criticising China's use of forced labour and other human rights abuses as he worked to cast the rivalry with Beijing as the defining competition for the 21st century.The president declined to discuss the private negotiations over the provision, but said he was “satisfied” with the tough rhetoric, though difference remained among the allies about how forcefully to call out Beijing.The leaders also embraced Biden's call for a 15 per cent global minimum corporate tax rate.The other G7 allies did their part in creating the impression that Biden was part of “the Club” and sought to help reinforce Biden’s “America is back” mantra, including by embracing the his campaign slogan to “Build Back Better” from the pandemic.Most European allies had been disenchanted with President Donald Trump’s grumbling of “global freeloaders” and espousing an “America First” policy, so Biden had the challenge of convincing a sceptical audience that the last US administration was not a harbinger of a more insular country.“We're totally on the same page,” British Prime Minister Boris Johnson said of Biden.Implicitly criticising his predecessor, who had said other countries should pay for the presence of America’s military presence abroad, Biden said he does not view NATO as a “protection racket\". Biden also reported that global leaders were gratified that the US president accepted the science of climate change.“One of the things some of my colleagues said to me when I was there was, ‘Well, the United States’ leadership recognises there is global warming,” Biden said.The president was ending his day Brussels for meetings with NATO and European Union leaders on Monday and Tuesday before his summit with Russian President Vladimir Putin on Wednesday in Geneva. US officials said that one-on-one meeting would test whether the two men could develop a constructive relationship even as Biden was poised to rebuke Putin for a range of rights abuses and election interference.Pressed at the news conference on why Putin has not changed his behavior after waves of US sanctions, Biden replied with a laugh. “He’s Vladimir Putin.”The summit marked some of Biden's first face-to-face meetings with global leaders since taking office in January amid the COVID-19 pandemic, including France’s Emmanuel Macron, with whom he was meeting for the first time.The 43-year-old Macron, who came into office in May 2017, months after Biden’s two terms as the US vice president ended, appeared to have quick chemistry with the 78-year-old American. The two draped their arms around each other and chatted animatedly when they walked together after the leaders' photo at the beginning of Friday’s summit.In remarks to reporters, Macron did not utter Trump’s name but offered an unambiguous shot at the former president. Macron noted his his relief that with Biden, he was now working with an American president “willing to cooperate.”“What you demonstrate is leadership is partnership,” Macron said of Biden.During Trump's term, Macron tried to find common ground but often bristled at Trump's nativist rhetoric.Macron, who has worked to portray France as a more prominent power in recent years, also used the rise of Trumpism to make the case for greater global European leadership.He complained in November 2019 that a lack of US leadership was causing the “brain death” of NATO, insisting in an interview with the Economist that the European Union must step up and start acting as a strategic world power. Biden, in his remarks, seemed to acknowledge Macron’s concerns, noting that Western Europe was providing “backbone and the support for NATO\".Biden administration officials said Biden hoped to leave the summit on Sunday with a communique that included language calling out China over forced labour of Muslims and ethnic minorities in western China.But as talks continued on Saturday, leaders said that differences remained. The leaders broadly agreed that greater coordination on China was necessary, according to an administration official who observed some of the talks and briefed reporters on the condition of anonymity. The official said it became evident that there was a “spectrum of how far different countries are willing to go\".Canada, the United Kingdom and France largely endorsed the Biden administration’s position, while Germany, Italy and European show hesitancy, according to the official. White House officials say Biden wants the G7 nations to speak with one voice on the China’s human rights abuse.“We need to be able to deal with China in all of those areas coming from a position of strength and coming from a united position.” US Secretary of State Anthony Blinken told CBS News’ Face the Nation on Sunday.“I think what the president was able to do in these last couple of days was bring countries closer together in dealing with some of the challenges posed by China.”During the summit, Biden also met with Italian Prime Minister Mario Draghi, Japanese Prime Minister Yoshihide Suga and President Cyril Ramaphosa of South Africa.At the news conference, Biden briefly confused Syria and Libya when he described the importance of providing humanitarian aid to countries torn apart by civil war. It was among a handful of verbal stumbles the president made.Biden then left on his way to Windsor Castle for a private audience with the queen - becoming the 13th president to have met with the 95-year-old monarch.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": ",,,,", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/after-g7-biden-says-he-s-reestablishing-us-credibility-15007400", "Source": "google"}