{"Type": "", "Time": "2021-06-14", "Headline": "Covid-19 cases in Jakarta surge 50 per cent in past week amid rise in Delta variant | The Star", "Text": "\n                    Monday, 14 Jun 2021\n                A man get his temperature and blood pressure readings taken before receiving the Sinovac vaccine against the Covid-19 coronavirus, during an immunisation session for bus drivers in Banda Aceh on June 11, 2021.  - AFPJAKARTA (The Straits Times/ANN): Jakarta governor Anies Baswedan has warned that the Indonesian capital may return to a strict restriction regime as coronavirus cases surged 50 per cent in the past week.Active cases in Jakarta rose to 17, 400 cases on Sunday (June 13) from 11, 500 on June 6.\"The capital is in a state that needs extra attention. If the current situation gets out of hand, we would enter an emergency phase, and if that happened, we would have to take drastic steps like we did in September and February. We do not want that to recur,\" Anies said in a statement on Monday morning.The Delta variant, first detected in India, has started to dominate cases in Indonesian cities including Jakarta and Kudus in Central Java province, a senior government official, who did not want to be named, told The Straits Times on Sunday night.Health Ministry spokesman Dr Siti Nadia Tarmizi told ST that the genome sequencing tests on 34 samples collected from Kudus showed that 28 of them were of the Delta variant. She did not elaborate.Bed occupancy rate for isolation wards reserved to treat Covid-19 patients also increased to 75 per cent on Sunday, from 45 per cent a week ago.One out of four Covid-19 patients in Jakarta, however comes from outside the city, mostly the surrounding satellite towns.Anies urged residents to strictly comply with health protocols in order to avoid another round of strict social distancing restrictions.Currently, dining-in in eateries are allowed with limited capacity and non-essential staff are partially required to work from home.The governor also stressed that the positivity rate - the percentage of people who are tested positive - in Jakarta increased to 17 per cent on Sunday, from 9 per cent the previous week.He also pointed out that the testing rate in Jakarta rose to eight times what the World Health Organisation recommended, from four times in the previous week.Anies ordered all his personnel on Sunday night to take stricter measures and step up enforcement of the health protocols on individuals as well as in places. - The Straits Times/Asia News Network \nTags / Keywords:\nIndonesia\n                                                                ,\n                                                                                                covid-19\n                                                                ,\n                                                                                                cases\n                                                                ,\n                                                                                                Delta\n                                                                ,\n                                                                                                variant\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\n", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/14/covid-19-cases-in-jakarta-surge-50-per-cent-in-past-week-amid-rise-in-delta-variant", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}