{"Type": "", "Time": "2021-06-14", "Headline": "157 suspected serious reactions to Covid-19 jabs reported out of nearly 3.7 million doses given in Singapore, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - There have been 157 reports here of suspected reactions to the Covid-19 vaccine severe enough to be life-threatening or result in hospitalisation, among other serious conditions.However, no deaths have been linked to the jab, the Health Sciences Authority (HSA) said on Friday (June 11).These \"suspected serious adverse events\" made up 0.004 per cent of the almost 3.7 million doses of Pfizer-BioNTech and Moderna jabs administered till May 23.These serious cases form part of the 4,704 \"suspected adverse events reports\" that HSA received till May 23.This translates into 0.13 per cent of administered doses, which is consistent with the percentage that had been reported by the authority on May 6, when it last gave an update on the safety record of both mRNA vaccines on May 6.These reactions are suspected to be associated with the vaccinations, but may not have been caused by them.An adverse event  or reaction related to vaccination is any undesirable medical condition that occurs after taking the vaccine, which does not necessarily have a direct link to the treatment. They may be coincidental or related to an undiagnosed disease, but have to be reported by healthcare providers to HSA.Reactions are considered serious if they result in hospitalisation, disability or life-threatening illnesses, among other things.Anaphylaxis, which is the rapid onset of severe allergic reactions, was the most frequently reported serious adverse event, with 26 such cases. All of them recovered after medical treatment, HSA said.It added that the incidence rate of anaphylaxis reported here with the Pfizer-BioNTech and Moderna vaccines is about 0.85 cases for every 100,000 doses of the jabs administered. \"This is similar to the incidence rates reported overseas of around 0.5 to two per 100,000 doses administered,\" said HSA.Other severe allergic reactions numbered 23. These include breathing difficulty, fast heart rate, an increase or decrease in blood pressure, chest discomfort and pain, fainting, limb numbness and weakness or pain, changes in vision, increase in liver enzymes, joint pain, fits, ringing in the ears and infections.The authority said most of those who had developed serious adverse events have recovered or are recovering. \"These serious adverse events are being closely monitored by HSA,\" it added.HSA said that the most commonly reported reactions are consistent with those typically observed following vaccination.From the 4,704 reactions, the most common one was cases of rash, which accounted for more than one in four reported adverse events. This was followed by cases of swelling of eyelids, face or lips, which occurred in about one in seven cases.These are typically resolved within a few days and are in line with the events described in the Covid-19 vaccines product information, as well as those reported overseas.Most of adverse events were associated with the Pfizer-BioNTech vaccine, which was rolled out for use here on Dec 30 last year and comprised 83 per cent of the doses administered. Moderna was deployed on March 12 this year.About 68 per cent of the total number of reactions reported was among people below the age of 60.HSA pointed out that trials of the Pfizer-BioNTech and Moderna vaccines found that those younger than 60 tend to experience more adverse effects occurring soon after vaccination, compared with those older.Generally, younger people have more active immune responses and may experience more adverse effects to the vaccines, said HSA. It pointed out that this is part of the body's natural response to build immunity against Covid-19 infection.The authority added that 64 per cent of these reactions were reported in females.Its update also noted that a greater frequency of heart attacks and strokes has not been observed in vaccinated persons locally.This comes after it was announced on Friday that six people have been reported to have suffered heart inflammation after receiving Covid-19 vaccines - four of whom were men aged below 30.As a precaution, experts have advised that vaccinated people, especially adolescents and younger men, should avoid strenuous physical activity for one week after their second dose.\"It is important to note that heart attacks and strokes can occur naturally within our population, regardless of whether people are vaccinated or not,\" said HSA.\"Due to the large numbers of people being vaccinated, it is expected that, by coincidence, some individuals may experience other medical events such as heart attacks and strokes in the days or weeks after vaccination which may not be related to the vaccination.\"HSA said it is monitoring the incidence of anaphylaxis and Bell's palsy, which are adverse events historically reported with vaccines.There have been 45 reported cases of Bell's palsy, which causes temporary weakness or paralysis of facial muscles. Most of the cases were not serious, HSA said, and patients will generally have completely recovery even without treatment.The incidence rate for this reaction in Singapore is estimated to be 3.35 per 100,000 persons per month. HSA said that this is within the background incidence of 1.1 to 4.4 per 100,000 persons per month before the introduction of vaccination.The authority said that it, along with the Ministry of Health, will continue to monitor the safety of Covid-19 vaccines closely and update the public on any significant safety concerns detected with the vaccines.Overall, the benefits of the Pfizer-BioNTech and Moderna vaccines continue to outweigh the known risks of Covid-19 disease and its severe complications in a pandemic, HSA added.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/157-serious-suspected-reactions-reported-out-of-nearly-37-million-doses-of-covid-19", "Source": "google"}