{"Type": "Singapore", "Time": "2021-06-14", "Headline": "2 new COVID-19 clusters, including Bukit Merah View market; 10 new community infections reported", "Text": "SINGAPORE: Singapore reported 10 new COVID-19 cases in the community as of noon on Sunday (Jun 13), including two unlinked infections.Eight were linked to previous cases, with five already in quarantine and three detected through surveillance, said the Ministry of Health (MOH).Two new clusters were identified, with one involving cases linked to Bukit Merah View Market and Food Centre.BUKIT MERAH VIEW MARKET CLUSTERFour of the linked community cases worked at 115 Bukit Merah View Market and Food Centre, which will be closed from Jun 13 to Jun 15 for deep cleaning and to \"break any potential chain of transmission\", said MOH.All staff and tenants who had been working at the market from May 25 were placed on quarantine, and will be tested during quarantine, said the ministry.There will also be special testing operations for staff who had been working at 116 Bukit Merah View from May 25.\"We will also extend free COVID-19 testing to members of the public who had visited the shops at 115 and 116 Bukit Merah View between May 25 and Jun 12,\" said MOH.All visitors to the two locations between those dates were advised to monitor their health closely and minimise social interactions as far as possible for 14 days from the date of their visit, said MOH.They should see a doctor immediately if they feel unwell, it added.All four cases were placed on quarantine earlier as they were identified as close contacts of Case 64132, a 74-year-old worker at a sundry store in the market who was confirmed to have COVID-19 on Jun 9.The new cases involved a 50-year-old Bangladeshi man who is a conservancy worker employed by Theng Liang Lee Services (Case 64187) and a 72-year-old Singaporean man working at a sundry shop (Case 64193).Two food stall vendors were also among the cases - a 67-year-old Singaporean woman (Case 64195) and a 65-year-old Singaporean man (Case 64196).Their infections were detected when they tested positive for COVID-19 during quarantine.All were asymptomatic, except for Case 64193. He developed a runny nose on Jun 13 while on quarantine, after his COVID-19 result came back positive.Cases 64193, 64195 and 64196 were fully vaccinated.MOH said it was investigating six cases of COVID-19 infection among individuals working at the market. They were the four new cases on Sunday, Case 64132 and Case 64158 - an 82 year-old Singaporean woman who regularly helped out at a sundry store there.\"Our epidemiological investigations have found that there is likely ongoing transmission among individuals who work at the location,\" said MOH.NEW CLUSTER LINKED TO ENGINEERAnother new cluster comprising an unlinked community case and two linked community cases was identified on Sunday.The unlinked case, Case 64184, was a 27-year-old Indian engineer working at Ecoxplore. He was tested for COVID-19 on Jun 10 as part of rostered routine testing. He developed fever that same day.The man's pooled test result came back positive on Jun 11, and an individual test confirmed his infection on Jun 12. His serology test was negative.The two linked community cases were his household contacts and detected through surveillance.One was a 19-year-old Singaporean teenager working as a warehouse assistant at DHL Express (Singapore).She developed a fever, sore throat, cough and runny nose on Jun 10 and sought medical treatment at a polyclinic on Jun 11, where she received an antigen rapid test (ART) and polymerase chain reaction (PCR) test.She was immediately isolated when her ART result came back positive, and her PCR test result also came back positive that same day. Her serology test result was negative.The other linked case was a 39-year-old woman employed by Cleen First Services as a cleaner at Emerald Park condominium.She developed a fever on Jun 11 and sought medical treatment at a polyclinic on Jun 12, where she was given an ART and a PCR test.Her ART result came back positive and she was immediately isolated. Her PCR test result came back positive that same day. Her serology test result was negative.UNLINKED CASE INVOLVING NURSING AIDEThe second unlinked community case was a 23-year-old Indian nursing aide working at All Saints Home (Hougang), a nursing home for the elderly.He was asymptomatic, and his infection was detected when he was tested for COVID-19 on Jun 11 as part of the nursing home's surveillance testing for staff members.His pooled test result came back positive on Jun 11. An individual test done that same day came back negative on Jun 11, but another done on Jun 12 came back positive.\"His Ct value was very high, which is indicative of a low viral load, and his serology test result is positive,\" said MOH.\"He is likely to be shedding minute fragments of the virus RNA from a past infection, which are no longer transmissible and infective to others, but we have taken all necessary public health actions.\"The nursing aide was fully vaccinated.REMAINING LINKED CASESA 59-year-old Singaporean woman working as a part-time cleaner at Crystal Lodge was reported as a linked community case. She was a close contact of Case 64135, apromoter at Guardian at ION Orchard.The new case was already placed on quarantine on Jun 11. She was asymptomatic, and her infection was detected when she was tested for COVID-19 on Jun 12 during quarantine, with the result coming back positive the next day. Her serology test result was pending.The other linked community case was detected through surveillance. The 66-year-old Singaporean retiree was a family member of Case 64183, alandscape gardener at AmozoniaLandscape.He developed a cough on Jun 11 and sought medical treatment at a general practitioner clinic on the same day, where he underwent both an ART and PCR test.His ART result was negative, but his PCR test result came back positive on Jun 12. His serology test result was pending.NEW LOCATIONS VISITED BY COMMUNITY CASESBukit Merah View Food Centre and Market, where the new cluster was identified, and Beo Crescent Market were on Sunday added to a list of public places visited by COVID-19 community cases during their infectious period.Mustafa Centre, Peninsula Plaza, an NTUC FairPrice supermarket at Havelock Road and a hair salon at Upper Serangoon Road were also listed.The full list of new locations is as follows:IMPORTED CASESThere were also three imported cases, who had been placed on stay-home notice upon arrival in Singapore.Two were permanent residents returning from India, and one was a foreign domestic worker who arrived from Indonesia.No new infections were reported in migrant workers' dormitories.In all, Singapore reported 13 new COVID-19 cases on Sunday.ONE STILL IN CRITICAL CONDITIONThirty-one more cases were discharged, bringing the total number of fully recovered to 61,869.There were 130 cases in hospital, with one in critical condition in the intensive care unit.A total of 243 were isolated and cared for at community facilities.Overall, the number of new cases in the community decreased from 116 cases in the week before to 36 cases in the past week.The number of unlinked cases in the community also decreased from 17 cases in the week before to 15 cases in the past week.Among the 80 confirmed cases reported from Jun 7 to Jun 13, 44 cases tested positive for their serology tests, 27 tested negative and nine serology test results were pending.PHASED EASING OF COVID-19 CURBS FROM JUN 14Singapore will move to Phase 3 (Heightened Alert)in two steps from Monday after a fall in the number of COVID-19 community cases, said MOH on Jun 10.The limit on group sizes for social gatherings will be increased from two to five people from Monday. Similarly, five distinct visitors per household daily will be allowed.More restrictions will be eased in the second step from Jun 21, when dining in can resume if the COVID-19 situation remains under control in the coming week.As of Sunday, Singapore has reported 62,276 COVID-19 cases and 34 fatalities.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "MOH,COVID-19,coronavirus", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/bukit-merah-market-covid-19-new-community-cases-singapore-jun-13-15004922", "Source": "google"}