{"Type": "", "Time": "2021-06-14", "Headline": "G-7 reaches consensus on China dumping, human rights abuses, says US official, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.CARBIS BAY, ENGLAND (REUTERS) - Group of Seven (G-7) leaders have reached consensus on the need for a shared approach to China selling exports at unfairly low prices and to human rights abuses, a senior official in the US President Joe Biden's administration said on Saturday (June 12).The official, speaking on condition of anonymity, said the leaders of the world's largest advanced economies had also agreed on the need to coordinate on supply chain resilience to ensure democracies are supporting each other.\"I would say there was unanimity in terms of a willingness to call out human rights abuses and violations of fundamental freedoms that invoke our shared values,\" the official said.\"There was commitment to take action in response to what we're seeing.\"The official said the G-7 had moved far from three years ago when the final communique made no mention of China.Under the legal structure of the World Trade Organisation, the designation of China as a \"non-market economy\" allows its trading partners, including the United States, to use a special framework to determine whether China's exports are being sold at unfairly low prices and, if that is found to be the case, to apply additional anti-dumping duties.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/g-7-reaches-consensus-on-china-dumping-human-rights-abuses-says-us-official", "Source": "google"}