{"Type": "", "Time": "2021-06-14", "Headline": "Singapore reports four cases of heart inflammation after second jab of mRNA Covid-19 vaccines | The Star", "Text": "\n                    Saturday, 12 Jun 2021\n                The Pfizer-BioNTech and Moderna Covid-19 vaccines both use mRNA technology. - Reuters\nSINGAPORE, June 12 (Bernama): Singapore has reported four cases of heart inflamation involving young men aged between 18 to 30 years after taking the second dose of mRNA Covid-19 vaccines.The republic's Expert Committee on Covid-19 Vaccination in a statement issue late Friday said most cases of \"myocarditis and pericarditis\" were reported to have occurred within a few days after receiving the second dose of the vaccine.\"However. all have recovered or have been discharged well from hospital,\" it said.Myocarditis and pericarditis are inflammatory conditions affecting the heart muscles and the outer lining of the heart respectively.However, the Committee said that while further studies and investigations were on-going, the currently available data suggests that there might be a \"very small risk\" of myocarditis and pericarditis after the second dose of an mRNA vaccine, particularly in young men.\"They occur more often in men compared to women. Patients with the condition show symptoms such as chest pain, shortness of breath or abnormal heartbeats.\"Most cases are mild, recover without the need for significant intervention and do not suffer any long-term effects, although very rarely, severe cases may result in damage to the heart muscles,\" it explained.As a precaution, the Committee recommended that vaccinated persons, in particular adolescents and younger men, should avoid strenuous physical activity for one week after their second dose.The Committee noted that it has been closely monitoring international reports on the situation and reviewed the currently available international and local data.\"Our assessment is that the benefits of receiving the mRNA Covid-19 vaccines, such as reduction in Covid-19 infections and severe complications even if infected, continue to outweigh the risks of vaccination,\" it said.It added that increased occurrences of myocarditis and pericarditis after the second dose of mRNA Covid-19 vaccinations have been observed overseas including in the United States (US), in adolescents and young men below the age of 25 years.\"The risk of this has been estimated to be 1.6 cases per 100, 000 doses for mRNA vaccines in the US, which is comparable to the risk of anaphylaxis observed in Singapore.\"To date, there is no observed incremental risk of myocarditis and pericarditis after the first dose of vaccine,\" it said. - Bernama\nTags / Keywords:\nCovid-19\n                                                                ,\n                                                                                                Singapore\n                                                                ,\n                                                                                                mRNA\n                                                                ,\n                                                                                                Vaccine\n                                                                ,\n                                                                                                Myocarditis\n                                                                ,\n                                                                                                Pericarditis\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\n", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/12/singapore-reports-four-cases-of-heart-inflammation-after-second-jab-of-mrna-covid-19-vaccines", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}