{"Type": "", "Time": "2021-06-14", "Headline": "[UPDATE] Tackling challenges faced by Covid-hit construction sector", "Text": "SINGAPORE (EDGEPROP) - Lego-style modular construction or prefabricated prefinished volumetric construction (PPVC) was intended to wean Singapore’s construction sector from its dependence on a foreign workforce. It is faster, more efficient and environmentally friendly compared to conventional construction. (See also: Covid-19 catalyses digitalisation in construction)However, even PPVC specialists have not been spared the ravages of the Covid pandemic. They have been just as affected by the travel ban on long-term pass holders from India and Bangladesh due to a surge in Covid infections. This immediately cut off the supply of construction workers from the two main source countries.The PPVC method does not require as many workers onsite compared to a conventional construction site. (Picture: Samuel Isaac Chua/The Edge Singapore)“Based on my experience, the construction industry is facing a 20%-30% shortage in foreign manpower, and the situation is aggravated by the tighter border controls,” says Khor Yew Chai, director (PPVC) at Dragages Singapore, a member of Bouygues Constrution, a global leader in the building sector.Under the PPVC method, frameworks and modules are built in a factory off-site. “We still need workers in these factories to produce the modules,” adds Khor. “The difference is that with PPVC, we do not require as many workers onsite compared to a conventional construction site.”Dragages’ modules are built in a factory located in Johor, Malaysia, before being transported to a factory in Singapore to be assembled. However, most of the construction materials are imported from overseas, especially China, notes Khor. “The rise in costs of sea transport and raw materials since last year is a challenge for contractors trying to complete their projects on schedule,” he adds.Lego-style assembly onsite. (Picture: Samuel Isaac Chua/The Edge Singapore)Dragages is not alone. Many of the precast components are manufactured in Malaysia, notes Tan Cheng Chuah, managing director of Construction Professionals and PM Link, two companies under CPG Corp, a professional development consultancy firm.Malaysia entered a 14-day Covid “total lockdown” with effect from June 1 to contain its daily infections. It has since been extended by another two weeks to June 28. “The initial Movement Control Order and the current Full Movement Control Order have impacted the completion timelines for ongoing projects in Singapore as precast factories in Malaysia have to stop production and deliveries,” continues Tan. “The result is that overall tender prices for construction projects have escalated by 20%-30% over the past year.”Productivity at construction sites has dropped due to the safe management measures (SMM) introduced as part of the Phase Two (Heightened Alert) measures put in place from May 16 to June 13.The government is aware of the manpower shortage and subsequent knock-on effects on ongoing infrastructure and development projects. In a speech at the OrangeTee Business Conference on May 24, the Minister for National Development, Desmond Lee, said: “[The tighter border controls] has significantly worsened manpower shortages in our construction sector, as South Asian countries are where we recruit and hire most of our construction work permit holders.”This is a double-blow for the construction industry, which had already been struggling with a manpower crunch since the start of the pandemic last year. “We have been cautious in reopening our borders and have also been careful in bringing in migrant workers, to reduce the risk of importing the virus,” adds Lee. “It’s a difficult trade-off.”The Minister for National Development, Desmond Lee, speaking at ​the OrangeTee Business Conference on May 24. (Picture: OrangeTee)Last year, the government introduced a $1.36 billion construction support package to help contractors bear part of the additional costs they had to incur due to construction delays and SMM.The government has stepped in with more support measures, including an additional 49-day extension for public-sector construction projects on top of the 122-day extension under the Covid-19 (Temporary Measures) Act, or Cotma, last year. Contractors who have been awarded contract sums of up to $100 million will receive 0.1% of the awarded contract sum for every month of delay as payment for non-manpower-related qualifying costs under Cotma.Foreign worker levy rebates for work permit holders will be increased from $90 per worker per month to $250 per worker per month, from May to December 2021.To alleviate the manpower crunch, the government will temporarily allow new construction work-permit holders from China to enter Singapore to work first and take their skills certification tests locally instead of in China.“Governmental support measures such as the Jobs Support Scheme helped to a certain extent as they covered about 15%-20% of manpower cost. In addition, the ex-gratia payment from the government for supporting material and equipment [purchases] also helped contractors,” says Chuck Kho, deputy CEO of CPG Consultants, which is part of CPG Corp.Kho: Some of CPG Consultants’ clients have preferred to delay tenders due to concerns over funding, cost escalations, labour shortage, and the prolonged environment of heightened risk and uncertainty. (Picture: CPG Corp.)A Cotma law has been amended to allow construction companies in Singapore to apply to the authorities for adjustments to contract sums so that project partners will more equitably share the burden of increased foreign manpower costs due to the Covid pandemic. “This is to ensure no single stakeholder group in the construction industry bears an undue share of the burden imposed by Covid-19,” said Minister Lee in Parliament on May 11.“The co-sharing mechanisms involve some documentation process and substantiation of the qualifying costs,” says Dragages’ Khor. “The catch is that all parties involved — contractors, including subcontractors and suppliers — must have the same objective of sharing the cost.”Dragages has six ongoing projects in Singapore, and is focused on completing four of them by the end of the year, for instance, the 613-unit condominium project, The Garden Residence; the 805-unit condominium, Park Colonial; and the Grade-A office development, CapitaSpring.Khor Yew Chai, director (PPVC) at Dragages Singapore, a member of Bouygues Constrution, a global leader in the building sector. PPVC specialists have not been spared the ravages of the Covid pandemic. (PictureL Dragages Singapore)Most ongoing construction projects in Singapore however, are facing delays of between six and 12 months, says CPG Consultants’ Kho. Further delays are likely, he cautions, “as overlapping problems cause a ripple effect across the industry”.For instance, some of CPG Consultants’ clients have preferred to delay tenders due to concerns over funding, cost escalations, labour shortage, and the prolonged environment of heightened risk and uncertainty, says Kho.For firms engaged in the built environment, the main cost component in project prolongation is inevitably manpower, notes Tan of Construction Professionals. Besides more measures on manpower cost-sharing, another way to alleviate the rise in manpower costs is for a more flexible procurement method to cushion the uncertainty due to Covid, he adds.Instead of an all-cost-inclusive construction tender or consultancy tender, for example, public agencies may consider including a provisional sum for costs that cannot be estimated or foreseeable in the short term, such as the costs of swab tests, prolongation costs, and the costs of implementation of mandatory SMM, Tan suggests.Tan: One option to solve the foreign worker crunch is to train a pool of local skilled workers to reduce the reliance on foreign labour. (Picture: CPG Corp.)The Covid-related construction delays is taking a toll on the finances of developers and contractors. “If these delays are prolonged, it is likely that some of the smaller developers may face serious cashflow issues,” warns Chia Ngiang Hong, president of the Real Estate Developers’ Association of Singapore (Redas).One issue that most, if not all, developers are concerned about is the additional buyer’s stamp duty (ABSD). Since the July 2018 property cooling measures, developers are subjected to a 30% ABSD, of which 5% is non-remittable.Developers were given a 12-month extension to the five-year project completion period last year, as part of Cotma. However, the ABSD period was only extended by six months, to 5.5 years.Most of the government assistance to the industry, including the reprieve to the completion deadline, was handed out close to the onset of the pandemic last year, says Redas’ Chia. “If developers continue to face the threat of having to pay heavy penalties with regard to the ABSD on land cost, they will likely adopt a more conservative attitude when negotiating with contractors,” he adds.An extension of the developers’ ABSD period will provide relief from “the time pressure” that developers and their contractors face, continues Chia.Most ongoing construction projects in Singapore are facing delays of between six and 12 months. Further delays are likely, as overlapping problems cause a ripple effect across the industry. (Picture: Samuel Isaac Chua/The Edge Singapore)“The reality is that there is no easy solution while most Singaporeans are not inclined to switch to manual labour professions, whether skilled or not,” says CPG Consultants’ Kho.Despite rapid technological advancements taking place in the construction sector, robotics and automation cannot completely displace workers — “at least not in the next 10 years”, says Construction Professionals’ Tan.One option to solve the foreign worker crunch is to train a pool of local skilled workers to reduce the reliance on foreign labour, adds Tan. Adequate training and remuneration should be sufficient to entice local skilled construction workers to enter and stay in the industry, he argues. “This should go hand in hand with the widespread adoption of PPVC technology and digitalisation as a long-term solution for Singapore’s built environment.”Check out the latest listings near The Garden Residence, Park ColonialSee Also:Singapore Property for Sale & Rent, Latest Property News, Advanced Analytics ToolsNew Launch Condo & Landed Property in Singapore (COMPLETE list & updates)Construction industry stakeholders call for safe and controlled entry of foreign workers[UPDATE] Capacity limits for visitors to project sales galleries, resale propertiesBiomimicry: When nature and tech work togetherEn Bloc Calculator, Find Out If Your Condo Will Be The Next en-blocHDB Resale Flats Up For Sale, Affordable Units AvailableDu Plessis collided with Quetta Gladiators team mate Mohammad Hasnain while trying to save a boundary in their 61-run defeat to Peshawar Zalmi.  The 36-year-old lay prone on the ground while the Gladiators physio attended him before he got up and was taken to hospital.  Have concussion with some memory loss but I will be fine.When Vladimir Putin meets Joe Biden for their first summit on Wednesday the Russian leader will not be looking for progress on arms control, the lifting of sanctions or even an apology for the US president saying he is a \"killer\".Wall Street legend Whitney Tilson says there's a huge new tech trend coming – and he's giving away his top pick for free right here.The man's a competitor.The U.S. debt ceiling comes into effect at the end of July, putting pressure on the Treasury to reduce its cash balance ahead of the deadline.  WHAT IS THE DEBT CEILING?  The debt ceiling is the maximum amount the U.S. government can borrow, as directed by Congress, to meet its financial obligations.A 60-year-old man was charged on Monday (14 June) for allegedly stabbing another man at the void deck of a Choa Chu Kang HDB block.Hiring the wrong financial advisor can wreak havoc on your investments and ruin your retirement. However, this new tool is changing everything.The U.S. debt ceiling comes into effect at the end of July, putting pressure on the Treasury to reduce its cash balance ahead of the deadline.  WHAT IS THE DEBT CEILING?  The debt ceiling is the maximum amount the U.S. government can borrow, as directed by Congress, to meet its financial obligations.Tesla suspended vehicle purchases using bitcoin citing increasing use of fossil fuels for its miningMarket launch of LAST® brand Paris, 14 June 2021: Global Bioenergies today launches its LAST brand, the first range of longwear make-up with over 90% natural ingredients: the range’s 18 mascara, eyebrow mascara and eye shadow products can now be obtained on www.colors-that-last.com. Instrumental tests and clinical studies demonstrate performance on a par with the best conventional products on the market: this is the first time a brand with over 90% natural ingredients has delivered such a perforThis small company behind it is sparking a potential 20,300% market surge. Click here for details.French cloud computing services provider OVHcloud re-committed on Monday to an initial public offering (IPO) on Euronext's Paris stock exchange but provided no timetable and no fundraising target.  The family-owned company had initially announced its plans in March, two days before a major blaze destroyed one of its data centres in eastern France - a disaster that had raised concerns about its capacity to go public.  Sales totalled 632 million euros in 2020, OVHcloud said, reflecting a growth of about 5% from a year earlier, according to a 2019 revenue figure given earlier to reporters.China on Monday accused the G7 of \"political manipulation\" after it criticised Beijing over its human rights record in Xinjiang and Hong Kong.Proceeds from the 10-piece collection, Free the Future, will support the Boys & Girls Club of Houston.Deemed \"The Mineral Of The Month\", and having recently been put on the USA's essential mineral list, here's something you may want to invest in....Tensions over Brexit threatened to overshadow the final day of the G7 Summit.London accused France on Sunday of offensive remarks that Northern Ireland was not part of the UK.The conflict relates to the Northern Ireland protocol in the Brexit deal signed by Prime Minister Boris Johnson.That protocol essentially kept the province in the EU's customs union to avoid a hard border between Ireland and Northern Ireland.But it also meant the need for trade checks across the Irish Sea to protect the integrity of the EU's single market.Something the UK government has resisted implementing.At his closing news conference, Johnson attempted to play down the row but reasserted his position.\"What I'm saying is that we will do whatever it takes to protect the territorial integrity of the UK. But actually what happened at this summit was that there was a colossal amount of work on subjects that had absolutely nothing to do with Brexit.\"During tense talks on Saturday, Johnson asked French President Emmanual Macron how he would feel if Toulouse sausage makers could not sell their products in Paris markets, echoing London's accusation that the EU is preventing sales of British chilled meats in Northern Ireland.British media reported that Macron responded by inaccurately saying Northern Ireland was not part of the United Kingdom.Later, Macron said he respected British sovereignty but that trade rules had to be honored.He called on the UK to implement what was collectively agreed months ago:\"What I have to say to Prime Minister Boris Johnson, I tell him and I tell you now: France has never allowed itself to question British sovereignty, the British territorial integrity and the respect of that sovereignty.\"Northern Ireland remains deeply split along sectarian lines.Many Catholic nationalists aspire to unification with Ireland while Protestant unionists want to stay in the UK.Unionists have been angered by the protocol which they say cuts them off from the rest of Britain.That anger spilled out into the streets in April, when Belfast saw some of its worst violence in years.CBI boss says world is ‘way off track’ in fight against climate changeTony Danker says UK government must publish detailed and concrete guidance on home heating and transport to unlock private resources Danker called for the government to put forward detailed plans on a charging network for electric vehicles, phasing out gas boilers, new offshore windfarms, and funding formulas for new nuclear power stations. Photograph: John Walton/PAMeatless Farm gives customers chance to put money where their mouth isYorkshire-based plant-burger and vegan sausage maker launches £5m crowdfunding drive A machine created by Meatless Farm dispenses free vegan sausage rolls to mark National Sausage Roll Day on 5 June. Photograph: David Parry/PABiggest stock market event in 20 years is almost here. And the next 2 months could decide your wealth in 2021. Here’s what to do now.Women working more hours in Covid crisis than first thought, study findsFull-time female employment in UK has actually risen over the crisis as average working hours slip less than men While working hours have fallen overall during the pandemic, average working hours among women without children reached a record high by the start of 2021. Photograph: Rex/ShutterstockOfqual wanted to scrap last year’s A-levels, says former chairRoger Taylor says England’s exam regulator backed down to government, leading to use of algorithms to award grades Taylor said Ofqual wanted to issue ‘non-qualification’ leaving certificates in place of A-levels when it became clear that socially distanced exams could not be safely taken. Photograph: Photofusion/UIG/Getty ImagesFour years after Louis Vuitton x Supreme, Kim Jones is again breaking new ground by partnering with Chitose Abe on the capsule collection.If you pay more than $99/month for power and own a home in Texas, you better read this.Motorway, is a UK startup that allows professional car dealers to bid in an auction for privately-owned cars for sale.  It’s now raised £48m / $67.7m in a Series B round led by Index Ventures, along with new investors BMW i Ventures and Unbound.  Existing investors Latitude and Marchmont Ventures also participated.Vacheron Constantin is opening a 4,500-square-foot flagship on 57th Street in New York.Rishi Sunak’s billionaire in-laws hit with £5.5m bill in Amazon India tax disputeNews follows disclosure of competition case brought by small traders against US tech giant and family-run Indian joint venture Cloudtail A worker sorts delivery packages in a van at an Amazon facility in Ahmedabad, India. Photograph: Amit Dave/Reuters", "Section": "", "Writers": "", "URL": "https://sg.finance.yahoo.com/news/tackling-challenges-faced-covid-hit-220005633.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}