{"Type": "Sport", "Time": "2021-06-14", "Headline": "Tennis: Calendar Grand Slam possible this year, says Djokovic", "Text": "PARIS: For the second time in six years Novak Djokovic is halfway to a calendar year sweep of all four Grand Slam titles after winning the French Open for a second time on Sunday.The 34-year-old dug deep into his reserves of resilience to hit back from two sets down against Greece's Stefanos Tsitsipas to win 6-7(6) 2-6 6-3 6-2 6-4 and increase his Grand Slam tally to 19.That takes him only one behind the men's record 20 held by Rafa Nadal and Roger Federer and there is nothing to suggest the world number one will not surpass his two career rivals.He can already claim something neither of those two can, after his win over the 22-year-old Tsitsipas made him the first player in the professional era to win each of the four Grand Slams at least twice.Having already claimed the Australian Open this year, he has a shot at becoming the first man to win all four majors in the same year since Rod Laver in 1969 and he could even complete a 'Golden Slam' by adding the Olympic title in Tokyo.\"Everything is possible,\" Djokovic told reporters.\"I've achieved some things that a lot of people thought it would be not possible for me to achieve. Everything is possible, and I did put myself in a good position to go for the Golden Slam. But, you know, I was in this position in 2016 as well.\"It ended up in a third-round loss in Wimbledon.\"Wimbledon returns later this month after last year's tournament was cancelled because of the pandemic.Djokovic won it in 2019 and will be the favourite to add a sixth title on the grass, after which he will turn his thoughts to the Olympic Games and the US Open.\"Obviously I will enjoy this win and then think about Wimbledon in a few days' time. I don't have an issue to say that I'm going for the title in Wimbledon,\" he said.\"Of course I am. I won in '18 and '19 there. Hopefully I can keep that run going.\"As far as chasing down Federer and Nadal, Djokovic said he has always considered it a possibility despite the fact that when he won his second Grand Slam title at the 2011 Australian Open, Nadal had nine and Federer was on 16.\"I never thought it was a mission impossible to reach the Grand Slams of these guys,\" Djokovic said. \"I mean, I'm not there, but it's one less. But they are still playing.\"Obviously they're playing great, especially Rafa with his level. We all have still opportunities at Wimbledon, all the other slams. I'll keep on going. I'll keep on chasing. At the same time I'll keep on paving my own path.\"His long-time coach Marian Vajda joked after Sunday's comeback win that he and Goran Ivanisevic, who is also part of the team, would retire if Djokovic won the calendar Slam.\"I think it is possible, much more possible. He loves to play in Wimbledon and U.S. Open,\" he told reporters. \"As much as Novak is healthy, and he's healthy right now, he's in great shape, I think he has ability to win the Grand Slam for this year. I'm pretty sure.\"It did not look likely when Djokovic trailed by two sets against an inspired Tsitsipas on Sunday - the effort of beating Nadal in a seismic semi-final appearing to catch up on him.But Djokovic said some words of wisdom from a young fan helped him out.\"I don't know the boy. He was in my ear the entire match basically, especially when I was two sets to love down. He was encouraging me. He was actually giving me tactics,\" Djokovic, who presented the excited fan with his racket at the end, said.\"He was like, 'hold your serve, get an easy first ball, then dictate, go to his backhand'. He was coaching me literally. I found that very cute, very nice.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Wimbledon,sports,Novak Djokovic,Rafa Nadal,win,Grand Slam", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/tennis-calendar-grand-slam-possible-this-year--says-djokovic-15009144", "Source": "google"}