{"Type": "", "Time": "2021-06-14", "Headline": "Lian Beng's Ong family makes 50 cents per share mandatory cash offer following married deal, Companies & Markets News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE (THE BUSINESS TIMES) The Ong family controlling the Lian Beng civil engineering and construction group on Monday (June 14) announced a mandatory conditional cash offer at 50 cents per share, following a married deal.The family had, through its investment holding company Ong Sek Chong & Sons, acquired nearly 5.9 million shares, or about 1.2 per cent of the total number of issued and paid-up ordinary shares issued by Lian Beng Group.Prior to the market acquisition, Ong Sek Chong & Sons and its concert parties held about 43.6 per cent of voting rights in Lian Beng.With its recent acquisition of more than 1 per cent of shares in Lian Beng, it was required to extend a mandatory offer.The offer price represents a premium on the last traded price of 47 cents last Friday, the last trading day, the announcement said.On Monday morning, shares of Lian Beng were trading at 48.5 cents, up 3.2 per cent or 1.5 cents, before the group called for a trading halt pending the release of the announcement.Ong Sek Chong & Sons has an issued and paid-up share capital of $100,000 comprising 100,000 ordinary shares, of which 40 per cent are held by Mr Ong Pang Aik, chairman and managing director of Lian Beng; 36 per cent by executive director Ong Lay Huan ; 12 per cent by Ms Ong Lay Koon, another executive director at Lian Beng; and the remaining 12 per cent by Ms Ong Lee Yap.The former three shareholders, along with Mr Ong Phang Hui and Mr Ong Phang Hoo, sit on Ong Sek Chong & Sons' board of directors.The trading volume of Lian Beng's shares has been generally low, the announcement said, with an average daily trading volume of 241,529 shares, or 0.05 per cent of total issued shares, in the one-month period up to and including the last full trading day prior to the announcement.The Ongs intend to maintain Lian Beng's listing status and do not intend to exercise any rights of compulsory acquisition.Ong Sek Chong & Sons has confirmed with the Securities Industry Council of Singapore that it will not be required to make an offer for SLB Development, of which Lian Beng owns some 708.1 million, or about 77.6 per cent, of issued and paid-up ordinary shares.It will not be making an offer for SLB Development in connection with the offer, which, if it becomes unconditional, will result in Ong Sek Chong & Sons acquiring statutory control and indirectly acquiring effective control of SLB Development.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/companies-markets/lian-bengs-ong-family-makes-50-cents-per-share-mandatory-cash-offer", "Source": "google"}