{"Type": "", "Time": "2021-06-14", "Headline": "Watch: Park Bo Young Jokes Around With Seo In Guk’s Cake Behind The Scenes Of “Doom At Your Service” | Soompi", "Text": "tvN’s “Doom at Your Service” has released another look at what goes on behind the scenes of the drama!“Doom at Your Service” is a fantasy romance drama about a character named Myul Mang (Seo In Guk), who causes everything he touches to vanish, and a woman named Tak Dong Kyung (Park Bo Young), who puts her life on the line to avoid her fate. After going through life without any grand goals, Tak Dong Kyung suddenly receives the diagnosis that she only has 100 days to live. She calls for doom (myulmang) of the entire world, but instead is found by Myul Mang.The video kicks off to a running start as Park Bo Young and Woo Hee Jin race around the corner, with Woo Hee Jin complimenting Park Bo Young on her running ability as they walk back around the set. Later on, Park Bo Young comments in amazement, “When you’re cold, you should run. It’s less cold.”Next, Park Bo Young practices hiding behind Seo In Guk, who suggests that she move him around even more since she’s using him as a shield. Everyone laughs when Park Bo Young obliges, shaking him back and forth. The staff even remarks to Seo In Guk, “You look like a balloon man.”Moving on to a different set, Park Bo Young learns how to use a camera to take pictures for her scene. Afterwards, she proudly shows her photos to the making-of camera. She then takes pictures of Seo In Guk, but he notices that his right side isn’t in the shot. Park Bo Young teasingly explains, “Only nice people can see it.”The cast members then move to the rooftop, where they get ready for a barbecue party. Park Bo Young asks SF9‘s Dawon to do a good job cooking it, to which he replies that he’s doing a great job. She then comments, “It was really delicious,” which makes Dawon turn his head in surprise as he asks, “You ate some?” While Park Bo Young gives her explanation, Dawon takes a bite of his own, and Park Bo Young jokingly tells him to take care of his older sister, since he plays her character’s younger brother in the drama. Dawon humorously explains, “I cut some up for you to eat. Also, I don’t take care of my real sister.”Seo In Guk, who was sitting in between the pair the entire time, mentions that he already secretly ate some meat as well. His story grows even more hilarious when he explains that he had to stop chewing to hide the food in his mouth when the director came close.When the cameras begin rolling, Dawon opens up a bottle of soju and takes a realistic swig, only later realizing that the content of the bottle was indeed alcohol. As Park Bo Young laughs at his mistake, Dawon exclaims, “I had no idea it was real. When I was opening it too, it was closed so tightly, but I thought ‘No, it can’t be,’ so I drank it.” The director then tells Dawon that he tried to send messages with his eyes to tell him not to drink it. Seo In Guk adds, “I was looking down here, but suddenly the smell of alcohol wafted over. It was so funny.”Next, Seo In Guk and Park Bo Young sit facing each other with a cake in between them as the director reads off the directions in the script. Seo In Guk laughs as he says, “It’s begun,” to which Park Bo Young just nods in silence. When she holds up the cake for Seo In Guk, he suddenly begins saying he’s scared that his hair will burn, which makes Park Bo Young act like she’s in a horror movie as she chillingly says, “I prepared this for you. Hurry up and blow it out.”The director gets in on the comedic action as he gives Park Bo Young the instruction to throw the cake at Seo In Guk’s face after he blows out the candle. Park Bo Young appears ready to carry out his orders, but Seo In Guk jokes, “Is today the last episode? Is this the last day of filming?”Later, when prodded to say what gift he’d like to receive from Park Bo Young’s character, Seo In Guk pretends to be camera-shy in order to avoid giving her an answer. Park Bo Young refuses to give up, however, and suggests that he write down the gift he wants on a piece of paper. She adds, “It can’t be long. Write it simply. Then fold it up and give it to me today. You can’t tomorrow.”Watch the full making-of video below!“Doom at Your Service” airs every Monday and Tuesday at 9 p.m. KST.Watch the drama with English subtitles below! Watch Now ", "Section": "", "Writers": "", "URL": "https://www.soompi.com/article/1474425wpp/watch-park-bo-young-jokes-around-with-seo-in-guks-cake-behind-the-scenes-of-doom-at-your-service", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}