{"Type": "", "Time": "2021-06-14", "Headline": "Students to gradually return to school from 28 June: MOE", "Text": "SINGAPORE — Students will be progressively brought back to school following the June school holidays, with all levels expected to return from 6 July, said the Ministry of Education (MOE) on Monday (14 June).Institutes of Higher Learning (IHLs) will also gradually increase the number of students allowed back on campus for face-to-face learning, said the ministry in a media release. From 28 June, students from Primary 4 to 6 and Secondary 3 to 5, along with all students from junior colleges as well as the Millennia Institute, will return to school. Secondary 1 and 2 students will be on Home-Based Learning (HBL) until 30 June and will return to school on 1 July. Primary 1 to 3 students will be on HBL for the first week of the new term, during which schools will continue to provide instructions and support for students to access online and hardcopy HBL materials.As 5 July is the Youth Day school holiday, all levels of students will return to school the following day.Graduating students taking centre-based classes – for subjects such as third languages, art and music programmes – will resume in-person lessons from Week 1 of Term 3, while non-graduating students will continue with HBL. All students taking centre-based classes will return for in-person lessons from Week 2 of Term 3.To help with care arrangements, MOE kindergartens and school-based Student Care Centres will also resume full operation from 28 June. For Special Education school students, their return to school will be staggered from 28 June based on students' needs, with all students expected to be back at school from 6 July.MOE also plans to resume in-person co-curricular activities (CCAs) from Week 2 of Term 3, starting with low-risk activities. \"Given the need to minimise intermingling of students from different schools in line with the gradual resumption of student activities, the National School Games for Junior and C Divisions as well as the remaining games for A Division will be cancelled,\" the ministry added.For IHLs, small-group classes or consultations that were previously held online will be allowed to resume from 21 June. Students will continue to return for essential in-person sessions such as labs and practicals, while in-person examinations will also continue to be held with no more than 50 persons per venue.Classes and lectures with more than 50 persons will continue to be held online. All schools and IHLs will also ensure that the appropriate safe management measures are in place for the students' return.\"Students should have their TraceTogether token or app with them throughout the school day to facilitate accurate contact tracing, should the need arise,\" said MOE.All tuition and enrichment classes for students aged 18 and below will also be allowed to resume in-person lessons from 21 June. Sports, along with arts and culture classes can take reference from SportSG and the National Arts Council's latest guidelines, said the ministry.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:Of 25 new COVID cases in Singapore, 19 local including 1 dorm residentCOVID: Social gathering size can increase to 5 per group from 14 June – MTFCOVID: Dine-in at F&B places can resume at max 5 per group from 21 JuneWork-from-home remains default arrangement in Singapore's Phase 3 (HA)4 COVID ART test kits on sale at 3 Singapore pharmacies from 16 June: MTFWhen you want protection that goes beyond just covering your medical costs, critical illness insurance is the logical choice. But with so many options out there, which ones are best for you? We investigate in this article. In a nutshell, critical illness insurance is insurance […] The post Best Critical Illness Insurance Plans In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.The Philippines will extend a key military pact with the United States for another six months, its foreign minister said Monday, after months-long negotiations between the two countries.Search for private jet membership. The affordable price makes these private jet offers hard to resistThe Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.An American father-son duo accused of orchestrating former Nissan chief Carlos Ghosn's audacious escape from Japan admitted their role Monday as they made their first appearance before a Tokyo court.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Looking for travel insurance? Save more with these promo codes and discounts from insurers such as FWD, MSIG, AXA, and more! To find out if your travel insurance covers COVID-19, read this article for the latest updates. No matter your travel itinerary, travel insurance is […] The post Travel Insurance Promotions and Discounts appeared first on SingSaver Blog - We Compare, You Save.Certainly, The Apprentice: ONE Championship Edition lived up to its billing as the toughest iteration of the show yet. Sixteen global candidates were subjected to taxing physical tasks and high-stakes business competitions for the better part of the past three months that truly, the best of the best came through and ended with Jessica Ramella … Continue reading \"The Apprentice: ONE Championship Edition’s Success To Open More Doors, Says Chatri\"Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.If you own a computer, this smart USB stick is an absolute must have!Canberra MRT opened in November 2019, and in the immediate quarter after (Q1 2020), property prices in District 27 jumped by over 6% QoQ. Read about what Canberra has to offer, as well as BTO and Condo projects in the area.A French nuclear firm said Monday it was working to resolve a \"performance issue\" linked to a gas build-up at a plant it part-owns in southern China following a US media report of a potential leak there.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.Amazon.comPolynesian seafarers likely reached Antarctica hundreds of years before the Western explorers usually credited with discovering the frozen continent, a new study has concluded.Dubai earned a reputation for delivering luxury for those with cash to splash years ago, but amid the Covid-19 pandemic, a new mode of travel has become popular -- yachts.Ukrainian leader Volodymyr Zelensky Monday said US President Joe Biden should have met him before his high-profile summit with Russia's Vladimir Putin as they could resolve nothing on Ukraine without Kiev at the table.Sick of seeing others get rich in the stock market? Have you heard of Everlasting Stocks?China on Monday accused the G7 of \"political manipulation\" after it criticised Beijing over its human rights record in Xinjiang and Hong Kong.European and US stocks diverged on Monday as investors marked time ahead of a meeting of the Federal Reserve this week that may provide fresh clues about prospects for higher interest rates as inflation soars.High coverage, no-fuss application and early benefit payout makes this a great plan for those seeking cancer protection. As many as 1 in 4 Singaporeans could develop cancer in their lifetimes. Hence, getting a protection plan specifically for cancer may be a prudent move, especially […] The post FWD Cancer Insurance (Review): Fuss-free Plan That Pays Out At All Stages appeared first on SingSaver Blog - We Compare, You Save.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/students-gradually-return-school-28-june-moe-085012541.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}