{"Type": "Asia", "Time": "2021-06-14", "Headline": "IN FOCUS: How Johor’s residential property market has been hit hard by COVID-19", "Text": "The Johor skyline is now dotted with empty condominium units, due to an oversupply in the market and lack of foreign buyers.JOHOR BAHRU: When Singapore business owner Jonathan Gan purchased a four-room condominium at Lovell Country Garden in 2018, he thought he had clinched his dream retirement home.The freehold apartment located near Johor Bahru’s city centre was twice the size of his three-room HDB flat in Singapore, but the cost was only half of the latter when he bought it directly from the developers.“The best thing about the unit is the amazing view. You never get anything close to it at such value in Singapore,” added the 42-year-old, who lives with his wife and two daughters.The apartment, like most units in the Lovell development, overlooks the Straits of Johor. The balcony opens up to a picturesque sea view and there is a sandy beach below.“It was the ideal weekend home,” said Gan. “But now it’s becoming a bugbear.”Just three years after he purchased it, Gan, who bought the unit at around RM1 million (US$242,000), is having a hard time trying to sell it, even though the asking price is a fraction of what he paid for it.Since the COVID-19 pandemic hit last year, border closures between Singapore and Malaysia meant that he and his family could not visit his weekend home.Furthermore, Gan’s business in Singapore has been affected by the pandemic, and he now needs to sell the apartment to gain some liquidity.“All this was never part of the plan. But the house is just left there, collecting dust and its value is going down by the day. We felt it is better to cut our losses and try to get rid of it,” he told CNA.Despite being on the market for over a year, there have been no takers. He has engaged agents and even advertised the unit on various property portals but to no avail.“There is not much hope. Barely anyone has viewed or signalled interest,” he said.Gan is among property owners in Johor Bahru who are having issues trying to sell their properties, as the market is in the doldrums due to the prolonged effects of COVID-19.Condominium developments around Johor Bahru were built with foreign buyers in mind, but the pandemic has closed borders, leaving many of them empty. Units owned by those from China, Singapore, Hong Kong have been left unoccupiedwhile homes that were left unsold have stayed empty. Landed property is also facing potential depreciation.JOHOR'S OVERSUPPLY PROBLEMAccording to statistics compiled by property consultancy firm Henry Butcher, the value and volume of residential property transactions in Johor had been climbing “rather steadily” from 2017 until 2019.In its report on the outlook of the Malaysian property market in 2021, the firm noted that the volume of transactions rose 8 per cent in 2018 and 7.5 per cent in 2019, while the value of the transactions increased by 1.5 per cent in 2018 and 15.9 per cent in 2019.The report highlighted that the Movement Control Order (MCO) imposed by the Malaysian government from Mar 18, 2020, was a key reason that reversed the upward trend.It said that in the first nine months of 2020, the volume and value of transactions declined by almost a quarter compared to the same period in 2019.Property analyst Debbie Choy, who is director of Knight Frank Malaysia’s Johor branch, said the situation is particularly bad for condominiums and serviced apartments, of which there is an oversupply in the Iskandar region.“Many developments were targeting a large proportion of overseas buyers. With the prolonged effects of COVID-19 restricting movements, it has been challenging for developers or investors to offload either for sale or rent,” said Choy.The situation is exacerbated by the fact that foreigners are presently not allowed to purchase homes in Malaysia under the Malaysia My Second Home Program (MM2H) scheme, which has been temporarily suspended since July 2020.MM2H was suspended by the Ministry of Tourism, Arts and Culture (MOTAC) in line with the government's decision to bar foreigners from entering enter Malaysia following the outbreak of COVID-19.MOTAC added that the government is currently reviewing the MM2H programme, and that foreigners still interested to participate must abide by the latest requirements when it is reinstated.MM2H president Anthony Liew was quoted by local media last Sunday (Jun 6) saying that the suspension has curtailed interest from Singapore and China buyers in Johor property.“The three big Chinese developers, Country Garden Pacificview, R&F Development and Greenland Group, have seen the demand for their developments in Johor from Chinese buyers drop,” Loke reportedly said.Even owners of the more premium, newer developments in Johor Bahru are having problems trying to attract tenants.A Taiwanese woman, who wanted to be known only as K, told CNA that she has put up her 3-room condominium unit at The Astaka for rent, after she headed back home when the pandemic hit.The Astaka, a premium condominium located at Bukit Senyum in the heart of Johor Bahru, saw 70 per cent of its units snapped up by buyers when it was first launched in 2019.The two towers, standing at 65 and 70 storeys, have three- or four-room units of between 2,207 and 2,659 sq ft.However, after the pandemic hit, demand has dried up and owners who are not in Johor are not able to find interested tenants.K told CNA that she had purchased the unit in 2019, with the idea of renting it out for investment returns. However, after almost two years, no tenant has made a \"suitable offer\".She first listed her 3-room unit at RM5,700 a month. Fifteen months later, she has lowered the rental price to RM3,800 and there has not been a single offer from potential tenants. She purchased the unit for around RM2 million.“I think considering the circumstances, I have no choice but to lower the rental price. I notice that there have been no offers. I am patient. Hopefully, when the pandemic is over, there will be people who are interested,” said K.The demand from Johoreans has also weakened, as they reel from the effects of the pandemic.Khor Yu Leng, a political economist with consultancy firm Segi Enam Advisors, said that besides border closures restricting foreign buyers or tenants, locals are also grappling with the economic impact of COVID-19 and their disposable income has been restricted.She noted that locals with more spending power were typically Johoreans who commuted daily to Singapore for work. However, with borders closed from daily commuting, this group is either out of work or is now based in Singapore.“The spending power of the former Johor daily commuters and Singapore residents who visited Johor weekly or otherwise has diminished or disappeared from the Johor economy,” said Khor.She noted that the impact on the Johor economy meant that some Johoreans have turned to the state government for financial assistance,and buying luxury condominium property is not realistic.“A year later, with Johor’s economic umbilical still cut off from Singapore, and Malaysia suffering a big wave of COVID-19, informal social support activities (to help the lower-income households) have been ongoing,\" added Khor.Even with the overall value and volume of transactions increasing prior to COVID-19, Khor noted there were signs that some condominium developments were struggling to sell their excess units.In its report, Henry Butcher Malaysia highlighted that Johor was the state with the highest proportion of unsold residential properties in the country, even before COVID-19.The report said that Johor contributes 19.5 per cent of “overhang” residential properties and a whopping 73.7 per cent of all overhang condominium apartments in the country in 2019.“Of these, approximately 34 per cent of the overhang service apartments/sohos are priced over RM1 million which were believed to have been designed specifically for foreign investors from Singapore and China,” the report said.LANDED HOMES ALSO AFFECTEDBesides condominiums and serviced apartments, those with landed properties in the southern state are also concerned about depreciating values.A Singaporean who wanted to be known only as Mustaqim, who owns a two-storey 4,000 sq ft terrace home at gated community Horizon Hills, has expressed concern that the value of his house is depreciating since he purchased it in July 2017.Horizon Hills is popular among foreign buyers, especially Singaporeans, as it is a mere 15-minute drive to Tuas Second Link. The development is also close to amenities such as the Sunway Iskandar township, which has hospitals, malls as well as prestigious international schools.Mustaqim bought the house as a retirement home rather than an investment, but admitted he was worried that based onrecent price trendsin the area, his home has lost some of its value.He bought his home a decade after the development was launched in 2017, for around RM1.8 million.“With COVID-19, some of my neighbours who are Singaporeans have decided to sell their homes for RM1.1 million to RM1.2 million. It is spoiling the market a bit but I can understand why with the borders closed,” said Mustaqim.“I am concerned that this downward trend will continue and my home’s value will be going lower and lower. I would be owning a depreciating asset,” he added.However, Mustaqim, who is currently in Singapore due to the borders being closed, is determined to wait out the pandemic.“The value will rise again post-pandemic,” said Mustaqim.Property agents in Johor have also seen their livelihoods hit with the lower volume and value of transactions during COVID-19.An agent who wanted to be quoted only as Brian, told CNA that he has been forced to take a second mortgage on his own home as the number of transactions has dried up since the pandemic.“Some months I barely make any transactions, so I’ve been looking around for another job to tide through over the next few months,” he said.The agent, who specialises in selling condominiums in the central Johor Bahru area, said that most developments have the same problem – too many units on sale with “almost zero” demand.\"Some months, we have to live with zero completed transactions. So, the situation is really bad for us,” added Brian.The tightening of restrictions during the ongoing nationwide MCO 3.0 meant that agents are not able to legally arrange physical viewings of homes for any interested buyers or tenants. With virtual viewings being the only permissible option, it becomes even harder to make a sale.CNA has approached the Johor chief minister's office, as well as the state housing and local government committee for comments on the state of the property market and whether measures will be taken to assist industry players.EMPTY HOMES SUSCEPTIBLE TO CRIMEAnother headache for owners whose properties have been left empty is their susceptibility to break-ins.Economist Khor said that properties that are not located within gated communities may be more vulnerable.Investors with properties in Johor but cannot be physically there are now confronting the practical problems of how to guard, maintain and have a house-sitter, she said.\"The reality of the prolonged border closure will surely crimp some future demand,\" she added.In September last year, it was reported that police had arrested two men for breaking into houses at Taman Bukit Indah, a suburb where foreigners have been known to invest in property.Johor police added that the pair had specifically targeted vacant homes whose owners were in Singapore due to the border restrictions.Rahmah Zainolabidin, a Singaporean who chose to remain in Johor Bahru during this pandemic, told CNA that she has been taking care of homes belonging to her family members who have chosen to return to the city-state.She told CNA how her sister’s home, a terrace house located in a non-gated community in Taman Bukit Indah, had been robbed in August 2020.“When I was walking towards the home from afar, I could see that something was wrong. The windows were pried open wide and the gate was ajar,” said the 65-year-old.“They broke the gate grilles and drilled into the safe, taking thousands of dollars in cash as well as jewellery,” she added.Rahmah said that her sister was considering selling the house, but she had to first set aside money to repair the damage inflicted.“It is sad because she already got robbed, but now she has to fork out more money to try to sell it off. And in this market, I’m convinced there will be little interest, especially with the number of robberies reported in the area,” Rahmah added.“Crime is a serious issue ... I don’t think people would consider buying homes in areas with high incidences of break-ins.”Charmaine Tay, a freelance agent who focuses on property deals in Johor Bahru and the Medini Iskandar Malaysia area, told CNA that houses located in areas with a high incidence of break-ins have seen a drop in value and demand.\"Many buyers are aware that landed homes are susceptible to break-ins in Johor, so they tend to look for those located within gated areas where there are security checks,\" said Tay.\"But for those houses outside gated communities, especially in areas like Taman Bukit Indah where robbery is common, they are harder to sell, and the value has depreciated faster recently,\" she addedBUYERS FROM OTHER STATES, OVERSEAS BARGAIN HUNTERS COULD SPARK RECOVERYThose interviewed by CNA said that there are two groups of buyers who could help pave the way towards recovery in the residential property sector.The first group is potential buyers from other states.Choy of Knight Frank predicted that domestic tourism will likely recover first. She noted how in the second half of 2020, the property market saw a slight rebound when movement restrictions were lifted domestically before another wave of infections hit in September.Choy said that many Malaysians who have been stuck in Kuala Lumpur would then take some \"leisure time off” and possibly buy or rent properties in the smaller cities.However, she warned that the high-rise residential sector in Johor would only see gradual and slow progress as the units, which are in abundant oversupply, are not priced right for locals.“Developers have since then restructured and re-looked at planning to target more local purchasers i.e. by reducing unit sizing and thus, the end pricing – this makes the prices more palatable for the local community,” said Choy.The return of foreign buyers may also provide some relief.Choy highlighted the reopening of borders will provide \"a more optimistic outlook with more certainty and flexibility on travel arrangements\", especially with the currently low prices.She noted that even as there will be bargain hunters from overseas, foreign buyers should note the Johor land administration has stated that there is a minimum threshold of RM1 million on residential homes for non-Malaysian citizens.With borders remaining shut in the short term, the situation seems especially bleak for those desperate to sell their homes like Gan, who cannot find a buyer despite lowering his asking price for his four-room apartment at Lovell Country Garden.“It’s a sticky situation. Although we had good times using it as a weekend home, ultimately buying it was a wrong decision we now regret,” he said.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Johor,COVID-19,property,economy", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/covid19-johor-selling-condo-property-market-malaysia-14964430", "Source": "google"}