{"Type": "", "Time": "2021-06-14", "Headline": "Stefanie Sun gets care package from Zoe Tay, Entertainment News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.In a show of support - literally - home-grown actress Zoe Tay recently sent care packages of bras and perfumes to singer Stefanie Sun and actress Sharon Au.But Tay denied that she was a brand ambassador for these products and said they were just small gifts for friends.Sun, 42, recently posted on Instagram Stories the package she received from Tay, who is known as local television's \"Big Sister\" (Ah Jie). Sun wrote: \"A sudden sweet surprise. Ah Jie, you really think highly (of my size) hor.\"Tay, 53, told Shin Min Daily News that she sent the gift to congratulate Sun, whom she has known for a long time, on her 21st year in show business.She also sent the care package to Au, who is currently serving a 21-day quarantine at a hotel in Orchard Road. She has returned from France, where she works as an investment director at a private equity firm, to visit her mother.Au, 45, also posted a photo of the care package on social media, writing: \"When I was a rookie in the industry and had to interview @zoetay10, she knew I was nervous and made extra effort to be affable and reassuring.\"Now I'm all grown up and she continues to care and encourage. That's why she is our Ah Jie forever.\"Tay reportedly caused a commotion in the hotel lobby when she delivered a meal for Au and was recognised despite her hat and face mask.She told Shin Min it was not pre-arranged and she simply happened to be near the hotel that day ordering takeaway food for her family and friends.She decided to order another set for Au to give her some comfort during her quarantine.Tay, who won the Best Actress award for her role in My Guardian Angels (2020) at the Star Awards in April, will reportedly make a guest appearance in the upcoming long-form drama The Heartland Hero.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/life/entertainment/stefanie-sun-gets-care-package-from-zoe-tay", "Source": "google"}