{"Type": "", "Time": "2021-06-14", "Headline": "Pandemic Turbocharges Aging Theme for Global Stock Investors - Bloomberg", "Text": "Photographer: Jason Alden/BloombergThe world’s emergence from the coronavirus pandemic is set to unleash a wave of spending by older consumers, with increasing opportunities for investors in aging-linked stocks.That’s the view of money managers who see huge pent-up demand from wealthy seniors for medical services and luxury goods. They also expect that the forced adoption of the internet by older people during lockdown will open up this demographic permanently to e-commerce companies and social networks.The number of people aged 65 and over is projected to double to more than 1.5 billion by 2050, greatly increasing their economic impact. The total spending power of the older population globally was about $8.4 trillion in 2020, according to World Data Lab. That’s expected to grow to $14 trillion over the next decade.“The pandemic has accelerated many of the issues related to aging populations and has highlighted the urgency of resolving them,” said Christopher Rossbach, chief investment officer at J. Stern & Co. “We think they will be significant drivers for growth and investment.”U.S., China are dominant markets for seniors' consumption \r\nSource: World Data LabNote:  Data is for middle and upper classes in 2011 purchasing power parityUnderpinning the thesis are global fertility rates that are forecast to keep falling as life expectancy rises, even as the virus takes a staggering human toll. China’s decision last month to allow three-child families may have only limited impact on the aging trend in the most populous country.Here are some key focuses of investors who argue that the aging theme will be even more important as economies move past the pandemic.From cancer screening to hip replacements and cataract surgery, countless medical procedures have been postponed since the virus took hold. As this changes, global health-care spending is projected to bounce back in 2021, rising 5.8% to $8.8 trillion, according to IHS Markit.Rossbach expects shares of medical device manufacturers to benefit and cited Thermo Fisher Scientific Inc., Medtronic Plc, Becton Dickinson & Co. and Alcon Inc.Shares of all four companies have underperformed the global stock benchmark so far this year, with U.S.-listed Becton Dickinson down 3% versus the MSCI AC World Index’s 11% gain.Mirabaud Asset Management Ltd. also likes Medtronic, as well as Edwards Lifesciences Corp. for exposure to the cardiovascular diseases sector, said global equities head Anu Narula.Hearing aids are another market hurt by fewer in-person consultations, with Morgan Stanley estimating sales will normalize this year, following a 15% decline in the market in 2020. Among businesses in this field, it has an overweight recommendation on Copenhagen-listed GN Store Nord A/S and equal-weight on Demant A/S, which have both surged this year.“The large contingent of developed countries that have universal health coverage is being joined by an increasing number of developing markets that are establishing and/or expanding universal health-care systems, especially in emerging Asian markets,” said Mirabaud’s Narula.As well as long-delayed holidays, the travel sector is poised to pick up with support from cashed-up seniors. “Older or richer people tend to want to visit relatives more,” said Sanjiv Bhatia, founder of Pembroke Emerging Markets.Read More: European Luxury Sizzles With Nasdaq-Beating Multiples Rossbach also has his eye on a rebound in luxury spending, with LVMH and liquor makers Pernod Ricard SA and Diageo Plc among his preferred reopening bets.“A general point is that as people age their purchasing power increases and they become more concerned with quality, not quantity, of their consumption,” he said.Insurers stand to benefit too, as a surge in unplanned early retirements since the emergence of Covid-19 raises awareness of unforeseen health and employment risks.Strategists at Credit Suisse Group AG expect growth potential for insurers, particularly in markets with relatively low penetration such as China.Juliana Hansveden, a fund manager at Nordea Asset Management, sees insurance, medical and the internet all coming together to create investment opportunities.She is expressing confidence in the theme with a bet on loss-making Ping An Healthcare & Technology Co., which is helping patients in China avoid long waiting time at hospitals by providing online medical consultations. It is also working with parent company Ping An Insurance Group Co. to bundle its health-care offering with insurance policies, she said.Read More: ‘New Normal’ on the Internet for Older AdultsJ. Stern’s Rossbach expects growth across the board for companies that can tap seniors and their new-found confidence online.“Think of all the parents and grandparents who have used social networks or video conferencing apps for the first time to stay in touch with their loved ones, or have bought their first products through e-commerce or ordered their groceries or meals through delivery services,” he said.— With assistance by Isolde MacDonogh", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-12/pandemic-turbocharges-aging-theme-for-global-equities-investors", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}