{"Type": "", "Time": "2021-06-14", "Headline": "Will Bennett outdo his former mentor Netanyahu? | Benjamin Netanyahu | Al Jazeera", "Text": "The outgoing Israeli prime minister and his supporters are already trying to undermine the new coalition government. Will it survive?The Netanyahu family is experienced in moving its belongings out of the official prime minister’s residence on Jerusalem’s Balfour Street. In 2016, Prime Minister Benjamin Netanyahu told a group of stunned settlers being evicted from their homes in the illegal West Bank outpost of Amona, “I understand what it means to lose a home. After the 1999 elections, with zero warning, me and my family were simply kicked out of the house on Balfour Street. Just like that, with all of our belongings, we were just thrown into the street. We had to go to the Sheraton Plaza Hotel, it felt terrible.”The Likud party won 19 Knesset seats in the 1999 elections, seven fewer than the Labor party, led by Ehud Barak. Barak’s government, just like the one sworn in on June 13, was a diverse coalition of parties, with Meretz on the left, the Hamerkaz party in the centre and the ultra-Orthodox parties on the right. The partnership lasted less than two years.What can that short-lived government teach us about the future of Israel’s new government led by Yamina party leader Naftali Bennett and Yesh Atid party head Yair Lapid? What are the prospects of their diverse coalition comprising parties from the conservative Jewish right, whose leaders are committed to the settlement enterprise, and lawmakers from the Meretz party that boycotts goods made in the settlements? Can the fierce women’s rights campaigner Merav Michaeli, chair of the Labor party, get along with conservative Interior Minister Ayelet Shaked who has pledged to deport asylum seekers and their families?The cards that Prime Minister Naftali Bennett is holding are far worse than those Barak was dealt in 1999. First of all, there has never been an Israeli prime minister, nor a leader of any democracy, whose party only won 6 percent of the vote (translated into seven seats in the 120-member Knesset, one of whom is opposed to the new government). Bennett is a default option, the best of three highly imperfect alternatives, the other two being the continued rule of Benjamin Netanyahu after 12 years in power, or a fifth round of elections widely expected to perpetuate the political deadlock. The new government, both its makeup and guidelines, is thus hardly the ideal choice of its left-wing or right-wing components.Bennett, as well as Yisrael Beitenu party leader Avigdor Lieberman and New Hope party chair Gideon Saar, would have felt more comfortable in the company of their former Likud party colleagues than seated alongside representatives of Labor, Meretz and the Palestinian Ra’am (United Arab List) parties. The common denominator of the new government is its disgust with Netanyahu’s personality and with his indictment on corruption charges.The centre-right partners of the new government are in tune with his ideology and with his foreign and defence policies. Presumably, if Netanyahu cedes his leadership of the Likud, or if his party colleagues muster the courage to unseat him, many in the new government would negotiate a partnership with the Likud.However, Netanyahu declared war on his successor even before he started packing and moving to the opposition benches. Netanyahu of 2021 is not the same young prime minister defeated 22 years ago who took time off from politics. This time, he enjoys the backing of hot-headed legions of supporters and an army of violent bots.In the government’s final days, with the ground burning under their feet, leaders of the ultra-Orthodox parties and their rabbis joined the chorus of incitement against Bennett. The language they adopted, and their threats of hell were reminiscent of the atmosphere that prevailed in the months prior to the November 1995 assassination of Prime Minister Yitzhak Rabin.One of the new government’s first challenges will be to douse these flames, restore trust in the country’s legal system, police and the media, and try to instil respect for pluralism.The architects of the strange Bennett-Lapid coalition were well aware that the opposition would identify cracks in its edifice and plant explosives to blow it up. These explosives include legislation on highly sensitive issues, such as the relationship between religion and state, the annexation of Palestinian territories, LGBTQ rights and the recognition of the progressive streams of Judaism challenging the monopoly of the ultra-Orthodox establishment.To defuse these time bombs, the coalition agreement perpetuates the status quo on each of these issues. However, Netanyahu has a new type of TNT at his disposal in the shape of arch-nationalist Knesset member Itamar Ben-Gvir and his Arab-hating coterie. Ben-Gvir was elected to the Knesset this year with Netanyahu’s support, and is exploiting his parliamentary immunity to violate the status quo at the most volatile venues – Jerusalem’s Muslim holy sites. Netanyahu can rely on Hamas and Islamic Jihad to respond to Ben-Gvir’s provocations.And what would Bennett do if rockets from Gaza are fired at Jerusalem in response to a visit by Jewish Knesset members to the Al-Aqsa Mosque/Temple Mount compound, sacred to both Jews and Muslims? Would the two Arab members of the new government, Islamist Ra’am Chair Mansour Abbas and Regional Cooperation Minister Issawi Frej of Meretz vote in favour of retaliation against Gaza and the killing of Palestinian civilians? And would Lieberman and Saar vote for restraint if Israelis are killed in a Hamas attack?And would the staunchly pro-settlement Bennett, respect a court ruling to demolish the 40 homes in the illegal West Bank outpost of Evyatar? How would he manoeuvre between pressure from the American administration to pursue diplomatic negotiations with the Palestinians on the two-state solution, his centre-left partners who support the establishment of a Palestinian state and his own strong statements against it, let alone the resentment of his partners from the right-wing parties?The negotiations on a new nuclear deal with Iran are yet another obstacle facing the new government, which will force it to adopt an extremely difficult decision. If he adheres to Netanyahu’s militant policy opposing the agreement, Bennett will place himself on a collision course with the Biden administration which will be in power throughout his two-year term. On the other hand, if the government agrees to go along with the Biden administration’s policy, Netanyahu is likely to launch a public campaign accusing the new government of “abandoning the Jewish people to a second Holocaust”.Throughout his long rule, Netanyahu was considered a magician walking on tightropes without a safety net. Bennett saw his performance up close when he served as his chief of staff when he was opposition leader between 2006 and 2008. To survive in power long enough to start fixing some of the damage Netanyahu has inflicted on Israeli society, Bennett will have to surpass his former master.The views expressed in this article are the author’s own and do not necessarily reflect Al Jazeera’s editorial stance.Follow Al Jazeera English:", "Section": "", "Writers": "", "URL": "https://www.aljazeera.com/opinions/2021/6/13/will-bennett-outdo-his-former-mentor-netanyahu", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}