{"Type": "Sport", "Time": "2021-06-14", "Headline": "Football: Fabrice Muamba, who collapsed with cardiac arrest in 2012, reflects on Eriksen situation", "Text": "LONDON: Fabrice Muamba has spoken about how watching Christian Eriksen receive life-saving treatment at Euro 2020 brought back emotional memories of his own cardiac arrest as a doctor warned the Dane was unlikely to play again.Eriksen received CPRas his distraught teammates formed a circle around him to shield the stricken player from the view of 16,000 stunned fans in Copenhagen on Saturday.The Finns won 1-0 thanks to a Joel Pohjanpalo header in their first-ever appearance in the European Championship but Eriksen's plight overshadowed the match.Muamba, the former Bolton midfielder who collapsed after suffering a cardiac arrest during a televised FA Cup game in 2012, tweeted \"Please God\" following the incident.\"To watch it from that distance and not knowing the expectation of what was going to happen -- it's scary,\" he told the BBC.\"It's credit to the medical staff that they've come in and they did an amazing job on Christian.\"Muamba said he was impressed by how Eriksen's teammates had surrounded him to \"protect the whole situation\".\"It just brought back emotion that you've literally put down there for a long time that you don't want to re-live,\" he said.\"To see it on the other side, when it happened I asked my missus 'how did you even cope knowing this has happened to me'?\"I'm hoping that things turn out to be OK for him. I really, really, really hope he comes through.\"CARDIOLOGIST WARNINGA sports cardiologist who previously worked with Eriksen at Tottenham said the midfielder, now at Inter Milan, was unlikely to play again.\"Clearly something went terribly wrong,\" Sanjay Sharma, professor of sports cardiology at St George's, University of London, told the Press Association agency.\"But they managed to get him back. The question is what happened? And why did it happen?\"This guy had normal tests all the way up to 2019 so how do you explain this cardiac arrest?\"Sharma, who chairs the Football Association's expert cardiac consensus group, said there were multiple reasons a cardiac arrest could have happened, such as high temperatures or an unidentified condition.But he said reports after the match that Eriksen, 29, was awake in hospital were \"a very good sign\".\"I'm very pleased,\" he said. \"The fact he's stable and awake, his outlook is going to be very good. I don't know whether he'll ever play football again.\"Without putting it too bluntly, he died today, albeit for a few minutes, but he did die and would the medical professional allow him to die again? The answer is no.\"Former Tottenham player and manager Glenn Hoddle, who suffered a cardiac arrest while working for TV in 2018, tweeted: \"Thank God Christian is OK. And to those who did the CPR, it's simple, you saved his life as I know so well.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "memory,medical health,Muamba Fabrice Muamba,Sanjay Sharma,Tottenham", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/football-fabrice-muamba-christian-eriksen-cardiac-euro2020-15005640", "Source": "google"}