{"Type": "", "Time": "2021-06-14", "Headline": "[UPDATE] Tackling challenges faced by Covid-hit construction sector", "Text": "SINGAPORE (EDGEPROP) - Lego-style modular construction or prefabricated prefinished volumetric construction (PPVC) was intended to wean Singapore’s construction sector from its dependence on a foreign workforce. It is faster, more efficient and environmentally friendly compared to conventional construction. (See also: Covid-19 catalyses digitalisation in construction)However, even PPVC specialists have not been spared the ravages of the Covid pandemic. They have been just as affected by the travel ban on long-term pass holders from India and Bangladesh due to a surge in Covid infections. This immediately cut off the supply of construction workers from the two main source countries.The PPVC method does not require as many workers onsite compared to a conventional construction site. (Picture: Samuel Isaac Chua/The Edge Singapore)“Based on my experience, the construction industry is facing a 20%-30% shortage in foreign manpower, and the situation is aggravated by the tighter border controls,” says Khor Yew Chai, director (PPVC) at Dragages Singapore, a member of Bouygues Constrution, a global leader in the building sector.Under the PPVC method, frameworks and modules are built in a factory off-site. “We still need workers in these factories to produce the modules,” adds Khor. “The difference is that with PPVC, we do not require as many workers onsite compared to a conventional construction site.”Dragages’ modules are built in a factory located in Johor, Malaysia, before being transported to a factory in Singapore to be assembled. However, most of the construction materials are imported from overseas, especially China, notes Khor. “The rise in costs of sea transport and raw materials since last year is a challenge for contractors trying to complete their projects on schedule,” he adds.Lego-style assembly onsite. (Picture: Samuel Isaac Chua/The Edge Singapore)Dragages is not alone. Many of the precast components are manufactured in Malaysia, notes Tan Cheng Chuah, managing director of Construction Professionals and PM Link, two companies under CPG Corp, a professional development consultancy firm.Malaysia entered a 14-day Covid “total lockdown” with effect from June 1 to contain its daily infections. It has since been extended by another two weeks to June 28. “The initial Movement Control Order and the current Full Movement Control Order have impacted the completion timelines for ongoing projects in Singapore as precast factories in Malaysia have to stop production and deliveries,” continues Tan. “The result is that overall tender prices for construction projects have escalated by 20%-30% over the past year.”Productivity at construction sites has dropped due to the safe management measures (SMM) introduced as part of the Phase Two (Heightened Alert) measures put in place from May 16 to June 13.The government is aware of the manpower shortage and subsequent knock-on effects on ongoing infrastructure and development projects. In a speech at the OrangeTee Business Conference on May 24, the Minister for National Development, Desmond Lee, said: “[The tighter border controls] has significantly worsened manpower shortages in our construction sector, as South Asian countries are where we recruit and hire most of our construction work permit holders.”This is a double-blow for the construction industry, which had already been struggling with a manpower crunch since the start of the pandemic last year. “We have been cautious in reopening our borders and have also been careful in bringing in migrant workers, to reduce the risk of importing the virus,” adds Lee. “It’s a difficult trade-off.”The Minister for National Development, Desmond Lee, speaking at ​the OrangeTee Business Conference on May 24. (Picture: OrangeTee)Last year, the government introduced a $1.36 billion construction support package to help contractors bear part of the additional costs they had to incur due to construction delays and SMM.The government has stepped in with more support measures, including an additional 49-day extension for public-sector construction projects on top of the 122-day extension under the Covid-19 (Temporary Measures) Act, or Cotma, last year. Contractors who have been awarded contract sums of up to $100 million will receive 0.1% of the awarded contract sum for every month of delay as payment for non-manpower-related qualifying costs under Cotma.Foreign worker levy rebates for work permit holders will be increased from $90 per worker per month to $250 per worker per month, from May to December 2021.To alleviate the manpower crunch, the government will temporarily allow new construction work-permit holders from China to enter Singapore to work first and take their skills certification tests locally instead of in China.“Governmental support measures such as the Jobs Support Scheme helped to a certain extent as they covered about 15%-20% of manpower cost. In addition, the ex-gratia payment from the government for supporting material and equipment [purchases] also helped contractors,” says Chuck Kho, deputy CEO of CPG Consultants, which is part of CPG Corp.Kho: Some of CPG Consultants’ clients have preferred to delay tenders due to concerns over funding, cost escalations, labour shortage, and the prolonged environment of heightened risk and uncertainty. (Picture: CPG Corp.)A Cotma law has been amended to allow construction companies in Singapore to apply to the authorities for adjustments to contract sums so that project partners will more equitably share the burden of increased foreign manpower costs due to the Covid pandemic. “This is to ensure no single stakeholder group in the construction industry bears an undue share of the burden imposed by Covid-19,” said Minister Lee in Parliament on May 11.“The co-sharing mechanisms involve some documentation process and substantiation of the qualifying costs,” says Dragages’ Khor. “The catch is that all parties involved — contractors, including subcontractors and suppliers — must have the same objective of sharing the cost.”Dragages has six ongoing projects in Singapore, and is focused on completing four of them by the end of the year, for instance, the 613-unit condominium project, The Garden Residence; the 805-unit condominium, Park Colonial; and the Grade-A office development, CapitaSpring.Khor Yew Chai, director (PPVC) at Dragages Singapore, a member of Bouygues Constrution, a global leader in the building sector. PPVC specialists have not been spared the ravages of the Covid pandemic. (PictureL Dragages Singapore)Most ongoing construction projects in Singapore however, are facing delays of between six and 12 months, says CPG Consultants’ Kho. Further delays are likely, he cautions, “as overlapping problems cause a ripple effect across the industry”.For instance, some of CPG Consultants’ clients have preferred to delay tenders due to concerns over funding, cost escalations, labour shortage, and the prolonged environment of heightened risk and uncertainty, says Kho.For firms engaged in the built environment, the main cost component in project prolongation is inevitably manpower, notes Tan of Construction Professionals. Besides more measures on manpower cost-sharing, another way to alleviate the rise in manpower costs is for a more flexible procurement method to cushion the uncertainty due to Covid, he adds.Instead of an all-cost-inclusive construction tender or consultancy tender, for example, public agencies may consider including a provisional sum for costs that cannot be estimated or foreseeable in the short term, such as the costs of swab tests, prolongation costs, and the costs of implementation of mandatory SMM, Tan suggests.Tan: One option to solve the foreign worker crunch is to train a pool of local skilled workers to reduce the reliance on foreign labour. (Picture: CPG Corp.)The Covid-related construction delays is taking a toll on the finances of developers and contractors. “If these delays are prolonged, it is likely that some of the smaller developers may face serious cashflow issues,” warns Chia Ngiang Hong, president of the Real Estate Developers’ Association of Singapore (Redas).One issue that most, if not all, developers are concerned about is the additional buyer’s stamp duty (ABSD). Since the July 2018 property cooling measures, developers are subjected to a 30% ABSD, of which 5% is non-remittable.Developers were given a 12-month extension to the five-year project completion period last year, as part of Cotma. However, the ABSD period was only extended by six months, to 5.5 years.Most of the government assistance to the industry, including the reprieve to the completion deadline, was handed out close to the onset of the pandemic last year, says Redas’ Chia. “If developers continue to face the threat of having to pay heavy penalties with regard to the ABSD on land cost, they will likely adopt a more conservative attitude when negotiating with contractors,” he adds.An extension of the developers’ ABSD period will provide relief from “the time pressure” that developers and their contractors face, continues Chia.Most ongoing construction projects in Singapore are facing delays of between six and 12 months. Further delays are likely, as overlapping problems cause a ripple effect across the industry. (Picture: Samuel Isaac Chua/The Edge Singapore)“The reality is that there is no easy solution while most Singaporeans are not inclined to switch to manual labour professions, whether skilled or not,” says CPG Consultants’ Kho.Despite rapid technological advancements taking place in the construction sector, robotics and automation cannot completely displace workers — “at least not in the next 10 years”, says Construction Professionals’ Tan.One option to solve the foreign worker crunch is to train a pool of local skilled workers to reduce the reliance on foreign labour, adds Tan. Adequate training and remuneration should be sufficient to entice local skilled construction workers to enter and stay in the industry, he argues. “This should go hand in hand with the widespread adoption of PPVC technology and digitalisation as a long-term solution for Singapore’s built environment.”Check out the latest listings near The Garden Residence, Park ColonialSee Also:Singapore Property for Sale & Rent, Latest Property News, Advanced Analytics ToolsNew Launch Condo & Landed Property in Singapore (COMPLETE list & updates)Construction industry stakeholders call for safe and controlled entry of foreign workers[UPDATE] Capacity limits for visitors to project sales galleries, resale propertiesBiomimicry: When nature and tech work togetherEn Bloc Calculator, Find Out If Your Condo Will Be The Next en-blocHDB Resale Flats Up For Sale, Affordable Units AvailableUntil recently, the location of executed wartime Japanese Prime Minister Hideki Tojo's remains was one of World War II's biggest mysteries in the nation he once led.  Now, a Japanese university professor has revealed declassified U.S. military documents that appear to hold the answer.  The documents show the cremated ashes of Tojo, one of the masterminds of the Pearl Harbor attack, were scattered from a U.S. Army aircraft over the Pacific Ocean about 30 miles (50 kilometers) east of Yokohama, Japan’s second-largest city, south of Tokyo.The country on Monday reported 70,421 new COVID-19 infections over the past 24 hours, the lowest since March 31, according to the Health Ministry.Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.Marty Walsh remembers what it was like when a Cabinet secretary would come to town.  \"He was speaking on behalf of President Obama and Vice President Biden, and people hung on every word.”  Now Walsh, as secretary of labor, is on the other side of the equation, crisscrossing the country on behalf of President Joe Biden’s American Jobs Plan.The Cubs are one of eight teams that haven't reached the 85 percent vaccination threshold.Teoscar Hernandez slugged two of the Blue Jays' eight home runs and had a career-high six RBIs, Robbie Ray struck out 10 over six innings of three-run ball and the visiting Toronto Blue Jays routed the Boston Red Sox 18-4 on Sunday afternoon.  Hernandez had a pair of three-run blasts, Bo Bichette (4-for-5) launched a three-run bomb and scored five runs, Rowdy Tellez hit a two-run shot and Vladimir Guerrero Jr. homered for the third straight game for his majors-leading 21st homer.  Lourdes Gurriel Jr., Marcus Semien and Cavan Biggio each added solo shots in Toronto's 20-hit attack.Wall Street legend Whitney Tilson says there's a huge new tech trend coming – and he's giving away his top pick for free right here.TOKYO (Reuters) -Japan's Toshiba Corp on Monday blamed its former chief executive for fomenting a \"confrontational approach\" to shareholders, citing that as underlying factor in its widening governance crisis.  The comment from Osamu Nagayama, the chairman of Toshiba's board, comes after  a shareholder-commissioned investigation revealed the company colluded with the Japanese government to \"beat up\" foreign shareholders.  One shareholder has described the scandal as the biggest corporate scandal in a decade.The companies shared insights as to why payments and tech partnerships are key at the FN CEO Summit 2021.Marine Le Pen sets sights on territory of traditional rightCôte d’Azur is among areas where French far-right leader seeks to make inroads in regional elections this month Marine Le Pen, the leader of Rassemblement National, is portraying regional elections as a launchpad for her third presidential bid. Photograph: Guillaume Souvant/Sipa/RexThis small company behind it is sparking a potential 20,300% market surge. Click here for details.Country diary: a coral form with a fondness for dry stone wallsAllendale, Northumberland: The glaucous leaves and lemon yellow flowers of roseroot give it an underwater feeling – I almost expect small fish to emerge ‘Native to Britain, roseroot, Rhodiola rosea, grows mostly in the north and west, tucked on to the ledges of sea cliffs, or in mountain areas above 300m.’ Photograph: Susie WhiteFollow the latest updatesA series of coronavirus outbreaks in Thai factories is raising concerns that the export sector could be hit hard, threatening to further undermine an economy as it struggles to recover from the pandemic's crippling blow to the crucial tourism industry.  The virus has swept through over 130 factories, including those supplying international brands, with more than 7,100 cases across 11 provinces, making manufacturing one of the top sources of infections along with prisons and construction camps.  The affected plants are just a fraction of about 63,000 factories in Thailand that employ 3.4 million, government data shows, but officials worry about the impact on exports that have kept the struggling economy moving as income from tourism has collapsed.It’s beating everything else in the market… yet hardly anyone knows about it. Top analyst steps forward in new video to give away all the details.How Taiwan’s struggle for Covid vaccines is inflaming tensions with ChinaAs island faces new outbreak and mistrust of Chinese jabs, Beijing objects to donations from US and Japan A vaccination session for medical workers in New Taipei City, Taiwan, in May. Photograph: Ann Wang/ReutersThe report also found that opportunistic threat actors sought to exploit people’s emotions and uncertainties during the pandemic by using Covid-19 topics to anchor their phishing campaigns SINGAPORE - Media OutReach - 14 June 2021 - Ensign InfoSecurity (Ensign), Asia's largest, pure-play cybersecurity firm, today unveiled the findings of its Cyber Threat Landscape 2021 report, which found that the technology, manufacturing, and banking and finance industries were the top targets in Asia PacificKey companies profiled are Commercial Metals Company, Aurubis AG, Norton Aluminium Ltd., ArcelorMittal S.A., REAL ALLOY, DOWA HOLDINGS Co., Ltd., Sims Metal Management, Kuusakoski Recycling, Tom Martin & Co. Ltd., European Metal Recycling, Nucor Corporation, and Novelis Inc., among others.Pune, June 14, 2021 (GLOBE NEWSWIRE) -- The metal recycling market is expected to grow from USD 54.1 billion in 2019 to USD 88.5 billion by 2027, at a CAGR of 8.1% from 2020 to 2027. Metal recycling is imperatiWall street legend Chris Rowe says there’s a huge stock market event looming - and he’s revealing his #1 pick for free.Vehicle miles traveled in the United States declined more than 13% in 2020, according to IHS, while more than 15 million vehicles were scrapped - about 5.6 percent of the total vehicle population.  IHS researchers also said an ongoing shortage of semiconductors, which cut into vehicle production, resulted in lower dealer inventories and inflated transaction prices, in turn causing a concurrent rise in used vehicle prices.The athleticwear line, in partnership with Champion, consists of 15 styles ranging in price from $75 for a classic logo cap to $395 for a track jacket.Tiffany & Co. has chosen three new brand ambassadors to help represent its new era under LVMH.Today's mortgage refi rates at 1.77% FIXED - No hidden points or fees! 1.97% APR. Cut your payment while rates are still low.The National Petroleum Corporation of Namibia (\"NAMCOR\") and Reconnaissance Energy Africa Ltd. (the \"Company\" or \"ReconAfrica\") (TSXV: RECO) (OTCQX: RECAF) (Frankfurt: 0XD) are pleased to announce the execution of a Joint Operating Agreement (\"JOA\") to develop the resource potential of the Kavango Sedimentary Basin, Northeast Namibia.VANCOUVER, British Columbia and IRVINE, Calif., June 14, 2021 (GLOBE NEWSWIRE) -- PowerTap Hydrogen Capital Corp. (NEO: MOVE)(FWB: 2K6)(OTC: MOTNF) (“PowerTap” or the “Company” or \"MOVE\") is pleased to announce that, further to its announcement on June 7, 2021, the Company has completed its name change to \"PowerTap Hydrogen Capital Corp.\", effective as of the date hereof. This name change is in conjunction with the Company's transition to a single purpose hydrogen fueling technology company, preMonsters or a must? Venice tussles with return of cruise shipsThe arrival of the MSC Orchestra has rekindled tensions over the pros and cons of the giant vessels The MSC Orchestra, the first cruise ship to visit Venice in 18 months, sails out of the city. Photograph: Miguel Medina/AFP/Getty Images", "Section": "", "Writers": "", "URL": "https://sg.finance.yahoo.com/news/tackling-challenges-faced-covid-hit-220005633.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}