{"Type": "", "Time": "2021-06-14", "Headline": "American father and son plead guilty to helping former Nissan Chairman Ghosn flee Japan | World | Malay Mail", "Text": "Loading...Monday, 14 Jun 2021 02:02 PM MYT\n\nThis undated combination of file photos March 2, 2021 shows former US special forces member Michael Taylor and his son Peter, posing together years apart at unknown locations. — Taylor family handout pic via AFP\n\nFollow us on Instagram and subscribe to our Telegram channel for the latest updates.TOKYO, June 14 — An American father and son pleaded guilty in Tokyo on Monday to charges that they illegally helped former Nissan Motor Co Ltd Chairman Carlos Ghosn flee Japan hidden in a box aboard a private jet in December 2019.US Army Special Forces veteran Michael Taylor and his son Peter replied no when the judge asked them if there was anything wrong with the charges submitted by the Tokyo Prosecutors’ office. It was their first court appearance in the case.Extradited to Japan from the United States in March, father and son are being held at the same jail in Tokyo where Ghosn was detained. They could face up to three years in prison.Prosecutors have accused them of helping Ghosn evade punishment and escape to Lebanon from western Japan’s Kansai airport, receiving US$1.3 million (RM5.35 million) for their services.The Taylors’ US lawyers waged a months-long battle to prevent their extradition to Japan, arguing they could not be prosecuted for helping someone “bail jump” and that they could face relentless interrogations and torture.Suspects in Japan are interrogated without their lawyers present and are often denied bail before trial.Japan’s conviction rate is 99 per cent.At the time of Ghosn’s escape, he was awaiting trial on charges that he understated his compensation in Nissan’s financial statements by ¥9.3 billion yen (RM350 million) over a decade and enriched himself at his employer’s expense through payments to car dealerships.Ghosn, who denies any wrongdoing, remains a fugitive in his childhood home, which has no extradition treaty with Japan.Greg Kelly, a former Nissan executive charged with helping Ghosn hide his earnings, is also standing trial in Tokyo. He denies the charges. — ReutersLoading...© 2021, Malay Mail, All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.malaymail.com/news/world/2021/06/14/american-father-and-son-plead-guilty-to-helping-former-nissan-chairman-ghos/1982064", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}