{"Type": "", "Time": "2021-06-14", "Headline": "Scotland, Spain set to start Euro 2020 campaigns after England's opening win", "Text": "published :\n\t\t\t\t\t\t\t\t\t\t\t\t\t14 Jun 2021 at 11:45\t\t\t\t\t\t\t\t\t\t\t\twriter: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAFP LONDON: England launched their bid for Euro 2020 glory with a 1-0 win over Croatia on Sunday, as Scotland were set to end their 23-year wait to play in a major tournament and Covid-hit Spain prepared to face Sweden.Raheem Sterling scored at a sun-baked Wembley as England won their opening game of a European Championship finals for the first time at the 10th attempt.England's neighbours Scotland, playing at the highest level for the first time since the 1998 World Cup, will face the Czech Republic in Glasgow on Monday, before a new-look Spain get their bid for a record fourth European crown underway without captain Sergio Busquets who tested positive for coronavirus.But the action on the pitch is still being overshadowed by the fallout from the shocking events in Copenhagen's Parken Stadium on Saturday when Christian Eriksen suddenly collapsed during Denmark's Group B loss to Finland, lying motionless as medics administered CPR.The match resumed nearly two hours later following a suspension after reports filtered through that Eriksen was in a stable condition and awake.\"He was gone, and we did cardiac resuscitation, and it was cardiac arrest,\" team doctor Morten Boesen told a press conference on Sunday.\"How close were we? I don't know. We got him back after one defib (defibrillation), so that's quite fast.\"Denmark forward Martin Braithwaite called the incident \"one of the scariest moments of my life\".\"I'm grateful that he's stable and alive. Right now, that's all that matters. Hope to see you soon my friend,\" he tweeted.England make winning startOn Sunday, Manchester City's Sterling scored his first goal at a major tournament as England gained a measure of revenge for their 2018 World Cup semi-final defeat by Croatia.The forward's sharp finish in the second half was enough for the home side to send the Wembley crowd home happy.Sterling grew up in the shadow of London's Wembley and justified manager Gareth Southgate's decision to keep faith with him by scoring the only goal just before the hour.\"I always said if I played at Wembley in a major tournament, I'm scoring. I had to score in my back garden and delighted to do that,\" he told the BBC.England, seeking to end a 55-year wait for a major trophy, are playing all three group games at their London home. If they top Group D they will also play there in the last 16, while London is also the venue for both semi-finals as well as the final on July 11.The Netherlands, back at a major tournament for the first time since 2014, defeated Ukraine 3-2 in a thrilling Group C encounter in Amsterdam.Dutch captain Georginio Wijnaldum put the hosts ahead early in the second half before Wout Weghorst doubled their advantage.Ukraine equalised with two quick goals from Andriy Yarmolenko and Roman Yaremchuk, but a Denzel Dumfries header five minutes from time earned Frank de Boer's side victory.North Macedonia lost 3-1 to Austria in their first match in a major tournament as an independent nation in Bucharest, despite an equaliser from 37-year-old captain Goran Pandev.Scotland set to celebrate returnScotland's match in Group D has been slightly overshadowed by the racism ban which ruled Czech defender Ondrej Kudela out of the tournament.The Slavia Prague player was suspended for 10 games for racially abusing Rangers midfielder Glen Kamara on a Europa League visit to Scotland in March.\"I believe that he did not tell him anything racist, there was no evidence, but a lot of people on the islands (the UK) condemned him and he received a severe sentence,\" said Czech Republic and West Ham midfielder Tomas Soucek.But Scotland's fans will be sure to celebrate at Hampden Park, with their side finally back in the big time.\"I hope it inspires a nation, I hope we can make them happy. You can feel a real buzz around the country already,\" said Scotland captain Andy Robertson.The coronavirus, which delayed the tournament for a year, is still proving a major headache.Portugal defender Joao Cancelo has tested positive for Covid-19 and is out of Euro 2020, with Diogo Dalot taking his place in the squad.Spain's preparations have been badly hit by the virus, with Busquets missing for Monday's clash with Sweden in Seville, while defender Diego Llorente was only allowed to rejoin the group on Saturday after giving a fourth consecutive negative test.\"It's been a tough week, without doubt, but no complaints, no excuses,\" said Spain coach Luis Enrique.The other opening Group E game sees Robert Lewandowski's Poland face Slovakia in Saint Petersburg.World Cup holders France -- with Karim Benzema recalled -- are the favourites to win the continental crown.They begin their campaign against Germany in Munich on Tuesday, with holders Portugal facing Hungary in the other Group F match.NAKHON SI THAMMARAT: The body of a local fisherman missing for two days ago was found floating in the sea off Khanom district on Monday, police said.TOKYO: An American father-son duo admitted their role in orchestrating former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.The government admits there is a shortage of Covid-19 vaccine with no deliveries expected this week.", "Section": "", "Writers": "", "URL": "https://www.bangkokpost.com/sports/2132131/scotland-spain-set-to-start-euro-2020-campaigns-after-englands-opening-win", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}