{"Type": "", "Time": "2021-06-14", "Headline": "G7 leaders warn Russia on cyberattacks, chemical weapons usage", "Text": "The Group of Seven leaders ended their summit on Sunday by demanding that Russia take action and investigate the use of chemical weapons within its territory and hold accountable those behind ransomware attacks and other cyber crimes.Why it matters: The allied language come as all eyes turn to President Biden's Wednesday meeting with Russian President Vladimir Putin in Geneva.Get market news worthy of your time with Axios Markets. Subscribe for free.The state of play: The leaders called on Russia to \"end its systematic crackdown on independent civil society and media.\"They also reiterated their support for Ukraine and pressed Russia to deescalate tensions between the two nations by withdrawing troops from Ukraine's eastern border and the Crimean peninsula.The big picture: Secretary of State Antony Blinken made the rounds on the Sunday talk shows and tried to temper expectations about the upcoming meeting between Biden and Putin, saying that it would not be a \"flip-the-light switch moment\" for U.S.-Russia relations.Biden himself told reporters on Sunday that he agreed with Putin's recent comments that U.S.-Russia relations are at their lowest point in years, per Reuters.A recent ABC News/Ipsos poll found that 49% of Americans trust Biden to negotiate on their behalf with Putin.But, but, but: Lawmakers from both parties want Biden to take a tough stance with Putin on the issue of ransomware gangs, and convey the message that if Russia doesn't crack down on cybercriminals within its borders, the United States will, according to Politico.Putin has expressed willingness to hand over cybercriminals to the United States if the United States returns the favor, per Reuters.Ukraine's President Volodymyr Zelensky has also expressed reservations about the upcoming Biden's decisions vis-a-vis Russia.Of note: The issues of chemical weapons and cyberattacks are in the spotlight at this year's G7 summit in light of the poisoning of Russian opposition leader Alexei Navalny with a chemical nerve agent and the ransomware attack on America's Colonial Pipeline, reports Reuters.The Colonial Pipeline attack was carried out by Darkside, a Russia-based cybercrime group.More from Axios: Sign up to get the latest market trends with Axios Markets. Subscribe for freeThe following is a transcript of an interview with Andy Slavitt, former White House senior COVID-19 adviser, that aired Sunday, June 13, 2021, on \"Face the Nation.\"Moscow's mayor has effectively declared a public holiday for all of next week to combat a surge in COVID-19 cases.  Sergei Sobyanin announced the decision on Saturday, saying it would not affect organisations that maintain the Russian capital's infrastructure, the military, and other strategically important enterprises.  Monday is anyway a public holiday, and the mayor told people to also stay off work for the rest of the week.Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.Hong Kong democracy activist Agnes Chow was released on Saturday from prison on the second anniversary of the city's huge democracy rallies, with police out in force and protests now all but banned. Two thousand officers have been placed on standby after social media calls for residents to commemorate the failed democracy demonstrations. Authorities have kept a coronavirus prohibition on public gatherings despite the city recording just three local infections in the last month. A Beijing-imposedDenzel Dumfries rescued the Netherlands with a goal in the 85th minute to give his team a 3-2 win over Ukraine at the European Championship.  The Netherlands was playing at a major soccer tournament for the first time in seven years.  Fans in Amsterdam for the European Championship match between the Netherlands and Ukraine have expressed their support for Christian Eriksen following his collapse on Saturday.The Islamic State group has claimed responsibility for bombing two minivans in a mostly Shiite neighborhood in the Afghan capital that killed seven people.  Among the dead were two employees of Afghanistan's state-run film company, a colleague said Sunday.  In a statement issued late Saturday, Afghanistan's IS affiliate said its operatives blew up two minivans carrying “disbeliever Shiites” using sticky bombs.Get a $200 checking bonus when you apply for an eligible checking account online in minutes with qualifying direct deposits. Learn more.South African health inspectors will carry out further checks on a batch of Johnson & Johnson COVID-19 vaccines following a contamination error earlier this year at the U.S. plant where the doses were produced, the health ministry said.  \"There is now a real possibility that they may not be, however this is for the regulator to rule on,\" a ministry statement said.  The ministry said 300,000 J&J doses had been cleared for export to South Africa and that the U.S. Food and Drug Administration (FDA) had approved an extension of the expiry date, saying the vaccine can be stored at 2-8 degrees Celsius for 4.5 months instead of three.NATO leaders hope to open a new chapter in transatlantic relations at a summit with U.S. President Joe Biden on Monday, agreeing to focus on tackling climate change for the first time as well as facing up China's military rise.  Described as a \"pivotal moment\" by NATO Secretary-General Jens Stoltenberg, the summit aims to turn the page on four tense years with Biden's predecessor Donald Trump, who shook confidence in the Western alliance by calling it \"obsolete\".  For the 30 allies meeting in Brussels, diplomats say nothing could be further from the truth, looking to the nuclear-armed alliance founded in 1949 to help deal with threats from extreme weather that can worsen conflicts to Russian attempts to undermine Western democracies through covert attacks.The island of Cyprus has become a hotspot for loggerhead sea turtles to nest from spring to summer.If you pay more than $99/month for power and own a home in Texas, you better read this.Photo: \"Axios on HBO\"Ambassador Linda Thomas-Greenfield, U.S. ambassador to the U.N., told me on \"Axios on HBO\" that President Biden will be candid, frank — and tough — during this week's summit with Russian President Vladimir Putin.\"The president will make clear to the Russians that they cannot harbor cyber terrorists and criminals in their country and not be held accountable for it,\" she added. \"And they need to take the responsibility for dealing with this issue.\"Stay on top of the latest marCanadian Prime Minister Justin Trudeau led a Group of Seven discussion of China on Saturday and called on leaders to come up with a unified approach to the challenges posed by the People's Republic, a source said.  G7 leaders - who together control about $40 trillion in economic clout - reached broad alignment on building a concerted approach to China, the source with knowledge of the discussions told Reuters.  \"Trudeau's message today was that we really need to work to build a consensus on a unified approach to the challenges that China presents all of us,\" the source said.Francisco Lindor’s bat has started to come around of late, as evidenced by his two-run home run in the first inning of Saturday’s 4-1 win over the San Diego Padres.Read This Before Going Solar in Texas.  [You'll Likely Qualify!]England gets its tournament started on Sunday.Benjamin Netanyahu, Israel's longest serving prime minister, was ousted on Sunday night by a cross-party coalition government, raising hopes that the worst political crisis in the country's history is drawing to a close. At a special session in the Knesset, the Israeli parliament, lawmakers voted narrowly in favour of removing Mr Netanyahu from high office and swearing in a unity government. The coalition will be led by Naftali Bennett, the right-wing leader of the Yamina party, who will serve aThe Pine Island Glacier on the West Antarctic Ice Sheet is responsible for more than a quarter of Antarctica's contribution to global sea level rise over the past decades. Now, a new study shows it is more vulnerable to rapid melting than thought, because climate change is weakening its natural braking system.Why it matters: At stake is the future of a glacier containing about 160 trillion tons of ice, which if it were all to melt into the ocean would cause about 1.6 feet of global sea level risSo mad that I just learned this...At a low point in U.S.-Russian relations, President Joe Biden and Russian President Vladimir Putin appear to agree broadly on at least one thing — their first face-to-face meeting Wednesday is a chance to set the stage for a new era in arms control.  The fabric of arms control has been fraying, notably with the abandonment in 2019 — first by Washington, then by Moscow — of the Intermediate-Range Nuclear Forces Treaty, which had governed a whole class of missiles for more than three decades.  Last month the Biden administration informed the Russians that it would not reenter the treaty, and last week Putin confirmed Russia's exit.Biden's meeting with Queen Elizabeth II is his first in nearly four decades.Western democracies are in a race to compete with autocratic governments, U.S. President Joe Biden said on Sunday.  \"We're in a contest, not with China per se, ... with autocrats, autocratic governments around the world, as to whether or not democracies can compete with them in a rapidly changing 21st century,\" Biden told a news conference at the conclusion of a Group of Seven leaders' summit in Britain.Top Surgeon and Author of the Best Selling Book \"Dr. Gundry's Diet Evolution\" Discovers Link Between Gut Health and the Rising Number on the Scale.\"Pulse Nightclub is hallowed ground.\"Eriksen, 29, collapsed in the 42nd minute of the match near the touchline after a Denmark throw-in and was given life-saving cardiac massage treatment on the pitch, with officials later saying the player was stable and awake in hospital.  Sanjay Sharma of St. George's University of London, the playmaker's cardiologist at former club Tottenham Hotspur, also said Eriksen had no prior heart issues during his time with the Premier League side.President Joe Biden’s hopes of channeling billions of dollars into green infrastructure investments  to fight climate change are running into the political obstacle of winning over Republican lawmakers who oppose that approach as unnecessary, excessive spending.  As negotiations unfold in Congress in search of a bipartisan deal, the White House's ability to ensure a climate focus in Biden's sweeping infrastructure package is becoming daunting — so much so that key Democrats are warning the administration to quit negotiating with Republicans, calling it a waste of time that will produce no viable compromise.  The debate is similar to the political and policy differences complicating Biden’s broader talks over his ambitious infrastructure agenda, the sweeping $1.7 trillion American Jobs Plan making its way through Congress, as Democrats and Republicans argue over what, exactly, constitutes infrastructure and how much is needed.", "Section": "", "Writers": "", "URL": "https://news.yahoo.com/g7-leaders-warn-russia-cyberattacks-163053054.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}