{"Type": "Sport", "Time": "2021-06-14", "Headline": "Football: Phillips the biggest plus as England get the job done", "Text": "LONDON: England did enough tobeat a disappointing Croatia teamin their opening Euro 2020 game on Sunday with the biggest plus being the performance of central midfielder Kalvin Phillips.The three points put England in a strong position in Group D ahead of Friday's match against Scotland, also at Wembley Stadium, but the main questions over Gareth Southgate's team remain unanswered.Croatia are a slower and less talented team than the one which beat England in the semi-finals of the World Cup in 2018 and without Ivan Rakitic in midfield and striker Mario Mandzukic, they depend too much on 35-year-old playmaker Luka Modric.That meant that England's defence, including the inexperienced Tyrone Mings, did not face the kind of examination they will likely come up against in the knockout stages.There were two main positives that came out of the game - Raheem Sterling, low on confidence after a poor end to the season with Manchester City, was full of verve and will be boosted by getting the winning goal.Sterling was chosen ahead of Marcus Rashford on the left of the England attack and justified that decision, even if the erratic nature of his finishing was displayed on a couple of occasions.Yet it was Phillips' display in the centre of midfield that really was the major plus point for Southgate.Those who have not paid much attention to Leeds United's first season back in the Premier League were surprised by the 25-year-old's inclusion in the 26-man squad let alone the starting team, but there is a reason why he is so trusted by his club manager Marcelo Bielsa.Phillips is much more than a holding midfielder, although he can do the defensive work well and showed that by breaking up several Croatian moves.He has the energy and awareness to contribute going forward and also can switch play well and deliver a crucial pass - as he showed for Sterling's goal.Phillips burst forward, putting the Croatia defence on the back foot, and then found Sterling with a perfectly placed and weighted pass.Yet that was by no means his only contribution - with Declan Rice sitting deeper, he roamed the centre of the park, providing a link-up with the forwards.\"Kalvin Phillips is a player who is so understated. He has had a fantastic start to his international career. I thought he was immense throughout the game,\" said Southgate.There were some concerns though. Captain Harry Kane looked tired and provided little threat and Phil Foden, who started so brightly, faded out of the game too quickly.Yet with Jordan Henderson not yet back to full fitness, the emergence of Phillips gives Southgate options for when the tougher tests come along.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "midfield,Gareth Southgate,sports,England,team,job", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/football-phillips-the-biggest-plus-as-england-get-the-job-done-15007456", "Source": "google"}