{"Type": "World", "Time": "2021-06-14", "Headline": "G7 calls out China, demands COVID-19 origins investigation", "Text": "CARBIS BAY, England: Group of Seven (G7) leaders on Sunday (Jun 13) scolded China over human rights in Xinjiang, called for Hong Kong to keep a high degree of autonomy and demanded a full and thorough investigation of the origins of the coronavirus in China.After discussing how to come up with a unified position on China, leaders issued a highly critical final communique that delved into what are for China some of the most sensitive issues, including also Taiwan.The re-emergence of China as a leading global power is considered to be one of the most significant geopolitical events of recent times, alongside the 1991 fall of the Soviet Union that ended the Cold War.China's rise has also unnerved the United States: President Joe Biden casts China as the main strategic competitor and has vowed to confront China's \"economic abuses\" and push back against human rights violations.\"We will promote our values, including by calling on China to respect human rights and fundamental freedoms, especially in relation to Xinjiang and those rights, freedoms and high degree of autonomy for Hong Kong enshrined in the Sino-British Joint Declaration,\" the G7 said.\"We also call for a timely, transparent, expert-led, and science-based WHO-convened Phase 2 COVID-19 Origins study including, as recommended by the experts' report, in China,\" the G7 said.Reuters earlier reported the finalised version of the draft communique.Before the G7 criticism emerged, China pointedly cautioned G7 leaders that the days when \"small\" groups of countries decided the fate of the world was long gone.The G7 also said they underscored \"the importance of peace and stability across the Taiwan Strait, and encourage the peaceful resolution of cross-Strait issues\".\"We remain seriously concerned about the situation in the East and South China Seas and strongly oppose any unilateral attempts to change the status quo and increase tensions,\" they said.FORCED LABOURThe G7 said it was concerned about forced labour in global supply chains including in the agricultural, solar and garment sectors.\"We are concerned by the use of all forms of forced labour in global supply chains, including state-sponsored forced labour of vulnerable groups and minorities, including in the agricultural, solar, and garment sectors,\" the G7 said.Beijing has repeatedly hit back against what it perceives as attempts by Western powers to contain China, and says many major powers are still gripped by an outdated imperial mindset after years of humiliating China.UN experts and rights groups estimate more than a million people, mainly Uyghurs and other Muslim minorities, have been detained in recent years in a vast system of camps in Xinjiang.China denies all accusations of forced labour or abuse. It initially denied the camps existed, but has since said they are vocational centres and are designed to combat extremism. In late 2019, China said all people in the camps had \"graduated\".It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "G7,China,COVID-19,coronavirus,Uyghurs", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/g7-china-covid-19-origins-investigate-taiwan-hong-kong-xinjiang-15006734", "Source": "google"}