{"Type": "", "Time": "2021-06-14", "Headline": "China says nuclear plant operates safely after radiation report, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BEIJING (BLOOMBERG, AFP) - China General Nuclear Power said environmental indicators at and around its Taishan plant are normal, after CNN reported that a French company warned of an \"imminent radiological threat\" there.Unit 1 at the plant in Guangdong is operating normally and Unit 2 was reconnected to the grid last week after an overhaul, CGN said in a statement on the plant's website. The units have a combined capacity of 3.3 gigawatts and came online in 2018 and 2019.French company Framatome warned the US government of an \"imminent radiological threat\" at the plant, CNN reported, citing unnamed US officials and documents the news network says it has reviewed.Those documents include a letter seeking assistance sent to the US Department of Energy by Framatome, CNN said. Framatome helped build and provides technical assistance to the plant about 130km west of Hong Kong.The letter has prompted several high-level meetings in Washington, as well as discussions between the US and French governments and contact between the US and Chinese governments, CNN said. US officials do not believe the situation poses a severe safety threat to the public or workers at the plant, CNN said.CGN owns 51 per cent of the Taishan venture, while Framatome's parent, Electricite de France SA (EDF), has a 30 per cent stake. Chinese utility firm Guangdong Yuedian Group has the rest.Framatome said the company \"is supporting resolution of a performance issue with the Taishan Nuclear Power Plant\", adding that \"according to the data available, the plant is operating within the safety parameters\".EDF on Monday (June 14) said there was an “increase in the concentration of noble gases” in the cooling system of the nuclear plant.\"The presence of certain noble gases (chemically inert elements like argon, helium or neon) is a known phenomenon, studied and provided for in the reactor operating procedures,\" EDF said in a statement.The report came amid a power shortage in Guangdong, the country's industrial hub, that has caused more than 20 cities to ration power to some companies and factories.China is the world's third-biggest nuclear power market, after the United States and France, and has the most new reactors under construction. It has never had a serious nuclear accident on domestic soil.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/china-says-nuclear-plant-operating-safely-after-radiation-report", "Source": "google"}