{"Type": "", "Time": "2021-06-14", "Headline": "Christchurch attacks: producer resigns from film They Are Us as criticism grows | Christchurch shooting | The Guardian", "Text": "Jacinda Ardern says subject still feels ‘very raw’ amid ongoing accusations that film sidelines Muslim victims of 2019 massacreLast modified on Mon 14 Jun 2021 16.04 EDTA producer for a controversial Hollywood film depicting Jacinda Ardern’s response to the Christchurch terror attacks has resigned from the project after criticisms that it sidelined Muslim victims.The premise of the film, They Are Us, has also been criticised by its proposed subject, New Zealand prime minister Ardern, who is slated to be played by Rose Byrne. Ardern said on Sunday it felt “very soon and very raw” for New Zealand, and that she was not an appropriate focus for a film about the 2019 mosque attacks. “There are plenty of stories from March 15 that could be told, but I don’t consider mine to be one of them,” she said. Ardern has reiterated that she has no involvement with the film.The movie was announced by the Hollywood Reporter on Friday, and billed as an “inspirational story about the young leader’s response to the tragic events”.It immediately came under fire for centring on the leadership of a white woman against the backdrop of the mass murder of 51 Muslims by a white supremacist. Many Muslim New Zealanders criticised the move as “exploitative”, “insensitive”, and “obscene”. A petition to shut down the film’s production has gained about 60,000 signatures over the past three days.On Monday, New Zealand producer Philippa Campbell announced that she was resigning from the proposed production. “I’ve listened to the concerns raised over recent days and I have heard the strength of people’s views. I now agree that the events of March 15, 2019 are too raw for film at this time and do not wish to be involved with a project that is causing such distress,” she said in a statement released to media.“The announcement was focused on film business, and did not take enough account of the political and human context of the story in this country. It’s the complexity of that context I’ve been reflecting on that has led me to this decision.”When the film was announced on Friday, writer and community advocate Guled Mire told the Guardian that the premise was “completely insensitive”.“The reality is many victims are struggling right now. They’re really still trying to pick up the pieces – financially, everything,” he said. “This tapped into that vulnerability to make the most out of the situation.”The film will be directed and written by New Zealander Andrew Niccol, who wrote and directed Gattaca​. Niccol has not yet commented on the response to the film’s announcement. The Guardian has contacted the associated production companies for comment.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/world/2021/jun/14/christchurch-attacks-producer-resigns-film-they-are-us-jacinda-ardern-criticism", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}