{"Type": "", "Time": "2021-06-14", "Headline": "Coronavirus news LIVE Updates: Over 1.53 crore COVID-19 vaccine doses available with states, says Centre", "Text": "\n                        Coronavirus news Updates: Over 26 crore doses have been provided to states and UTs so far, through the Government of India channel and through direct state procurement category, the health ministry said\n                    \n                            Representational image. AP\n                        Coronavirus news LIVE UpdatesMore than 1.53 crore COVID-19 vaccine doses are still available with states and union territories and over 4 lakh more will be delivered to them within the next three days, the Union health ministry said Sunday.Over 26 crore (26,64,84,350) doses have been provided to states and UTs so far, through the Government of India (free of cost) channel and through direct state procurement category, it said.Of this, the total consumption including wastages is 25,12,66,637 doses (as per data available at 8 am Sunday), the ministry said.\"More than 1.53 crore (1,53,79,233) COVID-19 vaccine doses are still available with the states and UTs to be administered. Furthermore, 4,48,760 vaccine doses are in the pipeline and will be received by the States/UTs within the next three days,\" it said.Coronavirus news LIVE UpdatesThe Delhi government will begin COVID-19 vaccination for students enrolled in foreign universities, sportspersons, as well as people travelling abroad for work in a special drive starting from Monday at Mandir Marg.The second dose of Covishield and Covaxin can also be administered at this center only after 28 days, said deputy chief minister Manish Sisodia.Coronavirus news LIVE UpdatesBritish Prime Minister Boris Johnson said the Group of Seven wealthy nations have pledged over 1 billion coronavirus vaccine doses for poorer nations. Speaking at the end of a G-7 leaders' summit in southwest England on Sunday, Johnson said the doses would come both directly and through the international COVAX programme.The commitment falls far short of the 11 billion doses the World Health Organisation said is needed to vaccinate at least 70% of the world's population and truly end the pandemic.Coronavirus news LIVE UpdatesRussian COVID-19 vaccine Sputnik V is likely to be available in Delhi from next week at Indraprastha Apollo Hospital, with the tentative roll-out date scheduled for 15 June.The first phase of the Sputnik V roll-out by Apollo Hospitals and Dr Reddy’s Laboratories had started on a pilot basis on 17 May in Hyderabad and on 18 May in Vishakhapatnam.An Apollo Delhi spokesperson stated that they are expecting that the programme will begin on Tuesday 15 June, but can only be finalised when the consignment arrives, expected on Monday evening.Coronavirus news LIVE UpdatesCoronavirus news LIVE UpdatesThe Assam government on Sunday instructed all its employees who have recieved both the doses of COVID-19 vaccine to attend office from Monday, 14 June.All COVID-19 protocols are to be strictly followed, the government added in its order.Coronavirus news LIVE UpdatesOdisha on Sunday reported 4,469 new COVID-19 cases, taking the state's tally to 8,51,782, a Health Department official said. Forty-five more deaths pushed the toll to 3,302, he said.Of the new infections, 2,546 were reported from quarantine centres, while the rest 1,923 were local contact cases. Khurda district, where state capital Bhubaneswar is located, reported the highest 612 new cases, followed by Cuttack (413), Jajpur (370) and Balasore (318).Coronavirus news LIVE UpdatesThere was a slight dip in COVID-19 cases in Puducherry with the Union Territory recording 402 cases and seven deaths, taking the caseload to 1,12,528 and the toll to 1,684. The UT had reported 442 cases on Saturday. Recoveries outnumbered fresh cases with 809 people being discharged from hospitals, taking the active cases to 5,331. In all, 1,05,513 have recovered from the disease so far. Puducherry and Karaikal regions accounted for three deaths each and Mahe, one, Health and Family Welfare Services Director S Mohan Kumar said in a release.Coronavirus news LIVE UpdatesAt least 65 children have tested positive for coronavirus in Osmanabad district of Maharashtra over the last four days, as per the data shared by the district civil hospital. As per the data, the COVID-19 positivity rate and fatality rate are falling in the Osmanabad district but COVID-19 patients in the age group of 0 to 18 years are found in the district for the first time.Out of the 119 patients found in the district on 9 June, 25 were children between the age group of 0 and 18. Of the 109 patients found on 10 June,  19 were children. On 11 June, 123 infections were detected, of whom 21 were children. This shows that on an average 18 percent of children tested positive. However, no child suffering from coronavirus in the district has died, as per the data shared by authorities.Coronavirus news LIVE UpdatesCoronavirus news LIVE UpdatesThe order will come into effect in Delhi from 5 am on Monday till 5 am on 21 June or further orders, whichever is earlier, the government said.Coronavirus news LIVE UpdatesThe Bangladesh government has extended the closure of all schools and colleges till 30 June, in view of a surge in coronavirus cases, according to a media report. On 17 March last year, Bangladesh had closed all schools to contain the spread of coronavirus. All examinations were cancelled. In a notification on Saturday,  the Ministry of Education said all primary, secondary, higher secondary and college-level institutions, including Ebtedayee and Qawmi madrasas, would remain closed till 30 June, The Dhaka Tribune newspaper reported. Last month, Education Minister Dipu Moni said in-class teaching could be reopened on June 13, based on a review of the virus outbreak.\"The COVID-19 situation worsened in some districts and many areas have been locked down. Considering the safety of students, teachers, staff and guardians, and upon the advice of COVID-19 technical committee, the shutdown has been extended,\" the newspaper quoted the notification.Coronavirus news LIVE UpdatesThe Tamil Nadu government announced more relaxations in lockdown restrictions. The revised guidelines will come into effect from Monday.\"Tea shops are allowed to open from 6 am to 5 pm for takeaways in 27 districts. Construction companies are allowed to operate with 50 percent capacity,\" News18 reported.Coronavirus news LIVE UpdatesDelhi chief minister Arvind Kejriwal announced guidelines for the functioning of private and government offices.\"In government offices, there will be 100 percent attendance of group A officers and 50 percent for the rest. Private offices will run on 50 percent capacity from 9 am to 5 pm,\" he said.Coronavirus news LIVE Updates- Schools, colleges, educational and coaching institutions will remain closed. Social, political, sports, entertainment, academic, cultural, religious festival gatherings are prohibited. Swimming pools, stadiums, sports complexes, cinema theaters, multiplexes will also be closed, Chief Minister Arvind Kejriwal said.- Spas, gyms, yoga institutes, public parks and gardens will remain closed.Coronavirus news LIVE UpdatesArvind Kejriwal said religious places will be opened in Delhi but no visitors will be allowed.\"Weekly market allowed but only one market per zone. Weddings are not allowed in public places like banquet halls or hotels, only at the court or in homes with not more than 20 people. Only 20 people allowed at funerals.\"50 percent capacity allowed in Delhi Metro as well as buses. In autos, e-rickshaws, or taxis, not more than 2 passengers allowed to ensure social distancing,\" he added.Coronavirus news LIVE Updates\"Restaurants will be allowed to open at 50 percent seating capacity. We will observe this for one week, if cases increase, stricter restrictions will be imposed, otherwise, it will be continued,\" said Delhi chief minister Arvind Kejriwal on Sunday.Coronavirus news LIVE Updates\"After 5 am tomorrow, all activities will be allowed except some activities that will be prohibited and some activities that will be done in a restricted manner. A detailed order will be issued,\" Kejriwal said in a press briefing on Sunday. News18 reported that schools, colleges, educational institutes will remain shut; sports, religious gatherings will not be allowed and swimming pools, sports complex, multiplexes will remain closed.Coronavirus news LIVE UpdatesPakistan has placed strict restrictions on travellers from 26 countries, including India, to contain the spread of Covid-19 cases in the country. The National Command and Operation Centre (NCOC), a nerve centre to synergise effort against Covid-19 has placed these countries in the \"C category\" and revised the inbound air/land travel categories with an immediate effect, a Pakistani daily reportedCoronavirus news LIVE UpdatesOver 26 crore Covid vaccine doses doses provided to states/ UTs so far. More than 1.53 crore doses are still available with the states/UTs to be administered. Additional, more than 4 lakh vaccine doses are in the pipeline and will be received by the states/UTs within the next 3 days, says Union governmentCoronavirus news LIVE UpdatesThe 3,303 new deaths on Sunday include 1,966 from Maharashtra, 374 from Tamil Nadu, 171 from Kerala and 144 from Karnataka.A total of  3,70,384 deaths have been reported so far in the country including 1,08,333 from Maharashtra, 32,788 from Karnataka, 29,280 from Tamil Nadu, 24,800 from Delhi, 21,735 from Uttar Pradesh, 16,812 from West Bengal, 15,503 from Punjab and 13,311 from Chhattisgarh.Coronavirus news LIVE UpdatesWith the addition of 432 fresh coronavirus positive cases, the infection count in Thane district of Maharashtra mounted to 5,24,704, an official said on Sunday. These new cases were reported on Saturday, he said.With 23 more patients succumbing to coronavirus, the death toll in the district rose to 10,221. The mortality rate now stands at 1.94 percent, he added. The details of the recovered and under-treatment patients were not provided by the district administration.In neighbouring Palghar district, the COVID-19 case count has gone up to 1,13,416 while the death toll is 2,398, he said.Coronavirus news LIVE UpdatesThe Indian Council of Medical Research (IMCR) said that a total of 37,81,32,474 samples have been tested for COVID-19 up to 12 June, 2021.Of these, 19,00,312 samples were tested on Saturday.Coronavirus news LIVE UpdatesThe head of the World Health Organisation has welcomed the vaccine-sharing announcements coming out of the Group of Seven summit but says we need more, and we need them faster.\"The challenge, I said to the G-7 leaders, was that to truly end the pandemic, our goal must be to vaccinate at least 70% of the world's population by the time the G-7 meets again in Germany next year,\" WHO Director-General Tedros Adhanom Ghebreyesus told reporters Saturday at the summit in southwest England.\"To do that, we need 11 billion doses,\" Tedros said, adding that it was essential for countries to temporarily waive intellectual property protections for coronavirus vaccines.Coronavirus news LIVE UpdatesPrime Minister Narendra Modi on Saturday called for following a \"one earth, one health\" approach to effectively deal with the coronavirus pandemic globally, and sought the support of the G7 grouping to lift patent protections for COVID-19 vaccines, during a virtual address at an outreach session of a summit of the bloc.Calling for global unity, leadership, and solidarity to prevent future pandemics, Modi also emphasised on the special responsibility of democratic and transparent societies to deal with the challenge, according to an official statement. In his address, Modi sought the support of the G7 countries for a proposal moved at the WTO by India and South Africa, for patent waiver on Covid related technologies.\"The prime minister committed India's support for collective endeavours to improve global health governance. He sought the G7's support for the proposal moved at the WTO by India and South Africa for a TRIPS (Trade-Related Aspects of Intellectual Property Rights) waiver on Covid related technologies,\" the statement said.Coronavirus news LIVE UpdatesWith 80,834 new COVID-19 cases on Sunday, India reported its lowest daily figure in the last 71 days, the Centre said.The daily positivity rate is at 4.25 percent, which is less than 10 percent for 20 consecutive days. The recovery rate rose to 95.26 percent in last 24 hours, with 1,32,062 recoveries recorded.Coronavirus news LIVE UpdatesIndia on Sunday reported 80,834 new COVID-19 cases, 1,32,062 discharges, and 3,303 deaths in the last 24 hours, the Union Health Ministry said.Total cases: 2,94,39,989\r\nTotal discharges: 2,80,43,446  \r\nToll: 3,70,384\r\nActive cases: 10,26,159  Coronavirus news LIVE UpdatesWith the COVID-19 situation improving in Delhi, authorities are expected to give more relaxations and allow reopening of salons and weekly markets from next week, sources claimed on Saturday. Chief Minister Arvind Kejriwal had last week announced reopening of markets, malls and Delhi Metro services among other relaxations, saying more activities would be allowed if the Covid situation continued to improve in the city.\"There is a likelihood of the Delhi government announcing more relaxations like reopening salons and weekly markets from next week. Reopening of cinema halls, gyms and allowing dining at restaurants are also under consideration,\" a source claimed.Phased reopening of Delhi had started with allowing construction and manufacturing activities from 31 May, in view of declining numbers of coronavirus cases and positivity rate.Coronavirus news LIVE UpdatesMore than 1.53 crore COVID-19 vaccine doses are still available with states and union territories and over 4 lakh more will be delivered to them within the next three days, the Union health ministry said Sunday.Over 26 crore (26,64,84,350) doses have been provided to states and UTs so far, through the Government of India (free of cost) channel and through direct state procurement category, it said.Of this, the total consumption including wastages is 25,12,66,637 doses (as per data available at 8 am Sunday), the ministry said.\"More than 1.53 crore (1,53,79,233) COVID-19 vaccine doses are still available with the states and UTs to be administered. Furthermore, 4,48,760 vaccine doses are in the pipeline and will be received by the States/UTs within the next three days,\" it said.Coronavirus news LIVE UpdatesThe Delhi government will begin COVID-19 vaccination for students enrolled in foreign universities, sportspersons, as well as people travelling abroad for work in a special drive starting from Monday at Mandir Marg.The second dose of Covishield and Covaxin can also be administered at this center only after 28 days, said deputy chief minister Manish Sisodia.विदेश जाने वाले छात्रों, खिलाड़ियों, नौकरी पर जाने वाले व्यक्तियों आदि के लिए विशेष वैक्सीनेशन केंद्र कल से मंदिर मार्ग पर शुरू हो रहा है. इस केंद्र पर कोविशील्ड वैक्सीन की दूसरी डोज़ भी केवल 28 दिन बाद लगवाई जा सकती है. pic.twitter.com/moZBDJtQW7Coronavirus news LIVE UpdatesBritish Prime Minister Boris Johnson said the Group of Seven wealthy nations have pledged over 1 billion coronavirus vaccine doses for poorer nations. Speaking at the end of a G-7 leaders' summit in southwest England on Sunday, Johnson said the doses would come both directly and through the international COVAX programme.The commitment falls far short of the 11 billion doses the World Health Organisation said is needed to vaccinate at least 70% of the world's population and truly end the pandemic.Coronavirus news LIVE UpdatesRussian COVID-19 vaccine Sputnik V is likely to be available in Delhi from next week at Indraprastha Apollo Hospital, with the tentative roll-out date scheduled for 15 June.The first phase of the Sputnik V roll-out by Apollo Hospitals and Dr Reddy’s Laboratories had started on a pilot basis on 17 May in Hyderabad and on 18 May in Vishakhapatnam.An Apollo Delhi spokesperson stated that they are expecting that the programme will begin on Tuesday 15 June, but can only be finalised when the consignment arrives, expected on Monday evening.Coronavirus news LIVE UpdatesCoronavirus news LIVE UpdatesCoronavirus news LIVE UpdatesCoronavirus news LIVE UpdatesGuidelines on COVID-19 containment in Jammu and Kashmir notified on 29 May, will continue to remain in force till further orders, according to an official order. However, some relaxations have been allowed in eight districts ( Poonch, Reasi, Ramban, Doda, Shopian, Kulgam, Ganderbal and Bandipora) -barber shops, salons and parlours, standalone shops, outdoor bazaars and shopping complexes  permitted to open on all days except weekend; all government and private offices allowed to re-open without any restrictions subject to strict adherence to COVID appropriate behaviour. Lastly, wholesale trade of liquor will be allowed in the entire UT on all days except Saturday and Sunday.Guidelines on #COVID containment in UT notified on 29 May, will continue to remain in force till further orders. Relaxations granted to few activities in 8 dists-Poonch, Reasi, Ramban, Doda, Shopian, Kulgam, Ganderbal & Bandipora on significant improvements: Jammu & Kashmir Govt pic.twitter.com/cuCBRb5qFNCoronavirus news LIVE UpdatesThe International Monetary Fund managing director says there's a moral imperative for the world's richest countries to back programmes to end the COVID-19 pandemic but the donation of excess vaccines is only the first step. Kristalina Georgieva's comments in a virtual press conference at the Group of Seven summit Sunday came after UK Prime Minister Boris Johnson said he hoped G-7 leaders would agree to provide at least 1 billion vaccine doses for poorer countries. Humanitarian groups have welcomed the donations, but are calling for money, increased production and logistical support to help developing countries where the virus is still raging.APCoronavirus news LIVE Updates Coronavirus news LATEST Updates: Over 26 crore doses have been provided to states and UTs so far, through the Government of India channel and through direct state procurement category, the health ministry said.The first phase of the Sputnik V roll-out by Apollo Hospitals and Dr Reddy’s Laboratories had started on a pilot basis on 17 May in Hyderabad and on 18 May in Vishakhapatnam.An Apollo Delhi spokesperson stated that they are expecting that the programme will begin on Tuesday 15 June, but can only be finalised when the consignment arrives, expected on Monday evening.Kerala reported 11,584 new cases of COVID-19 and 206 related deaths on Saturday. With this, the total affected so far in the State to 26,98,214 and the toll of fatalities to 11,181. State health minister Veena George said 94,677 samples were tested in the last 24 hours and the test positivity rate was 12.24 percent.\nGuidelines on COVID-19 containment in Jammu and Kashmir notified on 29 May, will continue to remain in force till further orders, according to an official order.However, some relaxations have been allowed in eight districts ( Poonch, Reasi, Ramban, Doda, Shopian, Kulgam, Ganderbal and Bandipora) -barber shops, salons and parlours, standalone shops, outdoor bazaars and shopping complexes permitted to open on all days except weekend; all government and private offices allowed to re-open without any restrictions subject to strict adherence to COVID appropriate behaviour.Jharkhand on Sunday did not report any fresh coronavirus death for the first time during the ongoing second wave of the COVID-19 pandemic, but 239 new cases pushed the state's tally to 3,43,304, a health bulletin said. East Singhbhum district registered the highest number of new cases at 51, followed by 27 in Ranchi and 23 in Hazaribag, it said.Delhi records 255 new COVID-19 cases, 376 recoveries and 23 deaths in the last 24 hours, taking the total number of cases to 14,31,139, toll to 24,823 and recoveries to 14,02,850, according to a health bulletin. The National Capital now has 3,466 active cases.The Assam government on Sunday instructed all its employees who have recieved both the doses of COVID-19 vaccine to attend office from Monday, 14 June.All COVID-19 protocols are to be strictly followed, the government added in its order.At least 65 children have tested positive for coronavirus in Osmanabad district of Maharashtra over the last four days, as per the data shared by the district civil hospital. As per the data, the COVID-19 positivity rate and fatality rate are falling in the Osmanabad district but COVID-19 patients in the age group of 0 to 18 years are found in the district for the first time.Out of the 119 patients found in the district on 9 June, 25 were children between the age group of 0 and 18. Of the 109 patients found on 10 June, 19 were children. On 11 June, 123 infections were detected, of whom 21 were children. This shows that on an average 18 percent of children tested positive. However, no child suffering from coronavirus in the district has died, as per the data shared by authorities.Over 26 crore Covid vaccine doses doses provided to states/UTs so far. More than 1.53 crore doses are still available with the states/UTs to be administered. Additionally, more than 4 lakh vaccine doses are in the pipeline and will be received by the states/UTs within the next 3 days, says Union government.Arvind Kejriwal said religious places will be opened in Delhi but no visitors will be allowed.\"Weekly market allowed but only one market per zone. Weddings are not allowed in public places like banquet halls or hotels, only at the court or in homes with not more than 20 people. Only 20 people allowed at funerals.\"50 percent capacity allowed in Delhi Metro as well as buses. In autos, e-rickshaws, or taxis, not more than 2 passengers allowed to ensure social distancing,\" he added.Delhi chief minister Arvind Kejriwal announced new relaxations in lockdown restrictions in the National Capital on Sunday.\"After 5 am tomorrow, all activities will be allowed except some activities that will be prohibited and some activities that will be done in a restricted manner. A detailed order will be issued,\" Kejriwal said in a press briefing on Sunday.News18 reported that schools, colleges, educational institutes will remain shut; sports, religious gatherings will not be allowed and swimming pools, sports complex, multiplexes will remain closed.The Indian Council of Medical Research (IMCR) said that a total of 37,81,32,474 samples have been tested for COVID-19 up to 12 June, 2021.Of these, 19,00,312 samples were tested on Saturday.Active cases have decreased by 54,531 in the last 24 hours to take the tally to 10,26,159. Recoveries have been outnumbering the daily new cases for the 31st consecutive day now.With 80,834 new COVID-19 cases on Sunday, India reported its lowest daily figure in the last 71 days, the Centre said.The daily positivity rate is at 4.25 percent, which is less than 10 percent for 20 consecutive days. The recovery rate rose to 95.26 percent in last 24 hours, with 1,32,062 recoveries recorded.India on Sunday reported 80,834 new COVID-19 cases, 1,32,062 discharges, and 3,303 deaths in the last 24 hours, the Union Health Ministry said.Total cases: 2,94,39,989\nTotal discharges: 2,80,43,446\nToll: 3,70,384\nActive cases: 10,26,159The Congress on Saturday accused the BJP of hiding coronavirus deaths in Madhya Pradesh, Uttar Pradesh and Gujarat and demanded the resignation of the states' chief ministers as well as a judicial inquiry to ascertain the actual Covid figures of the country.Congress spokesperson Pawan Khera alleged that the BJP governments in Uttar Pradesh, Madhya Pradesh and Gujarat have been found to be hiding data and the chief ministers of these states have no moral right to continue in their positions.His remarks came after media reports claimed that over 1.7 lakh deaths had taken place in Madhya Pradesh in May, but the state government data reported much less.\"We demand an independent judicial inquiry across all these states in India in the number of Covid deaths,\" he told an online press conference.\"We demand that chief ministers of these states must resign now; they have no moral right to continue in their positions. Their hands are red, as they are responsible, one way or the other, for these deaths. They are responsible for not just the deaths, but also for denying dignity after death by hiding this data,\" he said.Congress chief spokesperson Randeep Surjewala said, Only in May, 1,70,000 deaths in Madhya Pradesh. What was never heard and not seen, and now the truth is before us.\"The deaths in May (in the state) are equal to the deaths reported in six months. Has human life become so cheap? Has our soul died? The prime minister and chief minister should come forward and say who is responsible, he tweeted tagging a media report.Khera also cited difference in data given by the governments of Madhya Pradesh, Uttar Pradesh and Gujarat, and that of crematoriums and burial grounds in these states.The Congress leader said this is not just statistics or mere data, but people, these are sons, daughters, parents, husbands, wives, brothers, sisters.\"For God's sake, have some heart, Mr Modi (Prime Minister Narendra Modi),\" he said while demanding the inquiry. Khera alleged that the present government at the Centre considers data as its enemy.\"It considers truth which comes out through data as 'enemy, number one'. It fights with data. It tries to defeat data,\" he alleged.The spokesperson also alleged that one has seen how in Parliament whenever questions are asked and uncomfortable statistics have to be laid on the table, \"this government and this alliance called the NDA (National Democratic Alliance) becomes a 'No Data Available' alliance.\"The Congress leader said it is also for jobs, the economy and human lives. Concealing data on deaths is not only a crime, but also a sin, he said.\"Let's not reduce human lives to mere statistics. We are talking about deaths due to accidents, due to pandemic, people will say - look, don't reduce it to mere statistics, Khera said.\"Under this new India of Mr Modi, the importance given to human life has gone down so much that it is not even mere statistics any more.These deaths will not even be counted in statistics any more, which is a most unfortunate thing, we have witnessed through this pandemic,\" he said.The Congress has been accusing the governments of Gujarat, Uttar Pradesh and Madhya Pradesh of suppressing Covid death data.Khera alleged that in Gujarat, between April 10 and May 9, government data showed 3,578 deaths across the state.But, if one sees the death records of one civil hospital in Ahmedabad as many as 3,416 people died in the same period in just one hospital and 1,23,000 death certificates were issued across 33 districts and eight municipal corporations of Gujarat from March 1 to May 10, he claimed.This is 58,000 more than last year's period -- March 1 to May 10 -- and this cannot be natural, Khera alleged.\"If 58,000 more death certificates are being issued, questions will be asked, answers will be demanded, accountability will be sought,\" he said.In Madhya Pradesh too, he alleged record registers from mukti dhams and from cremation grounds are being taken away or hidden.Khera claimed that if one compares deaths from last year to this year, the gap is astounding, as between January and May last year, the number of deaths this year has increased by 1,90,000.\"What explains this increase, what explains the fact that the government doesn't want this data to come out,\" he asked.\nHe made similar claims about Uttar Pradesh.One has seen horrifying visuals of how the government was trying to erect view cutters in Lucknow, so that people don't take videos or pictures of extra ordinarily high number of cremations taking place, Khera said.\"We have seen visuals of bodies floating in rivers. We have seen visuals of river beds, those visuals don't let us sleep,\" he said.\n                Updated Date:\n                \n                    June 13, 2021 21:02:54 IST\n                \n\n                        TAGS:\n                    \n                Coronavirus Live News Updates: The CM also reviewed the status of paediatric ICUs, which are being set up at various government hospitals, and functioning of 13 oxygen plants in the state\n            \n                The daily COVID-19 count in India remained below the one-lakh mark for the fifth consecutive day with the country reporting 84,332 fresh cases, its lowest in 70 days, according to data updated by the Union Health Ministry on Saturday.\n\n            \n                Coronavirus news LIVE Updates: Mumbai reported 733 new cases, taking the total number of infections to 7,15,879 while the toll 15,164 reached with 18 more deaths\n\n\n\n\n\n            Sign up for a weekly curated briefing of the most important strategic affairs stories from across the world.FirstpostSectionPlusToolsAppsNetwork18 sites Copyright © 2021. Firstpost - All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.firstpost.com/india/coronavirus-live-updates-covid-cases-vaccine-lockdown-latest-news-13-june-9711741.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}