{"Type": "CNA Insider", "Time": "2021-06-14", "Headline": "They grieved when their baby was born blind. Now they see a world of possibilities for him", "Text": "Eric and Wei Shi panicked at first: How could they raise Elliot to be like everyone else? Would he lag developmentally? Could he ever be rich and successful? A year on, they're using his story to inspire others.SINGAPORE: There are nine photos of baby Elliot displayed above the Koh family’s dining table. They provide a window into a time when life was very different for his parents.In one, Elliot is just out of hospital, a newborn being burped by his father. In another, he is cuddled up to his mother, warmly dressed against the spray of Jewel’s indoor waterfall. There is also one of his parents kissing him, their arms encircling him protectively.Eric, 32, and Wei Shi, 31, put the photos up one evening last July when Elliot was four months old. They were looking forward to showing them to him as he grew older.They have never got to do so. The very next day, they brought him to the doctor, suspecting a developmental delay. A day later, they found out Elliot was blind and was unlikely to ever have sight.Eric remembers both of them bursting into tears on the spot. “My wife was still listening to the doctor intently to hear his explanation and diagnosis,” he says. “I just walked out of the room and cried.“Nothing much needed to be said.”The clinic was crowded, but his world went silent when he walked out of the doctor’s office. He called his mother, broke it to her and they cried on the phone together.He was still in shock as he tried to process how it had come to this.It started with a comment from Wei Shi’s father, who had noticed Elliot seemingly having trouble tracking things with his eyes.The couple did not think much of it then. Newborns often do not see very well yet, and their son would catch up, they rationalised.But the signs kept coming. He showed no interest in the toys his grandmother placed in front of him. He did not seem to smile or look at his surroundings.And when Wei Shi brought Elliot on a play date, she noticed that her friend’s baby of the same age was curious and excited, reaching out to grab toys, while Elliot remained passive and did not lift his head.At that point, they decided to take him to a doctor, although they were still “not too worried”. But the paediatrician referred them to an ophthalmologist, who gave them the news that shook their world.It looks like the email address you entered is not valid.The couple did not exchange many words that day. But questions kept running through their minds. What could they do for Elliot? What will happen to him when they are gone?Wei Shi could not help but wonder: Had she done anything — maybe it was her diet or lifestyle — during her pregnancy or even during the delivery that could have resulted in this?But Eric made it clear that neither of them was to blame.“We can’t solve the problem just by assigning blame,” he says. “I was just focused on providing support for Elliot and Wei Shi, just to be there and give them what they need.”Elliot, now 15 months old, was eventually diagnosed with Leber congenital amaurosis, an inherited disease that causes vision loss.It affects about two to three newborns in every 100,000 births, according to the United States’ National Library of Medicine and the American Association for Paediatric Ophthalmology and Strabismus.“The doctors said it wasn’t detectable on any scan because the retinas were just so tiny. And it’s not something that was avoidable,” she added.Once I knew that, I started to think that maybe I should focus on what I can control rather than the past, which is beyond my control.A NEW FRIENDEric and Wei Shi wanted more answers to all the questions they had. Being young, modern parents, as they described themselves, they turned to Google first.They searched for the abstract, like how the blind visualise things, as well as answers as to how they could interact with and take care of Elliot.WATCH: Raising a blind baby and the lessons we've learnt from it (12:02)They joined Facebook groups for parents of children with the same disorder. While these were international groups, it was encouraging to see that the other children were growing up well.The couple also picked up useful tips on caring for Elliot, but the issue was a lack of local context. They knew his condition was rare but had still hoped that help would be readily available for blind infants in Singapore.For example, Wei Shi remembers looking for pre-schools or specialised therapies for visually impaired babies and children. But she came away disappointed.“It made me panic a little because I didn’t know better,” she says. “And if there’s nothing on the Internet, where can I find this information?”She recalls asking the doctors as much as possible about what to expect and so on. But there were times the couple were also at a loss to know what to ask, she adds.Help came from an unexpected source. As Eric sat in hospital waiting for Elliot to undergo tests, he flicked his phone’s screen and went on Reddit, which he browsed regularly. He had never made a post on the forum — but that day, he did.It was, simply: Baby born blind. Need help.The replies he got surprised and touched him. Some pointed out local resources and organisations that support the blind; others said they had visually impaired friends and were happy to share their experiences.“People were so willing to help,” he says. “They gave us more than enough resources for us to get by.”That was how they met Cheryl Yeo. An orientation and mobility specialist from Guide Dogs Singapore, the 29-year-old teaches people with visual impairment how to travel independently, and the skills they eventually need to use a guide dog.The Kohs had tried ringing up several organisations but could not get through in the post-circuit breaker period, with people still working from home. Cheryl, whose calls were rerouted to her mobile, was the first person to call them back.The conversation lasted almost two hours. The couple were anxious and, she recalls, sounded overwhelmed.“One of the big questions Eric asked was whether Elliot would be able to get a girlfriend,” she says. “It’s rather funny, but it’s actually quite a big concern because it’s about how he’s going to grow up, be like everyone else and find a job.”She told them stories about her clients, like the schools they attended, their jobs and, in answer to Eric’s question, how some of them were looking for girlfriends. “It’s just (about) showing him that it’s quite possible to be independent even though you’re growing up with vision impairment,” she says.She arranged for them to speak to some of her clients and linked them up with other organisations and services they could tap for support.It was a great comfort to the couple. “What we wanted at that point in time was just reassurance, that somebody understood what we were going through,” says Eric. “She’s been a great help.”They count her as one of their friends now. She visits them regularly, teaching them how to interact and play with Elliot, and even brings along her husband and eight-month-old baby.BRINGING UP BABYAs the months went by, the family developed their own routine. It bears similarities to those of other families with young children, but with noticeable tweaks.During breakfast, Wei Shi puts Elliot’s hand on her jaw so he can feel the chewing motion. It is to encourage him, but it is no picnic; he does not like food, and the colourful vegetables in his porridge do nothing to entice him.“In the past, I introduced exciting stuff with different textures. But it was disappointing if he didn’t eat,” she says. “Nowadays I don’t care already. I’d just throw everything into a pot to make porridge.”His play area is strewn with toys that tend to make sounds or play music. One of his favourites is a spinning toy that makes a rattling sound. There is a dinosaur whose buttons he presses to hear sounds, and a toy piano on one side of the living room.His books are heavy on texture, have buttons that play music, and one has Braille markings, passed to him from another family with a visually impaired child.Wei Shi points out, however, that his condition does not mean they cannot do visual activities like reading a book with him. The activity simply must be adapted so he can understand.“If he wasn’t visually impaired, I’d probably just point to the different pictures and tell him it’s a cow. But he won’t be able to relate to all this. So I tell him this is a book, this is how a book works, you have to flip the pages and press the button,” she cites.While there are toys that he cannot fully enjoy, such as stacking cups and animal figures, the couple make a point of letting him feel the different shapes and textures.What has met with little success, however, is an activity board filled with locks, switches and lights, known as a toddlers’ busy board. It was handmade by Eric during his wife’s pregnancy.The appeal of these toys often comes from children watching their parents use them. But Eric has not given up hope. “Perhaps when he’s 15, he’ll start getting interested,” quips the father.Each activity they plan for him is purposeful, from the nightly baby massages to help him relax before bedtime, to naming his body parts out loud as they touch each one.Like other parents, they take him out to enjoy new experiences, though the highlight of the outing may only be something like Elliot sitting on artificial grass at Jewel.It can be tiring, Wei Shi says, to plan all the activities and look after him. But his sweet smile when he crawls to her and feels her face spurs the couple on. That action is a sign of improvement too.“All the lost sleep, the time spent with him to bring him to who he is today, is totally worth it,” she says.HIS BIGGEST ACHIEVEMENTEric and Wei Shi learnt from the start that being blind meant Elliot would have no visual motivation to lift his head and reach forward, which would result in other developmental delays, such as in standing and even crawling.So sometimes they cannot imagine he has come this far.Crawling is a difficult milestone to achieve, says Wei Shi. Besides the lack of visual motivation, there is the fear of moving head-first into an unfamiliar, dark space. And many visually impaired babies would skip this stage.Getting the hang of it was not easy for Elliot. It took months of effort, professional therapy and his parents’ perseverance with shaking a rattle in front of him to encourage him before he began making tentative movements forward.“I would’ve been okay if he’d skipped crawling altogether. I thought it was just good exercise for him,” says Wei Shi. “But one fine day, he just pushed up and started crawling.“I was really, really proud of him.”Their pride grows when they see him exploring the house by himself, even the corners he had not explored before, or moving across the living room to get closer to the sound of nursery rhymes from the television.He now goes for physiotherapy, speech therapy and occupational therapy about once a month at KK Women’s and Children’s Hospital. And they have high hopes for him once again.“Nobody wants their kid to be lousy,” says Eric. “Like any other Singaporean parent, our initial thought was for our baby to be rich, successful and happy with what he does.”While that changed when they discovered Elliot’s condition, they have come to understand over the months that he can achieve as much as a sighted person.“Our expectations shouldn’t be (lowered) from … ‘I want my kid to be successful’ to ‘okay, just be independent,’” says Eric. “You just have to realise that he’ll have to reach these targets in a different way.”Dealing with reactions from others, however, is still a work in progress.Eric was recently reminded of an incident when Elliot was about six months old and was wearing baby spectacles that stopped him pressing his eyes, a tendency among visually impaired children that could result in sunken eyes, notes Wei Shi.He was in a baby carrier with Eric, who was picking up breakfast for the family, and on that one trip, at least three people stopped to ask about the spectacles.“I just got annoyed and walked away,” recalls Eric, who also felt sad. “At that point in time, we’d accepted it … but it’s generally not so easy to just start telling people and open up about it.”Last month, when Elliot received his first cane — a blue, child-sized one — the emotions hit home again.“We’re not ashamed of him. And we know that the best thing to do is to get him used to walking with a cane so he can be independent as soon as possible,” says Eric.“But when people can easily tell he’s visually impaired … I don’t feel I’m ready to go out there and explain yet.”RAISING AWARENESSWei Shi says that before her son came along, she had never interacted closely with a visually impaired person, let alone be friends with one. In parenting Elliot, she and Eric have grown more socially aware.They began noticing little things that could help a blind person to navigate through society. Not all public buses and traffic lights, for example, have audio cues. Even escalators could provide auditory cues for approaching users to inform them of the direction, cites Eric.Pre-school education is also a challenge. The couple began approaching schools a year ahead of their son turning 18 months old. Out of “more than 10 schools”, most rejected them, despite the Kohs’ offer to bring in a vision therapist to guide the teachers on how to work with Elliot.“The reason they gave is along the lines of … ‘we’re afraid we don’t know how to take care of the baby properly,’” he says.“I understand this from their perspective … Liability is something no company would want to have. But we just wanted them to be a little more understanding and inclusive.”Eventually, they found a school willing to help them.“Compared to 10 years ago, when there was less awareness of the needs of the special needs community, today’s society has made great progress,” he adds. “But obviously, as a parent, I hope more can be done.”Wei Shi is doing her part with an Instagram account she created in September to document Elliot’s developmental milestones and the various ways she helps him learn.The account, @blindandshine, has more than 1,500 followers. She has also attracted some collaborations with brands. “I don’t want any other pair of parents to feel the helplessness that we felt should the same thing happen to them,” she says.She can also advocate for Elliot at a pragmatic level, for example after he received three sets of Braille blocks for Christmas. These well-intentioned gifts were the likely result of a Google search for “Braille toys”, she says.“(But) people have the misunderstanding that maybe he can’t play with normal toys,” Wei Shi adds. “He can, just maybe he needs adaptations.”She knew, however, where they were coming from — she had once been in their shoes. “I had preconceived thoughts, not because I’m an elitist but simply because of a lack of awareness. And nobody told me these things,” she says.LOVE IS BLINDThe change the couple have undergone in their lives in the past year has been both unexpected and dramatic. Every month, however, they still take a family photo, their camera set up on a tripod as they coax Elliot to face forward.“He always looks down,” says Wei Shi. “It’s not meaningful for him because he doesn’t know why we’re pausing.”But each photo is lovingly saved, not so much for him to enjoy in future but for his parents to look back on as he grows.Just visible in the background of one of the photos on their wall is a pegboard with the words “Today’s brew”, mimicking the look of a cafe.Today, the board stands on the television console, unmissable as one enters their home — and it reads “Love’s blind”. Because the love within the family, as Wei Shi says, comes from the heart rather than by sight.They still grieve over what could have been, but it is not a case of “Oh, we’re so sad”, says Eric.“We didn’t know this was going to happen. But looking at his growth and happiness, we’re just as happy taking care of him as any other parent would be of their child.”To mark each milestone in Elliot’s life, such as his first birthday or when he got his first cane, Eric also takes out a recorder and documents the moment with his voice.“Today, people will know your story, and you’ll inspire many people,” Eric talks away into the recorder. “You want to be an influencer and earn money? Be a politician? Also can.”", "Section": "", "Writers": "", "MainKeyWord": "special needs,CNA Insider", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/cnainsider/grieved-when-baby-born-blind-visually-impaired-world-possibility-15002458", "Source": "google"}