{"Type": "Asia", "Time": "2021-06-14", "Headline": "French nuclear firm seeks to resolve 'performance issue' at China plant", "Text": "GUANGZHOU: A French nuclear firm said on Monday (Jun 14) that it was working to resolve a \"performance issue\" at a plant it part-owns in China's southern Guangdong province following a United States media report of a potential leak there.CNN reported earlier that the US government is assessing a report of a leak at the Taishan Nuclear Power Plant after the French company, Framatome, warned of an \"imminent radiological threat\".Framatome said in a statement to AFP that it is \"supporting resolution of a performance issue\" at the plant.\"According to the data available, the plant is operating within the safety parameters,\" the company said.\"Our team is working with relevant experts to assess the situation and propose solutions to address any potential issue.\"Citing a letter from Framatome to the US energy department, CNN said that the warning included an accusation that the Chinese safety authority was raising the acceptable limits for radiation outside the facility in order to avoid having to shut it down.The operator of the power station, state-owned China General Nuclear Power Group, said in a statement on Sunday evening that \"the environmental indicators of Taishan Nuclear Power Plant and its surroundings are normal\".It did not reference any leak or incident at the power station, which it said meets \"the requirements of nuclear safety regulations and power plant technical specifications.\"AFP did not get any immediate responses to requests for comment from the Chinese foreign ministry or the Chinese nuclear power group.EPR REACTORSPowered up in 2018, the Taishan plant was the first worldwide to operate a next-generation EPR nuclear reactor, a pressurised water design that has been subject to years of delays in similar European projects in Britain, France and Finland.EPR reactors have been touted as promising advances in safety and efficiency over conventional reactors while producing less waste.Nuclear plants supplied less than 5 per cent of China's annual electricity needs in 2019, according to the National Energy Administration, but this share is expected to grow as Beijing attempts to become carbon neutral by 2060.China has 47 nuclear plants with a total generation capacity of 48.75 million kilowatts - the world's third-highest after the United States and France - and has invested billions of dollars to develop its nuclear energy sector.Last month, Russian President Vladimir Putin and his Chinese counterpart Xi Jinping hailed close ties between their countries as they launched work on Russian-built nuclear power plants in China.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "China,France,Framatome,nuclear power", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/french-nuclear-firm-performance-issue-china-framatome-taishan-15011522", "Source": "google"}