{"Type": "Singapore", "Time": "2021-06-14", "Headline": "Singapore firm that developed COVID-19 breath test pivoted from detecting lung cancer to coronavirus", "Text": "SINGAPORE: When COVID-19 hit Singapore early last year, local start-up Breathonix had to stop all its clinical trials for its lung cancer breathalyser test due to pandemic restrictions.The company's CEO Dr Jia Zhunan had been working on a way to detect disease from a person's breath since her days as a doctoral student.But although tests for lung cancer detection had to stop, the firm soon found a new purpose - a breath test for COVID-19.It was a \"natural\" switch because no other clinical trials were allowed at the time, and there was a lot of interest in a quick way to detect the highly infectious coronavirus, said Breathonix's business development and strategy head Wayne Wee.\"The technology, the hardware, even the know-how is the same,\" the 26-year-old told CNA. \"It's just collecting a different set of data.\"On May 24, Breathonix announced that its COVID-19 breath analysis system was the first to secure provisional authorisation in Singapore.This came a week before Prime Minister Lee Hsien Loong said in anational addressthat COVID-19 testing must be done “faster, and more liberally and extensively”.Many different tests have become available, such as antigen rapid tests (ART), saliva tests and breathalysers, Mr Lee noted then, adding that DIY tests will also be sold at pharmacies.TRIALS SPEEDED UPBreathonix is supported by the National University of Singapore’s (NUS) Graduate Research Innovation Programme.Around mid-2020, the company started a small study with the National Centre of Infectious Diseases (NCID), and the accuracy was high enough for them to expand it to a larger trial.As with many innovations linked to COVID-19, what might have taken three years or more was then compressed into one year - with clinical trials and regulatory approvals speeded up.And the firm did it all on a budget of less than S$1 million, said Mr Wee.\"It was quite a steep learning curve for us - (as it was our) first time doing all these things ... we tried to seek consulting help from NUS. And if that's not enough, we had to source for or hire some experts to join the team,\" he added.They also had a lot of help from stakeholders like the Ministry of Health and NCID, said Mr Wee.Rather than having a swab thrust up your nose, a COVID-19 test using the company's BreFence Go COVID-19 breath test system takes just one breath.The exhaled breath then passes into a mass spectrometer, and the breath is analysed for volatile organic compounds (VOC) or biomarkers that indicate COVID-19 infection.The trick, says Mr Wee, is to figure out what VOCs to look for and what to ignore. For example, smokers or people who have consumed alcohol would emit certain VOCs, which the analysis would omit.It currently has an accuracy of 85.7 per cent sensitivity and 97 per cent specificity - correctly identifying those without the disease. Clinical trials are ongoing with an algorithm with artificial intelligence to further improve accuracy.The World Health Organization (WHO) recommends a sensitivity of 80 per cent and specificity of 97 per cent for rapid antigen tests (ART), while the gold standard for COVID-19 tests remains the polymerase chain reaction or PCR test.Both ART and PCR tests require nasal swabs. While ART tests can produce results in 30 minutes, it may take a day for PCR tests.\"LESS THAN A SECOND TO PROCESS\"According to Mr Wee, their breath test takes only 40 to 60 seconds, which eliminates the need for a holding area while people wait for test results.\"Once we capture the data from the breath, the analysis of our own algorithm takes less than a second to process ... We are able to give the results in real-time to the person on the spot,\" he said.\"If you're tested negative, you are cleared to go ... If you're tested positive, you will be redirected to take the PCR test and then you'll be isolated or quarantined.\"Another advantage is that the test can be conducted by trained non-medical staff members.A pilot deployment at Tuas Checkpoint started on May 31 and is still ongoing. The machine is placed at different locations at the checkpoint to see if it is suited for use in such an environment.For example, the team thought that strong winds or car fumes may affect the test results, but the performance so far has been \"quite promising\", said Mr Wee.Beyond Singapore, Breathonix is looking at other countries, including Malaysia and Vietnam, for more trials. It has already conducted trials at Changi Airport, as well as in Dubai, and are seeking approval in the United Arab Emirates.It hopes to get full approval from Singapore's Health Sciences Authority by the end of the year.Each test costs US$5 to US$20, depending on the volume of the deployment, which is much cheaper than PCR tests, said Mr Wee.It is thus useful for venues with high traffic like large events, schools, worker dormitories or workplaces where routine testing is done.\"Our bigger vision is really to make breath tests (an) annual screening tool for every single individual,\" said Mr Wee.\"On top of doing a blood test and other tests, you also do a breath test, where we are able to detect and identify if you are at risk of any disease ... such as lung cancer, nose cancer, tuberculosis, maybe even flu.\"Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,science", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/covid-19-breath-test-breathonix-nus-singapore-lung-cancer-14971406", "Source": "google"}