{"Type": "Singapore", "Time": "2021-06-14", "Headline": "PA cancels meeting with couple whose photo was used as standee, denies incident was racist", "Text": "SINGAPORE: The People's Association (PA) has cancelled a meeting with a couple whose wedding photo was used as a cut-out standee without their permission, saying that there was \"no point\" in proceeding with it after comments she made on social media.The meeting with Ms Sarah Bagharib and her husband Razif Abdullah was set up to offer them an in-person apology over the incident, said the PA in a Facebook post on Monday (Jun 14). A photo from their wedding in 2017 was recently used as part of Hari Raya decorations at a Tiong Bahru estate in Radin Mas constituency.\"We also wished to clarify our position, elaborate on the steps we have taken to prevent such incidents from recurring, and hear her suggestions of how we might improve at the meeting,\" said the PA in its statement on Facebook.However, the PA said that Ms Sarah had made a public call in her social media posts to \"please share your messages/suggestions to PA here and we’ll share them\".\"We find this odd. We do not see why our meeting should be appropriated as a platform for her to funnel the views and comments of persons unrelated to the incident,\" the PA said.\"All these lead us to believe her purpose in agreeing to meet with us has gone far beyond the Radin Mas incident. We therefore see no point in proceeding with the meeting.\"ALLEGATIONS OF RACISMThe PA had publicly apologised to the couple on May 29 and removed the standee. It also said: \"We will take steps to guide and help our staff and, as far as possible, external vendors as well, to be more culturally-attuned and sensitive.\"Ms Sarah posted a response to PA's apology on Jun 1, saying that there are \"glaring gaps that indicate a very superficial understanding of the gravity of the issue\". This was not just about copyright infringement, but there was a \"larger issue affecting the wider Malay/Muslim community\", she said.\"It is unfortunate that a government body that was established to build and bridge communities in achieving one people, one Singapore is required to still 'guide and help (its) staff ... to be more culturally-attuned and sensitive' 61 years after inception,\" she wrote in the post.Ms Sarah also referenced the incident in a few Instagram stories, which the PA responded to in its statement on Monday.Referring to an Instagram story re-posted by Ms Sarah on Jun 11, the PA said Ms Sarah had shared claims by another user that the incident perpetuates \"racist culture\".The PA also said that Ms Sarah characterised the standee incident as “racist” by lumping it with \"other racist attacks and incidents\" in one of her posts, and that she \"insinuated\" in an interview with Assistant Professor Walid Jumblatt Abdullah that the PA's staff and volunteers did not find anything wrong with the standee as they might be “blind to racism”.The assistant professor is from Nanyang Technological University's School of Social Sciences, with research areas that include religion and politics.During the interview on Jun 7, Ms Sarah noted that the Hari Raya light-up event featuring the standee was attended by MP Melvin Yong. She wondered if Mr Yong saw the standee and what he thought about it, saying: \"If he did and he didn't say anything about it, then something is definitely wrong.\"\"There was a comment there as well about internalised racism,\" she added. \"We've been so conditioned to think that this is a certain way ... there's nothing wrong with this because you know people that are colourblind, I guess, or blind to racism at play or there's nothing wrong because it doesn't impact them.\"PA REJECTS ACCUSATIONSOn Monday, the PA said it rejects those accusations.\"While the error was culturally insensitive, it was certainly not racist. It is not right to raise the allegation of racism, without basis, to stoke emotions and sentiments,\" it added.CNA has contacted Ms Sarah for her reaction to the PA's comments.The PA also said that its grassroots organisations such as the Malay Activity Executive Committees Council (MESRA) and the Indian Activity Executive Committees Council (Narpani Pearavai) play a key role in representing the interests of the Malay and Indian communities.\"We regularly reach out to numerous community partners among all our races and religions to ensure that their concerns are actively considered when designing our programmes,\" it added.What happened with the standee at Radin Mas was an \"isolated incident\", said the PA, adding that it showed nonetheless that the organisation \"can fall short\".\"We agree it is important for our staff and volunteers to be sensitive to and knowledgeable about the cultures of all our ethnic groups.  We are now looking at establishing a resource panel to guide and advise our staff on cultural matters.\"We will also step up training efforts to enhance staff and volunteers' understanding and appreciation of our different cultures. Singaporeans becoming 'one people' is a work in progress – and so is the PA.\"It further refuted Ms Sarah's point that it was “hasty in sharing the name of the vendor” in order to “distance and deflect blame”.\"This is untrue,\" said the PA on Monday. \"The vendor had identified himself directly to Ms Sarah on May 28 and apologised. This was before PA issued our statement on May 29.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "People's Association", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/pa-cancels-meeting-couple-standee-wedding-photo-hari-raya-15011776", "Source": "google"}