{"Type": "", "Time": "2021-06-14", "Headline": "Football: Netherlands edge out Ukraine in five-goal Euro thriller, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.AMSTERDAM (AFP) - Denzel Dumfries scored a dramatic late winner as the Netherlands marked their long-awaited return to a major tournament with a 3-2 victory over Ukraine in a remarkable Euro 2020 game in Amsterdam on Sunday (June 13).Dumfries, the PSV Eindhoven full-back, headed in a cross from substitute Nathan Ake to complete a madcap second half after the home side eased into a two-goal lead and then threw it away.Captain Georginio Wijnaldum and Wout Weghorst both scored before the hour mark in front a raucous crowd at the Johan Cruyff Arena, only for Ukraine to silence the home supporters as Andriy Yarmolenko and Roman Yaremchuk netted to briefly restore parity.Frank de Boer’s side got there in the end and the victory will provide a major lift to the Netherlands after what was their first game at a major competition in seven years.They will now hope to build on it on Thursday against Austria, who beat North Macedonia earlier in Bucharest in the same Group C.It was a brilliant game, and a crowd of around 16,000 created an atmosphere fit for the occasion at the home of Ajax, where supporters held up banners with messages of support for Christian Eriksen following the Denmark star’s cardiac arrest on Saturday.Eriksen made his name at Ajax before moving to Tottenham Hotspur in 2013.After failing to qualify for Euro 2016 or the 2018 World Cup in Russia, the Netherlands were playing their first game at a major competition since beating hosts Brazil 3-0 to claim third place at the 2014 World Cup.They had not won a game at a Euro in almost exactly 13 years, since Klaas-Jan Huntelaar and Robin van Persie netted in a 2-0 win over Romania at Euro 2008.The emergence of the likes of Frenkie de Jong and Matthijs de Ligt has given supporters of the Oranje new hope for the future.Those supporters were in fine spirits ahead of the game, bedecked in orange as they filled the bars around the ground in the blazing sunshine, thoughts of the pandemic appearing far away.Yet Dutch optimism has been tempered by selection problems facing coach De Boer.Juventus defender De Ligt watched this game from the stand as he recovers from a groin injury, his absence added to that of fellow centre-back star Virgil van Dijk who is absent from the tournament with the serious knee injury that cut short his season with Liverpool.Manchester United’s Donny van de Beek withdrew from the squad because of injury and first-choice goalkeeper Jasper Cillessen was left out altogether after testing positive for Covid-19.De Boer has switched to a 3-5-2 formation and he has real stars in Barcelona midfielder Frenkie de Jong as well as Memphis Depay up front.The system has helped Wijnaldum – who will join Paris Saint-Germain from Liverpool after the Euro – develop into a real goal-scoring threat from midfield while Dumfries was a constant threat down the right flank.He should have scored late in the first half when he contrived to put a free header wide, after Ukraine goalkeeper Georgiy Bushchan had produced a fine save to keep out a deflected Wijnaldum volley.The hosts got their reward shortly after the restart when Bushchan turned a dangerous low ball into the box by Dumfries out into the path of Wijnaldum who fired home.Weghorst then lashed in a loose ball that came to him following more havoc wrought by Dumfries, and the Netherlands seemed to be on easy street.Maarten Stekelenburg, at 38 the oldest player ever to represent the Netherlands at a major tournament, had not had much to do but then he was beaten in the 75th minute by a brilliant curling strike from Yarmolenko, the West Ham United winger.Yaremchuk then headed in a Ruslan Malinovskyi free-kick and Ukraine – whose build-up to the tournament was overshadowed by a row about patriotic slogans on their shirt which upset Russia – looked set to leave with a draw, but then Dumfries appeared.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-netherlands-edge-out-ukraine-in-five-goal-euro-thriller", "Source": "google"}