{"Type": "", "Time": "2021-06-14", "Headline": "England players booed for taking a knee despite plea by team - Japan Today", "Text": "\nJapanToday\nHigashi-Azabu IS bldg, 4F\n\t\t\t\t\t1-8-1 Higashi-Azabu\n\t\t\t\t\tMinato-ku\n\t\t\t\t\tTokyo 106-0044\n\t\t\t\t\tJapan\n\t\t\t\t\tTel: +81 3 5561 7755\n\t\t\t\t\tFax: +81 3 5561 7756\nEmail: editor@japantoday.com\n©2021 GPlusMedia Inc.\nSections of fans at Wembley Stadium booed England players for taking a knee before the European Championship game against Croatia on Sunday.The boos, which could be heard over those fans applauding, came despite pleas from the team to respect the anti-racism gesture. Croatia’s players did not take a knee as expected ahead of the Group D game, which England won 1-0.“Everybody should cheer for England,” British Prime Minister Boris Johnson said a short time later at the G7 Summit, while not saying if he would take a knee if he was a player.Some England fans claim taking a knee is a political act but the English Football Association said again ahead of the team's opening Euro 2020 match that the gesture is important to them and should be respected. There had been booing at England's two warmup games for the tournament that were played in Middlesbrough.“They are doing this as a mechanism of peacefully protesting against discrimination, injustice and inequality,\" the FA said in a statement to fans. \"This is personally important to the players and the values the team collectively represents. This gesture of unity and fighting against inequality can be traced back as far as the 18th century.“It is not new, and English football has made it very clear that it does not view this as being aligned to a political organisation or ideology. There can be no doubt as to why the players are taking the knee and what it represents in a footballing context.”The jeering was by some fans who also chanted “No surrender” during the national anthem. That’s a dated reference to the conflict endured for generations that saw Britain hit by terrorist attacks from the Irish Republic Army.Croatia's national anthem was also booed by some of the 22,500 fans allowed into Wembley, which could lead to the country's soccer association being fined by UEFA.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberCroatia's national anthem was also booed by some of the 22,500 fans allowed into WembleyThat is generous.  I could hardly hear that anthem over the booing.  May have been the coverage though, and different at the match. Good on the England players for drawing attention to a cause that has meaning for them.Get Politics out of sport.  Just play the game.The boos were drowned out by most of the fans applauding. Great match, England were great.Well they were booing because the knee taking means nothing.I stand with Wilfred Zaha on that issue.What do we expect with one of the most reactionary right-wing governments ever?They took the knee and Sterling took the boot!LudditeToday  07:56 am JSTThe boos were drowned out by most of the fans applauding.Yes, that's what I heard on my TV. A timely reminder that the EDL/BNP/UKIP knuckle draggers are a small minority. MickeliciousToday  08:29 am JSTWhat do we expect with one of the most reactionary right-wing governments ever?Every time this topic is raised with Lying Johnson I expect him to say, \"Gosh. Look, yes. Jolly good. Fine people on both sides. Certainly. I think.\"LudditeToday  07:56 am JSTGreat match, England were great.There were indeed. Raheem awoke from his lengthy slumber to score the winner, Kalvin Philips bossed the midfield, Mount was terrific and the Stockport Iniesta hit the post. Even Pickford looked comfortable! The Scotland game should be a cracker.Good for the players supporting efforts to stop racism. The irony is, it was a Black man - Sterling - who won the game for England. I bet a lot of the thousands of racist scum who were booing, cheered when that Black man scored. Hypocrites.Get Politics out of sport. Just play the game.I agree with this.Let's get politics out of work in general, unless of course our work is concerned with politics.Let's be professionals.What do we expect with one of the most reactionary right-wing governments ever?Feed working class fans a diet of chip butties, larger and late night curries, what do you expect?That is generous. I could hardly hear that anthem over the booing.England fans have been booing the opponent's national anthem for as long as I can remember despite calls from almost every England manager for them to stop. I can think of no nation that does it. It's pretty shameful, some basic respect should be shown, even when we play the Argies. I also think it must give the other team a bit of a lift, makes them eager to shut us up.Use your Facebook account to login or register with JapanToday. By doing so, you will also receive an email inviting you to receive our news alerts.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberA mix of what's trending on our other sites\n\t\t\t\t\tGaijinPot Travel\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t", "Section": "", "Writers": "", "URL": "https://japantoday.com/category/sports/england-players-booed-for-taking-a-knee-despite-plea-by-team", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}