{"Type": "", "Time": "2021-06-14", "Headline": "South Korea eases Covid-19 restrictions on concerts, sports events, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SEOUL (REUTERS) - South Korea began easing restrictions on large concerts and sports events on Monday (June 14) after announcing last week that it would loosen a series of coronavirus curbs as the country pushes ahead with its vaccination drive.Up to 4,000 people will be allowed to attend K-pop concerts and other cultural shows from Monday, up massively from a capacity limit of below 100 people since late last year, according to measures announced by health officials last Friday.Sports stadiums will be able to operate at a 30 per cent to 50 per cent capacity, depending on the districts, up from 10 per cent previously.While South Korea has fought small clusters of Covid-19 infections in recent months, the daily infection number hit a two-month low on Sunday while the government has pushed through with its vaccination drive.The government has also said it would loosen some quarantine restrictions for fully vaccinated overseas visitors.From July 1, some of those travellers can apply for exemptions from having to observe South Korea's mandatory two-week quarantine if they are visiting family or travelling for the purpose of business, academics or public interest, the health authorities said on Sunday.As the Covid-19 vaccine roll-out gains momentum, many countries are planning a gradual return to normal, opening borders and letting people back into restaurants, shops and sports venues after more than a year of on-off lockdowns.South Korean tour agencies were also preparing new travel packages after the government's announcement last week that it is accelerating talks aimed at securing \"travel bubbles\" with a few countries, including Singapore and Thailand, the Korea Association of Travel Agents told Reuters.South Korea has given a first dose to more than 11.8 million people, or 23 per cent of the country's population, the Korea Disease Control and Prevention Agency director Jeong Eun-kyeong told a briefing.That is below the vaccination rate seen in many advanced countries, such as 61 per cent in Britain, but higher than the 12 per cent in Japan, according to a Reuters tally of state and local government sources.Japan started vaccinating its population in February like South Korea.While there has been a significant drop in new cases at nursing homes as many elderly have received vaccines, South Korea will only see a full-scale reduction in the number of local transmissions in September when more than 70 per cent will have been inoculated, said Dr Jeong.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/south-korea-eases-covid-19-restrictions-on-concerts-sports-games", "Source": "google"}