{"Type": "", "Time": "2021-06-14", "Headline": "7 men arrested for rioting at Jalan Bukit Merah, one man used karambit knife to attack victims", "Text": "Seven men, aged between 15 and 29, have been arrested for rioting in an attack that involved a deadly weapon.The police said in a statement that on June 11 at about 11.30pm, they were alerted to a fight where three youths were allegedly attacked by a group of men along Jalan Bukit Merah.One of the men had allegedly used a karambit knife to attack the victims.Two of the victims, aged 14 and 15, were subsequently taken to the hospital.Officers from the Criminal Investigation Department and Central Police Division established the identities of the people involved and arrested them on June 12.A karambit knife that was recovered from one of the assailants was also seized as a case exhibit.Preliminary investigations revealed that the three victims are known to the assailants and they had purportedly attacked the victims due to a dispute.Five men will be charged in court on Monday (June 14) with rioting armed with a deadly weapon.The offence carries a jail term of up to 10 years and caning.Police investigations are ongoing.The police in their statement they will not tolerate such brazen acts of violence and blatant disregard of the law: \"We will spare no effort to apprehend such offenders and deal with them in accordance with the law.\"Get more of Stomp's latest updates by following us on Facebook, WhatsApp, Twitter, Instagram and YouTube.View the discussion thread.View the discussion thread.Download the new STOMP app today.SPH Digital News | The Straits TimesAll rights reserved | Terms & Conditions | Data Protection Policy | Advertise with usSPH Digital News / STOMP / Copyright (c) 2019 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E.", "Section": "", "Writers": "", "URL": "https://stomp.straitstimes.com/singapore-seen/7-men-arrested-for-rioting-at-jalan-bukit-merah-one-man-used-karambit-knife-to-attack", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}