{"Type": "", "Time": "2021-06-14", "Headline": "China gas explosion kills at least 12 and injures nearly 140, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BEIJING • At least 12 people were killed and nearly 140 others injured when a gas line explosion ripped through a residential compound in central China's Hubei province yesterday, local officials said.Rescue efforts were continuing, according to a statement from the disaster management bureau in the city of Shiyan, although it was unclear how many people might still be trapped under the debris.Videos shot by witnesses and verified by Beijing News show several buildings reduced to rubble and rescue workers carrying shocked survivors on stretchers.The blast ripped through one of the city's vegetable markets that was filled with shoppers and local residents eating breakfast, a witness told state-run Global Times.\"I heard a loud bang and immediately ducked under the table, thinking it was an earthquake,\" a man who owns a restaurant near the explosion site told the newspaper.State broadcaster CCTV showed footage of buildings with charred walls and shattered windows. Rescuers are seen raking through the debris with shovels and gloved hands.The explosion took place at about 6.30am local time and an investigation was under way to determine the cause of the blast, the statement said. The Ministry of Emergency Management has also sent a team to assist with the rescue operation.Industrial accidents are common in China due to weak safety standards and corruption among officials tasked with enforcing them.The blast comes a day after eight people were killed and three others injured when toxic methyl formate leaked from a chemical handling facility in the southwestern city of Guiyang.AGENCE FRANCE-PRESSEJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/china-gas-explosion-kills-at-least-12-and-injures-nearly-140", "Source": "google"}