{"Type": "", "Time": "2021-06-14", "Headline": "Businesses in S'pore prepare for larger group sizes, higher capacity limits as Covid-19 rules eased, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Businesses are gearing up to welcome more customers, with the easing of Covid-19 restrictions from Monday (June 14), which includes an increase in the cap on social group sizes from two to five.Some are looking forward to welcoming more families for the remainder of the June school holidays.The Ministry of Health said last week that Singapore will gradually reopen in two steps, after earlier strict measures that were put in place to curb a worrying spike in Covid-19 cases.The first step of reopening on Monday will see operating capacity limits for attractions, cruises, museums and public libraries go up from 25 per cent to 50 per cent.The size limits for events such as movie screenings, worship services and marriage solemnisations will also be increased. Pre-event testing will be required for events with more than 50 attendees.In the second step, slated to take place from next Monday, dining in for groups of up to five may be allowed.Orchard Hotel Singapore said it saw a 40 per cent increase in website traffic following the Government's announcement last Thursday on the easing of measures.Mr Greg Allan, vice-president of South-east Asia operations for Millennium Hotels and Resorts, which runs Orchard Hotel, said: \"With two weeks left to the school holiday, many families are keen to book staycations so the lifting of precautionary measures is certainly a welcome move.\"The hotel has worked with vendors to launch activities targeted at families, he added. These include dim sum cooking classes and virtual reality game experiences.SneakPeek Singapore, which organises walking, hiking and kayaking tours, said it is preparing for larger groups, such as readying more kayaks.It added: \"Operationally, it will be much easier, less taxing, and less logistically complex to operate tours with sub-groups of five people instead of two.\"During phase two (heightened alert), there was little confidence to make bookings, even for after June 13, but now people are... booking tours for dates that are further away.\"Other organisations such as Wildlife Reserves Singapore and Dream Cruises have said they will increase their maximum capacity in line with what is allowed.The loosened restrictions will also benefit the likes of Kitten Sanctuary Singapore, a non-profit animal welfare group for cats. Executive director Jessica Seet said the group will now be able to accept more visitors and allow more volunteers to help out.\"Visitors are our lifeline to cover (the various) costs for rescued cats and kittens... so the easing of restrictions helps us to stay afloat,\" said Ms Seet.The Islamic Religious Council of Singapore said on Saturday that four mosques will pilot the use of an extra zone in order to offer more spaces for Friday prayers on June 25.In a Facebook post on Sunday evening, Prime Minister Lee Hsien Loong thanked the public for observing the tightened measures this past month.\"If all goes well, we should be able to open up further by next week,\" he said. \"In the new normal, such disruptions will happen from time to time, but we can still carry on with our lives.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/businesses-prepare-for-larger-group-sizes-higher-capacity-limits", "Source": "google"}