{"Type": "", "Time": "2021-06-14", "Headline": "Malaysia deports conspiracy theorist wanted in France over abduction", "Text": "Malaysia on Sunday deported a leading figure in conspiracy circles who is wanted in France over the kidnapping of an eight-year-old girl, sources told AFP.Remy Daillet, his pregnant partner and three children were arrested late last month on the holiday island of Langkawi over their residency status.The Frenchman and his family were taken under tight security to Kuala Lumpur airport and put on a flight to Singapore, a source familiar with the case, who spoke on condition of anonymity, told AFP.From there, they were due to board an Air France flight for Paris, arriving early on Monday, the source said.However, the family were still in Singapore late Sunday after Daillet's pregnant partner was hospitalised.\"We fear for the baby,\" Daillet's lawyer Jean-Christophe Basson-Larbi told AFP.\"Mr Daillet and his children are under the care of the Singapore police service,\" he added.The kidnapped girl, identified as Mia, was taken in mid-April from her grandmother's home in France by several men employed by their mother.Six men and the mother were indicted over the abduction following an intense five-day search that ended in Switzerland.According to some of the men, the mother's associates were activists who believe that children in care are unfairly taken from their parents.Mia's mother had lost custody of her daughter and was no longer allowed to see her alone or speak with her on the telephone.Investigators believe Daillet, known to police as a proponent of extremist conspiracy theories and a populist takeover of the state, may have helped organise the abduction.French prosecutors in April issued an international arrest warrant for Daillet, who had been living in Malaysia for several years.But he was detained over his residency status, making the process of deportation quicker.Daillet is a former regional leader of France's centrist MoDem party before he was excluded in 2010.After the abduction, Daillet posted a video in which he said that his organisation \"returns children kidnapped by the state to parents, at their request. There was absolutely no kidnapping\".In earlier videos, he has supported the idea of a coup d'etat and voiced opposition to taxes, vaccines and masks.Mia was returned to her grandmother's care.jsm-sr/je/har/bpWith its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.China on Monday accused the G7 of \"political manipulation\" after it criticised Beijing over its human rights record in Xinjiang and Hong Kong.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.The executive condo is an alluring property in Singapore because it serves ‘sandwich class’ Singaporeans. Whether it’s EC grant, EC income ceiling or resale levy, read everything you need to know about executive condos here.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.Protect yourself from Mosquitoes the moment you turn it on. These are selling fast, here is how it works.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Canberra MRT opened in November 2019, and in the immediate quarter after (Q1 2020), property prices in District 27 jumped by over 6% QoQ. Read about what Canberra has to offer, as well as BTO and Condo projects in the area.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Discover the benefits of a cloud that offers limitless scale, performance—and possibilities for what you can achieve.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.Several hundred people gathered in London, Ontario on Saturday to pay homage to a Muslim family deliberately mowed down by the driver of a pick-up truck, in an attack that has shocked Canadians and which Prime Minister Justin Trudeau denounced as \"terrorist.\"Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.You may be surprised by how pressure washing can transform your home. See for yourself. Look for nearby pressure washing services.The Ministry of Health (MOH) on Sunday (13 June) reported the detection of 13 new cases of COVID-19 infection in Singapore, taking the country's total case count to 62,276.President Recep Tayyip Erdogan on Sunday said Turkey would be the \"only reliable\" country left to stabilise Afghanistan after the US pulls out its troops, indicating Washington could rely on its NATO ally.The trial of deposed Myanmar leader Aung San Suu Kyi was expected to hear its first testimony Monday, more than four months after a military coup ousted her government.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.A 60-year-old man was charged on Monday (14 June) for allegedly stabbing another man at the void deck of a Choa Chu Kang HDB block.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Novak Djokovic claimed a 19th Grand Slam title and became the first man in 52 years to win all four majors twice when he came from two sets down to beat Stefanos Tsitsipas in a gripping French Open final on Sunday.This new car cloth can easily remove all the car scratches and dents from your car.Foreign forces should hold 'no hope' of keeping a military presence in Afghanistan after the US and NATO withdraw troops, the Taliban said Saturday, warning the security of embassies and airports would be the responsibility of Afghans.Most Singaporeans can't imagine owning an HDB flat without using their CPF money to pay for it.  While some complain about how their CPF money is “locked” up, the compulsory savings scheme is no doubt a major factor that has helped Singaporeans achieve such a high homeownership rate.  On top of using CPF money, the CPF Housing Grant, or HDB Grant, is another important policy that is helping Singaporeans cope with the high cost of home purchase.All travellers entering Singapore who have travel history in the past 21 days to Fiji are required to serve a 21-day Stay-Home Notice at dedicated SHN facilities given the worsening COVID-19 situation in the country.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/malaysia-deports-conspiracy-theorist-wanted-054921937.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}