{"Type": "", "Time": "2021-06-14", "Headline": "Changes to stay-home notice requirements for travellers to S'pore from Fiji and Israel, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Border measures will be tightened for travellers from Fiji with immediate effect because of the worsening Covid-19 situation there, said the Ministry of Health (MOH) on Monday (June 14).All those who enter Singapore with a travel history to Fiji in the past 21 days will now be required to serve a 21-day stay-home notice (SHN) in dedicated facilities, added MOH in its statement.Previously, travellers were subject to a 21-day SHN, with 14 days in dedicated facilities and the remaining seven at a place of residence or self-sourced accommodation.On the other hand, travellers from Israel who arrive in Singapore from 11.59pm on Wednesday (June 16), will serve a 14-day SHN at dedicated facilities and seven days at their place of residence, said MOH.They are currently subject to a 21-day SHN at dedicated facilities if they had a travel history to Israel in the past 21 days.This was given the improving situation in Israel, said MOH, so a \"risk-based approach\" will be adopted.All travellers serving a 21-day SHN will undergo Covid-19 polymerase chain reaction tests on arrival, day 14 of their SHN, and before the end of their 21-day SHN period.MOH said a multi-ministry task force regularly reviews Singapore's border measures to manage the risk of importation from travellers and onward local transmission.It added that \"as the global situation evolves, we will continue to adjust our border measures\".Any changes to border measures will be updated on the SafeTravel website.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/changes-to-stay-home-notice-requirements-for-travellers-to-spore-from-fiji-and-israel", "Source": "google"}