{"Type": "", "Time": "2021-06-14", "Headline": "Man falls 40m to his death at Tuas warehouse construction site, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A man was found dead at the building site of an upcoming warehouse on Thursday (June 10) after falling some 40m, the equivalent of 14 floors of a housing block.The 25-year-old Bangladeshi was working on the building of a stairwell at the site, and was crossing the gap between the stairwell’s walls when a structure used to bridge the gap gave way, causing him to plunge to his death, a spokesman for the Ministry of Manpower (MOM) said on Saturday.In response to queries from The Straits Times, the police said they received a call alerting them to the incident at 20 Tuas South Avenue 14 at 5.30pm on Thursday.When paramedics from the Singapore Civil Defence Force arrived, they said the man was dead.The authorities are investigating but no foul play is suspected, the police said. The construction site is where the Logos Tuas Logistics Hub is being built. When complete, it will have one two-storey warehouse and another four-storey one.The complex spans an area nearly six times the size of the Padang. The first phase of construction is expected to be completed in the fourth quarter of this year.According to the firm's website, the building will have an approved dangerous goods storage space on the first floor.A Logos spokesman confirmed that the man who died was an employee of one of its contractors.“Logos is currently investigating the details of the incident and is working closely with the general contractor and cooperating with the local authorities,” she said. “Safety is Logos’ No. 1 priority and our thoughts are with the family.”The MOM spokesman told ST that the occupier of the site is HPC Builders, and the man was employed by BHD Construction.The MOM is investigating the incident, and has instructed HPC to stop work on the stairwells.There were 14 workplace deaths between January and April this year, including three from a fatal industrial blast in Tuas in February.The number of such deaths is identical for the same period last year.\nA photo from Dec 6, 2019, shows safety reminders at the Kim Chuan Depot construction site. ST PHOTO: KUA CHEE SIONG\nIt was also recently reported that the number of workplace injuries from January to March this year has increased slightly, to close to 3,300, compared with about 3,100 in the same period last year.On June 6, an SMRT technician was killed and his colleague injured after a car jack supporting the bus they were working on gave way.On Thursday, a Malaysian worker fell from a height of about 15m while unloading steel pipes from a ship. SCDF officers went to his aid and he was found to have suffered a head injury and limb fractures.The MOM is currently conducting enforcement operation Ops Ibis, which involves some 400 additional inspections on top of its routine ones, specifically targeting the manufacturing and construction industries.The operation began last month and is expected to continue until the end of June.Such additional inspections appear to be effective in catching breaches at worksites, with more than 3,200 breaches detected from January to April this year, almost double the 1,800 breaches discovered in the same period last year.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/man-found-dead-at-tuas-warehouse-construction-site", "Source": "google"}