{"Type": "", "Time": "2021-06-14", "Headline": "Man, 26, posed as 'sugar mummy' to lure teen boy for sex", "Text": "SINGAPORE — A 17-year-old boy who wanted to find himself a sugar mummy after being kicked out by his mother, was preyed upon by a 26-year-old man instead.The victim had put up an advertisement on platform Locanto expecting elder women to reply.He instead received a reply from Muhammad AL-Masfuiin Mushin, who pretended to be a woman to lure the victim to his flat.AL-Masfuiin, a Singaporean, was jailed for 10 months on Monday (14 June), after he pleaded guilty to one count of obtaining the sexual service of a minor under 18The victim cannot be named due to a gag order protecting his identity.On 16 June 2019, the teen got into a heated argument with his mother and was kicked out of the house. In need of money, he placed an advertisement on Locanto, which he had downloaded two years ago in order to earn money by providing sexual services.The advertisement was titled \"Toyboy Fantasy Satisfies you- 18”, and stated that he was looking for a “sugar mummy” who could pay him in return for sexual services. He included his mobile phone number and two photographs of himself.The next day, AL-Masfuiin saw the advertisement and decided to chat up the victim while posing as a woman. He told the boy, “I’m looking for a young boy to be my sex slave” and asked the victim for his photographs and body statistics.When the victim asked if he was male or female, AL-Masfuiin said she was female. The victim told him that he was 17 years old and in need of money as he had been chased out of his house.As a “woman”, AL-Masfuiin asked the victim for a threesome with “her” and “her boyfriend”, even though there would be no female involved. The victim agreed and asked for $250 per meet up.At about 10.38pm that day, the victim messaged AL-Masfuiin to ask if they were able to meet up. AL-Masfuiin was aware that the victim had no place to stay.He told the victim that he could stay at “her boyfriend’s place” and that “he’ll send a Grab to let you stay over”. AL-Masfuiin texted that he also expected the boy to service “her boyfriend”.AL-Masfuiin then arranged transport for the victim. At about 1am on 18 June 2019, AL-Masfuiin sent a Grab to the victim, who asked AL-Masfuiin if “she” was joining the sex session. AL-Masfuiin replied “she might not” but that her “boyfriend will tell me if you did a great job at sex”.When the victim asked if the boyfriend knew his age, AL-Masfuiin replied “yes” and “I like my boys young”.After the victim arrived at AL-Masfuiin’s apartment, AL-Masfuiin told him to take a shower while he sat on the sofa bed in the living room masturbating himself. The two engaged in sexual acts, with AL-Masfuiin overpowering the boy when the latter resisted. After the incident, the boy went to sleep.He woke at about 8.30am and asked AL-Masfuiin for money to go to work. AL-Masfuiin took out a $50 note from his wallet and handed it to the victim before the two parted ways.According to court documents, a police officer performing foot patrol came across the victim on 18 June 2019 at Toa Payoh Central. During the course of investigations, the officer discovered messages relating to him providing sexual services, in his phone. AL-Masfuiin was arrested afterwards. Commercial sex with a minor under 18 carries a jail term of up to seven years, with fine, or both. Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:Singapore reports 13 new COVID-19 cases, 10 from the communityCOVID: Social gathering size can increase to 5 per group from 14 June – MTFCOVID: Dine-in at F&B places can resume at max 5 per group from 21 JuneWork-from-home remains default arrangement in Singapore's Phase 3 (HA)4 COVID ART test kits on sale at 3 Singapore pharmacies from 16 June: MTFWith its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.China on Monday accused the G7 of \"political manipulation\" after it criticised Beijing over its human rights record in Xinjiang and Hong Kong.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.The executive condo is an alluring property in Singapore because it serves ‘sandwich class’ Singaporeans. Whether it’s EC grant, EC income ceiling or resale levy, read everything you need to know about executive condos here.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.Protect yourself from Mosquitoes the moment you turn it on. These are selling fast, here is how it works.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Canberra MRT opened in November 2019, and in the immediate quarter after (Q1 2020), property prices in District 27 jumped by over 6% QoQ. Read about what Canberra has to offer, as well as BTO and Condo projects in the area.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Discover the benefits of a cloud that offers limitless scale, performance—and possibilities for what you can achieve.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.Several hundred people gathered in London, Ontario on Saturday to pay homage to a Muslim family deliberately mowed down by the driver of a pick-up truck, in an attack that has shocked Canadians and which Prime Minister Justin Trudeau denounced as \"terrorist.\"Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.You may be surprised by how pressure washing can transform your home. See for yourself. Look for nearby pressure washing services.The Ministry of Health (MOH) on Sunday (13 June) reported the detection of 13 new cases of COVID-19 infection in Singapore, taking the country's total case count to 62,276.President Recep Tayyip Erdogan on Sunday said Turkey would be the \"only reliable\" country left to stabilise Afghanistan after the US pulls out its troops, indicating Washington could rely on its NATO ally.The trial of deposed Myanmar leader Aung San Suu Kyi was expected to hear its first testimony Monday, more than four months after a military coup ousted her government.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.A 60-year-old man was charged on Monday (14 June) for allegedly stabbing another man at the void deck of a Choa Chu Kang HDB block.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Novak Djokovic claimed a 19th Grand Slam title and became the first man in 52 years to win all four majors twice when he came from two sets down to beat Stefanos Tsitsipas in a gripping French Open final on Sunday.Last chance to save big on thousands of finds. Don’t miss out!Foreign forces should hold 'no hope' of keeping a military presence in Afghanistan after the US and NATO withdraw troops, the Taliban said Saturday, warning the security of embassies and airports would be the responsibility of Afghans.Most Singaporeans can't imagine owning an HDB flat without using their CPF money to pay for it.  While some complain about how their CPF money is “locked” up, the compulsory savings scheme is no doubt a major factor that has helped Singaporeans achieve such a high homeownership rate.  On top of using CPF money, the CPF Housing Grant, or HDB Grant, is another important policy that is helping Singaporeans cope with the high cost of home purchase.All travellers entering Singapore who have travel history in the past 21 days to Fiji are required to serve a 21-day Stay-Home Notice at dedicated SHN facilities given the worsening COVID-19 situation in the country.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/singaporean-man-26-posed-sugar-mummy-lure-teen-boy-sex-035110137.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}