{"Type": "", "Time": "2021-06-14", "Headline": "Malaysian-born journalist Ed Yong wins Pulitzer Prize for explanatory reporting | Malaysia | Malay Mail", "Text": "Loading...Monday, 14 Jun 2021 11:58 AM MYTBY R. LOHESWAR\n\nYong began warning readers about the fragility of America’s pandemic preparedness long before Covid-19 emerged there. — Reuters pic\n\nFollow us on Instagram and subscribe to our Telegram channel for the latest updates.KUALA LUMPUR, June 14 — Malaysian-born British science journalist Edmund Yong has won the 2021 Pulitzer Prize for explanatory reporting.Born in 1981, Edmund, better known as Ed Yong, migrated to the UK in 1994 and became a citizen in 2005.Yong has been writing for The Atlantic in the US since 2015 and won the award for his series of articles where he anticipated the course of the coronavirus pandemic, clarified its dangers, and illuminated the American government’s failure to curb it.The Atlantic in acknowledging Yong’s accomplishments said Yong began warning readers about the fragility of America’s pandemic preparedness long before Covid-19 emerged.His 2018 investigative article, “When the Next Plague Hits.” showed how Yong correctly predicted an interconnected set of dangers: breakdowns in international communication, chronic underfunding of public health, shortages of supplies and scientific expertise at the federal level, and former President Donald Trump’s inadequacies as a leader. In a series of tweets, Yong who is also a juror, said “I could not have done this without the amazing people at the Atlantic, who collectively created an environment where award-winning work was possible. It really takes a village, and in recognition of that.“I’ll be splitting the prize money between everyone who worked on my pieces last year—every editor, copy editor, fact checker, artist, and more. Even when individuals win Pulitzers, their work depends on a community. I want to honor mine,” he said.This is not Yong’s first award. In 2016 he was awarded the Byron H. Waksman Award for Excellence in the Public Communication of Life Sciences. Yong was selected for his excellence in science writing, which includes his popular blog, Not Exactly Rocket Science, his work with national publications such as The Atlantic, and his first book, I Contain Multitudes, which focuses on microbiology. His blog Not Exactly Rocket Science was part of the National Geographic Phenomena network.The Pulitzer Prize is an award for achievements in newspaper, magazine and online journalism, literature and musical composition within the United States.Loading...© 2021, Malay Mail, All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.malaymail.com/news/malaysia/2021/06/14/malaysian-born-journalist-ed-yong-wins-pulitzer-prize-for-explanatory-repor/1982040", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}