{"Type": "", "Time": "2021-06-14", "Headline": "Running Man final episode: 'Thank you for running with me,' says Lee Kwang-soo, Entertainment News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.A few hours before his final episode of Running Man aired on Sunday (June 13), cast member Lee Kwang-soo posted a message on social media to his fans.\"Thank you for running with me for 11 years,\" the 35-year-old actor-host wrote in his post, accompanied by photos of him with a bouquet of flowers, a cake and a certificate of completion.Lee had announced in April that he was leaving the wildly popular variety show due to an ankle injury he had sustained last year.As he was one of the original cast members, the production team took pains to return to the same locations where Running Man had started filming in July 2010.Another original cast member, comedian Jee Seok-jin, said: \"Even the staff members are sad for Kwang-soo's final recording. Let's talk about him a lot today.\"Lee then retorted: \"You didn't say anything while we weren't recording, but as soon as the cameras turned on, you came out with that line ready.\"Another cast member, Yoo Jae-suk, said jokingly: \"You should rethink your decision. If you say right now, 'I'm sorry', viewers would understand. They'd think, 'that rascal', laugh and move on.\"He later added more seriously: \"It will feel empty without you, but you should do all the things that you wanted to do now without worrying about us.\"Singer Kim Jong-kook, who has also been with the show from the start, said: \"It felt like we would go on like this forever without changing. The regret is even stronger because it's Kwang-soo, with whom I thought I would go until the end.\"Even though we aren't able to go on with Running Man together anymore, let's go for the rest of our lives together.\"Those who had worked with him behind the scenes also shared their fond memories of him on social media.Former producer-director Lee Hwan-jin posted on Instagram on Sunday: \"From what I remember, Kwang-soo never once told the producers 'no'.\"From continuing to film even when he had a broken toe to being soaked with water in the middle of winter while suffering from a cold, his dedication was noted by his co-workers over the course of filming 559 episodes.Another former producer-director Jung Chul-min wrote: \"He always thought about the programme and his career rather than himself and showed such professionalism.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/life/entertainment/running-man-final-episode-lee-kwang-soo-says-thank-you-for-running-with-me", "Source": "google"}