{"Type": "Singapore", "Time": "2021-06-14", "Headline": "Bukit Merah market stallholders worry about lost income as COVID-19 testing starts for cluster", "Text": "SINGAPORE: Stallholders at the temporarily shuttered 115 Bukit Merah View Market and Food Centre are worried about losing income, Member of Parliament (MP) Joan Pereira (PAP-Tanjong Pagar) told reporters on Monday (Jun 14).Stallholders had reached out to the MP with their concerns after the Ministry of Health (MOH) announced a new COVID-19 cluster in the area on Sunday and ordered mandatory testing operations for those who work and stay at nearby Block 116.The market has been closed since Sunday and will remain so until Tuesday to facilitate deep cleaning and to break potential transmission chains.MOH said it was looking the into six cases identified in the market cluster after epidemiological investigations revealed likely ongoing transmission among those who work there.Five of the cases detected so far are either food stall vendors or sundry shop staff aged from the 60s to the 80s.All staff and tenants who worked at the market from May 25 have been quarantined and will be tested during quarantine.Ms Pereira said that while the stallholders understand the need for these measures to take place, \"many of them are concerned especially with the fact that they will not have income over the next few weeks\".\"They have asked if there is some financial help that could be afforded to them. We are just working with the government agencies to provide all this relevant information to be relayed to them,\" she added.Ms Pereira said financial grants include the COVID-19 Recovery Grant - Temporary, Courage Fund and MOH's Quarantine Order Allowance Scheme, which pays S$100 a day to self-employed individuals.\"We are working with NEA (National Environment Agency) to see how we can help these stallholders with their varied needs,\" she added.\"We are every day engaging with our stallholders, calling them to assure them that we are here for them and will look after their needs as much as possible.\"When asked about the possibility of the market being closed beyond Tuesday, Ms Pereira said MOH is still investigating and \"it's best\" that the ministry shares its findings.MOH also said on Sunday that it will conduct special testing operations for staff and tenants who worked at 116 Bukit Merah View from May 25 to \"disrupt any wider, undetected community transmission\".Eighty-five people from this group will undergo the mandatory testing that started on Monday, Ms Pereira said at the temporary testing site at Block 125A.Beyond that, MOH said it will extend free COVID-19 testing to members of the public who visited shops at 115 and 116 Bukit Merah View between May 25 and Jun 12.However, testing for this group will not be done at the temporary site, but at regional screening centres or \"swab and send home\" clinics, which include Bukit Merah polyclinic.A CNA reporter observed residents turning up at the temporary site in hopes of getting swabbed at a location closer to home. Many were elderly residents who were concerned about being exposed to the virus as they frequented the nearby market.Ms Pereira said three elderly residents had asked her about the possibility of being tested at the temporary site.\"I have put up this request to MOH to see if we could have the swab tests for our residents - as you can see, mostly elderly - here since the tentage and everything is set up here,\" she said.\"It's really very convenient for them. And if MOH gives the go ahead, I think most of our residents will really appreciate that.\"Additional reporting by Lee Li Ying.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "covid-19,coronavirus,Bukit Merah", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/covid-19-cluster-bukit-merah-market-hawker-testing-15011140", "Source": "google"}