{"Type": "", "Time": "2021-06-14", "Headline": "Israel’s new government agrees on only one thing: Booting Netanyahu - The Washington Post", "Text": "Seven months after the 1967 war, President Lyndon B. Johnson hosted Israel’s prime minister, Levi Eshkol, in Texas. Johnson asked Eshkol directly: “What kind of Israel do you want?” Israel officially rejected a return to the prewar armistice lines, which it felt had helped produce the war. So what did it want instead? What borders — and what citizenry — did Eshkol envision? Eshkol replied, in the recounting of a minister he briefed: “Mr. President … I have a wall-to-wall coalition. … [T]he government has decided not to decide until there is an Arab partner for negotiations. … Unfortunately, I cannot tell you what kind of Israel I want!”The successors to Eshkol — including the charismatic, polarizing, and longest-serving among them, Benjamin Netanyahu — have all been confronted with versions of Johnson’s question. As Netanyahu leaves office, perhaps for the last time, he leaves the nation wealthier, more powerful in some ways, and yet more divided than ever, and with no more of an answer as to “what kind of Israel” it wants.Eshkol’s non-answer to Johnson was not only evasion. He was not, in fact, in a position to speak for Israel without the authorization of his cabinet. Prime ministers are not presidents, although Netanyahu often behaved as one. Prime ministers are, at least formally, first among equals in a cabinet that collectively governs the country and commands its armed forces. This will be especially the case for Naftali Bennett, Israel’s new prime minister, and Yair Lapid, the “alternate prime minister” and foreign minister, slated to become prime minister in 2023. Each man will have a veto on all major decisions in a coalition of no fewer than eight parties, spanning the full ideological spectrum, from hard right to hard left, and including an Arab party for the first time since the 1950s.The upshot is that major moves on the Israeli-Palestinian conflict, in any direction, will not be possible with this government. Seemingly modest developments, for better and for worse, could turn out to have major long-term effects.Netanyahu ended his tenure desperate, unhinged and totally uninterested in governingBennett is very hawkish on the issue, openly and consistently opposing a Palestinian state, but he is not alone. In 2017, he described to me how his once-far-right views had become mainstream in Israel, in the aftermath of the suicide bombings of the second intifada, which started in September 2000, and the rocket fire that intensified after Israel’s withdrawal from Gaza in 2005. He was an early proponent of annexation of Area C in the West Bank — over 60 percent of the territory — and saw elements of his plan incorporated not only into the official Netanyahu approach, but also into the Trump-Kushner plan of 2020. “President Trump calls it a [Palestinian] state,” said a “senior Israeli official” quoted in the Netanyahu-friendly newspaper Israel Hayom, but what the Trump administration proposed was a state in name only, more akin to the “autonomy-on-steroids” that Bennett had previously advocated.Others on the right flank of the new government share many of these views. Gideon Sa’ar, the incoming justice minister, told me in February that although annexation is off the table for now — given Israel’s commitment as part of the Abraham Accords with the United Arab Emirates and Bahrain — it remains a strategic goal. Finance Minister Avigdor Liberman’s views have been more complex, and he nominally supported a two-state solution of sorts, but no one would mistake him for a dove.Nonetheless, Netanyahu and his camp have attacked Bennett for forming a “leftist” government. Alternate prime minister Lapid supports a Palestinian state, as he told me recently, although he rejects — perhaps as an opening position — the division of Jerusalem. Lapid sounds like, and genuinely holds the views of, a centrist Israeli with whom President Biden’s Washington would be very comfortable. He hopes to rebuild bridges to U.S. Democrats, woefully damaged during the Netanyahu years, and, domestically, he espouses a liberal, secularist vision. This entails curbing the influence of religious authorities on personal affairs and the power of the Haredi (“ultra-Orthodox”) parties, now out of government, which the Modern Orthodox Bennett could go along with but only to a degree. Lapid leads the largest faction in the new government he himself put together, earning recognition as the new leader of the center-left.Netanyahu has dominated the U.S.-Israel relationship. What happens if he’s gone?Alongside Lapid are other parties that support compromise to varying degrees. These run from Benny Gantz’s Blue and White to Labor, with a new and prominent leader, Merav Michaeli, to the leftist Meretz, led by Nitzan Horowitz. Where Bennett and Sa’ar reject a Palestinian state, Michaeli and Horowitz reject the idea of annexation or the continuation of occupation for equally fervent ideological and security reasons. They will, in real terms, cancel each other out, both because of the Bennett-Lapid mutual vetoes and because the relatively dovish camp in the coalition will represent at least 42 Knesset seats of the coalition’s 61.Most interesting, perhaps, is the inclusion of Ra’am, an Islamic party representing Palestinian citizens of Israel. Ra’am surprised everyone by seeking to join a coalition — Netanyahu’s or Bennett and Lapid’s — to promote domestic policy in favor of its constituents, rather than foreign policy on behalf of the Palestinian cause. Ra’am’s priorities are indicative of the government’s as a whole.No matter how many Palestinians vote in Israeli elections, we still can’t winThe Bennett-Lapid agenda on the Palestinian issue is clear: It has none. The new coalition is built to tackle completely different issues, outlining a far-reaching domestic agenda that starts with two simple goals: replacing Netanyahu and ending Israel’s governance crisis.The severity of the governance crisis should not be underestimated. In but one example, Netanyahu has blocked the passage of a state budget — his own government’s — for personal political gain; the move allowed him to call elections without vacating his post. Had Netanyahu stepped aside, his own party would have easily formed a relatively homogenous and stable coalition. With four elections in two years, Israel has been beholden to the political fate of one man. Ending this, more than anything, is the task Bennett and Lapid undertake.Reality probably won’t be so kind to the new government, however. What happens on the Israeli-Palestinian front often occurs while one is making other plans. Before Donald Trump appeared on the scene, Netanyahu’s answer to Johnson’s question, I argued, was to doubt its very premise: There is no solution to the Palestinian-Israeli conflict in our lifetime, Netanyahu believed. Israel must hunker down, defend itself, dissuade any challengers and perhaps gain begrudging acceptance or at best normalization, not grand peace.This “anti-solutionist” approach always contained within it a fateful contradiction, however. Israel was not actually pursuing a conservative, modest policy on the conflict. It was, and still is, actively shaping the conflict’s parameters. Netanyahu and the right-wingers among the new coalition all championed policies that intentionally blurred the distinction between Israel and the West Bank. And this blurring of the “Green Line” is often not dependent on proactive cabinet decisions. Bureaucratic inertia and existing legal arrangements all create a strategy by default, whether the cabinet has a plan or not.Now Netanyahu leaves office at a time when normalization has resumed without movement on the Palestinian issue. But this is also a time when many abroad view the two-state solution as an anachronistic platitude and therefore return with a vengeance to the question of what Israel wants to be. Some have their own answers.The Biden administration, with a huge domestic and foreign agenda to think about, might also prefer if the Israeli-Palestinian conflict went to sleep for about four years, just like Bennett and Lapid. And yet, just like Israel, the administration has already been pulled back into conflict management, if not conflict resolution.Bennett heads a very small party, and he earned the top post first simply because he was the hardest to peel off from the Netanyahu camp. He’s a successful tech entrepreneur, with an energetic, straight-shooting, can-do demeanor and a pragmatic approach to many domestic issues. He thinks of himself — and hopes to be perceived abroad — as someone driven by common sense, ready to listen. In joining this coalition, Bennett has lost his base in the right wing, leaving him only one path: forward. He must at least appear to succeed as prime minister, or all will have been for naught.Biden will find in Bennett someone eager for a fresh start. In his first speech to the Knesset, before being sworn in, he spoke of working on Israel’s relations with both U.S. parties, even using the English term “bipartisan,” as Lapid advocates and in an implicit critique of Netanyahu, a Republican favorite and a villain to Democrats. Capitalizing on this, Washington would do well to see what practical steps it could advance — in the West Bank, and perhaps even on Gaza — with Bennett and Lapid.Biden will not, however, find any more clarity than Lyndon B. Johnson: The question of what kind of Israel does Israel itself want will remain as vague as it was in 1968, and even more important today.The latest: Israeli security chief issues rare warning over potential for Jan. 6-style mob violence ahead of Netanyahu departureAnalysis: The era of Netanyahu is over — or is it?Naftali Bennett, set to be Israel’s next leader, represents a break with its more secular pastWhat to know about Naftali Bennett, the Israeli politician poised to succeed Benjamin NetanyahuThe most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/outlook/2021/06/14/israels-new-government-only-agrees-one-thing-booting-netanyahu/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}