{"Type": "", "Time": "2021-06-14", "Headline": "Israel's Netanyahu ousted as 'change' coalition forms new govt", "Text": "Keep up to speed at a glance with the Top 10 daily storiesA motley alliance of Israeli parties on Sunday ended Benjamin Netanyahu's 12 straight years as prime minister, as parliament voted in a new government led by his former ally, right-wing Jewish nationalist Naftali Bennett.Bennett, a tech millionaire and former special forces commander, was sworn in at the helm of an ideologically divided eight-party bloc united only by disdain for the country's longest-serving prime minister.Netanyahu, 71, in typically combative style, vowed shortly before his defeat that \"if it's our destiny to be in the opposition, we'll do so with our heads high until we take down this bad government and return to lead the country our way\".Beloved as \"King Bibi\" and \"Mr Security\" by his right-wing supporters and condemned as the \"crime minister\" by his critics, Netanyahu has long dominated Israeli politics.But on Sunday, a vote in the Knesset legislature following weeks of political drama ended his government with a razor-thin majority of 60 to 59 in the 120-seat chamber.US President Joe Biden swiftly congratulated Bennett.\"I look forward to working with Prime Minister Bennett to strengthen all aspects of the close and enduring relationship between our two nations. Israel has no better friend than the United States,\" he said in a statement.Delighted revelers packed a square near the Knesset (parliament) in Jerusalem and poured into Tel Aviv's city centre to celebrate Netanyahu's fall.Throngs of people gathered in the coastal city, clapping, cheering and waving flags.In Tel Aviv's Rabin Square, Netanyahu's opponents launched into celebrations, waving \"Bye bye Bibi\" placards.- Fragile coalition -Bennett, 49, told the Knesset before the vote that his government \"represents all of Israel\".He said the country, after four inconclusive elections in under two years, had been thrown \"into a maelstrom of hatred and in-fighting\".\"The time has come for different leaders, from all parts of the population, to stop, to stop this madness\", he said, to angry shouts of \"liar\" and \"criminal\" from right-wing opponents.Netanyahu, who is battling corruption charges in a trial he dismisses as a conspiracy, has been the dominant Israeli politician of his generation, having also served a previous three-year term in the 1990s.His supporters have hailed him as a defender of Israel who has been tough on archfoe Iran, but who also struck a series of historic normalisation deals with Arab nations last year.Being ousted from the top job leaves Netanyahu more exposed to his legal troubles, denying him the chance to push through legislation that could give him immunity.Bennett, a former defence minister under Netanyahu, vowed to keep Israel safe from Iran, promising that \"Israel won't let Iran have nuclear weapons\", a goal the Islamic republic denies pursuing.Netanyahu claimed Iran saw \"celebrating\" the birth of a \"dangerous\", weak left-wing government.The diverse anti-Netanyahu bloc was cobbled together by the secular centrist Yair Lapid, a former TV presenter.It spans the political spectrum, with three right-wing, two centrist and two left-wing parties, and even an Arab Islamic conservative party.Lapid, 57, is to serve as foreign minister for the next two years before taking over from Bennett.German Chancellor Angela Merkel on Sunday congratulated Bennett in comments tweeted by her spokeswoman: \"Germany and Israel are connected by a unique friendship that we want to strengthen further. With this in mind, I look forward to working closely with you.\"Canadian Prime Minister Justin Trudeau sent a message of congratulations, adding that Ottawa \"remains steadfast in its commitment to a two-state solution, with Israelis and Palestinians living in peace, security, and dignity – without fear and with their human rights respected\".British Foreign Secretary Dominic Raab tweeted: \"I look forward to continued cooperation on security, trade and climate change, and working together to secure peace in the region.\"European Council president Charles Michel also tweeted his congratulations.- 'Fraud' -The improbable alliance emerged weeks after an 11-day war between Israel and Hamas, the Islamist group that rules the Palestinian enclave of Gaza, and following inter-communal violence in Israeli cities with significant Arab populations.Netanyahu, a mastermind at navigating Israel's fractious politics, had tried in vain to peel off defectors, hoping to deprive the nascent coalition of its hard-won majority.He accused Bennett of \"fraud\" for siding with rivals. Angry rallies by the premier's Likud party supporters resulted in security being bolstered for some lawmakers.As his grip on power slipped, Netanyahu's bombastic remarks drew parallels to former US president Donald Trump, who described his election loss last year as the result of a rigged vote.Sunday's Knesset approval also came amid heightened tensions with the Palestinians.Right-wing Israelis are also angered over last week's postponement of a controversial Jewish nationalist march through flashpoint areas of east Jerusalem.The \"March of the Flags\" is now slated for Tuesday, representing a key early test for the new government.Gaza's rulers Hamas said political developments in Jerusalem wouldn't change their position on Israel.\"The form the Israeli government takes doesn't change the nature of our relationship,\" said the group's spokesman Fawzi Barhoum.\"It's still a colonising and occupying power that we must resist.\"mdo/har/jjWith its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.China on Monday accused the G7 of \"political manipulation\" after it criticised Beijing over its human rights record in Xinjiang and Hong Kong.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.The executive condo is an alluring property in Singapore because it serves ‘sandwich class’ Singaporeans. Whether it’s EC grant, EC income ceiling or resale levy, read everything you need to know about executive condos here.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.Protect yourself from Mosquitoes the moment you turn it on. These are selling fast, here is how it works.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Canberra MRT opened in November 2019, and in the immediate quarter after (Q1 2020), property prices in District 27 jumped by over 6% QoQ. Read about what Canberra has to offer, as well as BTO and Condo projects in the area.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Discover the benefits of a cloud that offers limitless scale, performance—and possibilities for what you can achieve.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.Several hundred people gathered in London, Ontario on Saturday to pay homage to a Muslim family deliberately mowed down by the driver of a pick-up truck, in an attack that has shocked Canadians and which Prime Minister Justin Trudeau denounced as \"terrorist.\"Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.You may be surprised by how pressure washing can transform your home. See for yourself. Look for nearby pressure washing services.The Ministry of Health (MOH) on Sunday (13 June) reported the detection of 13 new cases of COVID-19 infection in Singapore, taking the country's total case count to 62,276.President Recep Tayyip Erdogan on Sunday said Turkey would be the \"only reliable\" country left to stabilise Afghanistan after the US pulls out its troops, indicating Washington could rely on its NATO ally.The trial of deposed Myanmar leader Aung San Suu Kyi was expected to hear its first testimony Monday, more than four months after a military coup ousted her government.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.A 60-year-old man was charged on Monday (14 June) for allegedly stabbing another man at the void deck of a Choa Chu Kang HDB block.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Novak Djokovic claimed a 19th Grand Slam title and became the first man in 52 years to win all four majors twice when he came from two sets down to beat Stefanos Tsitsipas in a gripping French Open final on Sunday.This new car cloth can easily remove all the car scratches and dents from your car.Foreign forces should hold 'no hope' of keeping a military presence in Afghanistan after the US and NATO withdraw troops, the Taliban said Saturday, warning the security of embassies and airports would be the responsibility of Afghans.Most Singaporeans can't imagine owning an HDB flat without using their CPF money to pay for it.  While some complain about how their CPF money is “locked” up, the compulsory savings scheme is no doubt a major factor that has helped Singaporeans achieve such a high homeownership rate.  On top of using CPF money, the CPF Housing Grant, or HDB Grant, is another important policy that is helping Singaporeans cope with the high cost of home purchase.All travellers entering Singapore who have travel history in the past 21 days to Fiji are required to serve a 21-day Stay-Home Notice at dedicated SHN facilities given the worsening COVID-19 situation in the country.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/israel-parliament-poised-vote-anti-034039159.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}