{"Type": "World", "Time": "2021-06-14", "Headline": "Australia's Victoria state expects further easing of COVID-19 curbs", "Text": "SYDNEY: Australia's Victoria state expects to announce a further easing of COVID-19 restrictions this week, Acting Premier James Merlino said on Sunday (Jun 13), as the state reported one new locally acquired infection for a second straight day.The latest infection was a close contact of a previously reported case and had already been quarantined, Victoria's health department said.Victoria recorded 92 cases in its latest wave of COVID-19 infections, which triggered a two-week snap lockdown late last month. The state emerged from the lockdown on Friday as new cases declined, but some physical distancing rules remain.\"My expectation is by later in the week, we will be in a position to announce further easing of restrictions for regional Victoria and ... for metropolitan Melbourne,\" Merlino said.Merlino added he was keen to get people back to attending sporting events and theatre, though he had no announcement to make yet in that regard.Under existing curbs, Melbourne residents can only travel up to 25km from home while outdoor gatherings are limited to 10 people. Masks are required indoors and outdoors at all public spaces.More than 3,000 primary close contacts of infected cases are already in quarantine with about 122 exposure sites listed on the Victorian government website.Australia has fared much better than many other developed countries during the pandemic, with more than 22,300 local COVID-19 cases and 910 deaths since March last year, mostly in Victorian aged-care homes.Snap lockdowns, internal border controls and tough social distancing rules have helped it contain prior outbreaks.New South Wales and neighbouring Queensland are on high alert after an infected woman and her husband travelled from Victoria through several country towns in both states.With no new cases on Sunday, New South Wales has not reported any locally acquired infection in more than a month, while Queensland last reported cases in late March.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,Victoria,Australia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/melbourne-victoria-australia-covid-19-lockdown-rules-15005128", "Source": "google"}