{"Type": "", "Time": "2021-06-14", "Headline": "Dutch defender Blind nearly decided not to play after Eriksen collapse - Sports - The Jakarta Post", "Text": "Please Update your browser\n          Your browser is out of date, and may not be compatible with our website. A list of the most popular web browsers can be found below.\n          Just click on the icons to get to the download page.Log in with your social accountNetherlands defender Daley Blind considered missing his country’s opening game at the European Championship after the heart attack his former club team mate Christian Eriksen suffered on Saturday.But Blind, who had heart problems himself last year, decided to take to the field and broke down in tears after being substituted midway through the second half of the 3-2 win over Ukraine in the Group C match on Sunday.\"Yesterday had a huge impact on me, never mind the fact that I know Christian well as a friend,\" Blind said of the drama in Copenhagen where Eriksen collapsed on the pitch during Denmark’s match against Finland after suffering a heart attack.“The situation for him is terrible. Of course, I have also experienced a few things in that area, so that I had to overcome a mental hurdle to play today,\" added the 31-year-old Blind, who was diagnosed with heart muscle inflammation in 2019 after he suffered a dizzy spell playing for Ajax Amsterdam in a Champions League game against Valencia.He was fitted with a pacemaker that treats dangerously abnormal heart rhythms but it failed while he was playing in a friendly last August and he collapsed again – although it was later described as a one-off incident.\"I had to persuade myself to play but I’m proud that I did and that’s why my emotion came bursting out at the end of the game,\" he told reporters.\"I definitely thought about not taking part. The images on television and the incident had a big impact and I didn't sleep very well because of them. I really had to overcome a big hurdle to do this.\"News that Eriksen was awake and talking in hospital came as relief.\"If it didn't go well, it would have haunted my head even more. When Christian encouraged his own team mates to play is when I decided to play myself. Also because I'm safe, according to the doctors,\" Blind said.Dutch coach Frank de Boer cancelled a team meeting on the eve of the game because of the distress among the Dutch players.\"I'm sure he (Blind) had a hard time making that choice, but on the other hand, he really put his hand up,\" De Boer said. \"That burst of feelings that hit him at the end was very normal.\"© 2016 - 2021 PT. Bina Media Tenggara", "Section": "", "Writers": "", "URL": "http://www.thejakartapost.com/news/2021/06/14/dutch-defender-blind-nearly-decided-not-to-play-after-eriksen-collapse.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}