{"Type": "", "Time": "2021-06-14", "Headline": "Olympics-Take your condoms home: social distancing and sex in the Olympic village", "Text": "Dunk BaitThe RushPosted UpMad BetsThe BandwagonOld Baseball CardsPosted UpChris HaynesYahoo Sports College PodcastDan Wetzel, Pat Forde, Pete ThamelYahoo Fantasy Football PodcastLiz Loza & Matt HarmonFantasy Baseball PodcastScott PianowskiNFL PodcastCharles Robinson & Terez PaylorBy Sakura MurakamiTOKYO (Reuters) - Tokyo Olympic organisers plan to give away about 150,000 condoms at next month's Games, but are telling athletes to take them home rather than use them in the Olympic village where social distancing rules and coronavirus measures are the top priority.Large numbers of condoms have been given out at the Games since the 1988 Seoul Olympics to raise awareness of HIV and AIDS, and organisers said the International Olympic Committee had requested their continued distribution.But athletes have been told to keep their distance from each other, meaning fewer opportunities to mingle and more.\"The distribution of condoms is not for use at the athlete's village, but to have athletes take them back to their home countries to raise awareness\" of HIV and AIDS issues, said Tokyo 2020 in an emailed response to questions by Reuters.Officials have already barred overseas spectators and are asking those who do attend the delayed event to show their support by clapping rather than cheering or singing to try and reduce the risk of spreading the virus.Dining has become another issue to resolve. Organisers were originally planning to feed residents of the village in vast dining halls – the largest one with a capacity to seat 4,500 people at once.But now, the organisers will ask athletes to dine alone, maintain social distancing with others, and wipe down surfaces after eating.\"Without the proper measures in place, it will only take one person to bring in the virus and spread it, especially in places like the athlete village,\" Nobuhiko Okabe, one of the infectious disease specialists advising Tokyo 2020 on its coronavirus measures said at a news conference on Friday.\"We have to do what we can to make sure an outbreak doesn't happen, and we really need the cooperation of all the athletes and delegations to make this work,\" he added.(Reporting by Sakura Murakami; Editing by Lincoln Feast.)The first U.S. swimmers qualified for the Tokyo Games at Olympic Trials on Sunday.Four-time Olympic medalist David Boudia was 4.45 points short of another Games.Protect yourself from Mosquitoes the moment you turn it on. These are selling fast, here is how it works.California officials had argued that Trump's decision to cancel funding for rail project \"arbitrary, capricious, an abuse of discretion.\"It was definitely not Big Baby's finest moment.“I feel like a new person. Doctors who haven’t rotated in the ICU in a while don’t recognize me.”Get a $200 checking bonus when you apply for an eligible checking account online in minutes with qualifying direct deposits. Learn more.The Squad, a group of four US representatives that are women of color, are deeply unpopular among conservatives, so the attacks could help raise funds.Swimmer Kaylee McKeown says the death of her father 10 months ago inspired her to break the 100-meter backstroke world record on Sunday at the Australian Olympic trials.  The 19-year-old McKeown had a time of 57.45 seconds at the South Australian Aquatic Centre to improve on the previous mark of 57.57 set by American Regan Smith in 2019.  McKeown’s father Sholto died last August from brain cancer.Ask Scary Mommy is Scary Mommy’s advice column, where our team of “experts” answers all the questions you have about life, love, body image, friends, parenting, and anything else that’s confusing you. This week … are you attracted to people you didn’t think you’d be attracted to on your FYP on TikTok? Have your own questions? []Excessive Sleep Disorder signs may be more subtle than you think. Check out narcolepsy warning signs and symptoms.School districts across the United States are hiring additional teachers in anticipation of what will be one of the largest kindergarten classes ever as enrollment rebounds following the coronavirus pandemic.  As they await the arrival next fall of students who sat out the current school year, educators are also bracing for many students to be less prepared than usual due to lower preschool attendance rates.  “The job of the kindergarten teacher just got a lot harder,” said Steven Barnett, senior co-director of the National Institute for Early Education Research at Rutgers University.Clippers assistant Chauncey Billups is \"definitely ready\" to become a head coach, the Clippers' Tyronn Lue said. Billlups might get his chance soon.A 25-year-old man died Sunday of injuries sustained in a mass shooting that wounded 13 other people in downtown Austin, Texas, the previous day, police confirmed.Driving the news: Austin police named the victim as Douglas John Kantor, as they continued to search for one of two suspects. One suspect was taken into custody on Saturday following the shooting on 6th Street, a popular area with bars and restaurants.Stay on top of the latest market trends and economic insights with Axios Markets. SubsTop Surgeon and Author of the Best Selling Book \"Dr. Gundry's Diet Evolution\" Discovers Link Between Gut Health and the Rising Number on the Scale.Boris Johnson is set to urge the public to accept “one last heave” to freedom as he delays the final step of lockdown reopening. On Sunday night the Prime Minister was finalising his plan to push back the June 21 reopening in England by up to four weeks owing to a surge in Covid cases. Earlier in the day he had refused to rule out further delays in the future. It means rules ordering the wearing of face masks, limiting groups to six people indoors and 30 outdoors, and keeping nightclubs shut areA large splash can be seen when the ambulance hits the water. The suspect was able to escape the vehicle and was taken into custody.During the darkest days of the coronavirus pandemic, Martha Medina would occasionally slip into her shuttered store on Los Angeles’ oldest street to ensure everything was secure.  Colorful folklorico dresses from each of Mexico's 32 states lined the walls.  Brightly painted Dia de los Muertos folk art skulls and figurines were safely locked behind a glass case.Looking for a real relationship? Click here to view profiles and meet someone near you. Get started for free!In a recent interview, Lonzo Ball revealed he would have rather gone straight from high school to the NBA rather than attend UCLA.Teachers in more than 20 cities gathered to let G.O.P. lawmakers know that they ain’t down with attempts to dictate they can and can’t teach in class.Don't add sugar. Sugar bowl via www.shutterstock.comChildren are manifesting increased rates of adult diseases like hypertension or high triglycerides. And they are getting diseases that used to be unheard of in children, like Type 2 diabetes and fatty liver disease. So why is this happening? Everyone assumes this is the result of the obesity epidemic – too many calories in, too few out. Children and adults are getting fat, so they’re getting sick. And it is generally assumed that no one specifiSearch for all inclusive resorts in Mexico. Find great deals now, save money and timeAs other progressives demand Biden end bipartisan negotiations, Sanders is instead working on the next package.Back in April, he shared the rare image and the story on his social media.For once, can we consider the whale's side of the story?", "Section": "", "Writers": "", "URL": "https://sports.yahoo.com/olympics-condoms-home-social-distancing-013947536.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}