{"Type": "", "Time": "2021-06-14", "Headline": "Man falls 40m to his death at Tuas building site, MOM probing incident, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.A man was found dead at the building site of an upcoming warehouse on Thursday after falling some 40m, the equivalent of 14 floors of a housing block.The 25-year-old Bangladeshi was working on the building of a stairwell at the site, and was crossing the gap between the walls of a stairwell when a structure used to bridge the gap gave way, causing him to plunge to his death, a spokesman for the Ministry of Manpower (MOM) said yesterday.In response to queries from The Sunday Times (ST), the police said they received a call alerting them to the incident at 20 Tuas South Avenue 14 at 5.30pm on Thursday.When paramedics from the Singapore Civil Defence Force arrived, they said the man was dead. The police said they are investigating but no foul play is suspected.The construction site is where the Logos Tuas Logistics Hub is being built. When completed, it will have one two-storey warehouse and another four-storey one.The complex spans an area nearly six times the size of the Padang. The first phase of construction is expected to be completed in the fourth quarter of this year.According to the firm's website, the building will have an approved dangerous goods storage space on the first floor.A Logos spokesman confirmed that the man who died was an employee of one of its contractors.\"Logos is currently investigating the details of the incident and is working closely with the general contractor and cooperating with the local authorities,\" she said. \"Safety is Logos' No. 1 priority and our thoughts are with the family.\"The MOM spokesman told ST that the occupier of the site is HPC Builders, and the man was employed by BHD Construction.The MOM is investigating the incident, and has instructed HPC to stop work on the stairwells.There were 14 workplace deaths between January and April this year, and close to 3,300 workplace injuries between January and March.On June 6, an SMRT technician was killed and his colleague injured after a car jack supporting the bus they were working on gave way.On Thursday, a Malaysian worker fell from a height of about 15m while unloading steel pipes from a ship. SCDF officers went to his aid and he was found to have a head injury and limb fractures.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/man-falls-40m-to-his-death-at-tuas-building-site-mom-probing-incident", "Source": "google"}