{"Type": "", "Time": "2021-06-14", "Headline": "Nabil Fekir will cost Arsenal 'a lot of money'", "Text": "Nabil Fekir will set suitors Arsenal back 'a lot of money' this summer, according to Real Betis sporting director Antonio Cordon.Fekir has long been linked with a move to north London and they seem undeterred by his underwhelming production in recent times. During the 2017/2018 season the attacking midfielder was electric for Lyon, registering 18 goals and seven assists, form that attracted strong interest from Liverpool. However, over the past two seasons he has managed just 12 La Liga goals for Betis. But while his productivity has waned, the club still consider him one of their most important players. According to AS, Manuel Pellegrini views Fekir as someone he wants to build his attack around next season. His importance has also been espoused by Betis' sporting director. Asked about the interest in Fekir, Cordon said: \"In no club in the world is there is a non-transferable player. For us, it is a cornerstone to have him and keep him, if someone wants to come for him, they will have to pay a lot of money.\"Cristiano Ronaldo's agents have reached out to Man Utd, PSG and Real Madrid to discuss the likelihood of a transfer away from Juventus this summer.Antonio Conte has suggested he turned down the chance to become Tottenham manager because he was not convinced by their long-term project.Remembering Antonio Conte's overhead kick in Italy's 2-1 win over Turkey at Euro 2000.Sergio Ramos wants to sign a one-year contract at Real Madrid but may not be offered it after clashing with president Florentino Perez.Finances are not the only roadblock for a potential deal either; it is thought that Fekir has no desire to leave Betis during the upcoming transfer window. The news is a blow to Arsenal, who have earmarked him as Martin Odegaard's successor. The Norwegian arrived on loan from Real Madrid in January but that deal has now expired. The Gunners had wanted to make the deal permanent but the transfer seems unlikely. The summer could be a busy one for Arsenal. Not only are they looking to strengthen following a poor season, they also want to trim the squad. Hector Bellerin and Alexandre Lacazette have both been linked with exits while Granit Xhaka's departure to Jose Mourinho's Roma is imminent. © 2021 Minute Media - All rights reserved", "Section": "", "Writers": "", "URL": "https://www.90min.com/posts/real-betis-sporting-director-says-nabil-fekir-arsenal", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}