{"Type": "", "Time": "2021-06-14", "Headline": "At least 11 killed, 37 injured in gas explosion in China's Hubei province-World News , Firstpost", "Text": "\n                        The explosion took place at the Yanhu market in Shiyan when many residents were having breakfast or buying vegetables, South China Morning Post reported\r\n\r\n\n                    \n                            Representational Image. ANI\n                        Beijing: At least 11 people were killed and 37 others seriously injured in a huge gas explosion in central China's Hubei Province on Sunday, official media reported.The blast took place at about 6.30 am local time in the Zhangwan district of Shiyan city. Media reports said a market in the district was hard hit.Eleven people were killed and 37 others injured in the explosion which has destroyed several buildings, state-run CGTN-TV reported.Hong Kong-based South China Morning Post reported that the explosion took place at the Yanhu market in Shiyan when many residents were having breakfast or buying vegetables in the market.The city's municipal office initially said \"many\" people were trapped after the incident. Images and video footages circulating on social media platform Weibo showed rescue workers working through the wreckage of flattened houses.The cause of the accident is under investigation.\n                Updated Date:\n                \n                    June 13, 2021 12:57:28 IST\n                \n\n                        TAGS:\n                    \n                Pakistan's Special Assistant Health Dr Faisal Sultan said China provided the raw material for the vaccine but still it was not easy to develop it.\n            \n                What exactly motivated them to make the epic journey remains a mystery.\n            \n                There have been calls for boycott of Chinese products after face-off between the armies of the two countries in eastern Ladakh last year.\n            Sign up for a weekly curated briefing of the most important strategic affairs stories from across the world.FirstpostSectionPlusToolsAppsNetwork18 sites Copyright © 2021. Firstpost - All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.firstpost.com/world/at-least-11-killed-37-injured-in-gas-explosion-in-chinas-hubei-province-9712221.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}