{"Type": "Singapore", "Time": "2021-06-14", "Headline": "Gojek to reduce service fees for drivers by half; cut to 10% from Jun 21", "Text": "SINGAPORE: Gojek drivers in Singapore will pay less to the ride-hailing platform from Jun 21, in a scheme that will last to at least the end of 2022.The company announced on Monday (Jun 14) it would reduce service fees for all drivers from 20 per cent to 10 per cent, \"allowing them to take home more earnings immediately without having to rely on incentives\".It will also implement a flat fee payout of S$3 for pickups of 3km or more, as well as new daily peak hour targets. Gojek said this would boost earnings by up to S$100 during peak hours.The new service fee, flat fee payout and peak hour targets will be implemented on Jun 21.There are no performance requirements for the lower service fees and all drivers are eligible regardless of their GoalBetter tier, said Gojek on its driver-partner blog.For Gojek taxi drivers, their service fees will continue to be waived until Aug 8, 2021.There will also be no performance requirements for the S$3 flat fee for far pickups. All drivers, as well as both GoCar and GoTaxi trips, are eligible for the S$3 flat fee.\"These changes ... are designed to help (driver-partners) take home more earnings per trip and build a sustainable livelihood on the Gojek platform,\" said Mr Lien Choong Luen, General Manager of Gojek Singapore.The press release added: \"The changes announced today reflect a significant investment in Singapore - a strategic market for Gojek - and are aligned to the company’s goal to further strengthen its market share and maximise business potential in the country.\"FARE INCREASE BY GRABGojek's latest moves comes off the back of changes made by rival Grab, which last monthincreased its fares by S$1 for passengers using the app. The increase took effect from Jun 1, with 100 per cent of the S$1 going to drivers for the month of June 2021.The firm, which typically takes about 20 per cent of each fare, said it would not collect commissions from this S$1 during this period.Grab said then that the revision was aimed at improving earnings for drivers.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Gojek,transport", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/gojek-cut-service-fees-drivers-10-per-cent-jun-21-grab-15011498", "Source": "google"}