{"Type": "", "Time": "2021-06-14", "Headline": "Asian stocks set for muted start with focus on Fed | The Edge Markets", "Text": "Ways to search theedgemarkets.com contentby Title: @title \"the edge malaysia\"by Author: @author \"lucas wong”by category: @category \"corporate\" \"hot stock” Combine search:  \"high speed rail\" @author \"Bhattacharjee\" @category \"From the Edge\"Searching either words : 1MDB MAS Searching all words : “Genting Berhad”Searching Chinese phrase : “马电讯”(June 14): Asian stocks looked set for a muted start to the week as investors prepare for a key Federal Reserve meeting.Futures were little changed in Japan. Trading volumes are expected to be light with a number of holidays in the region including in Australia, China and Hong Kong. U.S. futures were steady after stocks staged a late rally Friday, closing at another record after a choppy day of trading. Ten-year Treasury yields inched up to around 1.45% after hitting three-month lows on Thursday, but still notched their biggest weekly slide since December.The dollar was steady against Group-of-10 peers during early Asia trading in the wake of a Group-of-Seven leadership meeting that emphasized unity.With Treasury yields on the retreat, investors are anticipating the Fed will reaffirm that its ultra-loose policy remains appropriate, and that it’s too soon to start even contemplating tapering bond purchases. Still, officials could project interest-rate liftoff in 2023 amid faster economic growth and inflation, according to economists surveyed by Bloomberg.“The FOMC continues to see the jump in inflation as transitory, and may acknowledge, even at the margin, that they are discussing the pace of monthly purchases but won’t yet commit to a date for slowing the purchases,” said Prudential Financial Inc. strategist Quincy Krosby in emailed comments.Elsewhere, Bitcoin jumped after Elon Musk said Tesla would resume transactions with the cryptocurrency when mining it is done with more clean energy.These are some of the main moves in markets:We deliver news to your inbox daily© All rights reserved. 2020. The Edge Communications Sdn. Bhd.  ", "Section": "", "Writers": "", "URL": "https://www.theedgemarkets.com/article/asia-stocks-set-muted-start-focus-fed", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}