{"Type": "", "Time": "2021-06-14", "Headline": "Shannon Deery: Life in Victoria must continue as Covid spot fires emerge | Herald Sun", "Text": "We’re in a position to experiment with methods other than lockdown to stop Covid’s spread — but it will take courage from authorities.Another lockdown done and dusted. There must be no more, except in the most desperate of circumstances.The devastating social impacts and dire economic consequences of forcing businesses to close, stopping kids going to school, keeping people locked in their homes and keeping family and friends apart, are now only too well known.After four lockdowns we might know what to expect, but that doesn’t make it any easier.Kids Helpline recorded a 184 per cent increase in youth suicide attempts in Victoria from December 2020 to May 2021 compared to one year earlier.Reasons for the surge included “the impact of isolation and lockdowns” and the “increased stress” of young people not being at school. Consequently, there has been an increase in young people trying to access community-based mental health services.This was recognised by the state government last week with the immediate injection of $10m into critical mental health services.After a record $3.8bn investment in mental health announced in last month’s budget, the extra $10m is small money. But it is recognition that critical services need funding right now.The government is no doubt feeling justified in locking Victorians up for a fourth time.Modelling by the Burnet Institute, released last week, found that without the action up to 2000 Victorians would have contracted Covid-19 by August.There can be no arguing the lockdown worked. Of course it did. When people can’t mix, the virus can’t spread. But there must be another way. How can it be that after more than 15 months we’re no more advanced at dealing with this virus? Fortunately, unlike so many countries around the world still dealing with uncontrollable levels of the virus, Victoria is not in that position. Just two cases were discovered after more than 80 days of no locally acquired transmissions. Which leaves us in the unique position to be bold with our approach, and experiment with methods that don’t force the state to grind to a halt. But it will take courage from authorities to let life continue while putting out the spot fires that will no doubt continue to emerge.Victorian members of the Committees for Cities and Regions are now calling on the state government to develop a long-term Covid readiness plan. They rightly point out staged restrictions and recovery road maps are too often inconsistently applied.“This unpredictability of government decision-making contributes to the general unease in the community about unforeseeable restrictions that could be imposed upon Victorians at any moment,” they say.“The lack of a clear and consistent approach to reopening and locking down Victorian communities erodes business and consumer confidence to plan, resulting in damaging effects to local economies, community mental health outcomes and the reputation of Victoria as the place to be.”Among other things they want “a common set of publicly available and industry-informed standards to be applied to decision-making on Covid restrictions in Victoria.”The government has long kept the rationale behind its decision-making process secret, saying only it is based on “public health advice”.But increased transparency over the process will not only instil confidence, but could prompt a public debate about how to move forward. And how to do so without another lockdown.It beggars belief that four days after wild storms lashed parts of the state, tens of thousands of Victorians remain in the dark.More than 250,000 homes in storm damaged areas lost power last Thursday. Thousands were last night still waiting for the lights to come back on. In the middle of winter and with ongoing Covid-19 restrictions in place, they’ve sat for days with no power, no lighting and for many, no heating.The net of blame could be cast far and wide. But ultimately, this is an act of God and the blame game serves little purpose.What is hard to fathom is the virtual radio silence over the issue.The fact that hundreds of thousands of people were left without power, lights and heating is nothing short of a disaster.But the pandemic is all consuming. The morning after the storms acting Premier James Merlino fronted the media to announce an easing of restrictions. There was reference to the storms, but not much of substance.Energy minister Lily D’Ambrosio put out a series of tweets, and thanked energy companies for their efforts in restoring services to normal.In normal times, it’s hard to imagine Ms D’Ambrosio not fronting the media at least once, but probably multiple times, to update the community and instil a sense of confidence.It begs the question: With such intense government focus on Covid, what else is being ignored, or given less attention than it deserves?Carrying on the business of government alongside a pandemic response has been a problem for governments the world over. Taxpayers should be concerned about the reintroduction of the virus, particularly through government error.Because every time Covid-19 returns through a hotel quarantine breach or similar failure by authorities, the government is forced to again turn all attention to eliminating the scourge. And that can only be to the detriment of other critical functions. — Shannon Deery is Herald Sun state politics editorShannon Deery is the Herald Sun's state political editor. He joined the paper in 2007 and covered courts and crime before joining the politics team in 2020.To join the conversation, please\n log in. Don't have an account?\n RegisterJoin the conversation, you are commenting as  Logout\nThe Bruce Pascoe hoax is more proof that the ABC is strangled by group-think, where only one opinion seems allowed.“Aboriginal historian” Bruce Pascoe’s jig is up, with woke Leftists now admitting he told untruths.Our Apps", "Section": "", "Writers": "", "URL": "https://www.heraldsun.com.au/news/opinion/shannon-deery-life-in-victoria-must-continue-as-covid-spot-fires-emerge/news-story/da8d5183140c3b23a2182feefc81e2f4", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}