{"Type": "", "Time": "2021-06-14", "Headline": "'Small' groups don't decide fate of the world, cautions China, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BEIJING • China pointedly cautioned Group of Seven (G-7) leaders yesterday that the days when \"small\" groups of countries decided the fate of the world were long gone, hitting back at the richest democracies as they sought to act in concert to counter Beijing's might.The emergence of China as a global power has unnerved the United States. President Joe Biden casts China as the US' main strategic competitor and has vowed to confront China's \"economic abuses\" and push back against its alleged human rights violations.\"The days when global decisions were dictated by a small group of countries are long gone,\" a spokesman for the Chinese Embassy in London said.\"We always believe that countries, big or small, strong or weak, poor or rich, are equals, and that world affairs should be handled through consultation by all countries.\"The Chinese spokesman said the only valid global system was the international order based on the principles of the United Nations and \"not the so-called rules formulated by a small number of countries\".The G-7, whose leaders met in south-western England, has been searching for a coherent response to the growing assertiveness of President Xi Jinping after China's spectacular economic and military rise over the past 40 years.Leaders of the group, which comprises the US, Canada, Britain, Germany, Italy, France and Japan, want to use their gathering in the English seaside resort of Carbis Bay to show the world that the richest democracies can offer an alternative to China's growing clout.Canadian Prime Minister Justin Trudeau led a G-7 discussion of China on Saturday and called on leaders to come up with a unified approach to the challenges posed by the People's Republic, a source said.The G-7 is planning to offer developing nations an infrastructure scheme that could rival Mr Xi's multitrillion-dollar Belt and Road Initiative. Beijing has repeatedly hit back against what it perceives as attempts by Western powers to contain China, and says many major powers are still gripped by an outdated imperial mindset after years of humiliating China.Separately, Australian Prime Minister Scott Morrison said on Saturday at a G-7 press conference that his government wants to restart dialogue with Beijing, as a series of trade reprisals from China strain the already-weakened relationship between the two countries.\"We, of course, would like to see the dialogue that was occurring to continue again and start again,\" Mr Morrison said. \"Australia is always ready to sit around the table and talk through how our partnership can be made to work.\"In an interview on Sky News yesterday, Australian Trade Minister Dan Tehan said he wrote a letter in January to his Chinese counterpart laying out ways they could constructively engage. \"I'm still waiting for a response,\" he said.Before the G-7 gathering, Mr Morrison said he would seek support from other global leaders to counter what he called \"economic coercion\".The days when global decisions were dictated by a small group of countries are long gone. We always believe that countries, big or small, strong or weak, poor or rich, are equals, and that world affairs should be handled through consultation by all countries.At a meeting with Mr Biden and British Prime Minister Boris Johnson at the summit, Mr Morrison discussed what he called issues of \"mutual concern\" that included the Indo-Pacific region.Ties between Canberra and Beijing, which became strained in 2018, nosedived last year when Mr Morrison's government called for independent investigators to probe the origins of the Covid-19 pandemic and criticised Chinese actions in Hong Kong and Xinjiang.REUTERS, BLOOMBERGJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/small-groups-dont-decide-fate-of-the-world-cautions-china", "Source": "google"}