{"Type": "", "Time": "2021-06-14", "Headline": "Rare earth metals at the heart of China's rivalry with US, Europe", "Text": "What if China were to cut off the United States and Europe from access to rare minerals that are essential to electric vehicles, wind turbines and drones?At a time of frequent geopolitical friction among those three powers, Washington and Brussels want to avoid this scenario by investing in the market for 17 minerals with unique properties that today are largely extracted and refined in China.\"The expected exponential growth in demand for minerals that are linked to clean energy is putting more pressure on US and Europe to take a closer look at where the vulnerabilities are and the concrete steps these governments can take,\" said Jane Nakano, a senior fellow at the Washington-based Center for Strategic and International Studies.In 2019, the United States imported 80 percent of its rare earth minerals from China, the US Geological Survey says.The European Union gets 98 percent of its supply from China, the European Commission said last year.Amid the transition to green energy in which rare earth minerals are sure to play a role, China's market dominance is enough to sound an alarm in western capitals.- Cars and turbines -Rare earth minerals with names like neodymium, praseodymium and dysprosium are crucial to the manufacture of magnets used in industries of the future like wind turbines and electric cars. And they are already present in consumer goods such as smartphones, computer screens and telescopic lenses.Others have more traditional uses, like cerium for glass polishing and lanthanum for car catalysts or optical lenses.This week the US Senate passed a law aimed at improving American competitiveness that includes provisions to improve critical minerals supply chains, following a similar executive order issued by President Joe Biden in February.Washington aims to boost production and processing of rare earths and lithium, another key mineral component, while \"working with allies and partners to increase sustainable global supply and reduce reliance on geopolitical competitors,\" Deputy Director of the National Economic Council Sameera Fazili said Tuesday.- Boosting US production -The best hope for boosting American production can be found at the Mountain Pass mine in California.Once one of the major players in the sector, the mine suffered as China rose and ate up its market share, aided by Beijing's heavy government subsidies.MP Materials relaunched the mine in 2017 and aims to make it a symbol of America's industrial rebirth, saying the concentration of rare earths at its site is one of the world's largest and highest-grade rare earth deposits, with soil concentrations of seven percent versus 0.1 to four percent elsewhere.The company's aim is to separate rare earth minerals from each other via a chemical process, and then by 2025 manufacture the magnets that industry uses -- as market-leading Chinese firms currently do.The project was supported by the US government, while a Chinese firm is a minority shareholder.Elsewhere, Australian company Lynas has won several contracts in the United States, including an ore refinery in Texas for the military that was supported by the Defense Department.- Complications for Europe -In Europe, Bernd Schafer, CEO and Managing Director of rare earth mineral consortium Eit Raw Materials, said this month that an \"action plan\" will soon be presented to the European Commission on how to boost production.Europe, however, faces a more complicated path to achieving this goal, said David Merriman, a specialist in batteries and electric cars for London-based consultancy Roskill.\"Europe is expected to rely on importing raw materials or semi-processed materials and become more a processing base or recycling base,\" he said.China is expected to remain dominant for some time to come, but Schafer said that if recycling is scaled up, \"20 to 30 percent of Europe's rare earth magnet needs by 2030 could be sourced domestically in the EU from literally zero today.\"The desire to accelerate rare earth production comes amid a shortage of semiconductors, which are essential for the computing and automotive industries and mostly manufactured in Asia.The scarcity \"has caused global manufacturers to think about their supply chain in a new way, and think about vulnerabilities,\" a spokesman for MP Materials said, adding that several European automotive and wind power firms are already in contact with the company.alb/cs/dwIt is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.The executive condo is an alluring property in Singapore because it serves ‘sandwich class’ Singaporeans. Whether it’s EC grant, EC income ceiling or resale levy, read everything you need to know about executive condos here.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.President Recep Tayyip Erdogan on Sunday said Turkey would be the \"only reliable\" country left to stabilise Afghanistan after the US pulls out its troops, indicating Washington could rely on its NATO ally.Newly-crowned French Open champion Barbora Krejcikova hailed her mentor and former Wimbledon champion Jana Novotna who died in 2017, saying: \"At the end of her life, I had to be there.\"Several hundred people gathered in London, Ontario on Saturday to pay homage to a Muslim family deliberately mowed down by the driver of a pick-up truck, in an attack that has shocked Canadians and which Prime Minister Justin Trudeau denounced as \"terrorist.\"Discover the benefits of a cloud that offers limitless scale, performance—and possibilities for what you can achieve.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.The trial of ousted Myanmar leader Aung San Suu Kyi will hear its first testimony in a junta court Monday, more than four months after a military coup.Foreign forces should hold 'no hope' of keeping a military presence in Afghanistan after the US and NATO withdraw troops, the Taliban said Saturday, warning the security of embassies and airports would be the responsibility of Afghans.Amazon.comNovak Djokovic claimed a 19th Grand Slam title and became the first man in 52 years to win all four majors twice when he came from two sets down to beat Stefanos Tsitsipas in a gripping French Open final on Sunday.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.An American father-son duo accused of packing former Nissan chief Carlos Ghosn into an audio equipment case so he could escape trial in Japan will appear in a Tokyo court for the first time Monday.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Grab Holdings CEO Anthony Tan said he’s confident the SPAC merger will be completed by year-end, following a delay caused by a review of its financials.When you want protection that goes beyond just covering your medical costs, critical illness insurance is the logical choice. But with so many options out there, which ones are best for you? We investigate in this article. In a nutshell, critical illness insurance is insurance […] The post Best Critical Illness Insurance Plans In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.New $89 Portable Air Cooler Everyone In The U.S. Is Talking AboutUS President Joe Biden on Sunday congratulated incoming Israeli prime minister Naftali Bennett after an alliance of parties ousted Benjamin Netanyahu and formed a new government.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.Search for private jet membership. The affordable price makes these private jet offers hard to resistTwo strategies to consider when making investment decisions. The post Getting Started: What is Averaging Up and Averaging Down appeared first on The Smart Investor.The Ministry of Health (MOH) on Sunday (13 June) reported the detection of 13 new cases of COVID-19 infection in Singapore, taking the country's total case count to 62,276.US President Joe Biden on Sunday congratulated incoming Israeli prime minister Naftali Bennett after an alliance of parties ousted Benjamin Netanyahu and formed a new government.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/rare-earth-metals-heart-chinas-011737206.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}