{"Type": "", "Time": "2021-06-14", "Headline": "Jewel to reopen but airport terminals to stay closed to public, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Jewel Changi Airport will reopen on Monday, about a month after it was closed, as no new Covid-19 infections linked to a large cluster at Terminal 3 (T3) have been detected in the last three weeks.This comes as other measures in the past month's heightened alert phase will also be eased, as Singaporeans gradually return to working and living as before.\"Deep cleaning and disinfection of Changi Airport's passenger terminal buildings and Jewel Changi Airport have been completed,\" the Civil Aviation Authority of Singapore and Changi Airport Group said yesterday. \"(They) are on track to reopen safely and progressively.\"Passenger terminal buildings remain closed to the public, however, and Jewel's reopening is only the first of a phased process, with airport operations having undergone significant changes, including the segregation of about 14,000 airport workers into different risk zones.This is to minimise the transmission risks revealed by the T3 cluster, which began at the arrival halls and baggage claim areas, where staff came into contact with passengers.The cluster spawned 108 cases, 43 of whom were airport workers.Staff working in the highest-risk areas will have to wear personal protective equipment at all times, except when they are eating or resting. Inbound and outbound passengers will also no longer have opportunities to intermingle.Increased testing will become part and parcel of working life for some airport employees.Since May 23, those in higher-risk roles have had to take an additional antigen rapid test between a seven-day routine polymerase chain reaction test.Some are now taking Covid-19 breath tests as part of a small-scale pilot, with the airport authorities hoping that routine testing will be quicker and more comfortable for airport workers.The disposable TracieX breathalyser, which has just been approved by the Health Sciences Authority, is non-invasive, has been shown by trials to be almost as accurate as the PCR test, and can generate results within two minutes.It may eventually replace the antigen rapid tests for workers.Minister for Transport S. Iswaran, who visited T3 yesterday, said the breathalyser could be a game changer, but still urged caution.\"We are using this opportunity to administer the trial in the airport, and we will continue to scale it up so that there is more data,\" he said. \"In the first instance, it is promising, but we need to do a lot of work, and I think the testing will continue and gather pace as we go forward.\"Asked about the Transport Ministry's strategy for reopening borders, Mr Iswaran said it depends on circumstances here and in the countries Singapore is engaging.In Singapore, factors to consider include how extensively and quickly the population is vaccinated, how widely available tests and testing facilities are, and if tracing of new cases remains effective.The operations at Changi Airport as a point of entry are also critical, he said, and the airport authorities have fundamentally re-examined operations in the last few weeks.He said Singapore is in conversation with \"many potential partners\", including South Korea, and that both Hong Kong and Singapore remain fully committed to resuming their air travel bubble.\"Right now, our engagement with all our partners has been on the various preparatory elements - whether vaccination, testing or other kinds of protocols. When the conditions are right, then we will be able to mobilise,\" he said.SEE THE BIG STORYJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/jewel-to-reopen-but-airport-terminals-to-stay-closed-to-public", "Source": "google"}