{"Type": "", "Time": "2021-06-14", "Headline": "PSG.LGD trounce Evil Geniuses 3-0 to claim WePlay AniMajor title", "Text": "Chinese powerhouse PSG.LGD have been crowned as the newest Major champions of the 2021 Dota Pro Circuit (DPC) after they capped off a dominant run through the WePlay AniMajor with a resounding 3-0 sweep over top North American team Evil Geniuses (EG) in the grand finals.PSG.LGD had a blazing start to the AniMajor after they topped the Group Stage with a stellar 11-3 record, which earned them an upper bracket berth in the Playoffs. The Chinese squad then cemented themselves as the heavy favourites to win the tournament after they defeated Alliance, Team Nigma, and T1 to be the first team to reach the grand finals. Meanwhile, EG had to take the hardest road to the grand finals. They barely managed to survive the Group Stage with a middling 7-7 record and had to start the Playoffs from the lower bracket. However, the North American squad were able to find their groove and tear through the lower bracket — besting the likes of NoPing Esports, TNC Predator, Team Nigma, and Vici Gaming — to survive to the last day of the AniMajor.EG then outlasted T1 in the lower bracket finals to earn the right to challenge PSG.LGD in the grand finals.PSG.LGD kicked off the grand finals with a bang as they absolutely dominated EG in a 33-minute game oen behind Wang \"Ame\" Chunyu's carry Axe and Cheng \"NothingToSay\" Jin Xiang's mid Razor. Ame and NothingToSay combined for 23 kills and 22 assists against zero deaths between the two of them to pace PSG.LGD's 30-6 kill lead by the time their opponents called GG.EG put up a better fight in game two, as they dominated the early game behind an excellent showing from Abed Azel \"Abed\" Yusop on Storm Spirit. However, PSG.LGD were able to repel their opponents' pushes and delay the game long enough for Ame's Terrorblade to become the strongest hero in the map. Even Abed's series-high 14 kills against just two deaths on his Storm Spirit was not enough to stop PSG.LGD from taking a commanding 2-0 series lead after 47 minutes of action.PSG.LGD sensed blood in the water in game three, as they looked to overwhelm EG with relentless aggression behind their dominant team fight tri-core of Naga Siren for Ame, Death Prophet for NothingToSay, and an offlane Axe for Zhang \"Faith_bian\" Ruida. Despite EG's best efforts to hold on, PSG.LGD could not be denied from forcing the GG call at the 36-minute mark to secure their victory in the grand finals with a clean 3-0 series sweep. With their victory, PSG.LGD claim the championship of the WePlay AniMajor as well as the grand prize of US$200,000 and 500 DPC points. This is now the third DPC Major championship for Ame and the PSG.LGD organisation, who won their first two Major championships back-to-back at EPICENTER XL and the MDL Changsha Major in April and May 2018.Meanwhile, EG bow out of the WePlay AniMajor in second place and with US$100,000 and 450 DPC points in consolation. It is the second time that the North American team have fallen short of a Major championship in the 2021 DPC at the hands of Chinese opponents. Back in April, EG were defeated by Chinese team Invictus Gaming in the grand finals of the ONE Esports Singapore Major in a dramatic 3-2 reverse sweep.With the conclusion of the WePlay AniMajor, the 2021 DPC will soon be reaching its climax with The International 10 (TI10) in Stockholm, Sweden this August. PSG.LGD and EG will be among the 18 teams competing in the latest iteration of Dota 2's annual world championship tournament, where the Aegis of Champions and the lion's share of a massive US$40 million prize pool will be at stake.Wang \"Ame\" ChunyuCheng \"NothingToSay\" Jin XiangZhang \"Faith_bian\" RuidaZhao \"XinQ\" ZixingZhang \"y`\" YipingArtour \"Arteezy\" BabaevAbed Azel \"Abed\" YusopDaryl \"iceiceice\" KohAndreas \"Cr1t-\" NielsenTal \"Fly\" AizikRead also:WePlay AniMajor Playoff Preview: The race for TI10 direct invitesWePlay AniMajor: Everything you need to knowFor more esports news updates, visit https://yhoo.it/YahooEsportsSEA and check out Yahoo Esports Southeast Asia’s Facebook page and Twitter.Check out esports videos from Yahoo TV:It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Newly-crowned French Open champion Barbora Krejcikova hailed her mentor and former Wimbledon champion Jana Novotna who died in 2017, saying: \"At the end of her life, I had to be there.\"LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Several hundred people gathered in London, Ontario on Saturday to pay homage to a Muslim family deliberately mowed down by the driver of a pick-up truck, in an attack that has shocked Canadians and which Prime Minister Justin Trudeau denounced as \"terrorist.\"President Recep Tayyip Erdogan on Sunday said Turkey would be the \"only reliable\" country left to stabilise Afghanistan after the US pulls out its troops, indicating Washington could rely on its NATO ally.The executive condo is an alluring property in Singapore because it serves ‘sandwich class’ Singaporeans. Whether it’s EC grant, EC income ceiling or resale levy, read everything you need to know about executive condos here.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Novak Djokovic claimed a 19th Grand Slam title and became the first man in 52 years to win all four majors twice when he came from two sets down to beat Stefanos Tsitsipas in a gripping French Open final on Sunday.Grab Holdings CEO Anthony Tan said he’s confident the SPAC merger will be completed by year-end, following a delay caused by a review of its financials.Protect yourself from Mosquitoes the moment you turn it on. These are selling fast, here is how it works.Foreign forces should hold 'no hope' of keeping a military presence in Afghanistan after the US and NATO withdraw troops, the Taliban said Saturday, warning the security of embassies and airports would be the responsibility of Afghans.What if China were to cut off the United States and Europe from access to rare minerals that are essential to electric vehicles, wind turbines and drones?The trial of ousted Myanmar leader Aung San Suu Kyi will hear its first testimony in a junta court Monday, more than four months after a military coup.Search for private jet membership. The affordable price makes these private jet offers hard to resistEven in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.An American father-son duo accused of packing former Nissan chief Carlos Ghosn into an audio equipment case so he could escape trial in Japan will appear in a Tokyo court for the first time Monday.Right-wing candidate Keiko Fujimori insisted Saturday that Peru's presidential election was marred by fraud, as final vote counting dragged on with her leftist rival slightly ahead.Every PC user must read this in 2021 - Do it now.Several thousand people joined an interfaith marched on Friday evening honoring the four members of a Muslim family who were killed in an attack that has shocked Canada.Malaysia on Sunday deported a leading figure in conspiracy circles who is wanted in France over the kidnapping of an eight-year-old girl, sources told AFP.US President Joe Biden on Sunday congratulated incoming Israeli prime minister Naftali Bennett after an alliance of parties ousted Benjamin Netanyahu and formed a new government.Liver cancer indicators may be more subtle than you think. Take a look at liver cancer warning signs and symptoms.Moscow mayor Sergei Sobyanin on Saturday announced a \"non-working\" week in the Russian capital, with non-essential workers told to stay home, as Covid-19 cases hit a six-month high.Two strategies to consider when making investment decisions. The post Getting Started: What is Averaging Up and Averaging Down appeared first on The Smart Investor.Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/psg-lgd-trounce-evil-geniuses-3-0-to-claim-weplay-animajor-dota-2-231339467.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}