{"Type": "", "Time": "2021-06-14", "Headline": "US and NATO: Manufacturing a new cold war? | NATO | Al Jazeera", "Text": "The US wants to remain the sole superpower in the world and wants its NATO allies to rally behind unipolarity.The North Atlantic Treaty Organization is trying to find its way back to “normalcy” after four years of drama under the fitful leadership of former US President Donald Trump.This will prove a challenging task. NATO seems to have lost its mojo after Trump deformed its strategic vision and values and cast doubt over its shared destiny, albeit rhetorically.But the advent of the trans-atlanticist Joe Biden is breathing life and vitality into the pact, as the US president tries to assure European allies of his administration’s seriousness in rebuilding trust and restoring harmony.This is not the first time the alliance is recovering after an internal crisis.In fact, during the past few decades, there has been an eerie perception of some sort of a NATO crisis or another: a “profound crisis”, a “deepening crisis”, a “fundamental crisis”, a “general crisis”, an “unprecedented crisis” and even – a “real crisis”.But NATO has always recovered.Even before the end of the Cold War, NATO had its share of rift and discord whether over the Suez crisis, the Vietnam War, the Cuban Missile Crisis, and the presence of authoritarian regimes within its ranks. Still, fear of the Soviet Union during the Cold War helped unite its members regardless of their discord. The greater the threat perception, the deeper the unity.When the Eastern Bloc collapsed in 1989, the alliance which was created to keep the Soviets out, the Germans down and the Americans in Western Europe, lost its raison d’être. Disagreement within NATO persisted, shifting to enlargement towards the East and the ward and various military deployments in the greater Middle East.In 2001, 24 hours after the 9/11 attacks on New York and Washington, NATO invoked Article 5, the cornerstone of its collective defence, for the first time in its history. But fighting asymmetrical wars outside its long-defined area of operation, notably in Afghanistan, proved a thankless endeavour and a source of tension.Over the past 30 years, NATO still managed to keep its unity, going through a number of cosmetic and structural surgeries to restore its vitality. It even almost doubled its membership from 16 to 30 members.The alliance has repeatedly overcome internal discord through adaptation and compromise. It will do so again on June 14 in Brussels, hoping to enhance its appearance and performance in an ever more competitive world. Biden’s high popularity in Europe in comparison to Trump will certainly help.NATO will once again rely on the fact that there is more that unites its members than divides them.That, in my opinion, is first and foremost protecting their common economic and financial interests. With a population of almost a billion people and half of the world’s gross domestic product (GDP), NATO has decidedly been the military arm of a privileged club of Western capitalist democracies.Today, the alliance faces two major strategic challenges, rising China and resurging Russia, which pose cyber-, space, and geopolitical threats, including in “the Global South”, where Beijing and to some degree Moscow are expanding.All other issues that have been raised in public, such as climate change, human security, and development, etc are window dressing. This is not because they are not important – they most certainly are – but rather because they are more G7 than NATO material.But since the Trump psychological rupture, some Europeans are said to be wary of being overdependent on the US for their security, as they were over the past seven decades.NATO’s junior members have been especially traumatised by the erratic president’s behaviour, while the more senior continental members, like France and Germany, have been wary but also savvy in their reactions. They are exploiting the American debacle to call for a greater European security autonomy and a more equal partnership with the US.They have also embraced a more nuanced, less dramatic view of the challenges posed by Russia and China than the Biden administration has. They would rather avoid Cold War rhetoric and emphasise engagement over confrontation with Russia and Beijing.And they have a point.Russia, as former President Barack Obama put it, is today no more than “a regional power” whose bellicose actions are an expression of weakness rather than strength.It is better to contain Russia through political and economic engagement than alienate it through strategic confrontation.And while rising China presents a whole new geopolitical puzzle, it is no Soviet Union.Despite its enormous economic power and strategic ambition, it espouses no alternative vision for the world. And since joining the World Trade Organization in 2001, Beijing has integrated its economy into the Western-led world economic system and enjoys tremendous windfall from its trade with the West.The Europeans see China as an economic competitor or at worst, a rival, and are content with a multipolar world. But Washington looks at China through a different lens. It reckons China is determined to become an Asian hegemon and insists on containing its rise before it becomes the world’s leading power. America wants to remain the world’s undisputed superpower.This means the Biden administration will have to charm and bully its divided but prosperous European partners into getting behind it.In fact, some of the pressure is already bearing fruit as Europeans are increasingly distancing themselves from China, especially in the technology and investment fields, and the UK has demonstratively deployed an aircraft carrier to the South China Sea.Practically speaking, NATO will sooner than later try to embrace a new strategic assessment along the lines of its 2010 strategic assessment, but one that contains more emphasis on political cohesion and coordination. The Europeans will demand greater parity and lobby Washington to act less unilaterally as it did under Trump or when the Biden administration decided on withdrawal from Afghanistan with virtually no real consultation until the last minute.For its part, Washington will continue to insist, as it did over the past decades, that Europe must pay for a greater say in NATO and show greater commitment to their collective security. It may also bring the Asian powers, Japan and South Korea, to the picture under the pretext of “defending democracy” in East Asia.Easier said than done? Perhaps.But the greater challenge lies in defining NATO’s new role and mission in light of Washington’s insistence on using the alliance to do what it must to maintain America’s world supremacy, which is certain to lead to a new cold war with China.Biden wants to use the NATO meeting to rally the alliance behind America before his June 16 summit with Russian President Vladimir Putin, knowing all too well that China is watching closely.Pushing for enlarging the alliance further into Ukraine and Georgia or for extending its force projection, in the future, are sure to provoke both Moscow and Beijing and push them closer together, with grave ramification for world security.Biden should be careful what he wishes for; it may just come true.Follow Al Jazeera English:", "Section": "", "Writers": "", "URL": "https://www.aljazeera.com/opinions/2021/6/13/us-and-nato-manufacturing-a-new-cold-war", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}