{"Type": "World", "Time": "2021-06-14", "Headline": "Macron and Johnson clash over Northern Ireland, as Brexit tensions rise at G7", "Text": "CARBIS BAY, England: Growing tensions between Britain and the European Union threatened to overshadow the Group of Seven summit's conclusion on Sunday (Jun 13), with London accusing France of \"offensive\" remarks that Northern Ireland was not part of the United Kingdom.Ever since the United Kingdom voted to leave the European Union in 2016, the two sides have been trying to work out how to deal with post-Brexit trade and the British province, which has a land border with EU member Ireland.Ultimately, the talks keep coming back to the delicate patchwork of history, nationalism, religion and geography that intertwine in Northern Ireland, but the latest spat over the Brexit divorce deal is centred on sausages.During talks with Emmanuel Macron at the G7 summit, British Prime Minister Johnson queried how the French president would react if Toulouse sausages could not be sold in Paris markets, echoing London's accusation that the EU is preventing sales of British chilled meats in Northern Ireland.British media reported that Macron responded by inaccurately saying Northern Ireland was not part of the United Kingdom, remarks British foreign minister Dominic Raab described as \"offensive\".\"Various EU figures here in Carbis Bay, but frankly for months now and years, have characterised Northern Ireland as somehow a separate country and that is wrong,\" Raab said.\"It is a failure to understand the facts. We wouldn't talk about Catalonia and Barcelona, or Corsica in France in those ways,\" he told the BBC's Andrew Marr programme.TRADE WAR?In a move that some worry could provoke a full-scale trade war, Johnson has threatened to invoke emergency measures in the Northern Ireland protocol of the Brexit divorce deal if no solution is found to the so-called \"sausage war\".That protocol essentially kept the province in the EU’s customs union and adhering to many of the single market rules, creating a regulatory border in the Irish Sea between the British province and the rest of the United Kingdom.But Johnson has already delayed the implementation of some of its provisions, including checks on chilled meats moving from the mainland to Northern Ireland, saying it was causing disruption to some supplies to the province.A French diplomatic source said Macron had been taken aback by Johnson bringing up sausages - which the British leader had said was a crucial issue but one the French regarded as a distraction from the main business at the G7 leaders' gathering.The president had merely been pointing out the sausage comparison was invalid due to the geographic differences, the source said.Repeatedly questioned at a news conference about Macron's comments during their talks, Johnson said Brexit had occupied a \"vanishingly small proportion of our deliberations\" during the summit in Carbis Bay, which ended on Sunday.\"We will do whatever it takes to protect the territorial integrity of the UK but actually what happened at this summit was that there was a colossal amount of work on subjects that had absolutely nothing to do with Brexit,\" he said.Macron told reporters at the G7's conclusion the two sides should stop wasting time on disputes about sausages.\"My wish is that we succeed collectively in putting into action what we signed several months ago,\" he said. \"Let's not waste time with controversies that are created in corridors and backrooms.\"He said France had never taken \"the liberty to question the sovereignty, the territorial integrity of the United Kingdom\".Despite a U.S.-brokered 1998 peace deal that brought an end to three decades of violence, Northern Ireland remains deeply split along sectarian lines: Many Catholic nationalists aspire to unification with Ireland while Protestant unionists want to stay in the UK.The EU does not want Northern Ireland to be a backdoor into its single market and neither side wants border checks between the province and the Republic of Ireland which could become a target for dissident militants.Instead, the two sides agreed to the protocol, which provides for checks between the province and the rest of the United Kingdom, though Britain now says these are too cumbersome and divisive. Johnson said on Saturday he would do \"whatever it takes\" to protect the UK's territorial integrity.\"It is time for the government to stop talking about fixes to the protocol and get on with taking the necessary steps to remove it,\" said Edwin Poots, leader of Democratic Unionist Party, Northern Ireland's largest political party.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Brexit,United Kingdom,Britain,European Union,Northern Ireland", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/brexit-northern-ireland-uk-britain-france-g7-15006354", "Source": "google"}