{"Type": "Sport", "Time": "2021-06-14", "Headline": "Football: Eriksen in 'good spirits', remains under observation, says agent", "Text": "COPENHAGEN: The agent of Christian Eriksen says that the Danish player is in \"good spirits\" but anxious to find out the cause of his cardiac arrest during his country's opening Euro 2020 game in Copenhagen.\"We spoke (on Sunday) morning. He was joking, and in good spirits, I found him well,\" Martin Schoots told Italian newspaper Gazzetta dello Sport on Monday (Jun 14).\"We all want to find out what happened, him included. The doctors are conducting detailed tests, it'll take time.\"Denmark's team doctor on Sunday confirmed that the 29-year-old Inter Milan midfielder had suffered a cardiac arrest.\"He was gone, and we did cardiac resuscitation,\" doctor Morten Boesen told a press conference.\"How close were we? I don't know. We got him back after one (defibrillation), so that's quite fast,\" Boesen added.Schoots said that Eriksen had been lifted by \"all the love around him\".\"Messages have arrived from all over the world,\" the player's agent told the paper.\"And he was especially touched by those from Inter, not only from his team-mates, but also the fans.\"He added: \"Half the planet has been in touch with us, everyone is worried. Now, he must simply rest. His wife and parents are with him.\"Schoots said that the player would remain under observation in hospital until at least Tuesday.\"But in any event he wants to support his team-mates against Belgium\" in Denmark's second Euro match on Thursday.A spokesman for the Denmark Football Union reported Eriksen's condition as \"stable, good\".\"He's still in the hospital, and there are examinations throughout the day. So there is no different status,\" the spokesman added.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "football,Euro 2020,Christian Eriksen,Denmark", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/eriksen-s-condition-still-stable-after-collapse-euro-2020-15011578", "Source": "google"}