{"Type": "Business", "Time": "2021-06-14", "Headline": "American duo plead guilty to helping former Nissan chief Ghosn flee Japan", "Text": "(Corrects to remove extraneous word \"the\" in paragraph 8)TOKYO:     A U.S. Special Forces veteran and his son pleaded guilty in Tokyo on Monday to charges that they illegally helped former Nissan Motor Co Ltd Chairman Carlos Ghosn flee Japan hidden in a box aboard a private jet in December 2019.Chief judge Hideo Nirei, one of three judges presiding over their first court appearance, asked Michael Taylor and his son Peter whether there was any mistake in the charges submitted by the Tokyo Prosecutors' office.\"No your honour,\" the older Taylor replied. \"No,\" said his son.Extradited to Japan from the United States in March, they are being held at the same jail in Tokyo where Ghosn was detained. They could face up to three years in prison.Wearing black jackets and pants, white shirts and plastic slippers, they were were led into court with ropes threaded through handcuffs and tied around their waists.Prosecutors accused them of helping Ghosn evade punishment and escape https://www.reuters.com/article/us-nissan-ghosn-charge-idCAKBN2BE0G1 to Lebanon from western Japan's Kansai airport, receiving US$1.3 million for their services, some of which was paid to an advertising company owned by the younger Taylor.The prosecutors' statement on Monday, which described the younger Taylor as a frequent visitor to Lebanon, said planning for the escape began around six months before Ghosn fled.The statement also said that Ghosn's wife Carole Ghosn sought help from Michael Taylor, with Ghosn later contacting  him from Tokyo with a phone he had hidden from Japanese authorities.A third man George-Antoine Zayek, recruited by the Taylors, traveled to Japan later in 2019 to find a way through airport security, settling on the private jet terminal at Kansai airport as the best route out, the prosecutors said. Zayek remains at large.Luggage that does not fit through the security scanning machine there is inspected by hand. That check, however, can be waived by the pilot.The Taylors' lawyers in the United States waged a months-long battle to prevent their extradition to Japan, arguing they could not be prosecuted for helping someone \"bail jump\" and that they could face relentless interrogations and torture.Suspects in Japan are interrogated without their lawyers present and are often denied bail before trial.Japan's conviction rate is 99per cent.At the time of Ghosn's escape, he was awaiting trial on charges that he understated his compensation in Nissan's financial statements by 9.3 billion yen (US$85 million) over a decade and enriched himself at his employer's expense through payments to car dealerships.Ghosn, who denies any wrongdoing, remains a fugitive in his childhood home, which has no extradition treaty with Japan.Greg Kelly, a former Nissan executive charged with helping Ghosn hide his earnings, is also standing trial in Tokyo. He denies the charges https://www.reuters.com/business/autos-transportation/court-former-nissan-executive-kelly-denies-helping-ghosn-hide-earnings-2021-05-12.(Reporting by Tim Kelly and Kiyoshi Takenaka; Editing by Himani Sarkar & Simon Cameron-Moore)It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "helping,Japan,Carlos Ghosn,news and politics,Us,Nissan", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/business/american-father-and-son-admit-to-tokyo-court-they-helped-carlos-ghosn-flee-japan-15011118", "Source": "google"}