{"Type": "", "Time": "2021-06-14", "Headline": "Heart inflammation after Covid-19 jab rare: Experts, Latest Singapore News - The New Paper", "Text": "Heart conditions associated with the Covid-19 mRNA vaccines are extremely rare and it remains unclear if the vaccines are responsible for them, experts told The Straits Times after a handful of cases raised some concerns.Six individuals here were reported to have suffered myocarditis (inflammation of the heart muscle) and pericarditis (inflammation of the lining outside the heart) after getting an mRNA vaccine, among whom four are men younger than 30.The other two are a man and a woman both aged above 40.The Health Sciences Authority (HSA) said most of the cases occurred within a few days after receiving the second dose of the vaccine, and that all have recovered or been discharged from hospital.The United States and Israel - two major users of the mRNA vaccines - have also reported a slightly increased risk of myocarditis and pericarditis in young men after the second dose of mRNA vaccination.But there is no need to be overly concerned as these events are rare, experts said.Professor Ooi Eng Eong, an expert on emerging infectious diseases at Duke-NUS Medical School, said it also remains unclear if it is indeed mRNA vaccines causing these adverse events and how vaccination could have resulted in them.As at June 7, more than 1,888,000 people in Singapore have received both doses of mRNA vaccines by either Pfizer-BioNTech or Moderna.An article last Friday by the American Academy of Paediatrics cited a rate of 16 cases of myocarditis/pericarditis for every one million second doses in people aged 16 to 39.Such inflammation of the heart was also reported in some Covid-19 patients last year, most likely the result of an overactive immune system giving rise to the inflammation.Vaccine maker Moderna issued a statement last Friday stating it is aware of reports of such cases after people took its vaccine, but added that it has not established a causal association with its vaccine after carefully reviewing the available safety data to date.As mRNA vaccines lead to a similar but milder immune response, they could also give rise to inflammation, said Prof Ooi.\"But these cases, if indeed caused by the vaccine, will be much fewer compared with Covid-19-induced heart inflammation ones.\"It is also important to note that the occurrence of some rare events is natural for any vaccine, especially when large numbers have been vaccinated, he stressed.\"No other vaccine has come under the scrutiny as Covid-19 vaccines. In about six months, over 1.5 billion people have been vaccinated under close observation,\" added Prof Ooi.He said it is unclear why young men may be more susceptible, and that it is difficult to conduct the necessary studies to determine a correlation.\"Nonetheless, we can expect more detailed description of what happens to these cases in the coming months, from those that have been treated in the US and Israel. The picture may become clearer then.\"Get The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/heart-inflammation-after-covid-19-jab-rare-experts", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}