{"Type": "World", "Time": "2021-06-14", "Headline": "Putin says Russia would accept conditional handover of cyber criminals to US", "Text": "MOSCOW: President Vladimir Putin has said Russia would be ready to hand over cyber criminals to the US if Washington did the same for Moscow and the two powers reached an agreement to that effect.Putin made the comments in an interview aired in excerpts on state television on Sunday (Jun 13) ahead of a Jun 16 summit with US President Joe Biden in Geneva. Ties between the powers are badly strained over an array of issues.The Russian leader said he expected the Geneva meeting to help establish bilateral dialogue and revive personal contacts, adding that important issues for the two men included strategic stability, Libya and Syria, and the environment.Putin also praised Biden for having shown \"professionalism\" when the US and Russia agreed this year to extend the New START nuclear arms control treaty.The White House has said Biden will bring up ransomware attacks emanating from Russia at the meeting. That issue is in the spotlight after a cyber attack disrupted the North American and Australian operations ofmeatpacker JBS USA.A Russia-linked hacking group was behind that attack, a US source familiar with the matter said last week.Asked if Russia would be prepared to find and prosecute cyber criminals, Putin said Russia's behaviour here would depend on formal agreements being reached by Moscow and Washington.Both sides would have to commit to the same obligations, he said.\"If we agree to extradite criminals, then of course Russia will do that, we will do that, but only if the other side, in this case the United States, agrees to the same and will extradite the criminals in question to the Russian Federation,\" he said.\"The question of cyber security is one of the most important at the moment because turning all kinds of systems off can lead to really difficult consequences,\" he said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "cybersecurity,crime,Vladimir Putin,Russia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/cyber-criminals-russia-putin-summit-geneva-joe-biden-15005776", "Source": "google"}