{"Type": "", "Time": "2021-06-14", "Headline": "Irene Ang visits rough sleepers and admits her 'preconceived notions are so salah', Entertainment News - AsiaOne", "Text": "While many of us spent the weekend recovering from work burnout, local actress-turned-entrepreneur Irene Ang spent hers brightening the lives of some rough sleepers in Singapore.In her Instagram post yesterday (June 13), the 51-year-old shared some snaps from her experience as a volunteer and seemingly distributing some necessities.[embed]https://www.instagram.com/p/CQDBjlmhwws/[/embed]Irene described it as \"the most mind-blowing Saturday\" of her life and confessed that she signed up as a volunteer after her friend highlighted this initiative to her.She wrote: \"I wanted to find out more about why they are homeless or rough sleeping. Seems most of them fell through the cracks. So last night was my first time! I spoke to [a] few of them at length. And my preconceived notion was so salah (wrong)!\"I found out that they are all super appreciative of the help rendered by volunteers and their grassroots people. Majority have a job. Some have family here and some in JB (Johor Bahru) and Indonesia.\"Yes, the government is working on solutions for them. They have applied for rental flats for them. Yes, volunteer doctors come regularly to see them and offer free medical services, too! Yes, young people come by, too, and bought food for them too. We met two young Malay boys distributing McDonald's to them.\"Her post had an overwhelming response from her followers, including celebrities, who offered to help.The result?Irene's putting together a proposal to find them a roof over their heads during this transitional period of time or when they're \"falling [through] the cracks\".[embed]https://www.instagram.com/p/CQEQzpHBg3Z/[/embed]Earlier today, she posted: \"Many of you have offered to help and I can't tell you how very touched I am. And I'm sure help will be much appreciated. Some even preliminary (sic) messaged me with ideas and connections to others who know how to do this.\"Some have offered job-seeking help. Others have offered to buy stuff. So all chope first okay... Let me study and put together a proposal for you all ASAP hor. I now have a dream and that is [to] find them all a roof whilst they are transiting or falling into the cracks.\"bryanlim@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/entertainment/irene-ang-visits-rough-sleepers-and-admits-her-preconceived-notions-are-so-salah", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}