{"Type": "World", "Time": "2021-06-14", "Headline": "UK, EU show little sign of defusing post-Brexit row", "Text": "CARBIS BAY: Britain and the European Union showed little sign of defusing a post-Brexit trade dispute on Saturday (Jun 12), with both sides repeating their opposing positions even after US President Joe Biden encouraged them to find a compromise.Since Britain completed its exit from the EU late last year, relations between the two have soured, with both accusing the other of acting in bad faith over part of their Brexit divorce deal that covers border issues with Northern Ireland.At a Group of Seven summit in southwestern England, a meeting of the world's largest advanced economies, Prime Minister Boris Johnson held talks with French President Emmanuel Macron, German Chancellor Angela Merkel and top EU officials Ursula von der Leyen and Charles Michel.The EU told London once again that it must implement the Brexit deal in full and introduce checks on certain goods moving from Britain to its province of Northern Ireland. Britain again called for urgent and innovative solutions within the part of the deal called the Northern Ireland Protocol.\"Both sides must implement what we agreed on,\" Von der Leyen, European Commission president, said after meeting Johnson alongside Michel, the European Council president.\"There is complete EU unity on this,\" she said, adding that the deal had been agreed, signed and ratified by both Johnson's government and the bloc.Johnson's spokesman responded: \"The PM (prime minister) in all cases (expressed) confidence in the UK's position as regards to the Northern Ireland Protocol and the desire for pragmatism and compromise on all sides.\"Although there was no sign of a narrowing of positions, the threats of last week over the so-called \"sausage wars\" were absent. An EU official said there was a feeling the rhetoric needed to be toned down.Since Britain exited the bloc's orbit, Johnson has unilaterally delayed the implementation of some provisions of the protocol, including checks on chilled foods such as sausages moving from the mainland to Northern Ireland, saying it was causing disruption to some supplies to the British province.The United States has expressed grave concern the dispute could undermine the 1998 Good Friday peace deal.That agreement largely brought an end to the \"Troubles\" - three decades of conflict between Irish Catholic nationalist militants and pro-British Protestant \"loyalist\" paramilitaries in which 3,600 people were killed.BREXITThough Brexit was not part of the formal agenda for the G7 summit in the English seaside resort of Carbis Bay, it has more than once threatened to cloud the meeting.France's Macron offered to reset relations with Britain as long as Johnson stood by the Brexit deal - a characterisation of the meeting that was rejected by the British team.Brexit has strained the situation in Northern Ireland. The province has an open border with EU member Ireland so the Northern Ireland Protocol was agreed as a way to preserve the bloc's single market after Britain left.The protocol essentially kept the province in the EU’s customs union and adhering to many of the single market rules, creating a regulatory border in the Irish Sea between the British province and the rest of the United Kingdom.London says the protocol is unsustainable in its current form because of the disruption to some goods supplies.The pro-British \"unionist\" community in Northern Ireland say they are now split off from the rest of the United Kingdom and the Brexit deal breaches the 1998 peace deal. But the open border between the province and Ireland was a key principle of Good Friday deal.Biden, who is proud of his Irish heritage, has made clear that any steps that imperilled the peace agreement would not be welcomed by Washington.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Brexit,news and politics,UK,EU,Boris Johnson", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/uk-eu-show-little-sign-of-defusing-post-brexit-row-15000402", "Source": "google"}