{"Type": "", "Time": "2021-06-14", "Headline": "Lukaku eases Belgium past Russia  to kick off Euro 2020 campaign", "Text": "published :\n\t\t\t\t\t\t\t\t\t\t\t\t\t13 Jun 2021 at 08:00\t\t\t\t\t\t\t\t\t\t\t\twriter: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tReutersST PETERSBURG: Romelu Lukaku struck twice as Belgium confirmed their status as one of the favourites for Euro 2020 with a confident 3-0 victory over Russia on Saturday.Despite being without key performer Kevin De Bruyne, world number one ranked Belgium were rarely in trouble against a Russia side that struggled to impose themselves.Roberto Martinez's Belgium top Group B on three points, ahead on goal difference of Finland who beat Denmark in the group's other game in Copenhagen.The Red Devils are unbeaten in 10 games in all competitions and have suffered just one defeat in their last 24 outings. They have also scored in each of their last 31 games.The visitor's grabbed the lead in the 10th minute when Andrei Semyonov failed to deal with a ball into the box from Leander Dendoncker, and Lukaku turned and fired into the bottom corner.Lukaku celebrated his goal by running to the television camera and shouting \"Chris, Chris, I love you\" in tribute to Christian Eriksen, the Danish midfielder and his club team-mate at Inter Milan, who had been rushed to hospital after collapsing during the earlier game in the group.Belgium were calm in possession and finding plenty of time and space against a Russia side who struggled to get a firm grip on the game.The Russians reached the quarter-finals in the World Cup they hosted in 2018 but the energy of those performances was missing, despite playing at home in front of more than 26,000 fans.Stanislav Cherchesov struggled to find either the tempo to their attacks or a way to provide quality service to striker Artem Dzyuba who was too often left isolated.It was no surprise when the second goal came, in the 34th minute, when Russia keeper Anton Shunin could only parry Thorgan Hazard's shot towards Thomas Meunier, who made no mistake.Russia applied some pressure after the interval but the Beligans coped without too much panic and the game already felt decided before Lukaku wrapped up the win with a well-taken effort after racing on to a through ball from Meunier.Lukaku said the Eriksen situation had left him in tears before the game.\"I cried a lot because I was scared, obviously. You live strong moments together. I spent more time with him than with my family,\" he said.\"My thoughts are with him, his girlfriend, his two kids and his family,\" he added.\"I enjoyed the game but for me, it was difficult to play because my mind was with Christian. I hope he is healthy and I dedicate this performance to him,\" added the former Manchester United striker.Cherchesov conceded his team had struggled after falling behind to Lukaku's opener.\"Our tournament is continuing. We are doing our job. We chose our system, it worked partly but then started to break down. The Belgians scored and then it was difficult to get the ball off them.”The Russians host Finland on Wednesday and will need to quickly get their campaign on track.\"We will get out of the situation. We put ourselves there, so we must now get out of it,\" Cherchesov added.Lukaku and the Belgian team had taken the knee before the kick-off but the anti-racist gesture was met with jeers and whistles from the crowd.NAKHON SI THAMMARAT: The body of a local fisherman missing for two days ago was found floating in the sea off Khanom district on Monday, police said.TOKYO: An American father-son duo admitted their role in orchestrating former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.The government admits there is a shortage of Covid-19 vaccine with no deliveries expected this week.", "Section": "", "Writers": "", "URL": "https://www.bangkokpost.com/sports/2131567/lukaku-eases-belgium-past-russia-to-kick-off-euro-2020-campaign", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}