{"Type": "", "Time": "2021-06-14", "Headline": "Jail for man who posed as woman online to have commercial sex with underage boy, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A man posed as a woman online to lure a 17-year-old boy into having commercial sex with him.Muhammad Al-Masfuiin Muhsin, now 26, had pretended to be a woman who was looking for a \"sex slave\" to provide sexual services for \"herself\" and her \"boyfriend\" in exchange for $250.On June 18, 2019, the teenager, who had been kicked out of his home earlier, arrived at a Tampines flat. Al-Masfuiin, posing as the boyfriend, then performed a sexual act on the boy in exchange for a night's lodging in the unit. He also gave the boy a $50 note.The Singaporean, who was aware of the teenager's age, was sentenced on Monday (June 14) to 10 months' jail after admitting that he had indulged in commercial sex with a minor below 18 years old.The victim cannot be named due to a gag order to protect his identity.Deputy Public Prosecutor Emily Koh said that some time in 2017, the boy started using online classifieds website Locanto and discovered advertisements for sexual services as well as posts by people looking for \"sugar mummies\" or \"friends with benefits\".A sugar mummy commonly refers to an older woman who is willing to pay for the company of a younger person.He created an account on Locanto as he wanted to earn money by offering sexual services.The teenager was kicked out of his home on June 16, 2019, after a heated argument with his mother.In need of money, he created an advertisement on Locanto titled \"toyboy fantasy\", stating he was looking for a \"sugar mummy\" and was willing to provide sexual services.Al-Masfuiin, who came across the advertisement, posed as a woman and chatted with the boy via messaging platform Telegram.The DPP said: \"The accused was aware that the victim had no place to stay and offered lodging to the victim. Still posing as a female, the accused told the victim that he could stay at 'her boyfriend's place' and that 'he'll send a Grab to let you stay over'.\"Believing that the accused was a female, the victim asked if the accused was joining the sex session. The accused, still posing as a female, replied that 'she' 'might not', 'but my (boyfriend) will tell me if you did a great job at sex'.\"The teenager arrived at the Tampines flat at around 1.20am on June 18 and Al-Masfuiin performed oral sex on him.The boy later fell asleep in the unit and Al-Masfuiin gave him the $50 note after he woke up that morning. The pair then parted ways.A police officer was patrolling in Toa Payoh later that day when he spotted the teenager.He looked through the youngster's mobile phone and found out the minor had been providing sexual services. Al-Masfuiin was arrested soon after.For having commercial sex with a minor below 18 years old, an offender can be jailed for up to seven years and fined.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/jail-for-man-who-posed-as-woman-online-to-have-commercial-sex-with-underage", "Source": "google"}