{"Type": "", "Time": "2021-06-14", "Headline": "Christchurch mosque massacre victims slam Rose Byrne's new film about the attack | Daily Mail Online", "Text": "By Mary Mrad For Daily Mail Australia  Published:  23:59 EDT, 12 June 2021   |  Updated:  01:03 EDT, 13 June 2021    8View  commentsThe family of a woman killed during the Christchurch terror attack in 2019 are urging Rose Byrne not to star in a new film about the massacre.The Australian actress, 41, has been cast as New Zealand Prime Minister Jacinda Ardern in upcoming film They Are Us.According to The New Zealand Herald, the family of victim Linda Armstrong has contacted Rose and asked her to refuse the role.'It's too soon': Christchurch mosque massacre victims have urged Australian actress Rose Byrne (pictured) to refuse a role in a new film about the attackThe film follows Arden in the wake of the tragic Christchurch mosque shootings. At the time, Ms Ardern was commended for her response to the two consecutive mass shootings.'We know that a movie being made about what happened on that dreadful day is inevitable, however for now it is too soon,' Linda's nephew Kyron Gosse wrote.'It was only 27 months ago that I had to google my aunt's name to see if she was alive or dead. It was only 27 months ago that I stood in her grave, lowering her lifeless body into the ground. Please, give us time.''This is not the story': The Australian actress has been cast as New Zealand Prime Minister Jacinda Ardern (pictured) in upcoming film They Are UsKyron continued: 'The time will come for this story to be told. When the right time does arrive, it is important that the right story is told, a story that focuses on the true heroes of the day.''Now is not the time, and this is not the story. Please, turn down the role and give us time to heal.'A petition has also been launched by families of the victims calling for production to be cancelled, and has received over 47,000 signatures so far.Letter: The family of victim Linda Armstrong has reportedly contacted Rose and asked her to refuse the role'The film centres white voices and therefore will continue to white-wash the horrific violence perpetrated against Muslim communities,' the petition said.The Christchurch terrorist attack was carried out by gunman Brenton Tarrant who killed 51 people.Tarrant entered the Al Noor Mosque as Friday prayers were beginning and opened fire before driving to Linwood Mosque on the other side of the city where he continued shooting.Tarrant, a white supremacist originally from Australia, was arrested a short time later.He pleaded guilty to all charges and was sentenced to life imprisonment without the possibility of parole on August 27 this year.The film follows Arden in the wake of the tragic 2019 Christchurch mosque shootings. At the time, Ms Ardern was commended for her response to the two consecutive mass shootings \n\t    Share what you think\n          The comments below have been moderated in advance.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group", "Section": "", "Writers": "", "URL": "https://www.dailymail.co.uk/tvshowbiz/article-9680903/Christchurch-mosque-massacre-victims-slam-Rose-Byrnes-new-film-attack.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}