{"Type": "", "Time": "2021-06-14", "Headline": "182 stalls in 115 Bukit Merah View market closed for cleaning after 2 Covid-19 cases detected, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - All 182 stalls in 115 Bukit Merah View Market and Hawker Centre have been closed from Sunday (June 13) for cleaning after two Covid-19 cases were detected there.The market and hawker centre will be closed till Tuesday.Tanjong Pagar GRC MP Joan Pereira on Saturday said the Tanjong Pagar Town Council, the National Environment Agency and the Bukit Merah View Merchants' Committee are \"engaging stallholders at the market and hawker centre to inform them of the closure and to assist with any queries\".\"We are also putting up notices around the neighbouring estate to inform residents of the closure,\" she wrote in a Facebook post.Ms Pereira told The Straits Times that stallholders were understanding of the need to close the market for cleaning.\"Some asked if there would be any forms of assistance that they could tap in the meantime. We are currently working with the relevant agencies to ensure that relevant information on any assistance available can be relayed to the stallholders,\" she added.An 82-year-old Singaporean woman who regularly helps out at a sundry store at the market and hawker centre tested positive.She is the second case detected there, after a 74-year-old Singaporean man who was fully vaccinated and works at a sundry store.ST has asked the Ministry of Health (MOH) if they work at the same sundry store.MOH on Saturday said the woman, who has also received both doses of the Covid-19 vaccine, developed a fever and shortness of breath last Thursday and sought medical treatment at a polyclinic the next day.She was isolated upon testing positive for an antigen rapid test. The polymerase chain reaction test later came back positive. Her serology test is still pending.MOH reported nine community cases on Saturday and nine imported cases.These took Singapore's total Covid-19 tally to 62,263.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/182-stalls-in-115-bukit-merah-view-market-and-hawker-centre-closed-for-cleaning-after-2", "Source": "google"}