{"Type": "", "Time": "2021-06-14", "Headline": "'He was gone... it was a cardiac arrest' - Christian Eriksen's doctor - CGTN", "Text": " Share CopiedDenmark's Christian Eriksen suffered a cardiac arrest when he collapsed during his side's Euro 2020 opening match against Finland, his team's doctor confirmed on Sunday, but the reason remained unclear.\"He was gone. We did cardiac resuscitation, it was a cardiac arrest. We got him back after one defib (defibrillation),\" Morten Boesen told a news conference, adding that Eriksen remained in hospital for further tests after his collapse on Saturday.\"The exams that have been done so far look fine,\" Boesen added. \"We don't have an explanation to why it happened.\" READ MORE:Climate and vaccine pledges as G7 endsThe backward running championInter Milan's chairman on football's futureEriksen, 29, collapsed in the 42nd minute of the match while running near the left touchline after a Denmark throw-in. As a hush fell over the 16,000-strong crowd, his team mates gathered around him while he was treated on the pitch and then carried off on a stretcher.The Danish players have been in contact with Eriksen via a video conference, said Peter Moller, director of Danish football association DBU on Sunday. Eriksen recovering after cardiac arrest. /AFP Coach Kasper Hjulmand said Eriksen had told him he did not remember much from Saturday's collapse and that he was eager to get back on to the pitch.\"He would like for us to play on,\" Hjulmand said. \"He said he feels like he could go out and play again. Christian feels best when he's got a football close to his feet.\" Finland's players applauded the Denmark team on to the pitch before the restart. /Reuters\n\n Hjulmand quoted the midfielder as saying: \"I think you are feeling worse than I am. I feel as if I'm about to go training now, boys.\"\"Christian is in good spirits and it's a huge relief for the players after all this uncertainty,\" Hjulmand said. \"There is no doubt that we have been on the ropes.\"Messages of support for Eriksen, who plays for Inter Milan, have poured in.The Group B game was halted and eventually restarted an hour and 45 minutes later. Finland went on to win 1-0 with their only attempt of the game.Former Danish internationals Peter Schmeichel and Michael Laudrup have criticized governing body UEFA over their handling of the collapse. The players from both teams were given the option to finish the game on Saturday evening or on Sunday.\"Looking back, I honestly don't think that we should have been back on the pitch,\" Hjulmand said. \"I have thought about whether I could have done things differently.\"Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3", "Section": "", "Writers": "", "URL": "https://newseu.cgtn.com/news/2021-06-14/-He-was-gone-it-was-a-cardiac-arrest-Christian-Eriksen-s-doctor-114lU7ryS8U/index.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}