{"Type": "", "Time": "2021-06-14", "Headline": "S. Korea to exempt some people vaccinated overseas from Covid-19 quarantine | The Star", "Text": "\n                    Monday, 14 Jun 2021\n                Exempt travellers will need to fill out an application and still need to be tested before and after arriving in South Korea. - BloombergSEOUL (Reuters): South Korea will exempt some travellers who have received their COVID-19 vaccine shots overseas from its mandatory two-week quarantine starting July 1, health authorities said on Sunday (June 13).As of May 5, the quarantine exemption was only applicable to people fully vaccinated in South Korea.The new policy will apply only to certain people, such as citizens and foreign residents, as well as those coming to visit family, or for the purpose of business, academics or public interest, said Son Young-rae, an official with the Central Disaster Management Headquarters.Exempt travellers will need to fill out an application, and still need to be tested before and after arriving in South Korea. Some travellers from countries with major outbreaks or variants will not be allowed to skip the quarantine, he added.South Korea reported 452 more cases as of midnight on Saturday, bringing total infections to 147, 874, the Korea Disease Control and Prevention Agency (KDCA) said.The death toll in the country stands at 1, 985.More than 11.8 million people - 23% of the country's population - have received at least one dose of a vaccine, according to the KDCA.\nTags / Keywords:\nSouth Korea\n                                                                ,\n                                                                                                restrictions\n                                                                ,\n                                                                                                quarantine\n                                                                ,\n                                                                                                exemption\n                                                                ,\n                                                                                                vaccinatiion\n                                                                ,\n                                                                                                travel\n                                                                ,\n                                                                                                covid-19\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/14/s-korea-to-exempt-some-people-vaccinated-overseas-from-covid-19-quarantine", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}