{"Type": "", "Time": "2021-06-14", "Headline": "Benjamin Netanyahu loses 12-year hold on power in Israel; new PM sworn in, Middle East News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.JERUSALEM (REUTERS) - Benjamin Netanyahu’s record 12-year run as Israel’s prime minister ended on Sunday (June 13) with Parliament approving a new “government of change” led by nationalist Naftali Bennett, an improbable scenario few Israelis could have imagined.But the razor-thin 60-59 vote of confidence in a coalition of left-wing, centrist, right-wing and Arab parties with little in common except for a desire to unseat Mr Netanyahu only underscored its likely fragility.Addressing Parliament before Mr Bennett was sworn in, a combative Mr Netanyahu said: “If we are destined to go into the opposition, we will do so with our heads held high until we can topple it.” That will happen, the 71-year-old Netanyahu added, “sooner than people think”.The new government, formed after an inconclusive March 23 election, plans largely to avoid sweeping moves on hot-button international issues such as policy toward the Palestinians, and to focus on domestic reforms.Palestinians were unmoved by the change of administration, predicting that Mr Bennett, a former defence chief who advocates annexing parts of the occupied West Bank, would pursue the same right-wing agenda as Likud party leader Netanyahu.Israel’s longest-serving leader, Mr Netanyahu was prime minister since 2009, after a first term from 1996 to 1999.But he was weakened by his repeated failure to clinch victory in four elections over the past two years, including a vote in March, and by an ongoing corruption trial, in which he has denied any wrongdoing.Under the coalition deal, Mr Bennett, a 49-year-old Orthodox Jew and high-tech millionaire, will be replaced as prime minister by centrist Yair Lapid, 57, a popular former television host, in 2023.With his far-right Yamina party winning only six of Parliament’s 120 seats in the last election, Mr Bennett’s ascension to the premiership as the head of a kaleidoscope of parties was a political jaw-dropper.Interrupted by non-stop shouts of “liar” and “shame” from Netanyahu loyalists in Parliament, Mr Bennett thanked him for his “lengthy and achievement-filled service on behalf of the State of Israel”.But little love has been lost between the two men: Mr Bennett once served as Mr Netanyahu’s chief of staff and had a rocky relationship with him as defence minister. In the run-up to the new government, Bennett spurned Mr Netanyahu’s call to join with him, rather than with Mr Lapid.On the international stage, with his polished English and booming baritone voice, Mr Netanyahu has become the face of Israel.He has resisted international calls for Palestinian statehood he has described as a danger to Israel’s security, while forging formal relations with the United Arab Emirates, Bahrain, Morocco and Sudan and decrying Iran’s nuclear programme.United States President Joe Biden congratulated Mr Bennett, Mr Lapid and the rest of the new Cabinet and said he looked forward to working with Mr Bennett to strengthen the “close and enduring” relationship between their two countries.“My administration is fully committed to working with the new Israeli government to advance security, stability, and peace for Israelis, Palestinians, and people throughout the broader region,” he said in a statement.Both abroad and at home, Mr Netanyahu has been a polarising figure. Often referred to by his nickname Bibi, Mr Netanyahu is loved by his supporters and loathed by critics. His ongoing corruption trial – on charges he denies – has only deepened the rift.His opponents have long reviled what they see as Mr Netanyahu’s divisive rhetoric, underhand political tactics and subjection of state interests to his own political survival. Some have dubbed him “Crime Minister” and have accused him of mishandling the coronavirus crisis and its economic fall-out.Addressing Parliament, Mr Bennett echoed Mr Netanyahu’s call for the US not to return to the 2015 nuclear pact between Iran and world powers, a deal abrogated by Mr Biden’s predecessor Donald Trump.“Renewal of the nuclear agreement with Iran is a mistake, an error that would again grant legitimisation to one of the darkest and violent regimes in the world,” Mr Bennett said. “Israel will not allow Iran to equip itself with nuclear weapons.”Thanking Mr Biden for his “years of commitment to Israel’s security”, and for “standing by Israel” during fighting with Hamas militants in Gaza last month, Mr Bennett said his government would pursue good relations with US Democrats and Republicans.“The government will make an effort to deepen and enhance our relations with both parties – bipartisan,” Mr Bennett said.Mr Bennett has drawn anger from within the right-wing camp for breaking a campaign pledge by joining forces with Mr Lapid – and an allegation from Netanyahu that he defrauded the electorate.Mr Bennett has said another election – a likely outcome if no government were formed – would have been a disaster for Israel.Both Mr Bennett and Mr Lapid have said they want to bridge political divides and unite Israelis under a government that will work hard for all its citizens.Their Cabinet faces huge foreign, security and financial challenges: Iran, a fragile ceasefire with Palestinian militants in Gaza, a war crimes probe by the International Criminal Court, and economic recovery following the coronavirus pandemic.Bennett listed as priorities reforms in education, health, cutting red tape to grow businesses and lower housing costs.Coalition leaders have said it would pass a two-year budget to help stabilise the country’s finances and maintain a “status quo” on issues of religion and state.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/middle-east/naftali-bennett-sworn-in-as-new-israeli-pm-ending-netanyahus-12-year-run", "Source": "google"}