{"Type": "", "Time": "2021-06-14", "Headline": "Dana White confirms Jamahal Hill’s arm wasn’t broken after nasty armbar at UFC 263 - Bloody Elbow", "Text": "Filed under:UFC president Dana White has some good news regarding Jamahal Hill’s nasty injury at UFC 263. Another seemingly nasty injury happened at a UFC pay-per-view event. During the main card opener of Saturday’s UFC 263, light heavyweight Jamahal Hill found himself in a nasty armbar at the hands of Paul Craig.Statement win by @PCraigmma and undeniable toughness by @JamahalH #UFC263 pic.twitter.com/kEzHir0J1VHill’s left arm looked badly bent after he got out of the submission. Some speculated it to be broken just by how mangled it appeared to be. During the post-fight presser, UFC president Dana White confirmed otherwise, saying Hill’s arm was just dislocated and had been popped back in. “If you can believe this one, ‘cause I can’t f—ng believe it. Jamahal Hill’s arm was not broken,” White told reporters. “It was dislocated. They popped it back in and he has full range of motion, and the guy’s OK. That’s nuts.”Many are holding local Arizona referee Al Guinee responsible for supposedly failing to stop the fight at the right time. White, who’s usually vocal about his opinions about officiating mishaps, refused to say anything that could create friction with the Arizona athletic commission. He did, however, have some words for Guinee, whom he described as “the Arizona Mazzagatti.”“If you don’t know a guy’s arm is broken… When an arm is flopping around like this and going both ways, he should probably stop the fight.”Hill says he’s ‘OK’ despite what happened, as he also came to referee Guinee’s defense. The ref doesn't suck I wasn't tapping i was trying to stack but my arm wasn't there lol I tried to knock him out quick but he just was the better fighter tonight!!! I've been dominate for 12 years tonight was my turn to lose!!!!As for Craig, he won $50,000 for Performance of the Night.  \n    Related\n  ", "Section": "", "Writers": "", "URL": "https://www.bloodyelbow.com/2021/6/13/22531587/dana-white-confirms-jamahal-hills-arm-wasnt-broken-after-nasty-armbar-at-ufc-263-mma-news", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}