{"Type": "", "Time": "2021-06-14", "Headline": "After fire and floods, Aussie farmers suffer devastating mouse plague", "Text": "Keep up to speed at a glance with the Top 10 daily storiesAfter surviving years of crippling drought, farmers in eastern Australia are locked in a months-long battle with hordes of mice that are pouring through fields and devouring hard-earned crops.Farmer Col Tink uses a broom to skittle hundreds of roving mice toward a makeshift industrial trap -- essentially a large tub of water where they drown.It is a brutally simple attempt to slow the plague that has engulfed his farm -- near the rural town of Dubbo -- and thousands of other farms like it across eastern Australia.But Tink's efforts have barely made a dent. Mice continue to chew through grain and hay stocks while anything remotely edible remains under constant attack.Skin-crawling videos of writhing rodent masses have been shared around the world along with reports of bitten hospital patients, destroyed machinery and swarms running across roads en masse.The plague is the latest in a string of disasters to strike farmers in Australia. A years-long drought was followed by months of devastating bushfires from late 2019, before welcome rains became damaging floods in several regions.\"My dad's still alive; he's 93, and it's the worst three years he'd ever seen in his lifetime, and I think it's probably the worst mouse plague he's seen too,\" said Tink, who mainly farms Brahman cattle.But the prospect of this plague continuing through the southern hemisphere's winter makes him fearful for preparations ahead of the next dry spell -- which is always on the horizon.\"If we don't get a real cold and fairly wet winter, I'm just a little bit worried what's going to happen in the spring,\" the 65-year-old told AFP.- 'Chronic' infestations -The outlook is not good, according to Steve Henry, a research officer at Australia's national science agency, the CSIRO.\"When a mouse plague ends, they just disappear overnight,\" said Henry, who has been studying pest animals in Australia for nearly three decades.\"We're certainly not seeing that at the moment.\"Mice are a feral pest in Australia, arriving alongside the first British colonists.The tiny rodent is almost perfectly adapted to exploit the natural boom and bust of agriculture in the Australian climate, meaning plagues are not uncommon.But numbers this year have been \"just astronomical\", according to 74-year-old Terry Fishpool, a grain producer from nearby Tottenham.Large numbers of rodents were reported as early as October, their population fuelled by a bumper crop after the worst drought in living memory.Bill Bateman, an associate professor from Curtin University in Western Australia, said giant mouse plagues seemed to occur once a decade, but climate change could make them more regular.\"If we no longer get those cold winters, such that we are providing resources for mice all year round, then this is going to become a chronic thing rather than an acute thing,\" Bateman said.- 'Napalming mice' -With the rodents scurrying on, the government has announced millions of dollars in support and reached for a more potent poison, which one minister likened to \"napalming mice\".Yet to be approved, bromadiolone works faster than the widely used zinc phosphide bait but also stays in the system of dead or dying mice longer.Experts worry that it will potentially kill native wildlife who eat the poisoned mice.\"The use of second-generation rodenticides is an extremely worrying step,\" Bateman, who works in the school of molecular and life sciences, said.\"It's a very slippery slope.\"Extended use could create \"a bank of this toxin\" in the environment, killing natural predators and even risk poisoning humans through the food chain, Bateman said.\"We are really going to be setting up trouble for ourselves in future, not just in terms of destroying our biodiversity but destroying our frontline defences against any future mouse plagues.\"Henry said correct use of double-strength zinc phosphide, baiting while planting and removing alternative food sources could help curb the numbers if they did spike after winter.But the focus on \"quick fixes\" also needed to shift to long-term solutions including more research into what triggers \"monumental plagues\", he said.Fishpool said farmers had little choice in the meantime but to plant crops and hope the damage wrought by mice wasn't too severe -- comparing it to one of the nation's favourite pastimes.\"You could put it on horses and gamble it, but if you plant the crop, you can worry about it all year and gamble it.\"al/arb/gle/ssy/rbuWhen you want protection that goes beyond just covering your medical costs, critical illness insurance is the logical choice. But with so many options out there, which ones are best for you? We investigate in this article. In a nutshell, critical illness insurance is insurance […] The post Best Critical Illness Insurance Plans In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.Search for private jet membership. The affordable price makes these private jet offers hard to resistThe Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.The Philippines will extend a key military pact with the United States for another six months, its foreign minister said Monday, after months-long negotiations between the two countries.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.An American father-son duo accused of orchestrating former Nissan chief Carlos Ghosn's audacious escape from Japan admitted their role Monday as they made their first appearance before a Tokyo court.Even in the face of rising inflation, the lackluster progress on restoring jobs lost during the pandemic means the US Federal Reserve is unlikely to budge on monetary policy when it meets next week.Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Looking for travel insurance? Save more with these promo codes and discounts from insurers such as FWD, MSIG, AXA, and more! To find out if your travel insurance covers COVID-19, read this article for the latest updates. No matter your travel itinerary, travel insurance is […] The post Travel Insurance Promotions and Discounts appeared first on SingSaver Blog - We Compare, You Save.Certainly, The Apprentice: ONE Championship Edition lived up to its billing as the toughest iteration of the show yet. Sixteen global candidates were subjected to taxing physical tasks and high-stakes business competitions for the better part of the past three months that truly, the best of the best came through and ended with Jessica Ramella … Continue reading \"The Apprentice: ONE Championship Edition’s Success To Open More Doors, Says Chatri\"Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.New research has identified TEN favorite stocks for the upcoming yearCanberra MRT opened in November 2019, and in the immediate quarter after (Q1 2020), property prices in District 27 jumped by over 6% QoQ. Read about what Canberra has to offer, as well as BTO and Condo projects in the area.A French nuclear firm said Monday it was working to resolve a \"performance issue\" linked to a gas build-up at a plant it part-owns in southern China following a US media report of a potential leak there.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.Amazon.comPolynesian seafarers likely reached Antarctica hundreds of years before the Western explorers usually credited with discovering the frozen continent, a new study has concluded.Dubai earned a reputation for delivering luxury for those with cash to splash years ago, but amid the Covid-19 pandemic, a new mode of travel has become popular -- yachts.Ukrainian leader Volodymyr Zelensky Monday said US President Joe Biden should have met him before his high-profile summit with Russia's Vladimir Putin as they could resolve nothing on Ukraine without Kiev at the table.If you own a computer, this smart USB stick is an absolute must have!European and US stocks diverged on Monday as investors marked time ahead of a meeting of the Federal Reserve this week that may provide fresh clues about prospects for higher interest rates as inflation soars.High coverage, no-fuss application and early benefit payout makes this a great plan for those seeking cancer protection. As many as 1 in 4 Singaporeans could develop cancer in their lifetimes. Hence, getting a protection plan specifically for cancer may be a prudent move, especially […] The post FWD Cancer Insurance (Review): Fuss-free Plan That Pays Out At All Stages appeared first on SingSaver Blog - We Compare, You Save.Prime Minister Jacinda Ardern announced Monday she will offer a formal apology to New Zealand's Pacific community over \"demeaning\" police raids that targeted them in the 1970s.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/fire-floods-aussie-farmers-suffer-022212805.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}