{"Type": "", "Time": "2021-06-14", "Headline": "G-7's billion Covid-19 vaccine plan counts some past pledges, limiting impact, United States News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.WASHINGTON (REUTERS) - A G-7 plan to donate 1 billion Covid-19 vaccine doses to poorer countries will have limited impact because it includes some previous pledges, but it still offers a small lifeline to a global vaccine buying system, some experts said.Leaders from the Group of Seven major economies announced the move on Friday (June 11). A US initiative announced on Thursday to donate 500 million doses of the Pfizer and BioNTech SE vaccine is part of the G-7 pledge.Many of the promised doses will flow through Covax, a global vaccine buying system backed by the World Health Organisation and Gavi, the vaccine alliance.The pledge does not represent entirely new resources, and the donation is far short of the 5 billion to 6 billion shots needed by poorer nations. Moreover, the plan does not address distribution gaps that could make it difficult to deliver doses.But experts said it is still a much-needed boost to Covax, which has so far only distributed 83 million shots worldwide.Covax has struggled to secure deliveries as wealthy nations reserve enough shots to vaccinate their populations several times over.\"It's going to rescue Covax from its pretty dire predicament right now, so it's a very significant step,\" said Stephen Morrison, the director of the Global Health Policy Center at the Centre for Strategic and International Studies, a think tank.Britain's 100 million dose pledge is \"entirely new\", according to a spokesperson. But the European Union's 100 million dose commitment was promised during a summit in May, and the US commitment partially replaces earlier promises to fund Covax directly.The United States has already donated US$2 billion (S$2.7 billion) to Covax, according to a White House official. In February, the Biden administration pledged US$2 billion more. But that second US$2 billion will now fund the purchase of the Pfizer doses, along with US$1.5 billion in additional funds, according to the official.Even if the shots are acquired and shipped, they risk overwhelming developing countries' limited distribution infrastructure, especially if many are delivered together late this year.The World Bank extended a US$12 billion line of credit for developing countries to build out vaccine distribution infrastructure, but governments have drawn down only about US$3 billion.\"The low-income countries are wary of increasing their debt profile, that is the reality,\" said Edwin Ikhuoria, executive director for the ONE Campaign, a nonprofit focused on poverty and public health.Others argue that wealthy countries should find a way to ship doses more quickly, especially as some near expiry in countries with high vaccination rates, including those made by Johnson & Johnson Inc.\"When you just see the graph of the increase of vaccination coverage in wealthy countries and the accelerated pace at which that has been happening, and then when you look at the pace in developing countries, it's just so stark,\" said Kate Elder, senior vaccines policy adviser at Médecins Sans Frontières.\"Doses are needed now.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/united-states/g-7s-billion-covid-19-vaccine-plan-counts-some-past-pledges-limiting-impact", "Source": "google"}