{"Type": "Singapore", "Time": "2021-06-14", "Headline": "18 new community COVID-19 cases in Singapore, highest in more than 10 days", "Text": "SINGAPORE: Singapore reported 18 new COVID-19 cases in the community and one new case in migrant workers' dormitories as of noon on Monday (Jun 14).This is the highest daily number of locally transmitted infections reported in Singapore since Jun 3, when 35 community cases were reported.Seventeen of the new infections were linked to previous cases. Thirteen had been placed in quarantine earlier and four were detected through surveillance testing. The remaining two cases were unlinked, said the Ministry of Health (MOH) in its preliminary daily update.There were also six imported cases, all of which had been placed on stay-home notice upon their arrival in Singapore. Three were returning Singaporeans or permanent residents.In all, Singapore reported 25 new COVID-19 infections on Monday.Details of the new cases will be released on Monday night, said MOH.DIY COVID-19 TEST KITS AVAILABLE FROM JUN 16COVID-19 antigen rapid test kits for self-testing will beavailable in pharmaciesfrom Jun 16.These tests produce results in less than 20 minutes and detect the viral proteins in the nasal swab samples of infected people. The tests are usually most accurate in the early stages of infection.Four self-test kits have received interim authorisation from the Health Sciences Authority and will be sold at selected Unity, Watsons and Guardian outlets.The four test kits are: Abbott PanBio COVID-19 Antigen Self-test, QuickVue At-Home OTC COVID-19 Test, SD Biosensor SARS-CoV-2 Antigen Self-Test Nasal and SD Biosensor Standard Q COVID-19 Ag Home Test.Customers may purchase the test kits without a doctor’s prescription but must first consult the in-store pharmacist.As of Monday, Singapore has reported 62,301 COVID-19 cases and 34 fatalities.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,Ministry of Health,coronavirus", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/covid-19-new-cases-june-14-community-unlinked-imported-moh-15010238", "Source": "google"}