{"Type": "", "Time": "2021-06-14", "Headline": "Myanmar's anti-junta movement shows support for Rohingya on social media, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.YANGON (AFP) - Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday (June 13) in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Since the military ousted civilian leader Aung San Suu Kyi from power in a February 1 coup, an anti-junta movement demanding a return to democracy has grown to include fighting for ethnic minority rights.The mostly Muslim Rohingya - long viewed as interlopers from Bangladesh by many in Myanmar - have for decades been denied citizenship, rights, access to services and freedom of movement.Activists and civilians took to social media on Sunday to post pictures of themselves wearing black and flashing a three-finger salute of resistance in posts tagged \"#Black4Rohingya\".\"Justice must (be) served for each of you and each of us in Myanmar,\" said prominent rights activist Thinzar Shunlei Yi on Twitter.Local media also showed a small protest in Myanmar's commercial hub Yangon, with black-clad demonstrators holding signs in Burmese that said they were \"protesting for the oppressed Rohingya\".By evening, the #Black4Rohingya hashtag was trending on Twitter in Myanmar with more than 332,000 mentions.Sunday's show of support from the mostly Buddhist, ethnic Bamar-majority population is a far cry from previous years, when even using the term \"Rohingya\" was a lightning rod for controversy.In 2017, a bloody military campaign in Myanmar's west sent some 740,000 Rohingya fleeing across the border into Bangladesh carrying accounts of rape, mass killings and arson.The military has long claimed the crackdown was justified to root out insurgents, and Ms Suu Kyi also defended the army's conduct by travelling to the Hague to rebut charges of genocide at the UN's top court.The Myanmar public was largely unsympathetic to the Rohingya's plight, while activists and journalists reporting on the issues faced vitriolic abuse online.Prominent Europe-based Rohingya activist Ro Nay San Lwin told AFP the online campaign is a yearly effort to raise awareness - but Sunday was \"the first time\" he had seen it go viral in Myanmar.\"I am so happy to see that those inside Myanmar joined this campaign. I am more hopeful to have a stronger solidarity from them,\" he said.A recent announcement from the shadow \"National Unity Government\" - made up of ousted lawmakers working to topple the junta - has also extended an olive branch to the minority group, inviting them to \"join hands... to participate in this Spring Revolution\".The NUG has been branded as \"terrorists\" by the military regime, while junta leader Min Aung Hlaing has dismissed the word \"Rohingya\" as \"an imaginary term\".Since the coup, more than 860 people have been killed in brutal crackdowns by security forces, according to a local monitoring group - a death toll that has drawn alarm from the international community.On Friday, UN rights chief Michelle Bachelet said Myanmar has plunged from a \"fragile democracy to a human rights catastrophe\" - pointing with particular concern at the escalating violence in regions like Kayah, Chin and Kachin states.State-run television on Sunday evening condemned Ms Bachelet's comments, saying that the international body \"should not be biased\".Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/myanmars-anti-junta-movement-shows-viral-support-for-rohingya", "Source": "google"}