{"Type": "", "Time": "2021-06-14", "Headline": "Ah Jie Zoe Tay sends gal pals, Stef Sun and Sharon Au the cutest care package ever - The Independent Singapore News", "Text": "Stefanie Sun uploaded Instagram stories of her unboxing the packageAuthorDateCategorySingapore – Girls, what’s the funniest gift you’ve ever sent to your besties? If you’re looking for inspiration, maybe you can take it from actress Zoe Tay.She recently sent a next-level care package to her her celebrity gal pals – Stefanie Sun and Sharon Au.Photo: Instagram screengrab (@zoetay10)Photo: Instagram screengrab (@sharonau13)Upon receiving the parcel, Stefanie Sun uploaded Instagram stories of her unboxing the package – two lacey bralettes from Amanda Fashion Gallery and a couple of mini perfumes from F’Dairy.In case you’re thinking it may be from her husband… The package came with a handwritten card to Sun’s Chinese name, signed off by Tay.“A sudden sweet surprise,” Sun wrote in her story caption. “Ah Jie, you really think very highly of (my size) hor.”It’s no surprise as Sun made fun of herself for having… uh, small assets… because the bralettes are a little too big.Of course, fans got the joke and apparently left her comforting comments saying: “You’re mocking yourself again. Don’t worry, your size is trendy now.”However, this doesn’t go without mentioning that the singer has received creepy responses asking about her actual size and even pictures(!).It’s 2021, people. Kindly entertain yourselves with actual knowledge such as respecting others. As for Sharon Au, who’s currently undergoing mandatory 21-day quaratine – she’ll be Singapore until August, recalled how Tay used to look out for her when she first joined the showbiz.On her Instagram story, she wrote: “When I was a rookie in the industry and had to interview Zoe, she knew I was nervous and made extra effort to be affable and reassuring. Now I’m all grown up and she continues to care and encourage. This is why she is our Ah Jie forever. Thank you for the surprise Zoe.”Not to mention, Tay accidentally caused a ‘commotion’ at the hotel after she went to deliver the gift and food to Au a few days ago.Otherwise, 8days.sg reported that Celebrity Agency has confirmed that Tay isn’t a celebrity ambassador for the two brands and is just supporting her friend.Follow us on Social MediaSend in your scoops to news@theindependent.sg Send in your scoops to news@theindependent.sg ", "Section": "", "Writers": "", "URL": "https://theindependent.sg/ah-jie-zoe-tay-sends-gal-pals-stef-sun-and-sharon-au-the-cutest-care-package-ever/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}