{"Type": "", "Time": "2021-06-14", "Headline": "Gas blast in central Chinese city kills 12, rescue operation ongoing: Officials, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BEIJING (AFP) - At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China’s Hubei province on Sunday (June 13), local officials said.Rescue workers are uncertain how many people may still be trapped under the debris, according to a statement from the disaster management bureau in the city of Shiyan.Videos shot by witnesses and verified by Beijing News show several buildings reduced to rubble and rescuers carrying shocked survivors on stretchers.The blast ripped through a vegetable market that was filled with shoppers and people eating breakfast, an eyewitness told state-run Global Times.“I heard a loud bang and immediately ducked under the table, thinking it was an earthquake,” a man who owns a small restaurant near the explosion site told the newspaper.State broadcaster CCTV showed footage of buildings with charred walls and shattered windows. Rescuers were seen lifting large slabs to pull out those trapped underneath.The blast occurred in a two-story building that earlier housed a vehicle frame manufacturer.Several survivors told local media that the gas pipeline had fallen into disrepair after the factory was moved last year.“In March, workers from the gas company came and asked whether I got a smell of gas,” one survivor who runs a stall in the market told local website Health Times. “After asking around, they just left.”The explosion took place at about 6.30am local time and an investigation was underway to determine the cause of the blast, the statement said.Around 900 residents in the area have been evacuated as surrounding buildings may have been damaged by the blast, the city government said. About 2,000 rescue workers have been deployed on the site.Images verified by Health Times show a firefighter who was also injured and a fire truck damaged by a second, smaller blast.The severely injured were airlifted to bigger hospitals. State news agency Xinhua put the number of seriously injured at 37.Long lines of volunteers were seen outside blood banks as hospitals put out a call for donors.The Ministry of Emergency Management has also sent a team to assist with the rescue operation.In a rare move, Chinese President Xi Jinping issued a statement urging local officials to “learn profound lessons from the incident” and double down on efforts to prevent such incidents.“All regions and relevant departments must draw lessons from one another... investigate various safety hazards and prevent major emergencies,” he said. “Those responsible must be held to account,” Xinhua quoted him as saying.Industrial accidents are common in China due to weak safety standards and corruption among officials tasked with enforcing them.The blast comes a day after eight people were killed and three others injured when toxic methyl formate leaked from a chemical handling facility in the southwestern city of Guiyang.A massive 2015 explosion at a chemical warehouse in the port city of Tianjin killed 173 people in one of the worst industrial accidents in China in recent years.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/gas-pipe-explosion-kills-11-in-central-chinese-city-cctv-reports", "Source": "google"}