{"Type": "Asia", "Time": "2021-06-14", "Headline": "Malaysia's reef sharks stricken with mystery skin disease", "Text": "KUALA LUMPUR: Marine biologists are investigating a mystery skin disease afflicting whitetip reef sharks in Malaysia, with some early reports suggesting rising sea temperatures could be to blame.Named for the distinctive white tips on their fins, whitetip reef sharks are typically found resting in schools around reefs in the day and are a popular attraction for divers. They become active at night to hunt for small fish and other animals.Pictures of one of the sharks with what appeared to be spots and lesions on its head went viral on social media in April after being taken by an underwater photographer off Sabah state on Borneo island.Soon after, divers at Sipadan island, a famed diving destination nearby, and a team of experts from the state's university and government and conservation groups began seeing the skin disease in every group of sharks they encountered.Attempting to diagnose what could be causing the illness, the team found the sea surface temperature at Sipadan had risen to 29.5 degrees Celsius in May, a degree higher than in 1985.\"We can almost certainly pin the warming ocean as having a role in what we are seeing with the sickly sharks in Sipadan,\" said Davies Austin Spiji, a senior marine biologist with non-profit conservation group Reef Guardian, ruling out human factors as Sipadan is a marine protected area where fishing is strictly prohibited, and there are no settlements or industries nearby.The reported sightings coincide with reports of coral bleaching in the area, according to Mohamed Shariff Mohamed Din, a professor in aquatic veterinary studies with Universiti Putra Malaysia.\"We cannot ignore that changes are happening there due to higher temperatures,\" Mohamed Shariff said.A full scientific study is yet to be done, however.In May, the research team tried but failed to capture some of the sharks to secure samples for testing, said Mabel Manjaji-Matsumoto, a senior lecturer with the Borneo Marine Research Institute of Universiti Malaysia Sabah.\"If we can get shark specimens, we will surely at least be able to find out the pathogenic cause of the lesions,\" Manjaji-Matsumoto said, adding that the team plans to make another attempt in July.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Malaysia,animals,sharks", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/malaysia-whitetip-reef-sharks-skin-disease-lesions-temperature-15010086", "Source": "google"}