{"Type": "", "Time": "2021-06-14", "Headline": "Rolls-Royce's One-Off EV Returns To Factory For Repair Work", "Text": "Over four years ago, Rolls-Royce unleashed its first electric vehicle. It wasn't a passenger vehicle, though, but a one-off kid car for a noble cause called the Rolls-Royce SRH. Built specifically for St. Richard's Hospital in Chichester, the SRH was used by children to drive themselves before pediatric surgeries.Now, after years of being in service, the SRH is now back at the Home of Rolls-Royce in Goodwood for routine maintenance work after 2,000 journeys amounting to 100,000 meters (62 miles).The SRH needed 400 hours to be completed, with the main purpose to provide excitement to young patients who are up for surgery. Rather than walking or being wheeled to the surgery unit, the kids can drive themselves, removing anxiety and replacing it with a memorable experience. The journey was in style, of course, with the SRH bearing a laser-etched RR badge and its own Spirit of Ecstasy.However, that task wasn't without any peril. The SRH suffered some damages to its paint and bodywork, which prompted the automaker to instill a recall to bring it back to its original design and condition. There's The Other One-Off That's Equally Special:\"Building the Rolls-Royce SRH for St Richard's Hospital was tremendously satisfying for all concerned. That it has been used so extensively and made such a positive contribution to so many children's experiences, makes it all the more rewarding. It was wonderful to see it back at the Home of Rolls-Royce and to have the opportunity to return it to its original, magnificent state,\" said Andrew Ball, Head of Corporate Relations, Rolls-Royce Motor Cars.Now back in its original state, the Rolls-Royce SRH has returned in service to continue its journey as a joy-bringer to the children of St Richard's Hospital.\n                                Source:\n                                \n                                                                    Rolls-Royce Car Buying ServiceGet upfront price offers on local inventory.Search for:TrendingAbout this article", "Section": "", "Writers": "", "URL": "https://www.motor1.com/news/513732/rolls-royce-srh-repair-work/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}