{"Type": "", "Time": "2021-06-14", "Headline": "Coronavirus: Athletes told to take courtesy condoms home amid physical distancing rules in Olympic Village | CTV News ", "Text": "FOLLOW ONAdvertisement\nReuters\nStaff\n\nContact\nTOKYO -- \n\tTokyo Olympic organizers plan to give away about 150,000 condoms at next month's Games, but are telling athletes to take them home rather than use them in the Olympic village where physical distancing rules and coronavirus measures are the top priority.\n\tLarge numbers of condoms have been given out at the Games since the 1988 Seoul Olympics to raise awareness of HIV and AIDS, and organizers said the International Olympic Committee had requested their continued distribution.\n\tBut athletes have been told to keep their distance from each other, meaning fewer opportunities to mingle and more.\n\t\"The distribution of condoms is not for use at the athlete's village, but to have athletes take them back to their home countries to raise awareness\" of HIV and AIDS issues, said Tokyo 2020 in an emailed response to questions by Reuters.\n\tOfficials have already barred overseas spectators and are asking those who do attend the delayed event to show their support by clapping rather than cheering or singing to try and reduce the risk of spreading the virus.\n\tDining has become another issue to resolve.\n\tOrganizers were originally planning to feed residents of the village in vast dining halls – the largest one with a capacity to seat 4,500 people at once.\n\tBut now, the organizers will ask athletes to dine alone, maintain social distancing with others, and wipe down surfaces after eating.\n\t\"Without the proper measures in place, it will only take one person to bring in the virus and spread it, especially in places like the athlete village,\" Nobuhiko Okabe, one of the infectious disease specialists advising Tokyo 2020 on its coronavirus measures said at a news conference on Friday.\n\t\"We have to do what we can to make sure an outbreak doesn't happen, and we really need the cooperation of all the athletes and delegations to make this work,\" he added.\n(Reporting by Sakura Murakami; Editing by Lincoln Feast.)The Olympic Rings are silhouetted as fireworks light up the sky during the closing ceremonies at the 2014 Sochi Winter Olympics in Sochi, Russia on Sunday, February 23, 2014. (THE CANADIAN PRESS / Nathan Denette)Advertisement\n        Sign up for our weekly email newsletter delving into climate science and life on a changing planet.\n                      Use of this Website assumes acceptance of Terms & Conditions and Privacy Policy© 2021All rights reserved.Back to top", "Section": "", "Writers": "", "URL": "https://www.ctvnews.ca/sports/athletes-told-to-take-courtesy-condoms-home-amid-physical-distancing-rules-in-olympic-village-1.5469019", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}