{"Type": "World", "Time": "2021-06-14", "Headline": "After fire and floods, Australian farmers suffer devastating mouse plague", "Text": "DUBBO, Australia: After surviving years of crippling drought, farmers in eastern Australia are locked in a months-long battle with hordes of mice that are pouring through fields and devouring hard-earned crops.Farmer Col Tink uses a broom to skittle hundreds of roving mice toward a makeshift industrial trap - essentially a large tub of water where they drown.It is a brutally simple attempt to slow the plague that has engulfed his farm - near the rural town of Dubbo - and thousands of other farms like it across eastern Australia.But Tink's efforts have barely made a dent. Mice continue to chew through grain and hay stocks while anything remotely edible remains under constant attack.Skin-crawling videos of writhing rodent masses have been shared around the world along with reports of bitten hospital patients, destroyed machinery and swarms running across roads en masse.The plague is the latest in a string of disasters to strike farmers in Australia. A years-long drought was followed by months of devastating bushfires from late 2019, before welcome rains became damaging floods in several regions.\"My dad's still alive; he's 93, and it's the worst three years he'd ever seen in his lifetime, and I think it's probably the worst mouse plague he's seen too,\" said Tink, who mainly farms Brahman cattle.But the prospect of this plague continuing through the southern hemisphere's winter makes him fearful for preparations ahead of the next dry spell - which is always on the horizon.\"If we don't get a real cold and fairly wet winter, I'm just a little bit worried what's going to happen in the spring,\" the 65-year-old told AFP.'CHRONIC' INFESTATIONSThe outlook is not good, according to Steve Henry, a research officer at Australia's national science agency, the CSIRO.\"When a mouse plague ends, they just disappear overnight,\" said Henry, who has been studying pest animals in Australia for nearly three decades.\"We're certainly not seeing that at the moment.\"Mice are a feral pest in Australia, arriving alongside the first British colonists.The tiny rodent is almost perfectly adapted to exploit the natural boom and bust of agriculture in the Australian climate, meaning plagues are not uncommon.But numbers this year have been \"just astronomical\", according to 74-year-old Terry Fishpool, a grain producer from nearby Tottenham.Large numbers of rodents were reported as early as October, their population fuelled by a bumper crop after the worst drought in living memory.Bill Bateman, an associate professor from Curtin University in Western Australia, said giant mouse plagues seemed to occur once a decade, but climate change could make them more regular.\"If we no longer get those cold winters, such that we are providing resources for mice all year round, then this is going to become a chronic thing rather than an acute thing,\" Bateman said.'NAPALMING MICE'With the rodents scurrying on, the government has announced millions of dollars in support and reached for a more potent poison, which one minister likened to \"napalming mice\".Yet to be approved, bromadiolone works faster than the widely used zinc phosphide bait but also stays in the system of dead or dying mice longer.Experts worry that it will potentially kill native wildlife who eat the poisoned mice.\"The use of second-generation rodenticides is an extremely worrying step,\" Bateman, who works in the school of molecular and life sciences, said.\"It's a very slippery slope.\"Extended use could create \"a bank of this toxin\" in the environment, killing natural predators and even risk poisoning humans through the food chain, Bateman said.\"We are really going to be setting up trouble for ourselves in future, not just in terms of destroying our biodiversity but destroying our frontline defences against any future mouse plagues.\"Henry said correct use of double-strength zinc phosphide, baiting while planting and removing alternative food sources could help curb the numbers if they did spike after winter.But the focus on \"quick fixes\" also needed to shift to long-term solutions including more research into what triggers \"monumental plagues\", he said.Fishpool said farmers had little choice in the meantime but to plant crops and hope the damage wrought by mice wasn't too severe -- comparing it to one of the nation's favourite pastimes.\"You could put it on horses and gamble it, but if you plant the crop, you can worry about it all year and gamble it.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Australia,pests,farming", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/australia-mouse-plague-farmers-crops-fields-fire-floods-15010458", "Source": "google"}