{"Type": "", "Time": "2021-06-14", "Headline": "Tony Fruit Office / TAA DESIGN | ArchDaily", "Text": "We are currently in Beta version and updating this search on a regular basis. We’d love to hear your feedback here.We are currently in Beta version and updating this search on a regular basis. We’d love to hear your feedback here.\nHome\n\nProjects\n\nProducts\n\nFolders\n\nFeed\n+ 34Text description provided by the architects. Tony Fruit Office situates in District 4 of Ho Chi Minh City where building ratio is high with most of the constructed buildings serving as commercial hubs and office headquarters. The site sits on a T-junction with an open view to the public park and square. However, two main facades of the building receive direct sunlight from dusk till dawn, causing a great overheating problem for the interiors.The idea of utilizing a perforated geometry allows the possibility to generate intermediate space for shading while maintaining expansive visual contact from inside the built environment to the urbans cape outside. On the other hand, setting back the hard construction creates rooms for outdoor greenery that results in a natural skin covering daylight exposed facades.Protected by a blanket of plants surrounding the building, every office space in the interiors obtains a fresh view onto the green surface. A system of similar green spaces is continued on every floor with mutual eye contact from different levels, which further improves the enjoyable experience of each space.A collective of wood slats forming cubes to provide effective shading against diagonal daylight entering the building. Meanwhile, the setback glazing receives as much as reflected light that benefits the cooling and lighting cost in building maintenance.The Green-perforated block is a possible solution in improving working space conditions for urban buildings that resides in cities with the same tropical environment as Ho Chi Minh, Vietnam.You'll now receive updates based on what you follow! Personalize your stream and start following your favorite authors, offices and users.", "Section": "", "Writers": "", "URL": "https://www.archdaily.com/963242/tony-fruit-office-taa-design", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}