{"Type": "Sport", "Time": "2021-06-14", "Headline": "Soccer-Pukki says Denmark game among most difficult of career after Eriksen scare", "Text": "REUTERS:     Finland striker Teemu Pukki said their Euro 2020 opener against Denmark on Saturday was one of the most difficult games of his career after Danish midfielder Christian Eriksen collapsed and required emergency medical treatment on the pitch.Inter Milan playmaker Eriksen collapsed suddenly in the 42nd minute of the match while running near the left touchline after a Denmark throw-in and was given life-saving cardiac massage treatment and taken to hospital.The Group B game was eventually restarted an hour and 45 minutes later after news came through that Eriksen had regained consciousness and Finland went on to win 1-0 thanks to a Joel Pohjanpalo goal.\"I must say it's been definitely one of the most difficult games of my career. Hopefully, everything is getting a better direction now,\" Pukki told reporters.\"We decided to do what the Danish team would decide and were ready to continue whatever decision was taken. It was definitely not easy to come back to the pitch. But once we heard everything seemed to be fine, we started concentrating again on the game.\"In the end, we're glad about the victory. The atmosphere after the game is definitely not as glorious as usual but we got important three points.\"Finland skipper Tim Sparv described the contest as an emotional roller-coaster.\"Our thoughts are with Christian Eriksen and his loved ones during these difficult times,\" Sparv tweeted. \"Football is so insignificant when something like this happens. Life is precious. Take care of each other.\"Eriksen's former club Tottenham Hotspur, who he left in 2020 to join Inter, tweeted a message of support, saying that he would \"always be one of our own\".(Reporting by Shrivathsa Sridhar in Bengaluru; Editing by Himani Sarkar)It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "game,sports,Teemu Pukki,Finland,Denmark,Christian Eriksen", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/soccer-pukki-says-denmark-game-among-most-difficult-of-career-after-eriksen-scare-15005540", "Source": "google"}