{"Type": "", "Time": "2021-06-14", "Headline": "Australia's Victoria state expects to further ease Covid-19 curbs | World News - Hindustan Times", "Text": "Australia's Victoria state expects to announce further easing of COVID-19 restrictions this week, acting Premier James Merlino said on Sunday, as the state reported one new locally acquired infection for a second straight day.Also Read: Australia's Victoria detects Delta Covid-19 variant in latest outbreakThe latest infection was a close contact of a previously reported case and had already been quarantined, Victoria's health department said.Australia's second-most-populous state has recorded 92 cases in its latest wave of COVID-19 infections, which triggered a two-week snap lockdown late last month. Victoria emerged from the lockdown on Friday as new cases declined, but some physical distancing rules remain.\"My expectation is by later in the week, we will be in a position to announce further easing of restrictions for regional Victoria and ... for metropolitan Melbourne,\" Merlino said.Merlino added he was keen to get people back to attending sporting events and theatre, though he had no announcement to make yet in that regard.Under existing curbs, Melbourne residents can only travel up to 25 kilometres (15.5 miles) from home while outdoor gatherings are limited to 10 people. Masks are required indoors and outdoors at all public spaces.Also Read: Covid-19: Australia's Victoria enters 7-day lockdownMore than 3,000 primary close contacts of infected cases are already in quarantine with about 122 exposure sites listed on the Victorian government website.Australia has fared much better than many other developed countries during the pandemic, with more than 22,300 local COVID-19 cases and 910 deaths since March 2020, mostly in Victorian aged-care homes.Snap lockdowns, internal border controls and tough social distancing rules have helped it contain prior outbreaks.New South Wales, Australia's most populous state, and neighbouring Queensland are on high alert after an infected woman and her husband travelled from Victoria through several country towns in both states.With no new cases on Sunday, New South Wales, which includes the largest city, Sydney, has not reported any locally acquired infection in more than a month, while Queensland last reported cases in late March.Get our daily newsletter\nSocialism and Mamatha Banerjee, Tamil couple who went viral, tie the knot\n\nMan trying to board moving train slips, cop and train guard save his life. Watch\n\nOtter trapped inside car engine gets rescued in Scotland\n\nCar drowns in sinkhole in Mumbai, viral video shocks tweeple. Watch\nGet free access to newsletters, alerts and recommendations", "Section": "", "Writers": "", "URL": "https://www.hindustantimes.com/world-news/australias-victoria-state-expects-to-further-ease-covid-19-curbs-101623561850026.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}