{"Type": "", "Time": "2021-06-14", "Headline": "'Small' groups don't rule the world, China cautions G-7 nations, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.CARBIS BAY, ENGLAND (REUTERS) - China on Sunday pointedly cautioned Group of Seven leaders that the days when “small” groups of countries decided the fate of the world was long gone, hitting back at the richest democracies as they sought to act in concert to counter Beijing’s might. The re-emergence of China as a leading global power is considered to be one of the most significant geopolitical events of recent times, alongside the 1991 fall of the Soviet Union that ended the Cold War. But the return of China as a global power has unnerved the United States: President Joe Biden casts China as the main strategic competitor and has vowed to confront China’s “economic abuses” and push back against human rights violations.“The days when global decisions were dictated by a small group of countries are long gone,” a spokesman for the Chinese embassy in London said.“We always believe that countries, big or small, strong or weak, poor or rich, are equals, and that world affairs should be handled through consultation by all countries.”The Chinese spokesman said the only valid global system was the international order based on the principles of the United Nations and “not the so-called rules formulated by a small number of countries.” The G7, whose leaders are meeting in southwestern England, has been searching for a coherent response to the growing assertiveness of President Xi Jinping after China’s spectacular economic and military rise over the past 40 years.Leaders of the group, which comprises the United States, Canada, Britain, Germany, Italy, France and Japan, want to use their gathering in the English seaside resort of Carbis Bay to show the world that the richest democracies can offer an alternative to China’s growing clout.Canadian Prime Minister Justin Trudeau led a G7 discussion of China on Saturday and called on leaders to come up with a unified approach to the challenges posed by the People’s Republic, a source said. \nThe G7 are planning to offer developing nations an infrastructure scheme that could rival Xi’s multi-trillion-dollar Belt and Road initiative.Beijing has repeatedly hit back against what it perceives as attempts by Western powers to contain China, and says many major powers are still gripped by an outdated imperial mindset after years of humiliating China. In a step likely to anger China, the G-7 final communique mentions Hong Kong and the Chinese region of Xinjiang, a diplomatic source said. The United States has pushed for specific language in the communique about alleged forced labour in China’s Xinjiang region, officials said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/small-groups-dont-rule-the-world-china-cautions-g-7-nations", "Source": "google"}