{"Type": "", "Time": "2021-06-14", "Headline": "Netanyahu leaves an important legacy", "Text": "\nThe coalition against him is testament to the strength of feeling among Israeli voters, but Netanyahu has achieved much in 12 years\nBenjamin Netanyahu, who has finally lost power after 12 years, changed Israel radically. Under his leadership, the country deregulated, grew, leveraged its technical prowess, expanded its military power and, crucially, reached out to the rest of the world – on the basis that Israel had to be strong to survive. His critics charge him with moving away from a two state solution.At the same time, he built new friendships with Arab regimes, tapping into legitimate alarm about Iranian imperialism. In 2015, when he made his case against Iran to the US Congress, it underscored how different the world situation was compared to the 1930s. Then, Jews were defenceless. Now, they had a strong state to call home, and the people of Israel would never go down without a fight.Over time, Mr Netanyahu alienated much of his country, even his former supporters – and the Knesset alliance that has brought him down, lacking ideological coherence, is really an “Anyone But Bibi” coalition. In his effort to redefine Israel, and remake it in his own image, Mr Netanyahu also lost friends abroad. One of the most significant changes to American politics has been the death of the once instinctual alliance between the Democratic Party and Israel, thanks to the rise of far-Left Democrats who saw Mr Netanyahu’s closeness to Donald Trump as an indictment of Zionism.This is one of the most transparent prejudices shown towards Israel, that its impermanent, sometimes controversial leadership speaks for all Israelis or even all Jews the world over. In reality, as this past election has shown, this is a vibrant, pluralistic democracy in a region that eschews such things – a key reason to wish the nation every success.We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage.", "Section": "", "Writers": "", "URL": "https://www.telegraph.co.uk/opinion/2021/06/14/netanyahu-leaves-important-legacy/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}