{"Type": "", "Time": "2021-06-18", "Headline": "Apple Daily: the Hong Kong tabloid that dared to challenge China", "Text": "Keep up to speed at a glance with the Top 10 daily storiesKeep up to speed at a glance with the Top 10 daily storiesOver the past 26 years Hong Kong's Apple Daily newspaper has evolved into the city's most popular tabloid by punching up against a particularly powerful entity that brooks little criticism: China's communist leadership.It has now been declared a threat to national security and its future is deeply uncertain.Caustic criticism of Beijing has been part of the paper's DNA from the beginning.It was founded in 1995 \"as a newspaper for Hong Kong people\" by Jimmy Lai, a billionaire mogul who had fled to the city from the mainland as a penniless child, and amassed a fortune selling clothes.Lai had not been especially political until the events of June 4, 1989, when he and many other Hong Kongers watched in horror as China sent tanks and troops to crush democracy protesters in Beijing's Tiananmen Square.In the ensuing years he became increasingly outspoken -- often using especially colourful language to describe China's leaders -- and his clothing brand Giordano soon found itself in trouble with mainland authorities.So Lai sold up and ploughed the proceeds into a new endeavour -- founding a media empire.The emergence of Apple Daily coincided with Hong Kong's return by Britain to China in 1997.As many Hong Kongers fretted about their future freedoms, Apple Daily became the voice of the city's pro-democracy, Beijing-sceptical wing.- Scandal and sex -Much like Rupert Murdoch before him, Lai carved a space out in a crowded media landscape by being brasher and louder than his rivals, combining often populist right-wing politics with ample lashings of sex, celebrity and scandal.He also launched a brutal price war.The tactics paid off. In just a few years Apple Daily was printing 400,000 copies a day. Lai also opened up a Taiwan edition.Much like the rest of the print media, its circulation has crumbled in recent years -- to around 80,000 daily copies in Hong Kong.Apple Daily has struggled to successfully monetise online content, with Lai writing cheques to keep the paper afloat.But it remained a voice of defiance as local media increasingly began to self-censor and avoid taking on China's leaders directly.As Hong Kong's pro-democracy movement gathered steam from 2014 onwards, Lai became public enemy number one to Beijing, with state media routinely describing him as a \"traitor\" and a \"black hand\".Apple Daily's support for the huge and often violent democracy protests that rocked Hong Kong in 2019 infuriated Beijing further, as did Lai campaigning for international sanctions.Lai and Apple Daily's editorials were also vocal in support of former US president Donald Trump's confrontations with China.- 'See you in prison' -Beijing's imposition of a sweeping national security law last year radically changed the paper's fortunes.Lai, 73, was among the first high-profile democracy activists arrested under the law.He was jailed for attending protests, and faces a national security charge of collusion that could land him a life sentence.In an interview with AFP almost exactly a year ago, shortly before the law came in, he predicted it would be used to silence his newspaper.\"Whatever we write, whatever we say, can be subversion, can be sedition,\" he said.On Thursday, five Apple Daily executives were arrested under the same charge and some of its assets were frozen.A large number of items including 38 computers used by reporters were seized by police, Apple Daily said.\"They took away my computer,\" a reporter, who declined to be named, told AFP, adding that staff were rattled.\"No one knows where the red line is,\" he said. \"But for now I will continue my work as long as I can.\"A features reporter, who gave her surname Chan, said gallows humour had descended over the newsroom in recent months.\"We often made dark jokes like 'See you in prison'\", she told AFP.But she too vowed to plough on.\"If they really ban us, then we will remain a witness to history and will keep writing until the end.\"su-yan/jta/legRafael Nadal and Naomi Osaka, with 24 Grand Slam titles between them, both withdrew from Wimbledon on Thursday with the Spanish star also pulling out of the Tokyo Olympics in a bid \"to prolong my career\".China and other nations were attempting to “seize control” of strategically important international organisations so they could be “weaponised”, a new report by the UK parliament’s influential Foreign Affairs Committee said. The report, published Thursday, accused China in particular of “bullying” states to back their position or their candidates for top jobs, using measures including financial leverage “to shift policies away from the cooperation the organisations were created to promote”. TheGuided by MIT faculty, gain practical knowledge to embrace blockchain as a business tool.Global stocks were mixed on Thursday as traders digested the Federal Reserve's move to bring forward its forecasts for hiking interest rates as the economy recovers.The PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saBrowsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.Expand Wifi Signal in Every Single Room & Boost Wifi Speed by 200%A reporter with a pro-Beijing newspaper in Hong Kong accused of making a false statement when accessing a government car registry has been let off the hook after prosecutors agreed to drop the charge on condition of a binding-over order. The prosecution’s decision stood in marked contrast to the justice department’s handling of a case last year involving an RTHK contributor accused of the same act, prompting Principal Magistrate Ivy Chui Yee-mei to question the difference in approach at ThursdayWashington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HouseBeijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityLastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.If you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.The Kremlin was guarded about future dialogue with Washington on Thursday, a day after the first face-to-face meeting between Russian President Vladimir Putin and US counterpart Joe Biden.Hong Kong police have for the first time determined the publication of certain newspaper articles to be a national security crime as they arrested the editor-in-chief, publisher and three other executives of Apple Daily whom they held accountable for more than 30 reports calling for foreign sanctions. The force on Thursday cited the publication of the articles – understood to be mostly commentaries and opinion pieces, including several written by the tabloid’s jailed founder and opposition activEvery PC user must read this in 2021 - Do it now.Israeli jets launched air strikes on Gaza overnight Thursday to Friday after militants in the Palestinian territory again set off incendiary balloons into southern Israel, the army and AFP journalists said.Former Taiwanese president Ma Ying-jeou has called on the government to listen to public opinion and allow civilian groups which have different political leanings to the ruling Democratic Progressive Party to import much-needed Covid-19 vaccines. Taiwan, which is battling a surge in cases, has struggled to secure vaccines although it has signed deals to buy 10 million doses from AstraZeneca, 5 million from Moderna and more than 4.7 million doses via the Covax Facility, which is supported by theJapan said on Thursday it will make a vaccine passport available from next month for Japanese travellers, as governments around the world experiment with ways to relaunch tourism and business trips.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).The scientific community should find ways to overcome political divides and push for more collaboration in space exploration, as well as solve global problems by making use of China’s new space station, a Hong Kong-based space expert says. Professor Quentin Parker, head of the Laboratory for Space Research at the University of Hong Kong, made the remarks ahead of China’s first crewed space flight in nearly five years, with three astronauts expected to travel to its new Tiangong space station forChinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiChina’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the buNew research has identified TEN favorite stocks for the upcoming yearIf you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.The World Bank rejected a request from El Salvador for assistance in its bid to adopt bitcoin as a currency, a spokesperson for the Washington-based development lender said Thursday.With Afghan troops in retreat and soon to lose vital American air support, Taliban commanders are voicing exuberance about quickly seizing full control of the country and re-establishing their version of an Islamic state.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/apple-daily-hong-kong-tabloid-104055978.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}