{"Type": "Singapore", "Time": "2021-06-18", "Headline": "'Overwhelming' response for Sinovac COVID-19 vaccine at some approved clinics", "Text": "SINGAPORE: Several clinics received hundreds of enquiries about the Sinovac COVID-19 vaccine on Thursday (Jun 17), a day after the Ministry of Health (MOH) released its list of approved clinics to administer the shots.When CNA visited Wee Healthfirst Medical Clinic in Clementi - one of the 24 approved clinics - at about 2.30pm on Thursday, at least 15 people were there to ask about the Sinovac vaccine.Staff members were seen handing out paper slips for people to leave their details so that the clinic could contact them once the shots were available. Nearly 1,000 names were given to the clinic, according to the clinic’s director Dr Seow Yu Jin.\"It's just been manic, it's been very busy ... Some patients, unfortunately, couldn't get through on the phone and had to personally come down and there was a long queue outside of the clinic, which I really wasn't expecting,\" said Dr Seow.He said the clinic is currently waiting for its first batch of Sinovac shots to arrive.\"Hopefully they (the vaccine shots) will come tomorrow. We're bedding down processes – tonight, I'm just going to finalise my patient leaflets and then hopefully start vaccinating by the weekend,\" he said.He added that the clinic plans to open outside its usual operating hours in order to administer the vaccine.\"For example, this weekend, my Saturday clinic will run from 8am to 1pm. In order to deal with this response, we will probably have to open after 1pm until about 5pm, 6pm, when we can just purely vaccinate, just get through the numbers,\" he said.It was a similar situation at StarMed Specialist Centre, an ambulatory surgery centre in Farrer Park, which has seen an “overwhelming” response since its phone lines opened at 8am on Thursday.“We've already had (more than) 400 bookings for vaccinations,” the centre’s chief executive officer Dr Louis Tan told CNA.\"It's fair to say that we have seen a larger number of patients who are above the age of 40 make enquiries as to these vaccinations,\" he added.The centre has placed an order of 1,000 doses of the Sinovac vaccine, which was the maximum amount it was allowed, according to Dr Tan. It will be receiving 200 doses, with the first batch expected on Friday.To cope with the demand, the centre intends to bring in more nurses to support its current staff members, he said. At the moment, the centre does not plan to extend its operating hours, but it will do so if necessary, said Dr Tan.When CNA tried calling the other clinics on the approved list between 3pm and 5pm, most of the phone lines were busy.Two of them who picked up - iCare Medical and Wellness Clinic, and Chinatown Wellness - told CNA that they were “swamped” with enquiries from the public, but did not give figures.Meanwhile, Pinnacle Family Clinic’s Pasir Ris branch told CNA it has received more than 200 enquiries over the phone about the vaccine.StarMed Specialist Centre, which was involved in the vaccination of migrant workers and provided medical support at various community care facilities, said it will apply the same safety precautions when administering the Sinovac jabs.\"(We will screen) patients for recent illness, fever ... possibility of pregnancy and so forth, as well as filtering them by age, these are all standard questions that we would ask patients before we administer the vaccine,\" said Dr Tan.He added that the centre was waiting for more guidelines from MOH.MOH reiterated on Wednesday that the Sinovac vaccine is not part of the national vaccine programme and those taking the Sinovac jabs will not be covered under the Vaccine Injury Financial Assistance Programme for COVID-19 Vaccination.The ministry added that those who wish to receive the vaccine through the Special Access Route should discuss the risks and benefits with their doctors at their selected private healthcare institutions.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,Sinovac,vaccination,health", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/covid-19-sinovac-vaccine-jab-clinics-overwhelming-response-15033550", "Source": "google"}