{"Type": "", "Time": "2021-06-18", "Headline": "Israel bombs Gaza City in 2nd day of strikes since breaking cease-fire", "Text": "Israel bombed Gaza for the second straight day Thursday as a cease-fire signed last month appeared to be falling apart between the two sides.The Israeli government said it targeted Hamas sites in Gaza City and Khan Younis late Thursday. Explosions could be seen in the night sky from the jet strikes.\"Over the past day, arson balloons were launched from the Gaza Strip into Israeli territory,\" the IDF said in a statement. \"In response, a short while ago, IDF fighter jets struck military compounds and a rocket launch site belonging to the Hamas terror organization in Gaza city and Khan Yunis.\"MORE: Netanyahu ousted following Knesset vote The IDF went on to say it was ready for a \"resumption of hostilities\" if the attacks from Gaza continued.\"Earlier this evening, the IDF Chief of the General Staff held a situational assessment in which he instructed to increase the IDF's readiness and preparedness for a variety of scenarios including a resumption of hostilities, in the face of continuing terror activities from the Gaza Strip,\" the IDF said in the statement.Sirens were also reported to have sounded in Kfar Aza, a kibbutz in southern Israel, just 3 miles from the Gaza border. The IDF said the sirens were triggered by \"incoming fire, not rockets, from the Gaza Strip towards Israeli territory.\"Israel said it struck Hamas sites in Khan Younis and the Gaza Brigades on Wednesday.Open hostilities boiled over into airstrikes and rocket attacks between Israel and Hamas last month, killing at least 232 people -- including 65 children -- in the Gaza Strip, according to the Palestinian Ministry of Health. Ten people, including one soldier and a 6-year-old child, were killed in Israel by Hamas rockets, according to Magen David Adom, Israel's national emergency service.After nearly two weeks of fighting, Israel’s security cabinet approved a cease-fire with Hamas on May 20 without any conditions.MORE: Israeli cabinet approves cease-fire with Hamas amid 2nd week of violence\"The chief of staff, the military echelon and the head of the Shin Bet reviewed with the ministers Israel's great achievements in the campaign, some of which were unprecedented,\" a statement from the office of then-Israeli Prime Minister Benjamin Netanyahu read. \"The political echelon emphasizes that the reality on the ground will determine the continuation of the campaign.\"Netanyahu was ousted as prime minister on Sunday after a vote by the Knesset, Israel's legislature. Naftali Bennett took over as the country's new prime minister.ABC News' Morgan Winsor and Nasser Atta contributed to this report.Israel bombs Gaza City in 2nd day of strikes since breaking cease-fire originally appeared on abcnews.go.comTwo college students who say they were assaulted and shot with stun guns by Atlanta police officers last year plan to file a lawsuit against the city, Mayor Keisha Lance Bottoms and several of the officers they say were involved in the incident.  At a press conference, attorneys for Taniyah Pilgrim and Messiah Young said police stormed their car, smashed their windows and physically assaulted them on May 30, 2020.  The two students talked about the emotional and physical trauma they say they've suffered since the incident.Daredevil motorcycle rider Alex Harvill died in a crash Thursday while practicing for a record jump.  Harvill, 28, was practicing at the Grant County International Airport in Moses Lake, Washington, when the accident occurred, according to the Grant County Coroner's Office.  The record jump was set to take place at the Moses Lake Airshow on Thursday morning, but he was fatally injured in a warmup jump prior to the record attempt.Find top home alarm and security systems on Yahoo Search, today.The historic heat wave in the West is not relenting -- and the high temperatures may be contributing to a massive wildfire that's exploded in size.  Las Vegas hit 116 degrees on Wednesday, breaking a daily record, while Grand Junction, Colorado, reached 105 degrees, an all-time June record.  California residents have been asked to scale down their power usage to prevent a strain on the system, reported San Francisco ABC station KGO.President Joe Biden signed a bill Thursday making Juneteenth a federal holiday commemorating the end of slavery in the United States -- just in time for Saturday's June 19 anniversary.  It's a day African Americans have celebrated yearly since the Civil War-era and the culmination of a decades-long effort by advocates to get national recognition for the momentous development in American history.  A jubilant Vice President Kamala Harris, the nation's first Black vice president, who co-sponsored the legislation when she served in the Senate, spoke about the significance of the occasion, noting slaves helped build the White House.President Joe Biden and Democratic lawmakers praised the Supreme Court's decision Thursday to uphold the Affordable Care Act, known as Obamacare, in a case challenging its individual mandate.  Former President Barack Obama made a point to emphasize that this isn't the first time the high court has upheld his presidency's landmark legislation, which Republicans have sought to dismantle for years.Excessive Sleep Disorder signs may be more subtle than you think. Check out narcolepsy warning signs and symptoms.When Nicholas Allen, 22, graduated from Cornell University last month, he had hoped his grandfather, Gail Allen, would be able to be there to watch him be commissioned in the U.S. Navy.  Nicholas Allen, who is going to nuclear power school with the goal of working on a Naval submarine, said he grew up hearing stories of his grandfather's own service in the Navy.  Gail Allen, 78, enlisted in the Navy out of high school and served for 13 years, only leaving the service so he could gain custody of his two sons, one of whom is Nicholas's father, Ret.A third \"Legally Blonde\" movie is in the works with Reese Witherspoon set to reprise her role as Elle Woods, and Luke Wilson, who played Emmett Richmond, Woods' love interest in the first two films, said he's up for a reunion.  Wilson also admitted that he never misses a chance to catch the original \"Legally Blonde\" when it's airing on TV.An Alaska hiker whose whereabouts were unknown for nearly two days after she reported being chased off a trail by bears was found alive Wednesday evening, officials said.  Fina Kiefer, 55, of Palmer, Alaska, emerged from the woods and was spotted on a road about a mile from the Pioneer Ridge trailhead.  Kiefer was injured and was transported by ambulance to a local hospital for evaluation, according to statements from the Alaska State Troopers as well as Alaska's National Guard.Top Surgeon and Author of the Best Selling Book \"Dr. Gundry's Diet Evolution\" Discovers Link Between Gut Health and the Rising Number on the Scale.The Supreme Court on Thursday, in long-anticipated decision, rejected a challenge to the Affordable Care Act in a case involving whether the individual mandate can be severed from the rest of the law -- or whether the whole law must be struck down.  The court ruled 7-2, with Justice Stephen Breyer writing for the majority, striking down a lower court ruling, saying the plaintiffs -- Texas and 17 other GOP-led states -- did not have standing to sue.  \"We do not reach these questions of the Act’s validity ...  for Texas and the other plaintiffs in this suit lack the standing necessary to raise them,\" he wrote, concerning the arguments the mandate and the whole law should be invalidated.Chris Pratt and Katherine Schwarzenegger welcomed their first child together, daughter Lyla, last August.  The Marvel movie star, who shares an 8-year-old son Jack with ex-wife Anna Faris, explained what having a second child taught him.  \"The greatest gift that I've seen so far, the second child really shows you the uniqueness of the first child,\" Pratt told E!A man is in custody after allegedly stabbing a 94-year-old Asian woman multiple times in broad daylight in San Francisco, police said.  The woman was attacked at about 10:15 a.m. Wednesday and rushed to a hospital, the San Francisco Police Department said.  The suspect, 35-year-old Daniel Cauich, was arrested at about 11:45 a.m., police said.Research Subaru Forester Dealerships. The affordable price makes this SUV hard to resist.Victoria's Secret is on the brink of a major revamp.  As the brand says farewell to its notorious \"Angel\" models, the new leading lineup of ambassadors features actress and entrepreneur Priyanka Chopra Jonas, transgender Brazilian model Valentina Sampaio, LGBTQIA+ activist and professional soccer player Megan Rapinoe and several others.  \"With The VS Collective, we are creating a platform that will build new, deeper relationships with all women,\" said Victoria's Secret Chief Marketing Officer Martha Pease in a statement.Sunglasses used in the movie \"Cruella\" were stolen in a late-night raid on a luxury eyewear store in London earlier this month, with CCTV footage showing the daring smash and grab.  The burglary was caught on camera at the Tom Davies eyewear store in London's Sloane Square.  Among the pairs stolen were sunglasses used in the Disney movie \"Cruella,\" which were due to be auctioned off for charity.Rita Moreno is walking back the remarks she made in defense of \"In the Heights\" amid the colorism controversy surrounding the film after critics called out Lin-Manuel Miranda for casting mostly lighter-skinned Latino actors in the big-screen adaptation of his hit musical.  During Tuesday night's episode of \"The Late Show with Stephen Colbert,\" Moreno said critics were \"attacking the wrong person\" and Miranda \"is the man who literally has brought Latino-ness and Puerto Rican-ness to America.\"  \"While making a statement in defense of Lin-Manuel Miranda on the Colbert Show last night, I was clearly dismissive of Black lives that matter in our Latin community,\" she wrote.Veterinarian and author of the Best Selling Book, \"The Nature of Animal Healing\", Reveals Silent Clues That Your Dog is in Distress.John Marvin Murdaugh and Randolph \"Randy\" Murdaugh IV said they \"knew something was wrong\" when their other brother called them both late in the night on June 7.  Both victims were located outside of the residence on the sprawling property and had \"sustained multiple gunshot wounds,\" according to a press release from the South Carolina Law Enforcement Division, which is investigating the double murder along with the Colleton County Sheriff's Office.The \"megadrought\" that's plaguing much of the western U.S. is a direct consequence of warming global temperatures, according to experts.  The term is used to describe a severe and intense drought that spans a couple of decades, National Oceanic and Atmospheric Administration meteorologist Brad Pugh told ABC News.  The current megadrought is further evidence that the climate has been warming over past decades, according to the experts.Hong Kong's national security police arrested five executives at the pro-democracy newspaper Apple Daily on Thursday morning and raided its offices for the second time in a year as pressure on the city's media freedom intensifies.  Editor-in-chief Ryan Law and four directors were detained on suspicion of colluding with foreign forces under the controversial national security law, which was imposed by Beijing last summer following the mass pro-democracy protests of 2019.  In a \"letter to readers\" posted on the Apple Daily website Thursday afternoon, the paper said every one of its journalists has reported the truth, legally and reasonably.This new security camera lets you view all footage directly from your phone and no subscription required.When President Joe Biden took office in January, there was an expectation that changes to policies on the southern border would help reverse the crisis there.  In addition, hopes of reuniting families of children separated by Trump's controversial separation policy have also been slow-going and the issue of immigration generally has been a source of contention for the new administration.  Illustrating the turmoil is a dramatic surge in unauthorized U.S. southern border crossings.The Illinois family of a U.S. Navy veteran who has been held hostage by the Taliban has said for the past year that he might get left behind by his own country.  With the accelerated and chaotic exit from Afghanistan by America's remaining military forces, their worst fears may be realized.  Once American military and special operations personnel have left Afghanistan -- which some officials anticipate will happen by July Fourth -- experts say the U.S. will lose most of whatever leverage it might have to free civil engineer Mark Frerichs through one of the limited number of tracks the government has already contemplated or acted upon during his 17 months of captivity.For the first time in nearly 40 years, Congress has moved to establish a new national holiday, this time for Juneteenth, and just in time for Saturday's 156th anniversary of the day that marks the last African American slaves being freed in Texas in the wake of the Civil War.  It heads next to President Joe Biden's desk for a signature.  When Biden signs it, as he's expected to at 3:30 p.m. ET Thursday, according to the White House, Juneteenth will officially become a federal holiday -- the first since Martin Luther King Jr. Day was signed into law in 1983.", "Section": "", "Writers": "", "URL": "https://www.yahoo.com/gma/israel-bombs-gaza-city-2nd-213900603.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}