{"Type": "", "Time": "2021-06-17", "Headline": "McDonald's Adds New Products After Its Most Popular Collab to Date", "Text": "McDonald's has seen huge success with its BTS collaboration. The week the special k-pop meal launched, the chain saw a sudden record-breaking increase in foot traffic at its locations, while the merchandise line which came out alongside it sold out at the speed of light. So it's only natural that the fast-food giant decided to hang on to their superstar partners a little longer and extend the collaboration with a second merchandise drop.Fans of the band who have been buying up anything and everything connected to this partnership between the two greats (including fast-food wrappers from Ebay at inflated prices), will be delighted to know that not one, but two new lines of merch have just been released in the United States, and are available to pre-order on weverseshop.io.RELATED: Here's What a Food Critic Said About McDonald's New BTS MealThe drop actually consists of two new lines of BTS goodies—\"Saucy\", which includes items featuring hand-drawn art by the band members themselves, and Melting, which is all about paying homage to their latest smash hit Butter. While the first merchandise collection in May included hats, tote bags, hoodies, bathrobes, socks, and sandals, the two new lines offer additional items like badges, stickers, instant tattoos, a stationery set, keychains, and even a box set for learning Korean, so you can understand BTS social media posts.For those who were hoping to wear some of their BTS swag, there's good news too. The new lines also include a plush bathrobe, a parka, and a ball cap.The items will be available until they sell out—and that's happening fast. So don't wait if you want to get your hands on any of the cute memorabilia. As for the BTS meal, you still have several days to try it before it leaves the menu on June 20.For more, check out:And don't forget to sign up for our newsletter to get the latest restaurant news delivered straight to your inbox.The BTS meal is all about the new sauces.It was too popular for local restaurants to handle.Data was compromised in several markets, including the U.S.© 2020 Galvanized Media. All Rights Reserved. EatThis.com is part of the AllRecipes Food Group", "Section": "", "Writers": "", "URL": "https://www.eatthis.com/news-mcdonalds-bts-merchandise-lines-added/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}