{"Type": "", "Time": "2021-06-18", "Headline": "Inflation and the stock market", "Text": "\n\n\n\n\nTitle text for next articleLast week the US released its latest inflation figures, which\nover the past three months has been increasing significantly to levels known as\n\"hyperinflation\". Inflation has been a major issue for the US economy and for the\nCentral Regulators who seem to not know exactly how to approach the issue while\nemployment remains low. As part of the article we shall look at what\nhyperinflation is and what it means for the US stock market. This year after the financial stimulus which was introduced\nby the new government, economists predicted high levels of inflation due to the\npump of cash into the economy. The Federal Reserve also commented on this\nadvising high inflation is likely, but may not be here in the longer term and\ntherefore, no current need for altering the monetary policy while unemployment\nremains high. Now that inflation has reached over 5%, mainly due to the rise in\nenergy prices, traders have been evaluating what the market reaction is likely\nto be. It is not only the US Dollar which is likely to be affected, but also\nstocks. Last week, we saw quite a large rise in the US Stock Market after the\nannouncement of a 5% inflation. After the announcement the SNP500 grew by 0.65%\nwithin two hours, the Dow Jones by up to 0.72% and the Nasdaq by 1.53%. Overall\nthe biggest winner for the day was the Nasdaq followed by the Dow Jones. When we see high levels of inflation, a common side effect\nis the devaluation or lowered purchasing power within the economy. This alone\nmeans that stock can become harder to purchase, especially by individuals\nwithin the country. Subsequently, this can increase the demand amongst foreign\nbuyers as foreign currency may be able to benefit from a more competitive\nexchange rate. In addition to this, normally when a market sees hyperinflation\nthe central banks look at different possible methods of controlling the rise in\nprices. One method is by increasing the federal funds rate, the Federal Reserve\nis effectively attempting to shrink the supply of money available for making\npurchases. At the same time this also makes other investments, such as savings\naccounts and fixed deposits, more attractive due to the increase in the\ninvestment yield. Furthermore, an increase in interest rates can alter\ninvestors spending and investing habits due to the cost of living. Individual\ninvestors are impacted through increases to their credit card, overdrafts and\nmortgage interest rates, especially if these loans carry a variable interest\nrate and have not been fixed for the longer term. When the interest rate for\ncredit cards and mortgages increases, theamount of money that consumers can spend decreases. As a\nresult of this, certain groups may avoid investing, or generally spending extra\ncapital. This will not only affect the direct demand of the stock market, but\nalso the sales figures and company revenues.It is important to note that correlations should be\nconsidered when analysing the market, whether the currency exchange market or\nthe stock market. It should be noted that correlations are not always as strong\nand can have different effects depending on the market overall, for example the\nmarket at the moment is witnessing very high unemployment, lockdowns and\neconomic restrictions, all are aspects of the market we have not previously\nwitnessed. For this reason, it is also important to evaluate the overall stock\nmarket conditions and sentiment. This can be done through analysing not only\nindividual stocks, but indices such as the SNP500, NASDAQ and Dow Jones. This article was written and submitted by eXcentral.Disclaimer: This material is considered a marketing\ncommunication and does not contain, and should not be construed as containing\ninvesting advice or a recommendation, or an offer of or solicitation for any\ntransactions in financial instruments or a guarantee or a prediction of future\nperformance. Past performance is not a guarantee of or prediction of future\nperformance.Subscription Confirmed!Thank you for subscribingAbout UsAll the biggest trading floors in the world have screens locked on ForexLive™. We provide real-time forex news and analysis at the highest level while making it accessible for less-experienced traders.CONNECT WITH ForexLive\n\nSubscribe to our Daily News Wraps\nSubscribe to our Newsletter\n\n\n\n\nCONTACT US\nFounded in 2008, ForexLive.com is the premier forex trading news site offering interesting commentary, opinion and analysis for true FX trading professionals. Get the latest breaking foreign exchange trade news and current updates from active traders daily. ForexLive.com blog posts feature leading edge technical analysis charting tips, forex analysis, and currency pair trading tutorials. Find out how to take advantage of swings in global foreign exchange markets and see our real-time forex news analysis and reactions to central bank news, economic indicators and world events.\r\n                HIGH RISK WARNING: Foreign exchange trading carries a high level of risk that may not be suitable for all investors. Leverage creates additional risk and loss exposure. Before you decide to trade foreign exchange, carefully consider your investment objectives, experience level, and risk tolerance. You could lose some or all of your initial investment; do not invest money that you cannot afford to lose. Educate yourself on the risks associated with foreign exchange trading, and seek advice from an independent financial or tax advisor if you have any questions.\r\n            \r\n                ADVISORY WARNING: FOREXLIVE™ provides references and links to selected blogs and other sources of economic and market information as an educational service to its clients and prospects and does not endorse the opinions or recommendations of the blogs or other sources of information. Clients and prospects are advised to carefully consider the opinions and analysis offered in the blogs or other information sources in the context of the client or prospect's individual analysis and decision making. None of the blogs or other sources of information is to be considered as constituting a track record. Past performance is no guarantee of future results and FOREXLIVE™ specifically advises clients and prospects to carefully review all claims and representations made by advisors, bloggers, money managers and system vendors before investing any funds or opening an account with any Forex dealer. Any news, opinions, research, data, or other information contained within this website is provided as general market commentary and does not constitute investment or trading advice. FOREXLIVE™ expressly disclaims any liability for any lost principal or profits without limitation which may arise directly or indirectly from the use of or reliance on such information. As with all such advisory services, past results are never a guarantee of future results.\r\n            Viewing  Touch / Click anywhere to close ", "Section": "", "Writers": "", "URL": "https://www.forexlive.com/Education/!/inflation-and-the-stock-market-20210617", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}