{"Type": "", "Time": "2021-06-18", "Headline": "Japan eases Covid-19 emergency in Tokyo to ‘quasi-emergency’ as Olympics loom, Sport News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.TOKYO  - Japan will lift the Covid-19 state of emergency in Tokyo and Osaka on Sunday (June 20) as planned, but will continue to impose curbs under a lighter “quasi-emergency”.The decision, which comes nearly a month before the Olympic Games flag off on July 23, has been keenly watched as it will have a bearing on how many domestic spectators are allowed into stadiums for the Games.Foreign audiences have already been barred, but Prime Minister Yoshihide Suga’s government is said to be keen on having Japanese ticketholders fill the stands. A current cap of 5,000 or half of venue capacity, whichever is lower, will be eased next month, with an upper limit of 10,000 people.Spectators will be expected to wear masks and refrain from cheering.The state of emergency is ongoing in 10 prefectures, with regions being added to the list across several weeks. Tokyo, Osaka, Kyoto and Hyogo first came under the emergency on April 25, followed by Aichi and Fukuoka on May 12, and then Hokkaido, Hiroshima and Okayama on May 16, and finally Okinawa on May 23.The emergency will be lifted in all areas except Okinawa as planned on Sunday, with the tropical south-west island chain to remain under emergency measures until July 11. This is because the burden on the medical hospitals there remains high.Of the other nine areas, seven will come under the “quasi-emergency” restrictions until July 11, with only Hiroshima and Okayama escaping Covid-19 curbs altogether.Separately, the three prefectures that border Tokyo – Saitama, Chiba and Kanagawa – will also be under “quasi-emergency” measures until July 11. “The rate of decline in infections has slowed and because of the emergence of variants, there is a risk that cases may increase,” Prime Minister Yoshihide Suga told a news conference. “Given the circumstances, we need to be vigilant to ensure there is no rebound, and remain focused in implementing anti-virus measures.”Japan’s emergency measures have been far less strict than the lockdowns and circuit breakers overseas. Museums, gyms, shopping malls, cinemas and theatres are among those that remain open with few restrictions, and there is no compulsory location check-ins nor pre-event testing.But Tokyo and Osaka have been under either a Covid-19 emergency or “quasi-emergency” for all but four weeks so far this year, and public patience is fast wearing thin.They will not get any respite, however, with the “quasi-emergency” said to be necessary for the authorities to curb movement to prevent a spike in cases as the clock ticks down on the Olympic Games.An 8pm curfew on dine-in service at eateries will remain under “quasi-emergency” areas, though a blanket ban on alcohol sales will be relaxed to allow such sales until 7pm for parties of up to two people.But fines of up to 300,000 yen (S$3,640) on non-compliant eateries are being seen as a slap on the wrist by those who are flouting the guidelines to satiate public demand, and to stay afloat amid the slow disbursement of grants for compliance.Mr Suga’s vow to achieve a 70 per cent reduction in people making the daily commute to work has also come to naught with more companies mandating in-person attendance. Parks and other public spaces are packed, with little to differentiate from normalcy beyond masks and curfews.A study by the National Institute of Infectious Diseases released on Wednesday suggested that the latest emergency has shown “little statistical effect” in Tokyo.  Still, Mr Suga said: “We must ask you to continue these restrictions and I hate to do this, but in order to regain normalcy in our lives, I need to ask for your understanding and cooperation.”He added that his persistence on the Olympic Games was not an issue of “personal pride or the economy”.“Mankind has faced the daunting challenge of Covid-19, and now is the time to unite and show the world hat we can overcome this difficulty through the efforts and wisdom of the people,” he said.Japan reported a total of 1,554 cases on Thursday, down from the fourth-wave peak of 7,234 cases on May 8. This was led by 452 cases in Tokyo, 185 in Kanagawa and 124 in Chiba. Okinawa logged 97 cases, while there were 99 in Aichi and 95 in Osaka. Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/olympics-japan-lifting-virus-emergency-one-month-before-games", "Source": "google"}