{"Type": "", "Time": "2021-06-18", "Headline": "US Supreme Court rejects Trump-backed challenge to Obamacare, United States News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.WASHINGTON (REUTERS) - The US Supreme Court on Thursday (June 17) rejected a Republican bid that had been backed by former President Donald Trump’s administration to invalidate Obamacare, preserving the landmark healthcare law for the third time since its 2010 enactment. The 7-2 ruling declared that Texas and other challengers had no legal standing to file their lawsuit seeking to nullify a law, formally called the Affordable Care Act, that has enabled millions of Americans to obtain medical coverage either through public programs or private insurers.The decision was authored by liberal Justice Stephen Breyer.  The justices did not decide broader legal questions raised in the case about whether a key Obamacare provision was unconstitutional and, if so, whether the rest of the statute should be struck down.The provision, called the “individual mandate”, originally required Americans to obtain health insurance or pay a financial penalty. “A big win for the American people,” Democratic President Joe Biden, whose administration opposed the lawsuit, wrote in a Twitter post, adding that millions of people rely upon the law for healthcare coverage while encouraging others to sign up. The law was Democratic former President Barack Obama’s signature domestic policy achievement. Biden served as vice president under Obama. Breyer wrote that none of the challengers, including Texas and 17 other states and individual plaintiffs, could trace a legal injury to the individual mandate, partly because a Republican-backed tax law signed by Trump in 2017 had wiped out the financial penalty. “Unsurprisingly, the states have not demonstrated that an unenforceable mandate will cause their residents to enroll in valuable benefits programs that they would otherwise forgo,” Breyer wrote. After Texas and other states sued, a coalition of 20 states including Democratic-governed California and New York and the Democratic-controlled House of Representatives intervened in the case to try to preserve Obamacare after Trump refused to defend the law. “For more than a decade, the Affordable Care Act has been the law of the land, providing health coverage and a multitude of protections to tens of millions of Americans across the nation, and today’s decision solidifies those protections for generations to come,” said New York Attorney-General Letitia James, a Democrat. Conservative Justices Samuel Alito and Neil Gorsuch dissented from the ruling. Alito wrote that the individual mandate was “clearly unconstitutional” and called the court’s ruling preserving the law an example of “judicial inventiveness”.The Supreme Court in 2012 and 2015 also fended off previous Republican challenges to Obamacare.Justice Amy Coney Barrett, a Trump appointee whose confirmation hearing last fall included many questions from Democrats over whether she would vote to strike the law down, was in the majority in the ruling. Biden’s administration in February urged the Supreme Court to uphold Obamacare, reversing the position taken by the government under Trump, who left office in January. ‘Relentless efforts’If Obamacare had been struck down, up to 20 million Americans stood to lose their medical insurance and insurers could have once again refused to cover people with pre-existing medical conditions. Obamacare expanded the Medicaid state-federal healthcare program and created marketplaces for private insurance. House Speaker Nancy Pelosi, a Democrat, called the ruling a “landmark victory for Democrats’ work to defend protections for people with pre-existing conditions against Republicans’ relentless efforts to dismantle them.”Biden has pledged to expand healthcare access and buttress Obamacare. Biden and other Democrats had criticised Republican efforts to strike down the law at a time when the United States was grappling with a deadly coronavirus pandemic. The Supreme Court has a 6-3 conservative majority but the Republican Obamacare challengers still came away disappointed in a ruling in which all three liberal justices were joined by four of the six conservative justices. Republicans fiercely opposed Obamacare when it was proposed, failed to repeal it when they controlled both chambers of Congress and have been unsuccessful in getting courts to invalidate the law.The Trump administration did take steps to hobble the law. Opposition to Obamacare seems to have receded as a political issue for Republicans as the party has emphasised other matters such as immigration, voting restrictions and hot-button cultural issues. The Supreme Court previously upheld Obamacare by deeming the financial penalty under the individual mandate a tax permissible under the US Constitution’s language empowering Congress to levy taxes.The penalty’s elimination under the 2017 tax law meant the individual mandate could no longer be interpreted as a tax provision and was therefore unlawful, the Republican challengers argued. The impetus for the Supreme Court case was a 2018 ruling by a federal judge in Texas that Obamacare as structured following the 2017 change violated the Constitution and was invalid in its entirety.The New Orleans-based 5th US Circuit Court of Appeals agreed that the individual mandate was unconstitutional but did not rule that the entire law should be stricken.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/united-states/us-supreme-court-rejects-republican-challenge-to-obamacare-law", "Source": "google"}