{"Type": "", "Time": "2021-06-18", "Headline": "Woman who misappropriated $213k from investment scheme monies jailed for a year, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A woman fell out with an operator of an investment scheme involving hotels in Mecca after working for him for three months.Masita Samsudin, 49, later transferred funds from the investment scheme into her own bank account, and withdrew more than $213,000 of it in cash.She was jailed for a year on Wednesday (June 16), after she had been earlier convicted of dishonestly misappropriating the money.Court documents state that in February 2015, Masita was introduced to the investment scheme in Malaysia by an acquaintance.It involved collecting money from investors and using the sums to invest in hotels in the holy city of Mecca in Saudi Arabia. Depending on how much profit the hotels made, the investors would then be paid dividends.The acquaintance told Masita that she would get monetary benefits if she helped run the scheme in Singapore.She later notified an operator of the scheme, identified in court documents as Sheikh Saidey, of her interest in doing so.Under Mr Saidey's instructions, she registered a sole proprietorship named Safwah Orchid Resources under her name on Feb 25, 2015. Court documents state that the business was cancelled two years later.Masita also opened a bank account under Safwah Orchid Resources, which she knew would be used to hold funds from the scheme's investors and their investment returns.Court documents state that Masita worked for Mr Saidey between the end of February and May 2015, where she was involved in paying dividends to the scheme's investors.While she was not paid a monthly salary, she received a commission of $50 for every US$1,000 transferred into Safwah Orchid Resources' bank account. But she was paid less than $10,000 in total.Masita and Mr Saidey later fell out in June 2015 and she stopped working for him.Some time between November and December 2015, she decided to open the Safwah Orchid Resources bank account statements that were sent to her home.After she saw that the bank account had a balance of more than $400,000 as at Oct 31, 2015, she became angry with Mr Saidey as she believed he was not being honest with her about the business in Singapore.Masita closed the bank account and transferred the balance of about $261,000 into her personal account in Dec 22, 2015.She later took out the $213,000. She has not made restitution to date.During the trial, Masita's lawyer argued that she had been permitted by Mr Saidey to take the $261,000 sum.But the prosecution submitted that there was no evidence of such authorisation, adding that her account in court and earlier statements to the police were inconsistent. The subsequent withdrawal of $213,000 was therefore dishonest, the deputy public prosecutors argued.For her offence, Masita could have been jailed for up to two years, or fined, or both.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/woman-who-misappropriated-213k-from-investment-scheme-monies-jailed-for-a", "Source": "google"}