{"Type": "", "Time": "2021-06-18", "Headline": "Biden & Putin | The Indian Express", "Text": "The Geneva summit on Wednesday between the US and Russian presidents, Joe Biden and Vladimir Putin, exceeded expectations by outlining a pathway for a stable relationship between Washington and Moscow. Admittedly, the bar was set low, thanks to the steady deterioration of relations over the last decade. Biden and Putin did well to create a framework for sustained engagement on a range of issues, including arms control and cyber security, while communicating their respective red lines. The two sides are also sending their ambassadors back to Washington and Moscow to facilitate a productive dialogue. At the end of their four-hour-long talks, Biden and Putin suggested that the two sides are ready to explore common ground on the basis of self-interest.Sceptics will wait to see how US and Russian officials translate the political understanding between the two leaders into concrete outcomes. For now, though, Biden and Putin deserve some credit for trying to detox the relationship that had become so poisonous in recent years. The demonisation of Putin in the US had acquired unprecedented proportions amidst charges of Russian political interference in the US presidential elections and allegations of Moscow’s support to a series of cyber attacks on critical American infrastructure, including oil pipelines. In Russia, too, anti-Americanism had become a staple diet in public discourse. If crude Putin-bashing was so evident in the US media coverage of the Geneva summit, Biden made a bold effort to signal personal respect for Putin, by calling him “bright”, “tough” and a “worthy adversary” just before the summit and acknowledging Russia’s role as a great power. This was a far cry from Biden calling Putin a “killer” in response to a media question in the first weeks of his presidency.For Putin and Russia, respect and recognition are critical and provide the basis for a productive engagement with the new American administration. For Biden, stabilising the Russian relationship makes it easier to deal with a variety of other challenges, especially China, which is occupying a lot of American mindspace. There is enough room to negotiate agreements to reduce the risk of atomic war and a new arms race. While Russia denies American charges on cyber attacks, Putin is open to a dialogue that could lead to negotiation of new cyber norms. While the summit has opened up some political space for Biden and Putin, there are innumerable and intractable disputes, including on human rights, Ukraine, and European security. As they begin to cooperate on some issues, the US and Russian capacity to limit and manage the difficult areas will continue to expand. A more predictable relationship between Washington and Moscow is certainly welcome in Delhi, which has often got caught in the crossfire. India would also take a keen interest in the incipient nuclear and cyber dialogue between the US and Russia and in the summit’s implications for the triangular dynamic between Washington, Moscow and Beijing.📣 The Indian Express is now on Telegram. Click here to join our channel (@indianexpress) and stay updated with the latest headlinesFor all the latest Opinion News, download Indian Express App.", "Section": "", "Writers": "", "URL": "https://indianexpress.com/article/opinion/editorials/biden-putin-geneva-summit-us-and-russian-presidents-joe-biden-and-vladimir-putin-7363938/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}