{"Type": "", "Time": "2021-06-18", "Headline": "North Korea's Kim Jong Un says must prepare for 'dialogue and confrontation' with US: KCNA, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SEOUL (AFP) - North Korean leader Kim Jong Un has said his country needs to prepare for \"both dialogue and confrontation\" with the United States under President Joe Biden, state media reported on Friday (June 18).At a plenary meeting of the central committee of the ruling Workers' Party of Korea on Thursday, Mr Kim outlined his strategy for relations with Washington, and the \"policy tendency of the newly emerged US administration\", the Korean Central News Agency said.Mr Kim \"stressed the need to get prepared for both dialogue and confrontation, especially to get fully prepared for confrontation in order to protect the dignity of our state\", KCNA reported.The North Korean leader \"called for sharply and promptly reacting to and coping with the fast-changing situation and concentrating efforts on taking stable control of the situation on the Korean peninsula\", the agency said.Pyongyang had already accused Mr Biden of pursuing a \"hostile policy\" and saying it was a \"big blunder\" for the veteran Democrat to say he would deal with the threat posed by the North's nuclear programme \"through diplomacy as well as stern deterrence\".Mr Biden's predecessor Donald Trump made headlines - but little diplomatic progress - with a series of face-to-face meetings with Mr Kim, a policy that Mr Biden says he will not pursue unless the terms change dramatically.During a visit to Washington last month by South Korean President Moon Jae-in, Mr Biden said he \"would not meet\" Mr Kim unless there was a concrete plan for negotiating on Pyongyang's nuclear arsenal.And he made a clear criticism of Mr Trump's chummy relationship with Mr Kim, saying he \"would not do what had been done in the recent past. I would not give him all he's looking for - international recognition\".The White House says it is now pursuing \"a calibrated practical approach\" - diplomatic jargon, it seems, for being realistically low-key, while open-minded.\"We understand where previous efforts in the past had difficulties and we've tried to learn from those,\" a senior White House official said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/north-koreas-kim-jong-un-says-must-prepare-for-dialogue-and-confrontation-with-us", "Source": "google"}