{"Type": "", "Time": "2021-06-17", "Headline": "Denmark set for 'emotional Belgium game as Dutch target Euro 2020 knockouts", "Text": "published :\n\t\t\t\t\t\t\t\t\t\t\t\t\t17 Jun 2021 at 18:45\t\t\t\t\t\t\t\t\t\t\t\twriter: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAFP PARIS - Denmark host the world's top-ranked side Belgium at Euro 2020 on Thursday with the trauma of Christian Eriksen's collapse still raw, while the Netherlands can move into the last 16 on their return to a major tournament.Five days after Eriksen required emergency medical treatment to revive him at Copenhagen's Parken Stadium, Denmark play Group B leaders Belgium looking to move on from a harrowing 1-0 defeat by Finland.\"It will be very emotional to return to the Parken, we expect to have incredible support from our fans and from the whole country,\" said Denmark coach Kasper Hjulmand.\"We have to be ready for that and use this energy in a positive way.\"Denmark fans will stage a minute's applause in the 10th minute in support of Eriksen.\"What's crazy is that the hospital where Christian is staying is not far from the stadium. He can see the stadium and he might even be able to hear everything that is happening there,\" added Hjulmand.The 29-year-old Eriksen is to be fitted with a defibrillator after suffering a cardiac arrest during his team's opening game.\"After Christian has been through different heart examinations it has been decided that he should have an ICD (heart starter),\" the Danish football federation announced ahead of Thursday's 1600GMT kick-off.Belgium striker Romelu Lukaku, who scored twice in their 3-0 win over Russia and shouted a message of support to Eriksen into a pitchside camera, said the players would kick the ball out of play for the minute's applause.\"Several of our players have played with him. But tomorrow we'll be there to win the game, which promises to be difficult,\" said Lukaku, Eriksen's team-mate at Inter Milan.Belgium, who will advance to the knockout phase if they win, have Kevin De Bruyne back from the facial fractures he sustained in last month's Champions League final.\"The programme is very clear for Kevin De Bruyne. He is medically fit, he's got the green light to play in a match situation,\" said coach Roberto Martinez.- Dutch aim to double up -Frank de Boer's Netherlands marked their return to the big stage after a seven-year absence with a 3-2 win over Ukraine in Amsterdam last weekend.It was their first win at a European Championship since 2008 and another victory against Austria at the Johan Cruyff Arena in Group C will ensure a place in the next round.Juventus defender Matthijs de Ligt will reclaim his place in the side after sitting out the opener with a groin problem.Austria on the other hand will be without Marko Arnautovic, who has been given a one-game ban by UEFA for insulting a North Macedonian player in their 3-1 win in Bucharest.That was Austria's first ever win at the Euro and now they too know a victory will take them through to the last 16.Ukraine and finals debutants North Macedonia face off in the group's other game at 1300GMT with both countries aiming to pick up their first point.- Italy breeze through -Absent from the 2018 World Cup, Italy on Wednesday became the first team to qualify for the last 16 as they eased aside Switzerland to register a second successive 3-0 win in Rome.Manuel Locatelli scored twice and Ciro Immobile added a late third as Roberto Mancini's men stretched their unbeaten run to 29 matches.\"We played well, we wanted to win at all costs. They started well, it was not easy to win a second game in five days,\" said Mancini.The Azzurri will play the runners-up from Group C if they avoid defeat against surprise Euro 2016 semi-finalists Wales at the Stadio Olimpico on Sunday.Gareth Bale set up goals for Aaron Ramsey and Connor Roberts but also missed a penalty as Wales beat Turkey 2-0 in Baku, where the majority of the crowd roared on the opposition.Russia reignited their Group B campaign courtesy of a 1-0 win over Finland.Atalanta midfielder Aleksei Miranchuk produced a glorious finish in first-half stoppage time for the only goal of the game between the neighbours.PHNOM PENH: The United States is ending a Cambodian aid programme aimed at protecting one its biggest wildlife sanctuaries, citing worsening deforestation and harassment of those who speak out about destruction of natural resources.The Supreme Court has reduced to three years and four months the 10-year jail sentence given to a 56-year-old man who shot dead a teenager during a rowdy confrontation over double-parking in Chon Buri four years ago, and suspended the prison term.A goalkeeper for the Myanmar soccer team who raised a three-finger salute in protest at the military coup in the country during a World Cup qualifying match in Japan said Thursday he has chosen not to return home and will apply for refugee status.", "Section": "", "Writers": "", "URL": "https://www.bangkokpost.com/world/2134019/denmark-set-for-emotional-belgium-game-as-dutch-target-euro-2020-knockouts", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}