{"Type": "", "Time": "2021-06-17", "Headline": "PMO instructed to use PM's real name for all official documents | The Star", "Text": "\n                    Wednesday, 16 Jun 2021\n                PETALING JAYA: Staff members in the Prime Minister’s Office have been instructed to use Tan Sri Muhyiddin Yassin’s official name in all formal or official documents.A circular dated June 3 instructed that letters and official documents that needed the Prime Minister’s signature should use the official spelling of his name, which is “Mahiaddin Bin Md Yassin” or “Tan Sri Dato Seri Haji Mahiaddin Bin Haji Md Yassin”.The circular was signed by Muhyiddin’s private secretary Datuk Marzuki Mohammad and the order took immediate effect.It is understood that the order was given following the advice of the Attorney General’s Chambers.Mahiaddin is the Prime Minister’s given name, but he is popularly known as Muhyiddin.In April, the Shah Alam High Court released a man after it ruled that the detention order signed by the Prime Minister was defective, as it was not in his real name.The man was supposed to have been detained for two years at a rehabilitation centre in Simpang Renggam.However, the court ruled that ministers carrying out their official functions must use their names as stated in their MyKad and the Federal Government Gazette. \nTags / Keywords:\nPrime Minister’s Office\n                                                                ,\n                                                                                                Muhyiddin Yassin\n                                                                ,\n                                                                                                official\n                                                                ,\n                                                                                                name\n                                                                ,\n                                                                                                formal\n                                                                ,\n                                                                                                documents\n                                                                ,\n                                                                                                Mahiaddin Bin Md Yassin\n                                                                ,\n                                                                                                Tan Sri Dato Seri Haji Mahiaddin Bin Haji Md Yassin\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/news/nation/2021/06/16/pmo-instructed-to-use-pm039s-real-name-for-all-official-documents", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}