{"Type": "", "Time": "2021-06-18", "Headline": "Why are Olympics going on despite public opposition, medical warnings? - Japan Today", "Text": "\nJapanToday\nHigashi-Azabu IS bldg, 4F\n\t\t\t\t\t1-8-1 Higashi-Azabu\n\t\t\t\t\tMinato-ku\n\t\t\t\t\tTokyo 106-0044\n\t\t\t\t\tJapan\n\t\t\t\t\tTel: +81 3 5561 7755\n\t\t\t\t\tFax: +81 3 5561 7756\nEmail: editor@japantoday.com\n©2021 GPlusMedia Inc.\nPublic sentiment in Japan has been generally opposed to holding the Tokyo Olympics and Paralympics, partly based on fears the coronavirus will spike as almost 100,000 people — athletes and others — enter for both events.The Japanese medical community is largely against it. The government's main medical adviser Dr Shigeru Omi has said it's “abnormal” to hold the Olympics during a pandemic. So far, only 5% of Japanese are fully vaccinated.The medical journal The Lancet has raised questions about the health risks and criticized the World Health Organization and other health bodies for not taking a clear stand. The  New England Journal of Medicine has said the IOC's decision to proceed “is not informed by the best scientific evidence.”The second-largest selling newspaper in Japan, the Asahi Shimbun, has called for the Olympics to be canceled. So have other regional newspapers.Still, they are going ahead. How have the International Olympic Committee and the Japanese government of Prime Minister Yoshihide Suga been able to bypass strong opposition?At the core is the Host City Contract  that gives the IOC the sole authority to cancel. If Japan cancels, it would have to compensate the IOC. Of course, the IOC is unlikely to sue a host city. So any deal would be worked out behind the scenes.And there are billions at stake. Japan has officially spent $15.4 billion but government audits suggest it’s twice that much. Japanese advertising giant Dentsu Inc., a key player in landing the corruption-tainted bid in 2013, has raised more than $3 billion from local sponsors.Estimates suggest a cancellation could cost the IOC $3 billion-$4 billion in lost broadcast rights income. Broadcast income and sponsors account for 91% of the IOC income, and American network NBCUniversal provides about 40% of the IOC's total income.Fans from abroad have been banned already, and a decision on local fans attending Olympic venues should come as early as next week.Associated Press sought perspectives from inside and outside Japan with the Olympics set to open on July 23.“It’s a bit like a gambler who already has lost too much. Pulling out of it now will only confirm the huge losses made, but carrying on you can still cling to the hope of winning big and taking it all back. It’s true that public opinion is unlikely to be kind even if Suga decides to cancel at the last minute. He might as well take the chance and hope for the best by going ahead with it. At least there is some chance that he can claim the games to be a success — just by doing it — and saturating the media with pride and glory might help him turn the negative opinion around.”— Koichi Nakano, political scientist, Sophia University“The IOC carries a brand that is powerful. Athletes from around the world coming together to compete in peace is a heart-tugging draw. It takes an entertainment event and infuses it with a certain level of piety and awe. Who is against peace? With this 'Olympism' as a goal, it has snagged corporate sponsors willing to pay lots of money. Therefore, the IOC has the leverage to exact contract terms very favorable to it and it certainly has done that in this case. The fact that only the IOC can formally decide to pull the plug on the games — even in the case of unforeseeable health events -- is testament to this.”—  Mark Conrad, lawyer, Gabelli School of Business, Fordham University“The host city contract hands over all the power to the IOC. The Olympic industry has had 120-plus years to win hearts and minds around the globe, with obvious success. In the age of the internet, their PR controls the message and protects the brand 24/7. The IOC is also beyond the reach of any oversight agency, including the governments of host countries. It can violate a country’s human rights protections with immunity, including athletes’ right to access domestic courts of law.”— Helen Jefferson Lenskyj, sociologist, author “The Olympic Games: A Critical Approach\"\"Based on what I am hearing, people within the government have been given their instructions to make the games happen, and that is their singular focus right now — for better or for worse. Their hope is to get through the games with as few missteps as possible. Politicians may well be aware of the risk they are taking but hope that once the games begin the Japanese public will persevere ‘for the good of Japan’ and forget how we got there.”— Aki Tonami, political scientist, University of Tsukuba\"The IOC is an elitist club that garners support from other elites and people — and countries — that aspire to joining the elite. From a sports perspective, the IOC represents the custodian of the exclusive medals that athletes in numerous sports aspire to, acts as the chief promoter of the mythology of the healing power of sport, and the organization that most international sports federations and national Olympic committees are reliant on for funding.”— John Horne, sociologist, Waseda Univeristy, author with Garry Whannel of “Understanding the Olympics”\"Politically, the opposition is so weak, the government can do pretty much anything it wants. Although a disastrous Olympics would damage the LDP’s credibility, the party likely feels safe because a majority of the public doubts the capability of the opposition to govern. The government may be hoping that once the games start, public opinion will turn. At the very least, producing a distraction, and at most, perhaps a rally round the flag effect.”— Gill Steel, political scientist, Doshisha University“You notice how nobody seems to be in charge. You have all these different entities: the Tokyo organizing committee, the Japanese Olympic Committee, the Prime Minister’s Office, the Governor of Tokyo Yuriko Koike, the Japan Sports Agency, the Foreign Ministry, the Ministry of Education, Culture, Sports, Science and Technology. Suga is asked in the Diet about canceling the games and says it’s not his responsibility. Nobody wants to lose face. You saw the same in the run up to the 1964 Games. In fact, it wasn’t until Feb 11, 1963 — some 600 days before the opening ceremony — that Japan finally found somebody willing to accept the presidency of the local organizing committee.\"— Robert Whiting, author of several books on Japan including the latest “Tokyo Junkie”“A lot of the opposition is shallow and movable, though of course that’s contingent on the Olympics actually working out. There will be a lot of people (broadcasters, etc.) invested in trying to make it look like a good show, so I think they’ll have the winds at their back if there’s not an appreciable spike in COVID deaths or any heat-related tragedies for the athletes.”— David Leheny, political scientist, Waseda University\"If it turns out there is a surge in coronavirus patients and it becomes a catastrophe, that’s not the responsibility of the IOC. It’s the Japanese government that will be stuck with the responsibility.”— Ryu Homma, author, former advertising agency executive100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberLet's see how this mess unfolds. It's gonna be horrific.Why are Olympics going on despite public opposition, medical warnings?Pure ignorance and greed (Japanese Government and IOC).IOCLDPJOC Greed, that’s why!Pulling out of it now will only confirm the huge losses made, but carrying on you can still cling to the hope of winning big and taking it all back.The only one \"winning\" is those who profit  ¥ from this disaster. How does the general population benefit? How does the single mother of 3 children that lost her job during the pandemic benefit?Why are Olympics going on despite public opposition, medical warnings?MoneySo in one sentence the reason is that the government can do as it pleases so it holds economic gains of a few above the safety of the population in general.It did not have to be this way.If PM Suga, and his lot were not so arrogant and greedy. If they actually cared about Japan and the commitment it made when it accepted the Olympic bid, they would have followed the UK and the USA and started the vaccinations back in February.It seems the delay was meant to make it as difficult as possible for Tokyo Mayor Koike to succeed and if the Olympics did occur that they would be the worst Olympics in recent memory.It's a little sad that these 100 or so men can wield so much power and turn what should have been a joyous event into a national embarrassment.Reminds me the end of the WW2, letting the population die instead of stoping the madness.Money and japans absolute lack of concern for anything but the former. One good thing I guess is that now the world is seeing past the illusion that japan has worked so hard to uphold since the 70s. Clean on the outside, dirty on the inside.Public sentiment in Japan has been generally opposed to holding the Tokyo Olympics and Paralympics, partly based on fears the coronavirus will spike as almost 100,000 people — athletes and others — enter for both events.The latest polls have revealed equivocal, ambivalent results with increasing supportive replies: Yomiuri Shimbun (published on June 7th) : 51% for the Games, 48% against. NHK (conducted on 11-13 of June) : 64% for the Games,  31% against. The second-largest selling newspaper in Japan, the Asahi Shimbun, has called for the Olympics to be canceled. Asahi has since never quit a primary partner for the Olympics. The outlet and its affiliate TV broadcaster are now overtly promoting the upcoming Games stirring public excitement. Shameless and hypocrite!   How have the International Olympic Committee and the Japanese government of Prime Minister Yoshihide Suga been able to bypass strong opposition?Tokyo is the host city, not the central government under Suga who has no authority over the IOC decision (the Japanese government is not even a contract party). It's thus irrelevant to demand Suga for cancelation. However people can request max protection for public health through the speedy rollout and other anti-virus measures.I think for once we can’t blame completely blame the government though, despite all the other messes they’ve made. It’s the IOC who could’ve cancelled this. From what I’ve heard, the host country doesn’t actually have the power to cancel after the contract they sign. Blame ‘Dick’ Pound. Dick by name, dick by…. You know what I’m saying.Greed of IOC and a weak Suga.I used to enjoy watching the Olympics, but this blatant cash grab by the IOC and Japanese politicians was really soured me against it. Remember not to tune in when they broadcast it. That's where they will get most of their revenue from. I don't think I'll be able to watch in the future, considering how terribly they've treated their host city and their lack of concern for the general public's health and safety. If I watched, I wouldn't be able to stop thinking about it and getting angry. How sad that another fun thing has been ruined.$$$$$$$$..................THAT IS IT! People of the world be DAMNED!Why are Olympics going on despite public opposition, medical warnings?Greed.This is no mystery at all. Anyone who knows anything about the IOC (and similar originations such as FIFA) knows that those involved only care about profits for a very small group of people.It's funny that during an event that supports flag-waving nationalism in a country run by a nationalist government, the actual hosting nation seems to matter very little.@noriahojanenAbout polls, there's only one neutral way to ask the question. Well, if you want to know the population feeling.That is: do you think that the Games should be held, cancelled or postponed?I understand that the Yomiuri poll asked whether people thought the Games would be held and that the NHK one did not propose the postponement option.This pandemic has highlighted the existing disparities and corruption in society, which is perhaps the only thing positive we can say about this scourge.  The corrupt olympics is the pinnacle of the \"business as usual\" mentality that doesn't want to learn what this pandemic has taught us in such stark terms.  Good luck Japan, you made your bed...The article is too long,I give you a short and real answer,money.As long as Japanese nationals do nothing on the streets of Tokyo, the Japan Olympics will go on.How have the International Olympic Committee and the Japanese government of Prime Minister Yoshihide Suga been able to bypass strong opposition?\"Uhm...is that a serious question.?..by not giving a damn about public & medical professionals opinion, steamrolling over it and prioritizing money and oyaji pride as was plain to see from the beginning...disgrace.\nOnce the cases start rising again afer the games , watch the \"it wasn,t me , it was someone else,s responsibility \" dance begin.Infection rates in Tokyo are considered only moderate by world standards. Currently there have been 27 million doses delivered to date and 500 thousand per day. Vaccinations combined with acquired immunity will probably equate to a 70% immunity rate by the end of July. 70% is the threshold of herd immunity. Certainly every athlete and foreigner supporting the games will have been vaccinated long ago. By the time the Olympics start Covid-19 will be a moot concern and the government knows it. That is why the games will continue.Suga could have, and probably should have closed the borders. It would have forced the IOC to cancel the games if the athletes cannot attend.Here’s the answer. It’s hardly rocket science. And there are billions at stake. Japan has officially spent $15.4 billion but government audits suggest it’s twice that much. Japanese advertising giant Dentsu Inc., a key player in landing the corruption-tainted bid in 2013, has raised more than $3 billion from local sponsors.Estimates suggest a cancellation could cost the IOC $3 billion-$4 billion in lost broadcast rights income. Broadcast income and sponsors account for 91% of the IOC income, and American network NBCUniversal provides about 40% of the IOC's total income.Q: Why are Olympics going on despite public opposition, medical warnings?A: MONEY MONEY MONEY MOOOONEEEY………….MOONEEY!They were awarded with the promise that they would  be good for Tohoku.  Well, I live in Tohoku and can't think of a single benefit.  Not for Tohoku, or anyone really, except those at the top that are able to make their money grab.The greed for money prevailing over public health from the Japanese Government and the IOC clownsIt is the same as the republican museum and its greed for money that are prevailing over the protection of the nature, ecosystems and over the lives of people that are worth less than firearms..'murikkka, simple as that..I think there’s a parallel to be drawn with American politics here, although as a non-American I might be reading it wrong.The Republican party, or at least a non-insignificant part of it, appears to have completely thrown out even the facade of being interested in governing, and is now simply doing everything possible to gain as much power as possible. The commonly heard refrain is “they’re not even trying to hide it anymore”.It seems that the IOC and LDP are operating on a similar principle. The IOC has shown that it couldn’t care less who wins however may medals, or if the games turn out be a PA disaster. They’ll make their money. That’s the only thing that matters. The LDP, for their part, and as implied above by several of the comments, know that it would take something unbelievable to get them voted out, so they put out these platitudes about watching TV, knowing that they have enough support to win any time they choose to call an election.So money, yes, but also the fact that it’s no longer necessary to pretend.Money is obviously a huge factor, but also the athletes themselves. Following the 1980 (Western) Boycott of the 1980 Olympics in Moscow, many athletes fell into depression and committed suicide. They had been training their entire lives to compete at the Olympics.  Neither the IOC or the Japanese Olympic committee or the J-Gov wants to make the call.  Further more, many national athletic bodies said they weren't coming in 2020, but not a single one has said they aren't coming in 2021. If the athletes want to compete, let them.Anyone remember a few years ago when they were just beginning to plan for the Olympics and there was all this talk of making Japan more foreigner friendly? Things like banning smoking in the streets, making more English signs, more onsens allowing people with tattoos. It's kind of sad to think that that feeling, where Japan was going to be able to show off what a great place it is to all the guests, is (along with public health and opinion) totally unimportant now.Why has this turned into such a desperate struggle to make them happen this year? If they'd just postpone it for a year it could be amazing. I hope the people here pushing it through feel bitter embarrassment when the Paris Olympics take place and they see what could have been.I don't understand why they don't put them off until next year. This year is already a loss, every medal will have a question mark on it. We won't see the best of what humanity has to offer this time, we'll see the best of what the world was able to piece together in the midst of a pandemic.I don't understand why they don't put them off until next year.I assume it has something to do with the condo owners wanting to move into their (Athletes' Village) condos and repeating the same legal nightmare that was involved in postponing the games already.   It might also have something to do with 2022 World Championships already scheduled and the Olmpics in Beijing as they don't want to have two Olympics (Summer and Winter) in the same year (although thats what they used to do).Does this question really need to be asked...@noriahojanenYou forgot to mention that both pool have people thinking along the line the safety measure for games are not satisfying in the 60%. and did not bother posting links : https://www.yomiuri.co.jp/election/yoron-chosa/20210606-OYT1T50178/(did not find direct link for NHK :) https://news.yahoo.co.jp/byline/suzukiyuji/20210615-00243168/Cleo went through the trouble to explaining the content of the article : https://japantoday.com/category/national/japan-to-lift-virus-emergency-one-month-before-olympics#comment-2501366@PimAbout polls, there's only one neutral way to ask the question. Well, if you want to know the population feeling.That is: do you think that the Games should be held, cancelled or postponed?I disagree. I think we need at least 2 questions, the first one being a scale one : You totally agree / You agree / You somewhat agree / You do not care / You somewhat disagree / You disagree / You totally disagree / No answerAfter, you can go for interview so that people can explain themselves and so on the party likely feels safe because a majority of the public doubts the capability of the opposition to govern.Not anymore  the majority now knows the LDP do not have the capability to govern.LDP gets a Hell No Vote from my Family and I will be suggesting everybody I know to vote NO to LDP.I don't care who gets in as long as it isn't LDP. I think a Coalition Government excluding LDP and the religious party Komeito would have a better shot of running the country. Than the incompetent Fools we have in now.Interesting 180 turn @OlympicSupport 7:13am. Why the sudden dissent from having the Games that was being so heavily touted prior the Jun 15?- “The only “winning\" is those who profit ¥ from this disaster. More puzzling, why the change of ‘heart’?- “How does the gen’l popul. benefit? How does the sing. mo. of 3 chn that lost her job during the pandemic benefit?” -Is this sincere?Pandemics typically don't have multiple, effective, vaccines.The photo is of the FINA Diving World Cup held in Tokyo last month.  It was the last qualifying event for countries to get into the Olympics if they weren't already qualified.  During the entire event, 1 case of COVID was discovered - at the airport. None were found in daily testing by any of the athletes, coaches, staff, volunteers, the rest of the time for the event.  When it was held, few of the people involved were fully vaccinated, yet, the processes were followed and were effective.  Mainly the pre-screening requirements for tests prior-to and immediately on arrival did the work.https://www.straitstimes.com/sport/olympics-organisers-hail-diving-world-cup-after-anti-covid-measuresAs previously announced, only one positive Covid-19 case was found, in a team official upon arrival in Japan. The person was quarantined immediately and no close contacts were identified by Japanese authorities, the statement said.Overall there were 438 participants, including athletes, coaches and team officials, it said.Too many Chicken Littles in Japan. The sky isn't falling.  By the time of the Olympics, I would expect all Chinese, American, Canadian, Chilean, European, Indian, and many other teams teams to be fully vaccinated. Japan will still have the testing protocols - pre-flight, on-landing, and daily along with contact tracing while in Japan. Minimal risks to themselves or to anyone else.  It is the non-vaccinated people, and those who got less effective vaccines from the 2 countries we all know, who are the danger.  The IOC has arranged for all Olympic teams to be vaccinated and that is happen where the govt allows.  The IOC says over 74% are vaccinated as of last week. https://www.msn.com/en-us/sports/more-sports/olympics-ioc-pushes-for-more-vaccinations-of-tokyo-bound-athletes/ar-AAKSgCk It isn't the foreign teams that Japan should worry about.@PimI understand that the Yomiuri poll asked whether people thought the Games would be held and that the NHK one did not propose the postponement option.True. Yomiuri's survey seemed to ask people about their prediction rather than preference. NHK's is leading and a bit manipulative, without postponement option offered (if it's included, a shift would occur from \"cancellation\" to \"postponement\"). On June 5-6th, JNN/TBS also conducted a poll on the Olympics:  cancel: 31%, delay: 24%, go open: 44%. I just point out that public sentiments in Japan to date have been more divided and equivocal than predominantly weighed toward the cancelation (as the article describes here). Note that earlier this year approximately 80-90% opted for the full cancelation shown in several polls.I may be cynical, but I have a feeling that if the Olympics turns into a super-spreader event, Suga & Co. will blame all those \"undisciplined\" foreigners. When everything else fails, the pols will reach for \"Ware Ware Nihonjin\" (\"We Japanese\").KumagaijinToday  08:52 am JSTMoney is obviously a huge factor, but also the athletes themselves. Following the 1980 (Western) Boycott of the 1980 Olympics in Moscow, many athletes fell into depression and committed suicide.That's quite the claim. You'll have an abundance of evidence to back it up, of course...Tristis QuepeToday  08:51 am JSTSo money, yes, but also the fact that it’s no longer necessary to pretend.That arrogance eventually brought down Sepp Blatter and his cohorts at FIFA, so there's always hope. John Coates swanning around Tokyo like the autocratic president-for-life of some oil-rich Central Asian republic is stomach-turning.Perhaps in another country the ruling party would be fearful of political fallout from this and of losing their place of power. There is an election coming up this year after all. But, we can simply expect to see some deep bowing, an apology for the dead, and then everyone will be voted back in. The Japanese people are just as much to blame here, because they have given their politicians carte blanche to do what they want.its just pure greed of these \"investors/sponsors\" involved incl corrupted politicians!this have no touch with reality and faraway from any truly olympics ideas!I don't understand why they don't put them off until next year.I assume it has something to do with the condo owners wanting to move into their (Athletes' Village) condos and repeating the same legal nightmare that was involved in postponing the games already. It might also have something to do with 2022 World Championships already scheduled and the Olmpics in Beijing as they don't want to have two Olympics (Summer and Winter) in the same year (although thats what they used to do).Please don't forget the 2022 FIFA World Cup... I think it'd be better to hold both Summer and Winter Games in the same year.  For the Tokyo Game, a few months pushback is my preference. Japan's hot summer is as deadly as the virus. The 1964 Tokyo was opened on 10th of October. This crazy schedule is fixed as a matter of convenience solely for NBC, an US media giant and one of the biggest sponsors.¥,$,€,£.Because nobody in charge gives a flying t055 about what the public want or what medical experts know.They want their slice.You better pay up, Nippon. Nice country you got here. Be a shame oif something were to happen to it, such as, God forbid, someone should sue you or sump'n.Tristis QuepeToday 08:51 am JSTSo money, yes, but also the fact that it’s no longer necessary to pretend.That arrogance eventually brought down Sepp Blatter and his cohorts at FIFA, so there's always hope. John Coates swanning around Tokyo like the autocratic president-for-life of some oil-rich Central Asian republic is stomach-turningI would like nothing more than to see the members of the IOC exposed for their blatant corruption and disregard for anything but money. And yes, you make a good point about FIFA. However, that was a worldwide thing and we’re talking about Japan being the most affected here, and it’s not like the Japanese (for all their many virtues) are known for their rebellious streak…or their interest in politics beyond electing the same party every single time.IOC - Intrested Only Cashsir_bentley28Today  10:27 am JSTIOC - Intrested Only CashThis could become a game.Irascible Old CodgersIgnorant Oligarchic CrewImpotent Obdurate CretinsIgnoring Opprobrium CliqueThe article is too long,I give you a short and real answer,money.And...we are subservient to America who profits from controlling Japan government.However, that was a worldwide thing and we’re talking about Japan being the most affected here, and it’s not like the Japanese (for all their many virtues) are known for their rebellious streak…or their interest in politics beyond electing the same party every single time.To be fair though, it's hard to beat the LDP when one vote in rural Niigata is worth three in Kawasaki, or whatever the rate is now. And that's without all the gerrymandered constituencies for the opposition to contend with.Three reasons:moneyface-savingUse your Facebook account to login or register with JapanToday. By doing so, you will also receive an email inviting you to receive our news alerts.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberA mix of what's trending on our other sites\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t", "Section": "", "Writers": "", "URL": "https://japantoday.com/category/tokyo-2020-olympics/why-are-olympics-going-on-despite-public-medical-warnings", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}