{"Type": "", "Time": "2021-06-17", "Headline": "McDonald's BTS collaboration spawns new merchandise | Ad Age", "Text": "Forgot Password?Once registered, you can:By registering you agree to our privacy policy, terms & conditions and to receive occasional emails from Ad Age. You may unsubscribe at any time.Are you a print subscriber? Activate your account.By\nAlexandra Jardine\n-\n23 min 55 sec ago\nBy\nIlyse Liffreing\n-\n59 min 39 sec ago\nBy\nAd Age and Creativity Staff\n-\n1 hour ago\nBy\nJack Neff\n-\n1 hour 10 min ago\nBy\nMike Juang\n-\n1 hour 24 min ago\nBy\nEthan Jakob Craft\n- 5 hours 10 min ago\nBy\nSydney Gold\n- 6 hours 40 min ago\nBy\nE.J. Schultz\n- 1 day 5 hours ago\nBy\nParker Herren\n- 2 days 3 hours ago\nBy\nBrian Bonilla\n- 1 day 18 hours ago\nBy\nEthan Jakob Craft\n- 2 days 3 hours ago\nBy\nJack Neff\n- 2 days 7 hours ago\nBy\nE.J. Schultz\n- 1 day 5 hours ago\nMcDonald’s is continuing its collaboration with pop-music phenomenon BTS, adding new merchandise such as t-shirts and tote bags with images drawn by the band.The items set to go on sale tonight are part of the fast-food giant's marketing push for its BTS Meal and follow other BTS-themed merchandise that sold swiftly after a May debut. The new “Saucy Collection,” which includes t-shirts, tote bags and cushions, features personified McDonald’s menu options (think: ice cream cones with heart-sign hands) drawn by members of the K-pop supergroup. The new “Melting Collection” features merchandise with pop art inspired by BTS’s hit song “Butter.”\nMcDonald's rolled out the meal in May, along with an initial lineup of merchandise that included hoodies, pajamas and bags featuring the band’s logo and colors alongside the Golden Arches.The BTS Meal — 10 Chicken McNuggets, two special dipping sauces, fries and a Coke — is being offered through June 20. It is the latest meal inspired by celebrities' signature orders, following meals chosen and promoted by Travis Scott and J Balvin. The BTS Meal is the first such meal being sold in dozens of countries after the first two were sold last year in the U.S.\nSpecialty merchandise gives McDonald's another way to strengthen its connections with the fans of the celebrities it partners with. The new BTS items will be priced between $12 and $110 when they go on sale through the Weverse Shop app tonight at 7 p.m. EDT.In this article:Mike Juang covers the world of Ad Tech for Ad Age. He joined Ad Age after writing and producing at CNBC, Cheddar and Bloomberg, and holds a Master's from NYU and from the University of Edinburgh. ", "Section": "", "Writers": "", "URL": "https://adage.com/article/marketing-news-strategy/mcdonalds-bts-collaboration-continues-two-new-merch-lines/2344141", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}