{"Type": "", "Time": "2021-06-17", "Headline": "Delta variant of Covid-19 could have contributed to spread at S'pore's wet markets: Experts, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A wet market can fit a large number of people in a compact space and people have continued to flock to them even during the recent period of heightened alert.It is not surprising, therefore, that Covid-19 cases have surfaced there, said experts.The increased number of cases recently might also be due to a variant of Covid-19 that spreads more easily, they added.The cluster at 115 Bukit Merah View Market and Hawker Centre is linked to 56 cases, said the Ministry of Health (MOH) on Thursday (June 17), making it the third-largest open cluster.Precautions have also been taken at other wet markets after positive cases were found.Stallholders at the nearby Redhill Market and Food Centre had to undergo mandatory Covid-19 tests earlier this week.Testing was also conducted for people working at the Telok Blangah Drive Food Centre and Market, which has been closed for disinfection till Friday.Associate Professor Alex Cook, vice-dean of research at the National University of Singapore's (NUS) Saw Swee Hock School of Public Health, said some wet markets may be quite compact relative to the number of visitors, which would heighten the risk of spread, even with natural ventilation.He noted that the recent wet market clusters have a mix of three types of cases: those who work in the market or at a stall, those who visit the market, and household contacts of a case connected to the market.The household contacts were not really infected because of the market per se, even though they are epidemiologically linked to the market clusters, he said.\"So the risk of infection within a wet market isn't quite as high as it may appear from the size of these clusters,\" he added.Professor Paul Tambyah, president of the Asia-Pacific Society of Clinical Microbiology and Infection, said the spread in open-air wet markets suggests that airborne transmission is indeed rare as most authorities agree - for all strains of the virus.As for whether wet markets should be avoided, he said: \"The key has to be vaccination. That is how every single viral disease from smallpox to measles to polio has been controlled.\"A possible link has been established between the Bukit Merah and Telok Blangah markets.MOH said on Monday that a Singaporean man, 42, who works as a hawker at the Telok Blangah food centre is a family member of another Singaporean man, 47, who works as a cooking assistant at the Bukit Merah market.An infected person had also visited the Redhill Market and Food Centre from June 8 to 10, according to MOH data.Professor Teo Yik Ying, dean of the NUS' Saw Swee Hock School of Public Health, said it is highly likely that the cases at the Bukit Merah and Redhill markets are linked, given their proximity to each other.He added that malls and supermarkets have been where outbreaks were detected recently.\"I do not see them as a new weak link, but rather as a consequence of Singapore having to deal with a much more infectious Delta variant that is driving these outbreaks.\"Recent evidence from Britain has suggested that the Delta variant has a reproductive number of five to eight, which is much higher than the wild-type variant that the world saw early last year, with an R0 of two to three, he said.The reproductive number, or R0, of a virus is a measure of its transmission, or the number of new infections generated by each case.An R0 rate of 1, for example, means on average each infected person will infect one other person they come in contact with.The MOH told The Straits Times earlier this month that as at the end of May, 550 Covid-19 cases in Singapore were infected with the Delta variant of the coronavirus first detected in India.The number included 428 local cases, and 122 imported ones.Prof Teo said the increased transmissibility of the Delta variant means there is a possibility of a large outbreak event happening whenever infected cases are moving about in the community.\"If these cases were going to work or going about their social activities, then I expect the venues that are associated with the large outbreaks will be linked to workplaces or public spaces for social activities.\"But precisely because the default continues to be working from home and social activities are kept to a minimum now, people are frequenting malls, supermarkets, and wet markets for necessities and food. This is why we are seeing outbreaks in such venues,\" he said.Residents in Telok Blangah and Bukit Merah have expressed concern about the growing number of cases in the neighbourhood, as well as people who do not comply with safety rules.Compliance officer Gideon Goh, 37, who lives in Bukit Merah, told The Straits Times that he had seen elderly people smoking or talking in groups in his neighbourhood, with masks that are not properly worn.Mr Goh, who recently reported such behaviour via the OneService app, said: \"While we can report such non-compliant behaviour, if you want to avoid conflict, there's not very much that you can do apart from avoiding these people.\"He added: \"I think it also takes a little bit more of a community effort. If there is a stronger sense of frowning upon certain behaviour by passers-by, then they know that they are in the minority and are more likely to follow the rules,\" he said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/delta-variant-of-covid-19-could-have-contributed-to-spread-at-wet-markets-experts", "Source": "google"}