{"Type": "", "Time": "2021-06-17", "Headline": "US keeps tariff threat alive for discriminatory taxes, watching inflation: Treasury Secretary Yellen, United States News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.WASHINGTON (REUTERS) - The United States is pursuing every avenue to ensure that countries suspend or roll back discriminatory digital services taxes, but will keep tariffs as an option if that does not happen, US Treasury Secretary Janet Yellen said on Wednesday (June 16).Yellen told the Senate Finance Committee she had engaged in \"very constructive\" bilateral conversations with the Irish finance minister on the issue, and believed the entire European Union would ultimately support an increase in global minimum taxes, as proposed by the United States.She said she was hoping for progress on the tax issue, which is being negotiated under the leadership of the Organisation for Economic Co-operation and Development (OECD), by the time the leaders of the Group of 20 major economies meet in October.US President Joe Biden and other leaders of the Group of Seven (G-7) advanced economies on Sunday (June 13) endorsed a commitment by G-7 finance officials to work towards a global minimum tax of at least 15 per cent through the G-20/OECD inclusive framework.Yellen said moves by the United States to raise its corporate minimum tax would help provide momentum for a broad-based agreement. She said the United States was also proposing changes to prevent foreign companies working in the United States from shifting their profits offshore.Asked about rising consumer and durable goods prices, Yellen said the Biden administration was monitoring inflation \"very carefully\" and took the issue seriously.\"No one wants to return to the bad high inflation days of the 70s,\" Yellen told the committee.She said the current burst of inflation reflected the difficulty of reopening the US economy, and the Biden administration was also taking steps to deal with bottlenecks in certain supply chains that had resulted in higher prices.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/united-states/us-keeps-tariff-threat-alive-for-discriminatory-taxes-watching-inflation", "Source": "google"}