{"Type": "", "Time": "2021-06-17", "Headline": "Covid-19: Bukit Merah View food centre cluster grows to 39 cases, Singapore News - AsiaOne", "Text": "SINGAPORE - There were 14 more people added to the Bukit Merah View food centre cluster on Wednesday night (June 16), most of whom are foodstall workers there or their household contacts, said the Ministry of Health (MOH).This brings the total number of cases in the cluster to 39.The 14 new cases in the cluster form the bulk of the 16 linked cases that were announced on Wednesday.There were also three unlinked cases and five imported cases confirmed on Wednesday, for a total of 24 new cases.Linked cases in the cluster include a 12-year-old Singaporean who is a student at CHIJ St Theresa's Convent who was last in school on May 18. She is a family member and household contact of a hawker at Telok Blangah Drive food centre who tested positive on Monday.She was tested for Covid-19 the same day during quarantine and developed a fever, cough and runny nose. Her test result came back positive for Covid-19 infection on Tuesday. Her serology test result is negative, indicating that the infection is likely to be a recent one.The ministry had said on Tuesday that Bukit Merah View Market and Food Centre will be closed until June 26 for deep cleaning, and to break the chain of transmission.Telok Blangah Drive food centre has also been closed for deep cleaning and disinfection from Wednesday till Friday.[embed]https://www.facebook.com/102620781513630/posts/313306227111750/[/embed]A hawker there who tested positive for the virus on Monday was discovered to be a family member and household contact of three cases linked to the Bukit Merah View food centre cluster on Wednesday. All three have already been in quarantine since Monday.The 24 confirmed cases as at Wednesday take Singapore's total to 62,339, said the ministry.The 16 linked cases consist of 10 cases that have already been placed on quarantine and six that were detected through surveillance.The three unlinked cases include an 85-year-old female Singaporean who is a retiree. She developed a fever on Saturday, but did not seek medical treatment until Tuesday, when she went to a general practitioner. There, she was administered both an antigen rapid test (ART) and a polymerase chain reaction (PCR) test.[[nid:533111]]She was immediately isolated when her ART result came back positive the same day. Her PCR test result also came back positive for Covid-19 infection on Tuesday. Her serology test result is pending.Five imported cases were also reported. Two of them are Singaporeans or permanent residents.There were no new cases from workers' dormitories.The weekly total number of community cases is 77 in the past week, up from 71 in the previous week. The number of unlinked cases has also risen to 19 in the past week, compared with six cases in the week before.There are currently 44 active clusters of infection.As at Wednesday night, 146 patients remain hospitalised, including one in critical condition in the intensive care unit, while 228 are recuperating in community facilities.Singapore has had 34 deaths from Covid-19 complications, while 15 who tested positive have died of other causes.This article was first published in The Straits Times. Permission required for reproduction.", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/singapore/covid-19-bukit-merah-view-food-centre-cluster-grows-39-cases", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}