{"Type": "Singapore", "Time": "2021-06-18", "Headline": "17 new COVID-19 cases linked to Bukit Merah View, expanding cluster to 56 infections", "Text": "There were 20 new COVID-19 cases in the community on Thursday (Jun 17), including one unlinked infection.SINGAPORE: Seventeen new community COVID-19 cases in Singapore on Thursday (Jun 17) were linked to the Bukit Merah View cluster, said the Ministry of Health (MOH).There were three other community cases, bringing the total number of community infections to 20.Two of these were linked to previous cases, while one remained unlinked.BUKIT MERAH VIEW CLUSTERTwo young children - a three-year-old girl and a five-year-old pre-schooler - were among the 17 new cases in the Bukit Merah View cluster .Two students at Bukit Merah Secondary School, aged 13 and 14, were also among the cases.All are family members of previously confirmed cases and had been placed in quarantine when their infections were detected.Another 10-year-old student at Zhangde Primary School tested positive for COVID-19 after seeking medical treatment for a fever. She is also a family member of an earlier case.A 23-year-old woman working as a patient service associate at Singapore General Hospital was reported as another case. The woman is a family member of previously confirmed cases. Her infection was detected through the hospital's surveillance testing.The woman, who is fully vaccinated, developed a sore throat and blocked nose on the day her COVID-19 test result came back positive.Also newly linked to the cluster were several people who worked at the market: A worker at a sundry store, a food vendor, a retiree who helped out at a food stall and a part-time food stall assistant.The remaining seven new cluster cases were a woman working at MSIG Insurance, a stall assistant at Tiong Bahru Yong Tao Hu, a homemaker, a woman working at Bioinfocomm who frequently visited the market, a man working as a shipping operator at Skyline Shipping and two other women, who are unemployed.There were 56 cases in the cluster at 115 Bukit Merah View Market and Food Centre as of Thursday.OTHER LINKED CASESOne community case, a 52-year-old man working as a private-hire driver for Tada, was a close contact of Case 64186 and linked to the Case 64184 cluster. The man had been fully vaccinated, and he was placed on quarantine on Tuesday after being identified as a close contact.The man was tested on Wednesday and developed a cough the same day. His test result came back positive for COVID-19 the day after. His serology test result was pending.Another linked case was a 12-year-old student at Tanglin Trust School, who developed a fever on Tuesday.On the same day, she was identified as a household contact of a previous case and placed on quarantine, where she was tested for COVID-19. Her result returned positive on Wednesday and her serology test result was still pending.UNLINKED CASEThe sole unlinked case was a 72-year-old woman working at the counter at McDonald's in Tiong Bahru Plaza, who was fully vaccinated.She was asymptomatic. Her infection was detected on Wednesday as part of surveillance testing for people working at Tiong Bahru Plaza. Her serology test was pending.IMPORTED CASESThere were also seven imported cases, who were all placed on stay-home notice or isolated upon their arrival in Singapore.One was a Singaporean and two were permanent residents who had returned from India.Three were work permit holders who arrived from Indonesia and Malaysia, including two foreign domestic workers.One case, identified as Case 64265, entered Singapore waters from Indonesia without valid documentation, said MOH. He was arrested by the Singapore Police Force's Police Coast Guard.The man was tested for COVID-19 and isolated until he was taken to the hospital when his result came back positive.No new infections were reported in migrant workers' dormitories.In all, Singapore reported 27 new COVID-19 cases on Thursday.SWAB TESTING IN REDHILL, TIONG BAHRUThere will be special COVID-19 testing operations for all staff and tenants working at several locations in Redhill and Tiong BahruThe locations are 78, 79, 80, 84 and 85 Redhill Lane, 86 Redhill Close, 18 Jalan Membina and Tiong Bahru Yong Tao Hu Coffeeshop at 56 Eng Hoon Street.MOH said it was investigating cases of infection among people who work in or visited these locations.Free testing will also be offered to members of the public who visited these shops during selected dates in June.PLACES VISITED BY INFECTIOUS CASESSome locations for which swab testing will be conducted were added to the list of public places visited by COVID-19 cases in the community during their infectious period.These included Tiong Bahru Yong Tao Hu and a Giant Express outlet at 86 Redhill Close.Tiong Bahru Plaza, a hair salon at Beo Crescent and Toys \"R\" Us in VivoCity were also added to the list.The full table is shown below:As a precautionary measure, people who were at these locations during the specified timings should monitor their health closely for 14 days from their date of visit, said MOH.ONE STILL IN CRITICAL CONDITIONTwenty-nine more cases have been discharged, taking the number that had fully recovered to 61,960.There were 151 in hospital, with one in critical condition in the intensive care unit.Another 221 were isolated and were being cared for at community facilities.Overall, the number of new cases in the community increased from 40 cases in the week before to 93 cases in the past week.The number of unlinked cases in the community also increased from seven cases in the week before to 18 cases in the past week.Among the 130 confirmed cases reported from Jun 11 to Jun 17, 45 cases tested positive for their serology tests, 66 tested negative and 19 serology test results were pending.UPDATE ON COMMUNITY TESTINGMOH also provided a separate update on the results of swab testing operations at various locations around Singapore.Testing operations at ION Orchardconcluded on Tuesday. As of noon on Thursday, 12,928 visitors to the mall had voluntarily stepped forward for testing. Of these, one person tested positive and 12,160 tested negative, with 767 test results still pending.In Bukit Merah View, 239 employees and tenants who were working at115 Bukit Merah View Market and Food Centrefrom May 25 had been placed on quarantine since Jun 12. Twenty-one people had tested positive for COVID-19 so far, said MOH.Testing operations at 125A Bukit Merah View concluded on Tuesday. As of noon on Thursday, 4,892 visitors to 115 and 116 Bukit Merah View had voluntarily stepped forward for testing. Of these, seven people tested positive and 4,459 tested negative, with 426 results still pending.InTelok Blangah, 118 owners, tenants and employees of shops and commercial units at 79 and 82 Telok Blangah Drive were tested on Thursday, after two cases were detected among hawkers. All were negative for COVID-19 infection.Co-chair of the COVID-19 multi-ministry task force Lawrence Wong said on Wednesday that the authorities are \"evaluating the timing and scope\" of the next stage of Singapore's reopening.Dining-in at food and beverage outlets is currently banned as part of Phase 3 (Heightened Alert) and is scheduled to resume onJun 21, provided the COVID-19 situation remains under control.Referring to new cases breaking out and a \"major\" new cluster inBukit Merah, Mr Wong said the task force is \"studying the situation carefully with public health experts\".\"I want to assure all of you that we are doing our very best to control the infection and we want to ensure that we do not have another flare-up before we reach sufficiently high levels of vaccination in our community,\" said Mr Wong, who is also Finance Minister.As of Thursday, Singapore has reported a total of 62,366 COVID-19 cases and 34 fatalities from the disease.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,Ministry of Health,coronavirus", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/covid-19-new-cases-moh-jun-17-community-bukit-merah-view-cluster-15031438", "Source": "google"}