{"Type": "Lifestyle", "Time": "2021-06-18", "Headline": "The Singaporean making gin with ingredients from your neighbourhood market", "Text": "Talk about “local spirit”. Ashwin Sekaran's Singapore Distillery boasts gin flavours made with pandan, different types of lime – and even ones that are inspired by the Singapore Sling and bandung.How would you define a Singapore-made gin? For new-kid-on-the-block micro-distiller Ashwin Sekaran, it’s all about “showcasing the amazing Asian herbs and spices that can be easily found here”.“(With) Singapore historically being a trading hub, (it) has allowed us to use all sorts of ingredients like spices from India, local herbs, Asian fruits, and yes, western botanicals in a well-balanced way,” the 27-year-old Singaporean told CNA Lifestyle.Which is why Sekaran’s Singapore Distillery – the youngest player in the local distillery game, having just started in 2020, has whipped up a whopping eight different gins with a local touch.These boast flavours such as Coconut Pandan (made with creamy coconut and pandan leaves), Stolen Roses (a rose blend inspired by the bandung drink) and the self-explanatory Singapore Sling version (distilled with all the ingredients normally used to make the famous cocktail, such as fresh pineapples, oranges, cherries and angelica root).And the ingredients that go into these creations? They’re all to be found in your friendly neighbourhood markets. Sekaran and his team regularly go to those in Geylang Serai, Bishan and Bedok, as well as Pasir Panjang Wholesale Centre, to source limes, spices, oranges, pandan, coconuts, pineapples and more.Talk about fully embracing the local spirit.“We wanted to get super fresh ingredients to make our gin,” shared Sekaran, who serves as Singapore Distillery’s head distiller. “And the best way to get them was by going directly to local markets and getting them straight from the supplier.”And in true Singaporean kampung spirit, the aunties and uncles at the wet markets have become friends – even throwing in a “lobang” (favour) or two.“We would keep going and ordering kilos and kilos of spices, herbs, coconut flesh, and fruits from the various vendors,” Sekaran said, recalling the early days of his business.“After a while, they got friendly with us and would tell us to contact them and place orders beforehand so they can keep the freshest ingredients for us to collect.”To think this all started during a family holiday in London in 2017.“I had just gotten into drinking gin but hadn’t had any exposure to craft gin yet,” he shared. “It was only when I ordered a gin and tonic at a London pub and was given a craft gin menu did I find out about craft distilleries and craft gin.”So, in lieu of the usual holiday sightseeing pitstops, Sekaran attended a craft distilling expo instead. That same night, he went on a distillery tour where the head distiller explained that it was very important for them to use expensive and hard-to-find botanicals like cardamom, cinnamon, fresh limes, and cloves.“And I thought to myself, all of those ingredients are very commonly used here in Singapore!” he recalled. “That’s when I got the idea to start a distillery here in Singapore and make gins using local botanicals but also using quality imported juniper berries and other necessary western botanicals to really enhance the flavour of the gin.”After making sure he learned “how to make gin properly” with stints at the Institute of Brewing & Distilling in London, Brewlab in Sunderland and the University of Adelaide in Australia, Sekaran officially opened Singapore Distillery's doors in September 2020, right smack in the middle of the global pandemic.The distillery is located in a flatted factory in Ang Mo Kio, with a 500-litre, custom-built copper still that churns out about 500 bottles of gin a day.Sekaran is especially proud of the wide range of gins they produce – from the 13 spices and herbs Merlion to the Lime Garden, which is made from limes commonly used locally: Limau nipis, limau purut, limau purut leaves and calamansi.“We’ve got the widest range of any Singaporean distillery and I think, one of the widest ranges of gins in the world from a single distillery,” he said.What still astounds Sekaran to this day is that the name – Singapore Distillery – hadn’t even been snapped up after all these years.“We thought we'd just try our luck. It just seems the most natural name to use for a local distillery and yet it was still available,” he gleefully recalled. “So we grabbed it!”Singapore Distillery debuted with six different gins and has since added two new flavours to its menu: The Orange Grove (filled with kumquats and tangerines) and Ichigo Cameron (the first and only gin made with Japanese strawberries grown fresh in Cameron Highlands from Japanese parental seeds).Now that Singapore Distillery is a robust almost one-year-old with a staff strength of six, what is Sekaran's biggest takeaway about making it as a homegrown distillery in a competitive market?“You have to work very hard to keep the gin balanced. I learned this when I was getting my distilling qualification from the Institute of Brewing and Distilling in London. A good gin has got to be a balance of juniper and the other botanicals,” he shared.“This is even more important when we’re using the bold and bright flavours of Asian fruits, herbs, and spices. You can’t just chuck everything you want to use inside a gin and expect it to be good. That will just result in a lot of clashing flavours.”It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Food & Drinks,Gin,Culture & Trends", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/lifestyle/gin-made-in-singapore-distillery-15016340", "Source": "google"}