{"Type": "", "Time": "2021-06-18", "Headline": "Did Loki episode 2 just set up Spider-Man: No Way Home? | TechRadar", "Text": "TechRadar is supported by its audience. When you purchase through links on our site, we may earn an affiliate commission. Learn more\nBy\nSamuel Roberts\n17 June 2021\nConnecting the multiversal dotsSpoilers for Loki episode 2 follow. When Marvel's Kevin Feige said that Loki would have more impact on the MCU than any Disney Plus show so far, this might've been what he was talking about. At the close of Loki episode 2, our Loki – the 2012 Avengers-era version who was arrested by the Time Variance Authority, for crimes against the 'Sacred Timeline' – meets Lady Loki. But that's not all. He also watches her grand plan unfold: using the TVA's time reset charges, which she stole after killing their agents, she creates a huge number of Nexus events by sending the devices through time. What this means is that multiple paths now are branching off from the Sacred Timeline – that is, what we know as the Marvel Cinematic Universe. As explained by animated clock Miss Minutes in episode 1, the TVA exists to prevent timelines from branching off – so this is a huge deal. \"But sometimes, people like you veer off the path that time keepers created. We call those 'variants'. Maybe you started an uprising, or were just late for work. Whatever it was, stepping off your path created a Nexus event, which left unchecked, could branch off into madness, leading to another multiversal war.\"So, how does this connect to the next Spider-Man movie?The big rumor surrounding December's Spider-Man: No Way Home is that it'll feature villains (and possibly heroes) from past iterations of Spidey movies. Alfred Molina, who played Doc Ock in Spider-Man 2, has already confirmed his involvement. Jamie Foxx, who played Electro in the terrible The Amazing Spider-Man 2, previously mentioned he was appearing in the movie in a long-deleted Instagram post. These are the only firm sources we have to go on, but they tease a lot about what Marvel Studios has planned for the closer in the trilogy.Bringing old villains back from older superhero series sounds like a recipe for a 'multiversal war', to us. But are Loki and No Way Home connected by the events we're seeing take place on the small screen right now? Below, we'll give you our level-headed take on what could happen next in Marvel's road to the multiverse.We know the Multiverse is coming to the MCU. 2022's Doctor Strange in the Multiverse of Madness has the word in the title – it means that we'll likely see alternative versions of the MCU, with familiar characters appearing in different forms. This is something the comics have experimented with plenty of times, including multiversal wars of their own. So, in this episode, we know that an excessive number of Nexus events makes the idea of a war between universes more likely. Lady Loki triggers a massive number of these events at once. The TVA, who guard the sacred timeline on behalf of the mysterious Time Keepers, now have to stop this before all hell breaks loose. Official details on Spider-Man: No Way Home are thin on the ground. Rumor and speculation, though? Oh boy. Various forums and reports have suggested we'll see multiple Spider-Men and their villains in this movie. Sticking to the facts we know so far, we've got two actors, Molina and Foxx, who have both said on the record that they're in this film – that's what we should be working with to hypothesize until we learn more. In theory, Spider-Man: No Way Home is where the multiversal war could begin – and the Nexus events we're seeing in Loki could be their catalyst. Based on what we've learned about alternate universes from these two episodes, versus what we know about the third Spidey movie, that does add up. Either the TVA sorts out the branching timeline, or the consequences will be dire. Still, we've got some doubts that this is how the MCU will change forever – keep reading for more on that. We're only on episode 2 of Loki, and there's a long way to go. The idea that the show, from here on in, will just be four episodes of multiversal chaos is enticing – but this series has its own arc, too. Would Marvel really rip the fabric of the multiverse open in this TV show by a character we've only just met, then simply show the fallout on the big screen in the form of a Spider-Man movie? It's possible, and a multiversal war is surely coming to the MCU (why else would they bother using that phrase?) – but it's at least as likely that the Loki show will fully deal with the consequences of what this Lady Loki just did. Our protagonist has an arc of his own in this series. It feels like a redemption story on fast forward, with Mobius (Owen Wilson) anticipating his every move and therefore thwarting his attempts to escape or betray the TVA (who certainly seem to have their own secrets).This show needs to have a resolution. And surely Loki helping the TVA to stop the Nexus events is his journey as a character, here. Even in this second episode, we see him come around to the idea that outsmarting this different version of himself is important to him – the show seems very self-aware about how many times Loki has stabbed people in the back, which is facet of the character we'd be happy to see retired in favor of genuinely developing him. Our guess? That will be more important to this series that setting up a Spider-Man movie. Of course, it may be doing both. Interestingly, showrunner Michael Waldron told AV Club this week that he didn't see Marvel's master plan in writing the show, and that Marvel's priority was just trying to make this series good. \"Those connections happen organically. There is a plan, absolutely. But our focus on Loki was always just make Loki the best TV show we possibly can. And then you find yourself surprised with how it connects to other things down the line.\"So, how far-reaching the connections are remain to be seen. If nothing else, it's clear that this show is finally peeling back the layers on how Marvel's multiverse works.What Loki episode 2 does show us are the circumstances that will likely lead to different universes spilling over into each other. And if nothing else, it's nice that Loki has got us back in the WandaVision mindset of imagining what every little thing could mean.Sign up to get breaking news, reviews, opinion, analysis and more, plus the hottest tech deals!Thank you for signing up to TechRadar. You will receive a verification email shortly.There was a problem. Please refresh the page and try again.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\nFuture Publishing Australia ABN: 96 734 906 323 | PO Box 1077, Mount St,\nNorth Sydney\nNSW 2059. ", "Section": "", "Writers": "", "URL": "https://www.techradar.com/sg/news/did-loki-episode-2-just-set-up-spider-man-no-way-home", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}