{"Type": "", "Time": "2021-06-17", "Headline": "Football: Uefa reminds teams of sponsorship obligations, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.LONDON (REUTERS) - European football's governing body Uefa has responded to Portugal forward Cristiano Ronaldo's removal of a Coca-Cola bottle at a Euro 2020 news conference by telling teams they have contractual obligations towards tournament sponsors.Ronaldo moved Coca-Cola bottles aside as he sat down to speak to the media on the eve of Tuesday's (June 15) Group F opener against Hungary in Budapest, which Portugal won 3-0.The 36-year-old then held up a bottle of water and said \"Agua\" in Portuguese, making headlines.A day later, France midfielder Paul Pogba, who is a Muslim, removed a Heineken beer bottle from in front of him after France's 1-0 victory over Germany.Italy midfielder Manuel Locatelli also moved Coca-Cola bottles aside and placed a bottle of water in front of him before speaking to the press after his Star of the Match display in a 3-0 win against Switzerland on Wednesday.\"Uefa has reminded participating teams that partnerships are integral to the delivery of the tournament and to ensuring the development of football across Europe, including for youth and women,\" the tournament organisers said on Thursday.Uefa's Euro 2020 tournament director Martin Kallen said the main issue had been with Ronaldo's action but there was an understanding of players who did such things for religious reasons.\"If it is for religious reasons, they don't need to have a bottle there,\" said Kallen.He told reporters the contractual obligations regarding sponsors was part of the tournament regulations signed up to by the national federations.Uefa has not taken any disciplinary action over the incidents and Kallen said any sanctions would be a matter for federations. Uefa would not directly fine players, he added.\"We are never fining a player directly from the Uefa side, we do this always through the participating national association and they can look if they go further,\" said Kallen.The Uefa official did not however rule out punishments if there are further cases.\"We have regulations signed by the participating federations. We have reminded them of their obligations but of course this (fining) is always a possibility,\" he said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-uefa-reminds-teams-of-sponsorship-obligations", "Source": "google"}