{"Type": "", "Time": "2021-06-17", "Headline": "How Old Were the BLACKPINK Members When They Debuted?", "Text": "Together, Lisa, Rosé, Jisoo, and Jennie make up one of the world’s biggest girl groups. That’s BLACKPINK, a K-pop group that debuted in 2016. However, these artists trained for several years together before their debut. Whether they’re performing live at the Coachella Music and Arts Festival or for a live-streamed concert during the coronavirus (COVID-19) pandemic, BLACKPINK is in your area. At only 14 years old, Jennie was the first member to start training for this K-pop group. “Everybody who loves music in Korea would love to go to Coachella; it’s like a dream,” Jennie said during an interview with Jimmy Kimmel. “For us as a trainee, we would search on the internet for performance videos and who is going to be in the lineup. It was the most exciting part as a trainee to watch those performances.”Jennie was also the first official member of this girl group. During an interview in conjunction with the Netflix documentary BLACKPINK: Light Up the Sky, this idol shared more about her experience training and a young adult. “At that time, I was always so pressured to do a good job during my end-of-the-month evaluations, so I didn’t stop to enjoy it. But thanks to those times, we are doing so well now, and that is how we became the BLACKPINK we are today.”RELATED: Rosé From the K-Pop Group, BLACKPINK, Is Actually From New Zealand and Australia (Which Totally Explains the Accent)Jennie was the first BLACKPINK trainee at YG Entertainment. However, the other three members followed shortly after. According to Pure Wow, the youngest member of the group, Lisa, became a trainee at YG Entertainment in 2011, as did Jisoo. Rosé became the final trainee in 2012, with the group finally debuting in 2016.At the time of their debut, each BLACKPINK member was over 18 years old. The two youngest members, Lisa and Rosé, were 19 years old. Jennie was 20 years old. Jisoo, the oldest in the girl group, was 21. RELATED: Will Smith Actually Talked to the BLACKPINK Girls Before They Debuted — They Reconnected at CoachellaA few years since their debut, these idols released songs like “Pretty Savage” and “How You Like That,” earning millions of plays on platforms like Spotify. They even broke YouTube records with their music videos.  Since their debut, these performers collaborated with artists like Dua Lipa, Selena Gomez, Lady Gaga, and Cardi B. Some branched out to release solo music, including the rapper Jennie and the vocalist Rosé. These artists also individually partnered with fashion houses, showcasing their sense of style. Fans can catch up with Rosé, Jennie, Lisa, and Jisoo on social media. Music by BLACKPINK, including their recently released single with Selena Gomez, “Ice Cream,” is available on most major streaming platforms.", "Section": "", "Writers": "", "URL": "https://www.cheatsheet.com/entertainment/how-old-blackpink-members-when-they-debuted.html/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}