{"Type": "", "Time": "2021-06-18", "Headline": "Euro 2020: Pacemaker could save playmaker Christian Eriksen's career, Latest Football News - The New Paper", "Text": "Christian Eriksen's football career could be saved by an implantable cardioverter defibrillator (ICD), a small battery-powered device to regulate his heartbeat following a cardiac arrest.The Danish midfielder collapsed and received cardiopulmonary resuscitation during their Euro 2020 Group B clash with Finland in Copenhagen last Saturday. Yesterday, the Danish football association announced that he would be fitted with an ICD.Gunnar Gislason, head of research at the Danish Heart Foundation and a professor of cardiology, told Reuters that a return to elite sport after the insertion of an ICD is possible.\"It really depends on the condition you are treating, what kind of heart disease you are suffering from, that's very individual, (but) there are examples of top athletes that have come back to the field and restart normal activity,\" he said, adding that it can also act like a conventional defibrillator.It was the defibrillator that helped to revive Eriksen last Saturday, and the doctor who oversaw the emergency treatment revealed the first words Eriksen said after regaining consciousness.  An electric shock was administered to the 29-year-old after a few minutes of heart massage, German doctor Jens Kleinefeld told the Funke media group in an interview published yesterday.\"About 30 seconds later, the player opened his eyes and I could talk to him directly,\" Dr Kleinefeld said.\"That was a very moving moment, because in such medical emergencies in everyday life, the chances of success are much lower.\"Dr Kleinefeld said he looked at the Inter Milan playmaker and asked him: \"Well, are you back with us?\"Eriksen answered, \"Yes, I am back with you\" and \"Damn, I'm only 29 years old,\" the doctor said.\"That's when I knew the brain wasn't damaged and he had fully returned,\" he said.Eriksen responded successfully to commands and was fully conscious in the stadium, Dr Kleinefeld said, but it took time to equip him with all the monitors required for safe transport to hospital.Electric shock treatment usually has a high success rate in healthy professional athletes compared to normal patients with pre-existing conditions, he added.\"I was 99 per cent sure in the stadium that he would arrive at the hospital and remain stable.\"Daley Blind, Eriksen's former teammate at Ajax Amsterdam, also had an ICD fitted after collapsing in a friendly against Hertha Berlin in 2020.Blind, 31, was then cleared to return to football and was part of the Netherlands side that beat Ukraine 3-2 less than 24 hours after Eriksen's collapse.Gislason explained that the ICD, which monitors heart rhythm, can perform two intervention roles.\"It can try to override the fast heart rhythm and, in that way, take control of the rhythm of the heart and then slowly go down and restore the normal heart rhythm,\" he said.\"If it doesn't succeed with that, it will give a shock, like a normal defibrillator, and it will try to regenerate a normal heart rhythm in that way, so it's a life-saving device for those who have a serious cardiac arrhythmia or cardiac arrest.\"The operation to insert an ICD takes one to two hours and is done under local anaesthetic, Gislason said, with patients usually kept in an extra day to calibrate the unit and ensure there are no issues with its operation.Danish fans told Reuters they hope to see Eriksen back on the field.One of them, Jeppe Andersen, said: \"Of course, he should play again - if he's fit, he should play again, but it's up to him to decide.\" - AFP, REUTERSGet The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/sports/football/euro-2020-pacemaker-could-save-playmaker-christian-eriksens-career", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}