{"Type": "Singapore", "Time": "2021-06-17", "Headline": "Ngee Ann Polytechnic to sack teaching staff member who made racist remarks to couple in video", "Text": "SINGAPORE: Ngee Ann Polytechnic (NP) is in the process of terminating the employment ofone of its teaching staff membersafter a viral video showed him making racist remarks towards an interracial couple.\"The polytechnic has officially charged the staff in question for serious breach of our staff Code of Conduct, and is proceeding to terminate his service,\" said an NP spokesperson in a statement to CNA on Thursday (Jun 17).The staff member is also accused of makingIslamophobic remarksin class in 2017, according to an online post by an NP alumna.\"We have completed our internal investigations for both incidents,\" the school said. NP said the school's staff members are \"expected to respect cultural, ethnic and religious differences in our society\".\"They must uphold secularity and impartiality at all times. This is in line with our staff Code of Conduct - which includes strict guidelines on personal and professional conduct,\" it added.\"The disciplinary action meted out against the staff in question reflects our commitment to provide a safe, inclusive and respectful environment for our campus community.\"NP APOLOGISES TO ALUMNAIn the statement, NP also apologised to its alumna who alleged that the same staff member had made Islamophobic remarks in class in 2017.\"When the incident came to our attention last week, we reached out to our alumna immediately to express our regret for her experience in 2017,\" said NP, adding that the school immediately offered counselling support to her.\"We have since met her to get more details of her experience and would like to apologise for the distress that she suffered, and thank her for her assistance in our internal investigations,\" the spokesperson added.NP added that police investigations were ongoing and that the school would fully cooperate with authorities.On Jun 9, Ms Nurul Fatimah Iskandar shared her account on Instagram and Facebook of comments made about Islam by her then-lecturer Tan Boon Lee in class in 2017. In her post, Ms Nurul also said she had made a complaint against the lecturer, but nothing happened after that.\"As part of our investigations, we also wanted to understand why our alumna’s feedback had not been acted upon, to tighten our feedback processes and ensure that gaps and areas of improvement are duly addressed,\" said NP.\"In our conversation with her, she indicated that she could not recall whether she had emailed her feedback on the incident or raised it during a post-course focus group discussion (FGDs) in 2017.\"FGDs are typically held at the end of every semester to seek students’ feedback on courses and lecturers,\" the polytechnic said.NP added that it has conducted a search of its various feedback channels, and worked with the alumna for her to check her NP mailbox archives, but have not been able to locate any records of the feedback.\"Nonetheless, we are committed to preventing a similar incident from occurring again, and will ensure that students are made aware of the appropriate channels for them to provide feedback in a safe manner,\" it said.\"We will also advise our staff on how to manage and report feedback that they may receive outside of these channels, as appropriate.\"NP suspended the staff member from teaching duties on Jun 7 after a video of him making racist remarks towards an interracial couple surfaced online. The police said at the time that a 60-year-old man was assisting with investigations.In its statement, the school said that it has various channels for students to provide anonymous feedback, including a whistle-blowing email channel for students.\"Other channels for student feedback include a general enquiry AskNP email, course experience dialogues as well as various student surveys conducted periodically,\" said NP.\"In addition, students can share their feedback with their staff advisors at any time. We would like to assure students that all feedback will be taken seriously and handled in confidence.\"NP added that moving forward, it will make all feedback channels more accessible and visible on its website, and publicise them on campus digital screens as well.\"We will review our internal feedback monitoring processes to identify and resolve any gaps in teaching and learning practices and to ensure that matters of concern can be flagged in a timely manner,\" said NP.\"We also remind all staff to strictly adhere to the staff Code of Conduct and create a safe learning environment for all in NP.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Ngee Ann Polytechnic,education,race", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/ngee-ann-polytechnic-np-to-sack-lecturer-racist-viral-video-15032656", "Source": "google"}