{"Type": "", "Time": "2021-06-18", "Headline": "Mediacorp partners EMERGE Esports to grow content creators", "Text": "Singapore's national broadcaster and media network, Mediacorp, is taking steps to grow esports content in the country together with talent management agency EMERGE Esports.Announced on Thursday (17 June), the strategic partnership sees EMERGE working with Mediacorp's Bloomr.SG network to \"develop the knowledge and skills of up-and-coming\" content creators in esports.It also aims to provide these content creators with important industry exposure and opportunities, EMERGE said in a press release. The partnership will also pave the way for EMERGE Esports talents to receive sponsorship and cross-promotion opportunities, as well as a chance to work with local and regional celebrities on content.\"With this collaboration, we can dedicate resources to those with an interest in the exciting arena of esports, supported with the deep expertise and capabilities of EMERGE Esports,\" said Diogo Martins, the team lead of Bloomr.SG.Roy Kek, the CEO and founder of EMERGE Esports, said that his organisation was looking forward to growing and cultivating the next generation of esports content creators in Singapore and the region. \"We are glad a pioneer like Mediacorp acknowledges this and is looking to promote esports content,\" said Kek.A relative newcomer to the industry, EMERGE Esports already manage a host of talent, including former Dota 2 pros Benedict \"hyhy\" Lim and Dominik \"Black^\" Reitmeier. They also have two esports teams under Kingsmen, which compete in Mobile Legends: Bang Bang and VALORANT.EMERGE Esports have also signed deals with other organisations such as the Philippines' Bren Esports and China's LGD to manage the talent rights of those teams in Singapore.Read also:Free to Play star hyhy regrets not focusing more on esportsOh Deer Bambi leads Kingsmen while juggling studies at NUSFor more esports news updates, visit https://yhoo.it/YahooEsportsSEA and check out Yahoo Esports Southeast Asia’s Facebook page and Twitter.Check out esports videos on Yahoo TV:Israeli jets launched air strikes on Gaza overnight Thursday to Friday after militants in the Palestinian territory again set off incendiary balloons into southern Israel, the army and AFP journalists said.Rafael Nadal and Naomi Osaka, with 24 Grand Slam titles between them, both withdrew from Wimbledon on Thursday with the Spanish star also pulling out of the Tokyo Olympics in a bid \"to prolong my career\".Every PC user must read this in 2021 - Do it now.The World Bank rejected a request from El Salvador for assistance in its bid to adopt bitcoin as a currency, a spokesperson for the Washington-based development lender said Thursday.A reporter with a pro-Beijing newspaper in Hong Kong accused of making a false statement when accessing a government car registry has been let off the hook after prosecutors agreed to drop the charge on condition of a binding-over order. The prosecution’s decision stood in marked contrast to the justice department’s handling of a case last year involving an RTHK contributor accused of the same act, prompting Principal Magistrate Ivy Chui Yee-mei to question the difference in approach at ThursdayBeijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityMeet the PayPal business debit card. Use it everywhere Mastercard® is accepted.North Korean leader Kim Jong Un has said his country needs to prepare for \"both dialogue and confrontation\" with the United States under President Joe Biden, state media reported Friday.The PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saBrowsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.Guided by MIT faculty, gain practical knowledge to embrace blockchain as a business tool.Global stocks were mixed on Thursday as traders digested the Federal Reserve's move to bring forward its forecasts for hiking interest rates as the economy recovers.The first astronauts arrived at China's new space station on Thursday in the country's longest crewed mission to date, a landmark step in establishing Beijing as a major space power.Washington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HouseNew research has identified TEN favorite stocks for the upcoming yearHong Kong immigration officials will renew the visas of all of Cathay Pacific’s expatriate pilots, but its large contingent of foreign cabin crew will be denied extensions permitting them to remain based in the city, the airline has said. The decision leaves Cathay’s foreign cabin crew at risk of losing their jobs, with the airline saying it would offer the same voluntary redundancy package to affected staff that it offered to others in late April. In its memo on Thursday, Cathay expressed regreIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Former Taiwanese president Ma Ying-jeou has called on the government to listen to public opinion and allow civilian groups which have different political leanings to the ruling Democratic Progressive Party to import much-needed Covid-19 vaccines. Taiwan, which is battling a surge in cases, has struggled to secure vaccines although it has signed deals to buy 10 million doses from AstraZeneca, 5 million from Moderna and more than 4.7 million doses via the Covax Facility, which is supported by theMore than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).China’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the buThe Kremlin was guarded about future dialogue with Washington on Thursday, a day after the first face-to-face meeting between Russian President Vladimir Putin and US counterpart Joe Biden.Chinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiLastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Japan said on Thursday it will make a vaccine passport available from next month for Japanese travellers, as governments around the world experiment with ways to relaunch tourism and business trips.A US journalist detained in Myanmar since May appeared Thursday in a special court, his employers said, where he faces charges under a law that criminalises encouraging dissent against the military.Lim Chung Chun, may be the co-founder and CEO of homegrown wealth management firm iFAST Corporation, but he is still an investor at heart and a research analyst at his core. Learn more about his journey and his investment philosophy here.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/mediacorp-partners-emerge-esports-to-grow-esports-content-creators-in-singapore-082331953.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}