{"Type": "", "Time": "2021-06-18", "Headline": "Biden-Putin summit highlights discord on major issues, World News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.GENEVA • United States President Joe Biden and Russian President Vladimir Putin agreed to begin cyber security and arms control talks at a summit that highlighted their discord on those issues, human rights and Ukraine.In their first meeting since he took office in January, Mr Biden stressed he did not make threats during the three-hour meeting. Instead he outlined US interests, and made clear to Mr Putin that the US would respond if Russia infringed on those concerns.Both men used careful pleasantries to describe their talks in a lakeside Swiss villa, with Mr Putin calling them constructive and without hostility and Mr Biden saying there was no substitute for face-to-face discussions.They also agreed to send their ambassadors back to each other's capitals. Russia recalled its envoy after Mr Biden said in March that he thought Mr Putin was a \"killer\". The US recalled its ambassador soon after. The Russian President said on Wednesday that he had been satisfied by Mr Biden's explanation of the remark.But there was no hiding their differences on cyberspace. Washington has demanded Moscow crack down on ransomware attacks emanating from Russian soil.\"I looked at him and said, 'How would you feel if ransomware took on the pipelines from your oil fields?' He said, 'It would matter',\" Mr Biden told reporters at an unusual solo news conference, itself an illustration of the tensions between the two nations.The query referred to a cyber attack that closed the Colonial Pipeline system last month, preventing fuel flowing to the US' East Coast from the Gulf for days. Mr Biden vowed to take action against any Russian cyber attacks: \"I pointed out to him that we have significant cyber capability. And he knows it.\"Neither side gave details on how their planned cyber security talks might unfold, although Mr Biden said he told Mr Putin that critical infrastructure should be \"off-limits\" to cyber attacks.Speaking to reporters separately, Mr Putin dismissed US concerns about jailed Kremlin critic Alexei Navalny, Russia's increased military presence near Ukraine's eastern border and suggestions Russians were responsible for the cyber attacks in the US.He suggested Washington was in no position to lecture Moscow on rights, batting away questions about his crackdown on political rivals, saying he was trying to avoid the \"disorder\" of a popular movement such as Black Lives Matter.\"What we saw was disorder, disruption, violations of the law. We feel sympathy for the United States of America, but we don't want that to happen on our territory and we'll do our utmost in order to not allow it,\" he said.US-Russia relations have been deteriorating for years, notably with Russia's 2014 annexation of Crimea from Ukraine, its 2015 intervention in Syria and US charges - denied by Moscow - of meddling in the 2016 presidential election won by Mr Donald Trump.I looked at him and said: 'How would you feel if ransomware took on the pipelines from your oil fields?' He said: 'It would matter.'Mr Putin, 68, called Mr Biden, 78, a constructive, experienced partner, and said they spoke \"the same language\". But he added that there had been no friendship, rather a pragmatic dialogue.A senior US official said Mr Biden and Mr Putin, their foreign ministers and interpreters met first for 93 minutes. After a break, the two sides met for 87 minutes in a larger group including their ambassadors.Both Mr Biden and Mr Putin said they shared a responsibility, however, for nuclear stability, and would hold talks on their recently extended New Start arms limitation treaty.What we saw was disorder, disruption, violations of the law. We feel sympathy for the United States of America, but we don't want that to happen on our territory and we'll do our utmost in order to not allow it to happen.The treaty caps the number of strategic nuclear warheads they can deploy and limits the land-and submarine-based missiles and bombers to deliver them.Mr Putin said it was \"hard to say\" if relations would improve, but that there was a \"glimpse of hope\".Mr Biden said: \"This is not about trust, this is about self-interest and verification of self-interest.\"REUTERSSEE OPINIONJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/biden-putin-summit-highlights-discord-on-major-issues", "Source": "google"}