{"Type": "", "Time": "2021-06-18", "Headline": "Asia has wary welcome for G-7's Build Back Better World initiative, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.JAKARTA/SINGAPORE (REUTERS) - A plan by the Group of Seven (G-7) nations to counter Beijing's Belt and Road Initiative has been welcomed by countries in China's immediate orbit of influence but will need to overcome doubts about Western commitment to emerging market projects.The Build Back Better World initiative, or (B3W), was promoted at last week's G-7 summit in Britain but remains light on details and is not expected to become a reality for some years.The push, however, is seen as a challenge by the world's richest democracies to China's growing influence in developing economies, using infrastructure investment.While Asian governments say they are open to working with developed nations to meet their growing infrastructure needs, a challenge for B3W will be matching the speed at which China has been able to engage developing economies in the region.Mr Choi Shing Kwok, director of the ISEAS-Yusof Ishak Institute in Singapore, said South-east Asian nations are wary of overdependence on China, creating a potential opening for B3W when it eventually arrives.At the same time, B3W's multilateral nature would make it a more complex and potentially slower-moving initiative than BRI.\"South-east Asian countries that have hosted BRI projects, they often did so because of the ease with which such deals have been struck in the past,\" Mr Choi said. \"It isn't because of any ideological or geopolitical reasons.\"The B3W plan involves the G-7 and its allies using the initiative to mobilise private-sector capital in areas such as climate, health and health security, digital technology, and gender equity and equality.Indonesian Deputy Foreign Minister Mahendra Siregar told Reuters the country has several projects that would be open to co-investment and was ready to intensify engagement with developed nations.However, the country's coordinating ministry for maritime affairs and investment, Indonesia's main point of contact for BRI projects, said developed nations would need to shake off their past reluctance to commit to local development.\"We welcome the (B3W) initiative, but of course we hope this time they put their money where their mouth is,\" Mr Jodi Mahardi, a spokesman for the ministry, told Reuters.While China is among Indonesia's biggest investors, the country has mostly opted for Chinese finance delivered on a business-to-business basis, rather than state-backed investment or through BRI initiatives.The most high-profile BRI project in South-east Asia's largest economy is the Jakarta-Bandung high-speed railway that is facing cost overruns.More than 100 countries have signed agreements with China to cooperate in more than 2,600 BRI projects worth US$3.7 trillion (S$4.95 trillion), according to a Refinitiv database.Beijing said last year that about 20 per cent of BRI projects had been affected by the Covid-19 pandemic. China has also scaled back some plans after several countries sought to review, cancel or reduce commitments, citing concerns over costs, erosion of sovereignty, and corruption.But despite international concerns about China's growing influence, analysts and policymakers expect Asia's long-term development needs to trump politics.The Asian Development Bank in 2017 estimated developing economies in the region would need to spend US$1.7 trillion a year on infrastructure through to 2030 to sustain growth.Philippines Economic Planning Secretary Karl Chua said his country remained open to engaging a range of partners that have good infrastructure experience, including Japan, China, South Korea, Europe and the United States.\"The fact is we have a big gap in infrastructure which we have started to fill up vigorously in the past five years and we will continue to do so,\" Mr Chua said.A Bangladeshi foreign ministry official, speaking on condition of anonymity, told Reuters Dhaka remained committed to its BRI partnerships.Mr Roland Rajah, an economist at the Sydney-based Lowy Institute think-tank, said while countries would, in most cases, be able to choose between Chinese or Western support without major political repercussions, it could be more problematic for certain sectors.\"For sensitive infrastructure such as telecoms and strategically located ports, however, it will continue to be either/or and they'll be under pressure to make the 'right' choice.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/asia-has-wary-welcome-for-g-7s-build-back-better-world-initiative", "Source": "google"}