{"Type": "Asia", "Time": "2021-06-18", "Headline": "WHO warns of fresh Indonesia COVID-19 surge fed by virus variants", "Text": "JAKARTA: Indonesia’s president ordered authorities to speed up the country's vaccination campaign as the World Health Organization (WHO) warned on Thursday (Jun 17) of the need to increase social restrictions in the country amid a fresh surge of COVID-19 infections caused by worrisome variants.“We need vaccination acceleration in order to achieve communal immunity, which we hope can stop the COVID-19 spread,” President Joko Widodo said while visiting a vaccination centre just outside the capital Jakarta.Widodo said he ordered his Cabinet ministers and local governments to increase the number of people vaccinated each day to 1 million by next month. He said Indonesia is currently vaccinating half a million people a day.Indonesia, the world's fourth-most populous country, aims to inoculate more than 181 million of its 270 million people by March 2022, but authorities have only fully vaccinated 11.8 million people and partially vaccinated another 9.6 million others.National COVID-19 task force spokesman Wiku Adisasmito said the slow progress can be put down to the limited global vaccine supply, the unpreparedness of the national health system and vaccine hesitancy. The government has received 92.2 million vaccine doses so far.Indonesia reported 12,624 new COVID-19 infections on Thursday, the biggest increase since Jan 30, health ministry data showed. Another 277 fatalities were added to the death toll from the disease.The increase in cases has been blamed on travel during last month's Eid al-Fitr holiday as well as the arrival of new virus variants, such as the Delta version first found in India.In Jakarta, the number of hospital beds occupied has shot up to 75 per cent this week from 45 per cent last week, government data shows.The WHO in its situation report on Thursday noted that Indonesia’s drastic increase in bed occupancy rates is a major concern and necessitates the implementation of stricter public health and social measures, including large-scale social restrictions.“With increased transmission due to variants of concern, urgent action is needed to contain the situation in many provinces,” it said.Indonesian health officials say they've detected the Delta variant in Jakarta, Central Java and East Java provinces. They say they have spotted three of the four variants of concern flagged by the WHO.Adisasmito said that a spike in coronavirus infections has been seen this week in Jakarta, Banten, West Java, Central Java, Yogyakarta and East Java provinces. All are located on Java, the most populous of Indonesia's more than 17,000 islands.Indonesia has reported more than 1.9 million COVID-19 cases since the pandemic began, with more than 53,700 deaths, the highest toll in Southeast Asia. Those numbers are thought to be an undercount due to a lack of widespread testing.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,Indonesia,World Health Organization", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/indonesia-covid-19-who-warns-of-fresh-surge-virus-variants-15033526", "Source": "google"}