{"Type": "Business", "Time": "2021-06-18", "Headline": "Employment grows more than expected in Q1, but uncertainties weigh on recovery: MOM", "Text": "SINGAPORE: Total employment in Singapore grew by more than estimated in the first quarter of this year, but economic uncertainties and COVID-19 restrictions are expected to weigh on the pace of labour market recovery in the second quarter, said the Ministry of Manpower (MOM) on Thursday (Jun 17).According to final figures for the quarter, total employment – excluding migrant domestic workers – grew by 12,200.This is higher than the figure of 4,800 reported in preliminary estimates in April, when MOM said that total employment grew for the first time after four consecutive quarters of decline.The improved figures were due to a higher-than-anticipated rise in resident employment of 23,700. At the same time, the economy continued to shed foreign workers, with non-resident employment declining by 11,500. However, the pace at which non-resident employment fell moderated from previous quarters.Resident employment increases were broad-based across industries, led by information and communications, food and beverage services, health and social services, administrative and support services, public administration and education, as well as professional services.“These are good signs, which we are happy to see. However, our path to recovery will not be a straight road. We will be met with some twists and potential roadblocks,” said Minister for Manpower Tan See Leng.“In fact, last month’s tightened measures in Phase 2 (Heightened Alert) is expected to lead to some kinks. Recovery is also expected to be more uneven across sectors than earlier expected.”DECLINE IN FOREIGN LABOUR “CYCLICAL”Speaking after a visit to the Procter and Gamble Innovation Centre, Dr Tan said that the outlook remains “guarded” due to COVID-19 restrictions in Phase 2 (Heightened Alert), which Singapore is just emerging from.Domestic sectors like retail and food and beverage in particular would be impacted by the restrictions, he noted. Dining-in at F&B outlets, which has stopped since May 16, was to resume from Jun 21 under a two-step reopening plan. But that timeline is being evaluated as more COVID-19 cases have emerged.Export-oriented sectors like manufacturing, however, are expected to do well, said Dr Tan: “Even though we are guarded, we are cautiously optimistic, because external sectors in terms of the exports … I think we're still seeing quite a lot of good news coming on that front.”MOM said that seasonally adjusted unemployment rates continued to improve, but unemployment rates remained elevated in March. The overall unemployment rate in March was 2.9 per cent, with the resident unemployment rate dipping from 4.1 per cent to 4 per cent, and the citizen unemployment rate at 4.2 per cent.The resident long-term unemployment rate, referring to people who have been unemployed for more than six months, remained unchanged at 1.1 per cent.On foreign workers, permanent secretary for manpower Aubeck Kam said that ongoing border restrictions continue to put “significant pressure” on foreign employment, but this was “cyclical” and not a structural phenomenon.“We do expect the number of foreign workers to grow at some point. The prolonged decline is really a function of the border restrictions, and will not be representative of the demands of the different sectors,” he said, adding that the drop in foreign employment in Q1 was across different sectors.Mr Kam said that the fall in foreign worker numbers also has some bearing on projections in the second quarter as the output in some sectors like construction, which is reliant on foreign labour, will be reduced.Responding to a reporter’s question on when border restrictions may be relaxed so firms can hire the foreign workers they need, Dr Tan said that this depends on many factors and a “key variable” is the COVID-19 situation in the countries where the workers are from. He added that there is a “risk quota” to determine the inflow of workers.“It is a daily, weekly and monthly calibration and titration according to the risks of the imports from these countries, versus what we can deal (with) in terms of our healthcare facilities,” he said.MORE JOB VACANCIES, FEWER RETRENCHMENTSThe number of job vacancies increased further to 68,400 in March and the rise was reported in all industries, said MOM.In particular, job vacancies were seen in manufacturing (mainly in fabricated metal products, machinery & equipment and electronics), public administration and education, construction, information and communications, as well as financial services.The ratio of job vacancies to unemployed people improved from 0.75 in December 2020 to 0.96, or nearly one job vacancy for every unemployed person in March. This is within the pre-pandemic range, which was 0.82 to 1.09 from 2018 to 2019, said MOM.The number of retrenchments fell to 2,270, and the six-month re-entry rate among retrenched residents (66 per cent) rose in Q1 this year for the second consecutive quarter.“More than half of retrenchments which occurred in Q1 2021 were due to restructuring and re-organisation, while retrenchments due to recession or downturn in industry made up a smaller proportion compared to a quarter ago,” said MOM.As business activities picked up, the number of employees who were placed on short work-weeks or temporarily laid off also halved from 8,710 in the fourth quarter of 2020 to 4,020 in the last quarter.However, the level remains high compared to pre-pandemic quarters, which averaged 740 in 2018 and 2019.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Manpower,Ministry of Manpower,MOM,labour,employment,workers", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/business/employment-grows-more-than-expected-in-q1-covid-19-mom-15031620", "Source": "google"}