{"Type": "", "Time": "2021-06-18", "Headline": "Playwright Alfian Sa'at questions PA's selective quoting of Sarah Bagharib's remarks in interview on Hari Raya standee fiasco - The Online Citizen Asia", "Text": "Playwright Alfian Sa’at on Tuesday night (15 June) questioned what appears to be the People’s Association (PA)’s selective quoting of communications specialist Sarah Bagharib’s remarks in an interview with Nanyang Technological University professor Walid J. Abdullah on the Hari Raya standee fiasco.PA had used Ms Sarah’s wedding photograph as a prop in its Hari Raya Aidilfitri display at an HDB estate in Tiong Bahru. While the standee was subsequently removed and the PA offered her a public apology, the organisation later said it rejects Ms Sarah’s “accusations” of racism, branding the incident “culturally insensitive” and an “isolated case”.Posting on Facebook on Monday, PA referenced her interview with Assistant Professor Walid, claiming that Ms Sarah mentioned that the incident has perpetuated a culture of racism.“It is not right to raise the allegation of racism, without basis, to stoke emotions and sentiments,” said PA.The organisation claimed that it had explained to Ms Sarah that while it acknowledges that its staff “should have been more culturally sensitive”, it is not right to paint “sweeping conclusions from this incident”.Doubling down on its point that Ms Sarah’s case was an isolated one, PA said that it finds Ms Sarah’s public call for messages or suggestions that they would like to have relayed to the organisation in their meeting an “odd” one.“We do not see why our meeting should be appropriated as a platform for her to funnel the views and comments of persons unrelated to the incident,” said PA, adding that it is of the view that Ms Sarah’s purpose in agreeing to meet its representatives “has gone far beyond the Radin Mas incident”.PA said that it will not be following through with the meeting as there is “no point” in doing so, in light of the above.“We agree it is important for our staff and volunteers to be sensitive to and knowledgeable about the cultures of all our ethnic groups. We are now looking at establishing a resource panel to guide and advise our staff on cultural matters. We will also step up training efforts to enhance staff and volunteers’ understanding and appreciation of our different cultures,” it added.PA also claimed that Ms Sarah’s 1 June email had falsely alleged that it was “hasty in sharing the name of the vendor” in order to “distance and deflect blame” from itself.“The vendor had identified himself directly to Ms Sarah on 28 May, and apologised. This was before PA issued our statement on 29 May,” it said.“It is regrettable that Ms Sarah did not clarify this point during her Instagram Live interview with Mr Walid J. Abdullah on 7 June. Instead she persisted in conveying the impression that PA had deflected blame from itself,” PA added.The short length of the quotes attached by PA in its follow-up post, said Mr Alfian, had aroused his suspicion, as “to build a case against someone it is always important to be able to reproduce what they said in full”.“Scanning through PA’s statement, one would be forgiven if one thought that Ms Sarah was the one who made the claim that what PA did “perpetuate[d] [a] racist culture”. But she was actually sharing something someone else had written,” he noted.Ms Sarah had in fact quoted a female Chinese clinical psychologist’s comment, who wrote:“This whole thread is written with much labour, can we Chinese Singaporeans please appreciate the labour and educate ourselves on our conditioned racism? It’s long overdue towards our friends in minority communities who have to put up with our ignorance–which continues to perpetuate the racist culture that hurts them.”The comment in itself did not state that the act of putting up the offending decorations in itself had perpetuated a culture of racism — rather, it is the cultural ignorance in the process of doing so that is racist, said Mr Alfian.Ms Sarah, he added, did not directly make remarks such as “this racist incident” or “and other similar racist incidents” in the interview.Instead, she said:“Allyship plays a big part in promoting true racial harmony–one that goes beyond “racial tolerance”. I am so, so grateful to allies who have used their voices to stand in solidarity with Razif and I, and ethnic minority communities, in the aftermath of this incident (and other racist attacks and incidents that have been filmed).”“I think Ms Sarah has been at pains to assert that all Singaporeans, and not just minorities, are stakeholders in the issue. Hers isn’t some kind of minority grievance whose aim is to indict an entire majority community,” said Mr Alfian.Referencing PA’s claim that its error was not born out of racism, but rather out of “cultural insensitivity”, the playwright said that the model of “racial harmony” that the organisation has been operating on “would not recognise that something is racist unless it “disrupts” harmony”.“Of course the people at PA would want to distance themselves from “obvious” racists like Beow Tan, Tan Boon Lee and the gong lady,” he said, adding that pleading “cultural insensitivity” is a way of justifying “racism that is not tantamount to public nuisance”.Addressing PA’s claim that Ms Sarah had spoken about its “staff and volunteers” being “blind to racism”, Mr Alfian said that he could not find the alleged statement anywhere in the whole interview.“What I found instead was this, 9 minutes from the end. Walid jokes with her about whether she’d have a teh tarik with Melvin Yong (the MP on the banner),” he said.Quoting Ms Sarah:“There was a light-up event, at Tiong Bahru arcade, where the standee was as well, and I wonder if he saw it? There was a light up Hari Raya event, at that very stage. With his face, and the kampung thing, coconut tree and all of it. So I wondered if he saw the standee, what he thought about it. If he did, and he didn’t say anything, or think twice, to think that something was wrong about it. If I had teh tarik with him then I’d like to know if he did see that. And if he did, and he didn’t say anything about it, then something is definitely wrong, right?While there was a comment on internalised racism — on how “we’ve been so conditioned to think in a certain way…that there’s nothing wrong with this because people are colour blind, or blind to racism at play. Or there’s nothing wrong, because it doesn’t impact them” — Mr Alfian noted that there was “no mention of PA staff or volunteers”.“It’s a stretch, but maybe she was questioning whether the MP had noticed that something was wrong–and it’s important to underline that these are questions, not accusations,” he said.The playwright questioned whether much of the supposed efforts on those who speak of “racial harmony” are mostly concentrated on the “in progress” part than in doing “the actual work”.“Because for me, one of the most important work is dialogue–real dialogue with those on the other side of the aisle, not stage-managed ones of vetted questions and screened guest lists. I dream of the day when PA can have a dialogue with Ms Sarah, or when Zaobao editors can have one with the scholars who wrote in to them on their coverage of racial issues. It’s a dream that’s entirely within reach,” he said.Professor Walid, in his comment on Mr Alfian’s post, highlighted that Ms Sarah was “responding to a comment” left by a viewer during the livestream “when she talked about internalised racism”.“Because IG live does not save comments, and we were taking many comments, we do not even know what that specific comment refers to,” he added.Other commenters remarked that PA staff involved in the saga “need to take a critical reading class” and that by “unilaterally cancelling a planned meeting” with Ms Sarah, the organisation is “essentially indicating that they do not want to do the hard work of authentic dialogue”. One of the “smear campaigns constructed out of selective quotations” referred to by Mr Alfian in his post earlier include pro-establishment factions such as Facebook page Singapore Matters citing his social media post from 2012, in which Mr Alfian had reportedly told TODAY that he “would love to become a Malaysian”.In June last year, Mr Alfian also had to issue a refutation against the “pro-Malaysia activist” narrative made against him.Among the points made by Mr Alfian include his past criticism in 2014 on how the Bumiputera policy “has been hijacked and corrupted” by “UMNOputras” through “cronyism, nepotism and corruption”.“Of all the accusations in that post, this one is the most obviously defamatory. I had to comb through all my posts to see what I had written about ‘Bumiputera policies’. And there’s not a single post that mentions endorsement of the policy, nor my wish for it to be implemented in Singapore. If anything, there is awareness of how it has been hijacked and corrupted,” he wrote.Touching on the claim that he had “mocked” Singapore’s approach in the maritime dispute with Malaysia in 2019 as “jingoism”, Mr Alfian clarified that his comments expressed his “dovish” anxiety over military escalation in the Johor Straits at the time.“I expect our elected officials to exhaust all diplomatic channels for solutions rather than to rely on ‘jingoism’—extreme nationalism, in the form of aggressive or warlike foreign policy,” he wrote.In his commentary on his poem “Singapore You Are Not My Country”, Mr Alfian highlighted that then-Education Minister Ong Ye Kung did not quote the poem in full when the latter cited it in Parliament in October 2019.In delivering his speech on the cancellation of a Yale-NUS programme which Mr Alfian was initially invited to run, Mr Ong quoted part of Mr Alfian’s poem “Singapore You Are Not My Country”, which was written in 1998, to give Parliament “a flavour” of the literary figure’s “thinking”.Mr Ong said:“Singapore, I assert you are not a country at all,\nDo not raise your voice against me, I am not afraid of your anthem”Later part of the poem says:“…how can you call yourself a country,\nyou terrible hallucination of highways and cranes and condominiums\nten minutes’ drive from the MRT?”“This is a poem, and we might concede some artistic licence. But Mr Alfian Sa’at continues this attitude consistently in his activism.”Mr Alfian in a Facebook post later clarified that the line quoted by Mr Ong, when placed in context, appears as seen below:Do not raise your voice against me,\nI am not afraid of your anthem\nalthough the lyrics are still bleeding from\nthe bark of my sapless heart.Mr Alfian elaborated that the context in which the line “I am not afraid of your anthem” appears describes the anthem’s presence in his upbringing as a Singaporean and how it “bleeds from my heart”.Contrary to what the line appears to suggest on the surface, ‘I am not afraid of your anthem’ actually reveals the fear of vulnerability and of having the anthem “rouse patriotic feelings in me”, he added.“I am afraid of this patriotic love because it is so involuntarily, it comes from a primordial and irresistible place from deep inside,” said Mr Alfian. “I am afraid of these volcanic feelings because I want to protect myself from loving something too much.”“Just stopping on the word ‘anthem’ might suggest that I am somehow rejecting symbols of the state,” he said.The aforementioned Yale-NUS programme, which was renamed “Dialogue and Dissent in Singapore”, was originally set to take place from 29 September to 5 October in 2019.Contrary to the allegations made in a Yale report on the cancellation, which he said painted him as “defiant and intransigent”, Mr Alfian said that he was open to removing certain elements from the original programme itinerary and substituting such elements with others, in light of sensitivities arising from contemporary developments at the time.An example of such, according to Mr Alfian, included removing the screening of a documentary on Hong Kong civil rights activist Joshua Wong after a Yale-NUS representative – who he addressed as “Person D” – on 11 Sep raised concerns pertaining to the ongoing protests in the city. © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/16/playwright-alfian-saat-questions-pas-selective-quoting-of-sarah-bagharibs-remarks-in-interview-on-hari-raya-standee-fiasco/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}