{"Type": "", "Time": "2021-06-18", "Headline": "Cautious uptick in bookings of hotels, attractions in Singapore with easing of Covid-19 measures, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - With just over a week left of the June school holidays, people in Singapore are returning to attractions and staycations, which saw an increase in bookings since some Covid-19 restrictions were lifted earlier this week.Tourism players said it is a welcome change after phase two (heightened alert) measures, which kicked in on May 16, put a dampener on the peak season here. But many are looking to next Monday (June 21), when dining in is expected to resume, for a more decisive recovery.Skypark Sentosa by AJ Hackett, which runs activities such as a bungee jump and giant swing at Sentosa's Siloso beach, saw bookings fall by 30 per cent when restrictions were announced last month.General manager Luke Johnson said that bookings have picked up slightly this week, and he is anticipating a \"drastic increase\" when dining in at eateries can resume. The attraction runs a beach club on its premises that serves food and drinks.\"Even though the pax limit has been increased from two to five, I believe that the consumer is seeing next week as the real relaxation of the measures. People have been mostly indoors, so we are hoping for a huge spike then,\" he said.Gardens by the Bay, which also had a drop in visitorship to ticketed attractions such as the Cloud Forest and Flower Dome during phase two (heightened alert), saw a 12 per cent increase in bookings over the past weekend. It had postponed June holiday programmes, such as the Children's Festival, to the September school holidays.Director of attractions operations Jason Koo said restrictions on dining in had an impact on visitor numbers, but he believes more people will return when these are lifted.Hotels, too, had fewer bookings and more cancellations compared with pre-pandemic days, as well as the March and December school holidays over the past year.Lloyd's Inn, a boutique hotel near Orchard Road, had a 17 per cent drop in occupancy compared with June 2019, while The Vagabond Club near Jalan Besar had a 30 per cent drop during the same period.\"Many are taking a wait-and-see approach,\" said Lloyd's Inn hotel manager Kelvin Soh, who added that occupancy has yet to pick up.Other hoteliers remain cautiously optimistic. Those who spoke to The Straits Times reported more interest, in the form of inquiries and website traffic, following the relaxation of measures.Regional vice-president and general manager of Four Seasons Hotel Singapore Peter C. Draminsky said that since phase three (heightened alert) was announced, the hotel has seen an uptick in bookings. He attributed this partly to the relaxing of measures, such as up to five guests being allowed in a room, up from the previous two.In the coming weeks, hotels will be looking to woo more guests with new family-friendly experiences.The Fullerton Hotel and The Fullerton Bay Hotel have introduced workshops on botanical ink-making and a mindfulness-based movement and art workshop that includes stretching, sound meditation and therapeutic art. Meanwhile, Orchard Hotel launched staycation packages comprising activities such as a dim sum-making class at in-house Chinese restaurant Hua Ting.\n\nThe Fullerton Hotel, along with the Fullerton Bay Hotel, has introduced several workshops to attract visitors. ST PHOTO: GIN TAY\nPrivate tutor Joel Randall, 29, who went on three staycations in June at Mandarin Oriental Singapore, Raffles Singapore and The Fullerton Bay Hotel, says the getaways were worth it, even though he could not dine out.\"I was basically isolating myself in a room. Except it was the kind of room I wouldn't have the privilege to stay in on a daily basis, so I embraced it,\" says Mr Randall, who went with one friend each time.Still, he is looking forward to dining out during his upcoming staycation at The Capitol Kempinski Hotel Singapore later this month.He added: \"Staycations are a change of environment from working from home or being in the office, and I am a big believer in supporting local businesses.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/cautious-uptick-in-bookings-of-hotels-attractions-with-easing-of-covid-19-measures", "Source": "google"}