{"Type": "", "Time": "2021-06-18", "Headline": "How to watch Netherlands vs Austria: live stream Euro 2020 free and from anywhere | TechRadar", "Text": "TechRadar is supported by its audience. When you purchase through links on our site, we may earn an affiliate commission. Learn more\nBy\nKevin Lynch\n17 June 2021\nBoth sides looking to build on winning start to Group CThe Johan Cruyff Arena hosts an intriguing top-of-table clash tonight between two Group C rivals that have already shown plenty of attacking flair. Read on for your guide to watching a Netherlands vs Austria live stream and find out how to watch Euro 2020 online from anywhere.The Dutch opened their campaign with a 3-2 win in the tournament's best game so far against Ukraine, with Denzel Dumfries capping a superb performance up front by scoring the game's late winner.Date: Thursday, June 17Kick-off time: 9pm CET / 8pm BST /  3pm ET / 12pm PT / 5am AEST (Fri)/ 7am NZST (Fri)Venue: The Johan Cruyff Arena, Amsterdam, NetherlandsFree live stream: BBC iPlayer (see below for more)Global live streams: ESPN via Sling TV or FuboTV (US) | Optus Sport (AUS) | TSN/TVA Sports (CAN) | Sky Sport (NZ)Watch anywhere: try ExpressVPN 100% risk-freeWhile the Dutch looked formidable on the attack, the Ukraine's second-half comeback highlighted the fact that Frank De Boer’s side appear to look vulnerable at the back without the injured Virgil van Dijk.Austria meanwhile claimed their first ever win in a European Championships by easing past outsiders North Macedonia with a 3-1 victory.The result was somewhat overshadowed by the controversy surrounding substitute Marko Arnautovic's wild celebrations after scoring Das Team's third goal, with the former West Ham and Stoke star now the subject of a UEFA investigation into claims he used racist language during the incident with the threat of suspension for the striker from the tournament should he be found guilty.Hopefully this game will stand out for all the right reasons. Read on for how to watch an Netherlands vs Austria live stream for FREE today.There's great news for anyone looking to binge watch this summer's tournament, with a number of European broadcasters showing every match for free. We suggest you double check your local listings to confirm the details of who is showing this game, but among Europe's free-to-air broadcasters are:UK - BBC and BBC iPlayerFrance - TF1Germany - ARD and ZDFSpain - MediasetItaly - RAIOur guide below gives detailed instructions on how you can watch this Euro 2020 match live in the UK, US, Australia, Canada and New Zealand. However, if you're abroad at any point during the tournament, you won't be able to live stream the football via your usual domestic broadcaster.This is down to geo-blocking, which restricts certain services and content to specific parts of the world. However, you can get avoid geo-blocks by using a VPN, or Virtual Private Network. It's completely legal, very affordable and easy to use - and it also encrypts your browsing, offering protection against cybercriminals and government snooping.Use a VPN to live stream Euro 2020 from anywhereExpressVPN is the world's top VPN right now\nWe've put all of the major VPN's through their paces, and our current top-ranked service in our tests was ExpressVPN. Dead simple to use, yet fast and with full suite of security features thrown in, it can also be used on a wide variety of devices, with dedicated apps for Android and Apple smartphones. You can also use it on the Amazon Fire TV Stick, Apple TV, Xbox and PlayStation. If you want to stay safe online and watch your preferred broadcast from anywhere, you won't find anything better than ExpressVPN.Better still, you can get an extra 3 months FREE if you sign up for an annual plan. And there's nothing to lose, because if you change your mind within the first 30 days, let them know and they'll give you your money back.- Try ExpressVPN 100% risk-free for 30 daysOnce you've got ExpressVPN installed, watching your domestic Euro 2020 coverage is a piece of cake. Simply select a server back in your home country and then fire up the stream like you normally would when back at home. In the UK, this Euro 2020 clash between the Netherlands and Austria is being shown on BBC One.Coverage starts at 7.30pm BST, with kick-off set to follow at 8pm BST.You can also live stream the channel's coverage of Netherlands vs Austria for free via BBC iPlayer, which works across a wide range of devices, including phones, tablets, laptops, games consoles and streaming devices.As a national broadcaster, BBC iPlayer doesn't cost a penny to stream if you're located in the UK (though you should possess a valid TV licence).If you're not in the UK right now, you can use a VPN and follow the instructions above to live stream the action on  just as you would at home.ABC and ESPN are sharing broadcast rights for Euro 2020 in the US, with ESPN showing this Group C match. Kick-off Stateside is at 3pm ET / 12pm PT.If you get ESPN as part of your cable package, you can also live stream Netherlands vs Austria directly through the ESPN website.How to watch Netherlands vs Austria without cableFor all the cord-cutters out there, you've a number of options for watching every single Euro 2020 game without laying out for an expensive cable package. Over-the-top streaming service Sling TV is one of the most cost-effective options. Its Orange package costs just $35 a month and gets you all the games on ESPN and ABC (the latter thanks to simulcasts on ESPN3).Better still, Sling is offering new subscribers a fantastic bargain - right now you can get a whole month of Sling Orange for $10. The package also includes TNT, Nick Jr. and plenty more, and unlike cable, you can cancel your subscription at any time.Another solid choice is fuboTV, which is an even more fully-featured streaming service that offers ESPN, ABC and more than 120 other channels. Packages start from $64.99 a month and there's even a FREE fuboTV trial you can try to see if it's right for you.Underlying its reputation as the broadcaster of choice Down Under for football, Optus Sport has exclusive live broadcast rights in Australia for Euro 2020 matches, including this match which is set to get under way at 5am AEST on Friday morning.And if you're prepared to get up early enough then the great news is that Optus is showing this first game absolutely FREE!For the rest of the tournament. Optus Sport subscription will set you back $14.99 per month, but you can save money by signing up for a longer term, with a three-month plan costing $29.99 and a 12-month pass available for $99.You can stream Optus Sport coverage via your mobile, PC or tablet, and can also access the service on Fetch TV, Chromecast or Apple TV.And if you leave Oz at any point during the tournament, simply use a VPN to tune in as normal on your Optus account. Netherlands vs Austria will be shown live in Canada, along with the rest of Euro 2020, on English-language TSN or French-language TVA Sports.If you get them as part of your cable deal, then you'll just be able to log in with the details of your provider and get access to a Netherlands vs Austria live stream, with kick-off set for 3pm ET / 12pm PT. If you don't have cable, it may make more sense to opt for their digital platforms. The TSN Direct and TVA Sports Direct streaming services each cost just $19.99 a month, and work across a range of devices, including phones, computers and tablets.And don't forget that using a VPN is the way to get a Euro 2020 live stream if you're away from Canada when the game you want to watch is on.Kiwis can watch all the Euro 2020 action on Sky Sport.As you'd expect, there's a somewhat inconvenient kick off time for this match in New Zealand, with Netherlands vs Austria set to start at 7am NZST on Friday morning.You can get Sky Sport in New Zealand as part of a range of pay TV packages, and subscribers can watch online via the Sky Go service.If you're not already a customer, you can try the Sky Sport Now streaming-only platform, which costs $19.99 for a weekly pass and works across a wide range of devices, including phones, laptops, Apple TV and Chromecast.Anyone in New Zealand from abroad or vice-versa can use the VPN route outlined above to access their service of choice just like they would at home.Sign up to get breaking news, reviews, opinion, analysis and more, plus the hottest tech deals!Thank you for signing up to TechRadar. You will receive a verification email shortly.There was a problem. Please refresh the page and try again.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\nFuture Publishing Australia ABN: 96 734 906 323 | PO Box 1077, Mount St,\nNorth Sydney\nNSW 2059. ", "Section": "", "Writers": "", "URL": "https://www.techradar.com/sg/news/netherlands-vs-austria-live-stream-how-to-watch-todays-euro-2020-match-free-and-from-anywhere", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}