{"Type": "", "Time": "2021-06-17", "Headline": "Indonesian businessman on the run for 13 years fined by Singapore for immigration offences, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - An Indonesian businessman on the run for 13 years over corruption and illegal logging in his country has been caught and dealt with by Singapore authorities for immigration offences.Adelin Lis committed immigration offences in Singapore and was convicted of making false declarations to obtain a visit pass on multiple occasions in 2017 and 2018, the Immigration and Checkpoints Authority (ICA) said on Thursday (June 17) in response to queries by The Straits Times.On June 9 this year, he was fined $14,000 for his offences, said ICA.   Court documents state that he was arrested on May 28, 2018.According to charge sheets seen by ST, the 63-year-old had falsely declared in his disembarkation form that he had never used a passport under a different name to enter Singapore.Adelin pleaded guilty earlier in a Singapore district court to four immigration-related charges.Eleven other charges, including for using an Indonesian passport with the name \"Hendro Leonardi\" and a different birth date to enter Singapore, were taken into consideration by the court during Adelin's sentencing.Indonesia's Attorney-General's Office (AGO) said in a statement on Wednesday that the Singapore authorities had checked with the Indonesian embassy in Singapore if the two names - which shared the same immigration data - referred to the same person.\"Based on the data available at the Directorate-General of Immigration, it is confirmed that the two people are the same,\" said AGO spokesman Leonard Eben Ezer Simanjuntak.In his home country of Indonesia, Adelin was notorious among environmentalists as the destroyer of forests in Sumatra.\"He's a big fish. His business in the downstream and upstream logging sector and his illegal logging activities, including business in oil palm plantations, have destroyed forests and caused state losses,\" Mr Arie Rompas, forest campaign team leader of environmental group Greenpeace Indonesia, told The Straits Times.Mr Leonard said Adelin has been a fugitive since 2008 and was listed on the Interpol Red Notice.In August 2008, Indonesia's Supreme Court found him guilty of corruption and illegal logging in North Sumatra province, and sentenced him to 10 years in prison and a fine of 110 billion rupiah (S$10 million).The verdict overturned a previous acquittal by a lower court, Medan District Court, in November 2007 which had sparked public outcry nationwide on concerns that witness testimonies were not properly considered by the judges and field investigation was lacking.Adelin, the son of the owner of PT Mujur Timber, a wood-processing company in Sibolga, North Sumatra, has been on the wanted list of the North Sumatra Prosecutor's Office since July 2012.Mr Leonard also said Adelin and his bodyguards had resisted arrest at the Indonesian embassy in Beijing in 2006, beating up the embassy staff before fleeing.As such, Indonesia's Attorney-General hopes the Indonesian law enforcement officers will be allowed \"a special pick-up of this high-profile fugitive\" from Singapore, he added.According to the ICA, the Indonesian embassy had offered to repatriate Adelin to Indonesia via private air transportation on June 16.\"However, ICA had declined this arrangement as the repatriation of all undesirable foreigners is independently conducted by Singapore authorities,\" the ICA spokesman said.\"In accordance with ICA's established procedure, Adelin Lis will be repatriated to his country of origin as soon as his commercial flight arrangement is confirmed.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/businessman-who-fled-indonesia-for-13-years-caught-and-dealt-with-by-singapore-for", "Source": "google"}