{"Type": "Sport", "Time": "2021-06-18", "Headline": "Football: What next for Sergio Ramos after Real Madrid departure?", "Text": "SEVILLE: Sergio Ramos declared on Thursday that leaving Real Madrid had never been on his mind but he must now find a new destination after ending a 16-year, silverware-laden era with the Spanish side.Ramos recently turned 35 and had a season littered with injuries which led to him being left out of Spain's Euro 2020 squad, but said he wants to keep proving himself at the highest level.Yet only a few European clubs could afford his high wage demand, reported by newspaper Marca to be 12 million euros per year.Paris St Germain could be a good fit for Ramos given the club's resources and the French side could certainly do with the personality of the four-time Champions League winner to help them finally get their hands on club football's holy grail.Manchester United and Manchester City are two of the few Premier League clubs that could afford his high salary.City, however, are well equipped in central defence and the Spaniard might also struggle in a high defensive line favoured by coach Pep Guardiola.Ramos held talks with United in 2015 before eventually opting to stay at Real. While his salary demands remain the same, he is now six years older and there are increased questions about his fitness.Manuel Flores, a resident of Camas, the Seville district where Ramos grew up, said Paris would suit the defender better than Manchester as it would be closer to Spain, where his wife Pilar Rubio works as a television presenter.\"I don't see him going to England,\" said Flores, adding the 2010 World Cup winner had put the district on the map.But while he felt a sense of pride in sharing a hometown with Ramos, Flores said the player was not overly loved locally after an acrimonious split from Sevilla to join Real in 2005.And on a rainy afternoon in Camas, the overall feeling among locals approached by Reuters was one of indifference towards their most famous son.Flores said he would love to see the player return to Sevilla but Ramos quashed hopes of a homecoming in his farewell press conference while also ruling out joining Real's rivals Barcelona, declaring: \"It is a resounding no, so you can all relax.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "sports,Sergio Ramos,Real Madrid,Spain", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/soccer-what-next-for-sergio-ramos-after-real-madrid-departure--15037510", "Source": "google"}