{"Type": "", "Time": "2021-06-18", "Headline": "Easing COVID-19 emergency a boost for Japan's summer gasoline demand | S&P Global Platts", "Text": "Voluntary carbon markets have seen significant growth in recent years and are expected to surge in...A new wave of LNG importers borne out of China's gas market reforms is the new growth opportunity in...Brazil's total ethanol inventories were at 3.34 billion liters as on May 31, a plunge of 28% from a...Easing COVID-19 emergency a boost for Japan's summer gasoline demandShipping market faces logistical challenges as India continues fight against COVID-19 pandemicPlatts Market Data – Oil37th Asia Pacific Petroleum (APPEC 2021)Analysis: China's new crop of LNG buyers complicates Qatar's long-term sales strategyInsight Conversation: Toby Ferenczi, founder, EnergyTagJapan lifting 9 out of 10 prefectures from state of emergency June 20July gasoline demand seen rising by around 3% on year: sourcesJapan's refinery outage will soon be eased to 685,000 b/dJapan's easing of COVID-19 emergency restrictions will boost the gasoline demand in July, when the country kickstarts the summer driving season, but the expected transport restriction for the Tokyo Olympics sent mixed signals for the fuel demand.\r\n    Receive daily email alerts, subscriber notes & personalize your experience.\r\n  Japan decided June 17 it will lift its state of emergency measures on nine out of 10 prefectures when it expires on June 20 but will place Hokkaido, Tokyo, Aichi, Osaka, Hyogo, Kyoto and Fukuoka under its COVID-19 priority measures, together with Saitama, Chiba and Kanagawa until July 11.The state of emergency measures on Okinawa will remain until July 11 but the state of emergency on Okayama and Hiroshima will be lifted on June 20. The priority measures on Gifu and Mie will also be lifted. This means 56% of Japan's population will be under the priority measure, with the state of emergency on Okinawa, accounting for 1% of the population.\"With the easing of state of emergency measures, we expect to see sequential improvement of gasoline demand over the next couple of months,\" said JY Lim, oil markets adviser at S&P Global Platts Analytics.\"The summer Olympics will also provide some support, but impact will likely not be significant due to the restriction on non-athlete attendees. Overall, we expect to see gasoline growing by 2.5% this year, but still down by 5.7% when compared to pre-COVID levels,\" Lim said.Japan's gasoline demand is expected to recover in July on the back of gradual improvement in the pandemic situation and an increase in personal mobility due to the Olympics, among other factors, Petroleum Association of Japan President Tsutomu Sugimori said June 16.\"Speaking of the demand after July, it is difficult to foresee on a year-on-year comparison basis, however, we expect the gasoline demand to recover from May-June, when it stood at around 90% of the level comparing with the pre-coronavirus pandemic time,\" Sugimori said.Japan's gasoline demand is estimated to have fallen by 5% year on year in June and down 9% from June 2019 after marking a 14% year-on-year jump in May, when it was down 12% from the same month two years ago, according to Sugimori, who is also chairman of Eneos Holdings, the parent of largest Japanese refiner Eneos.\n\nJapanese refiners and market sources surveyed by S&P Global Platts said June 17 that Japan's July gasoline demand will mark a month-on-month increase and is expected to be between flat year on year to rising 3% from a year ago, taking into account the coronavirus pandemic and the Olympics situation.Still, the Japanese sources had split views over the likely impact on gasoline demand from the Olympics, which starts on July 23, with some expecting demand to increase, while others saw a negative impact from the various traffic restrictions.Although Japan's gasoline demand is expected to increase in July due to easing COVID-19 emergency measures and the start of the Olympics, regional industry sources expect the impact to be minimal amid bearish fundamentals.Japan's refinery outage will also soon drop to 685,000 b/d, or 19.8% of the total installed capacity when Eneos restarts its sole 141,000 b/d crude distillation unit at the Sakai refinery in western Japan in late June, according to Platts calculations.\"Japan gasoline imports are of a very specific grade which does not represent the wider pool of gasoline in Asia. So even if Japanese refiners increase their buying by 2-3 MR cargoes, the overall support is limited,\" one Singapore-based trader said.Japan driving activity as of June 15 was recorded 17% above baseline levels, still lower than the peak of over 100% above baseline levels recorded in end-April, according to mobility data from Apple.\"Southeast Asian buyers such as Vietnam, Indonesia and Malaysia are not pulling as much cargoes due to new spikes in COVID-19 cases. This is having more of an impact demand-wise on Asian gasoline,\" the trader said.Reflecting the weaker motor fuel complex, the FOB Singapore 92 RON gasoline crack against front month ICE Brent crude futures was assessed at $4.95/b on June 17 close of Asian trade, down from the $6.21/b average assessed in May, Platts data showed.\r\n          To continue reading you must login or register with us.\r\n        \r\n          It’s free and easy to do. Please use the button below and we will bring you back here when complete.\r\n        ", "Section": "", "Writers": "", "URL": "https://www.spglobal.com/platts/en/market-insights/latest-news/oil/061721-easing-covid-19-emergency-a-boost-for-japans-summer-gasoline-demand", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}