{"Type": "", "Time": "2021-06-18", "Headline": "Founder of student care centre jailed for forgery, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A 51-year-old man, who previously was in the news for starting an after-school care centre for underprivileged children, pleaded guilty on Thursday (June 17) to six charges, including for forgery relating to applications for student care subsidies.Shaik Ismail Mohd Ali was jailed for a year and three weeks.Seven other charges, including for forgery, were taken into consideration by District Judge Ronald Gwee during sentencing.Shaik and the after-school care centre he founded, Impresario Learning Lab, were featured in a Straits Times report in 2015. The centre, which has since ceased operations, focused on learning through play, with video game sessions, percussion classes and swimming lessons among the activities available. The fee, including the cost of percussion and swimming lessons, was $300 a month.Some time before July 1, 2014, Shaik was authorised by the mother of a girl attending the centre to apply for student care subsidies for her daughter. He was aware that the girl’s household was not eligible for the subsidies as the mother was not working. Shaik forged a document stating that the mother had been employed by her neighbour as a babysitter or nanny, and was drawing a monthly salary of $400. He then used the document as part of the application to the Ministry of Social and Family Development (MSF).In October that year, he filled in a subsidy renewal form in the mother’s name, using her signature that he had scanned from the application form.He later submitted the renewal form, along with supporting documents such as the forged employment document, to MSF.The court heard that Shaik dishonestly induced MSF to disburse about $6,900 in subsidies between July 1, 2014 and July 1, 2016.He has not made any restitution to date.Shaik also committed an offence of criminal intimidation on the evening of Sept 3, 2019.On that day, he became engaged in a heated verbal exchange with his stepson at the entrance of a flat. Court documents did not state who the flat belonged to, or if both men were staying there.\nShaik, who was outside the flat, had asked his stepson to hold his hand and hug him, but the latter refused.He later shouted: “Should I just burn the house down? Should I do it tonight?”Shaik continued shouting after his stepson called the police.He also banged on the flat’s gate and window before leaving.The court heard that he was observed to be drunk then.Anyone convicted of forgery for the purpose of cheating may be jailed for up to 10 years and fined.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/former-principal-of-student-care-centre-jailed-for-forgery", "Source": "google"}