{"Type": "", "Time": "2021-06-18", "Headline": "Editorial: The Supreme Court saved Obamacare for the third time. It should never have had to", "Text": "In rejecting yet another in a seemingly endless series of Republican attacks on the Affordable Care Act, a divided Supreme Court did more than just preserve a crucial protection for millions of Americans with preexisting health conditions that make them vulnerable to gouging or exclusion by insurers. It also preserved the notions that people have to be injured in order to sue and that Congress, not the courts, write the laws in this country.Writing for a 7-2 majority Thursday, Justice Stephen G. Breyer held that the two individuals and 18 Republican-controlled states behind the lawsuit  hadn't shown that a change Congress made in the ACA in 2017 was responsible for the financial harm they claimed to have suffered. The court ordered the case dismissed.In so doing, the justices rejected the lawsuit's invitation to speculate about what Congress might have intended or what Congress would have done when lawmakers' actions were clear. Congress has voted over and over again not to repeal or even rework the 2010 healthcare law, so it's not the courts' place to refashion it as they see fit.At issue in California vs. Texas was the law's mandate that adults obtain health insurance, which is enforced by a tax penalty, not by civil or criminal fines. Opponents of the mandate challenged its constitutionality right after the law was passed, but a sharply divided Supreme Court held in 2012 that it was a lawful exercise of Congress' power to tax.Once Republicans took control of the House, the Senate and the White House in 2017, GOP lawmakers offered several bills to repeal or replace the ACA, but Congress rejected all of them. Instead, it eliminated the tax penalty for not obtaining insurance, leaving the ACA's many other provisions intact. Among those left standing are requirements that insurers in the individual market — where people not covered by an employer's health benefits shop for coverage — accept all applicants and charge all enrollees in a certain geographic area the same premiums regardless of their health, adjusting only for age and tobacco use, and that insurers offer comprehensive policies that don't exclude coverage for 10 fundamental categories of care.Those provisions guarantee that people with preexisting conditions are protected against discrimination in the individual market, just as they have been when covered by employers' group plans. Republican lawmakers have said repeatedly that they want to protect Americans with preexisting conditions, but the lawsuit brought by a group of GOP state attorneys general and two individuals put the lie to that assertion.The suit claimed that because Congress eliminated the penalty for failing to buy insurance, the individual mandate was no longer a tax and was therefore unconstitutional. And because the mandate is the centerpiece of the law's insurance reforms, the lawsuit claimed, the entire law had to be deep-sixed.But it was an exercise in sophistry that begged the federal courts to engage in the worst form of judicial activism: ruling that Congress intended to do something it patently did not, and then rewriting the law to match the judges' assumptions. And sadly, two lower courts fell for it in whole or in part, setting the stage for the justices to weigh in.The high court did what the lower courts should have done. It observed that neither the states nor the individuals had shown any harm, or prospect of harm, suffered as a consequence of Congress enacting what amounted to a tax cut. And with no harm, there can be no lawsuit.This should have been obvious from the get-go. No one can claim with a straight face to be injured by Congress' decision to reduce the penalty to zero. It's a tax with a 0% rate — what's not to like?It's equally stupefying that a judge would find, as U.S. District Judge Reed O'Connor of the Northern District of Texas did, that Congress killed the entire law when it neutered the mandate. For one thing, the mandate has nothing to do with the law's premium subsidies and its extension of Medicaid to more low-income Americans, among other major provisions. For another, Congress clearly did not intend to repeal the ACA — instead, it voted multiple times not to do so. And third, the ACA marketplaces around the country have continued to function well without the tax penalty, proving that it's hardly an indispensable piece of the law's reforms.It is true, as Justices Clarence Thomas observed in a concurring opinion and Samuel A. Alito Jr. in a dissent, that the mandate to buy insurance was initially seen as indispensable to a central part of the law: the new insurance marketplaces, with premium subsidies for low- and moderate-income consumers. Supporters argued the first time the high court took up the issue that the marketplaces could collapse without the mandate because younger, healthier people would gradually stop buying coverage, causing premiums to spiral upward. But what we've seen since 2017 is that the subsidies are the key to sustaining the marketplaces, not the mandate.The ACA has grown in popularity in recent years, and it won over more doubters during the pandemic, when it provided a crucial safety net to hundreds of thousands of laid-off workers who lost their employer-sponsored coverage. In California alone, enrollment through the state's ACA-based marketplace surged by 200,000 above the previous year's pre-pandemic enrollment period.The relief suggested by the lower courts — tossing out the entire law or just the insurance reforms at its core — would have ripped that safety net to shreds. It also would have inflicted grave damage to the notion that Congress writes the laws.This story originally appeared in Los Angeles Times.The Supreme Court on Thursday released its highly anticipated decision on a challenge to the Affordable Care Act (ACA), also known as Obamacare. By a 7-2 vote, the court rejected the Republican-led challenge to the law.The pair felt so inspired by their energy on the talk show that they headed straight to the studio to record a new tune after their interview.Get the best information at your fingertips, here. Yahoo Search provides quick and efficient solutions for all your needs.The $1 trillion bipartisan infrastructure deal being hammered out in the Senate got a boost Wednesday as 21 Democratic and Republican senators publicly backed the framework. “We support this bipartisan framework that provides an historic investment in our nation’s core infrastructure needs without raising taxes,” the senators said in a joint statement. “We look forward to working with our Republican and Democratic colleagues to develop legislation based on this framework to address America’s criCelebrities like George and Amal Clooney, Tyler Perry, and Orlando Bloom have offered their support to the Duke and Duchess of Sussex.McDonald's CEO Chris Kempczinski also talked about wages, the restaurant recovery, and the plant-based meat trend at the CNBC Evolve Global Summit.Our technology will match you with the best lenders at super low rates. Trusted by over 15 million. Save thousands each year. (1.97% APR)Republicans tried for a third time to kill Obamacare and fell short.Little said Idaho would support efforts by Texas and Arizona governors to secure the Southern border.The Jacksonville 14-year-old faces a charge of culpable negligence after reportedly leaving out the gun that the young boy later found.Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.The first astronauts for China's new space station blasted off on Thursday for the country's longest crewed mission to date, a landmark step in establishing Beijing as a major space power. The trio launched on a Long March-2F rocket for the Tiangong station, where they will spend three months, in a much-anticipated blast-off broadcast live on state TV. Lift-off happened at 9:22 am (0122 GMT) from the Jiuquan launch centre in northwest China's Gobi desert, with the rocket rising in clouds of smokThe Trump administration tried to block Bolton from publishing the book, which portrayed Trump as erratic, uninformed and driven by self-interest.“That was a typo that was corrected,\" said Republican Party of Florida Executive Director Helen Aguirre Ferré.New research has identified TEN favorite stocks for the upcoming yearThe two-time Olympic gold medalist has reinvented herself as a distance runner and is making a last-gasp bid to qualify for Tokyo in the 5,000 meters.Hillary Clinton claimed that Russian president Vladimir Putin “made it his mission to deny me the presidency” when she ran against Donald Trump in 2016.President Biden's firm hand in dealing with Vladimir Putin marked a departure from the nauseating acquiescence our previous president displayed when meeting with the Russian leader. #Colbert #Comedy #MonologueThis small company behind it is sparking a potential 20,300% market surge. Click here for details.Passionate collectors told Insider that streaming movies lack things like quality and nostalgic appeal that comes with physical copies.Now you can match your swimsuit to your cell phone.Amid strong political pressure to pack the Supreme Court, President Biden formed a commission to study ways to reform the court. Mandel Ngan/AFP via Getty ImagesIn late 2020, President Donald Trump nominated conservative jurist Amy Coney Barrett to the U.S. Supreme Court. She was quickly confirmed to fill the seat previously held by the late Ruth Bader Ginsburg. Many liberals feared the court was becoming too conservative and called on then-candidate Joe Biden to “pack the court” by adding new sHIV-1 indicators may be more subtle than you think. Take a look at HIV-1 warning signs and symptoms.Gavin Grimm’s lawsuit drew headlines in 2016 when the Supreme Court initially agreed to hear it. A change in presidents has brought the case back.Sen. Kyrsten Sinema was the only Democrat absent from Vice President Kamala Harris’s bipartisan dinner for women of the Senate.Jadeveon Clowney has been in the league since 2014. He’s also on his fourth team in the last four years, having gone from Houston to Seattle, Tennessee, and now Cleveland. But for all his experience and former teammates, Clowney sees someone unique in defensive end Myles Garrett. “It’s funny, I haven’t run into many guys [more]", "Section": "", "Writers": "", "URL": "https://news.yahoo.com/editorial-supreme-court-saved-obamacare-152924975.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}