{"Type": "", "Time": "2021-06-18", "Headline": "Opinion: The real culprit for the selloff in the stock market? Hint: It wasn’t the Fed - MarketWatch", "Text": "CHAPEL HILL, N.C. (MarketWatch)—The real cause of the air pocket the stock market hit this week was excessive bullishness.That’s not the prevailing narrative, of course. The almost universal blame is being put on the Federal Reserve’s rate-setting committee for accelerating its road map for raising rates.Yet that acceleration does not, in and of itself, justify a significant revaluation of equities’ value—a revaluation that took nearly 400 points off the Dow Jones Industrial Average \n        DJIA,\n        -0.62%\n       in the immediate wake of that meeting. The Dow was down more than 200 points at midday on Thursday. In fact, the present value of stocks’ expected future earnings and dividends barely changed after the Fed’s meeting. Both before and after that meeting, the median expectation of members of the Fed’s interest-rate-setting committee has been that the federal funds rate would rise to 2.5% when economic conditions returned to normal. The sole thing that changed was whether that increase would begin no earlier than 2024, which was the prior expectation, or instead start in 2023—with the fed funds rate rising modestly to just 0.50% by year’s end.Be my guest calculating the impact that single change has on the present expected value of the stream of a stock’s future earnings and dividends. John Graham, a finance professor at Duke University’s Fuqua School of Business, said in an interview that it’s “minimal.”I submit that the real culprit behind Wednesday’s selloff was the excessive bullishness that prevailed before the meeting. When there’s too much optimism, even the slightest provocation can cause significant disappointment. To explain the market’s reaction, therefore, we must turn to contrarian analysis rather than fundamental analysis.Consider how bullish the several dozen Nasdaq-focused \n        COMP,\n        +0.87%\n       market timers I monitor were before Wednesday’s meeting. As you can see from the accompanying chart, their average recommended equity exposure (as represented by the Hulbert Nasdaq Newsletter Sentiment Index, or HNNSI) had climbed into the upper shaded zone—which means that it was higher than 90% of all daily readings since 2000. The stock market historically has struggled in the wake of HNNSI readings this high—regardless of what the financial headlines were on each of those prior occasions.The good news is that, in the wake of the stock market’s midweek drop, the market timers began to quickly retreat from their erstwhile bullishness. To the extent they continue their retreat, odds increase that the market’s decline will be modest and short-lived. A strong contrarian trading buy signal will come when the HNNSI drops into the lower gray zone on the chart—representing the lowest 10% of the historical distribution.As you can see from the chart, however, the last time that happened was at the bottom of the market’s waterfall decline in March of last year. Since then the market timers on balance became only moderately bearish as the market declined, and instead were quick to turn bullish again when the market showed any sign of strength.As I argued in a column at the beginning of this month, this behavior points to a trading-range market—in which both rallies and declines are subdued. What we’ve seen since then suggests this trading range will continue for at least a while longer.Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.comDon’t get too optimistic about a stock market rally—they’ve been fizzling outFed, alert to risks of higher inflation, now sees two interest rate hikes in 2023Gold tumbles to under $1,800 an ounce after Fed ups inflation forecasts but signals higher interest ratesHeavy insider selling is a warning sign that a stock's price is inflated.Mark Hulbert is a columnist for MarketWatch. His Hulbert Ratings service tracks investment newsletters that pay a flat fee to be audited.", "Section": "", "Writers": "", "URL": "https://www.marketwatch.com/story/the-real-culprit-for-the-selloff-in-the-stock-market-hint-it-wasnt-the-fed-11623946624", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}