{"Type": "", "Time": "2021-06-17", "Headline": "Major banks, airlines in Australia, U.S. report online outages - Japan Today", "Text": "\nJapanToday\nHigashi-Azabu IS bldg, 4F\n\t\t\t\t\t1-8-1 Higashi-Azabu\n\t\t\t\t\tMinato-ku\n\t\t\t\t\tTokyo 106-0044\n\t\t\t\t\tJapan\n\t\t\t\t\tTel: +81 3 5561 7755\n\t\t\t\t\tFax: +81 3 5561 7756\nEmail: editor@japantoday.com\n©2021 GPlusMedia Inc.\nMajor banks and airlines in Australia and the United States suffered brief online outages Thursday, with several blaming an \"external provider\" for the disruption.Most of Australia's major financial firms reported customers could not access websites and mobile apps, while website Downdetector said a slew of U.S. airlines were also affected.American, Delta, United and Southwest airlines were among them, although all four websites appeared to be working shortly after.The issues appeared to be more prolonged in Australia -- where problems hit in the mid-afternoon as much of the rest of the world slept -- with services only slowly returning an hour after the first reports.A spokesperson for ANZ bank told AFP that the incident was \"related to an external provider\" but that \"connectivity was restored quickly and the most impacted services are back online\".Australia's largest financial firm Commonwealth Bank told AFP that it and many of the country's major banks had been affected.Westpac and ME Bank also reported problems with their mobile apps or online banking products, while customers for St. George and several regional banks reported they were down too.The outages began around 2:10 p.m. Sydney time and did not appear to be limited to the banking sector.Airline Virgin Australia posted to Twitter: \"We are currently experiencing a system outage which is impacting our website and Guest Contact Centre.\"Australia Post, the country's postal service, said some services were hit by an \"external outage\".Earlier this month major US media and government websites, including the White House, New York Times, Reddit and Amazon were temporarily down after a glitch with cloud computing services provider Fastly.The company offers a service to websites around the world to speed up loading time for websites.A series of high profile hack-for-ransom attacks have also left corporations around the world jittery over cybersecurity risks, although there was no indication the latest problems were caused by malicious actors.Colonial Pipeline was briefly shuttered after an attack in May, and JBS, the world's largest meat producer, was forced to stop operations in the United States and Australia.Both firms reportedly paid ransom to get operations back up and running.The issue of cybersecurity was at the top of the agenda when US President Joe Biden and his Russian counterpart Vladimir Putin met in Geneva this week.Washington believes hackers who have extorted hundreds of millions of dollars from Western governments, companies, and organisations operate from Russian soil.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberDamn, hijacked and black mailed and paying ransoms ..............................not goodRussians. They're no fan of Australia.Either Russians laughing at Ol' Joe or Chinese looking to inflict more pain on Oz.Hackers Russians, Thieves Chinese, Thieves plus hacker NKIn all likelihood the outage was not caused by hacking.  All of the affected firms used a Content Delivery Network (CDN) called Akamai.   They are an \"edge platform\", cybersecurity and webhosting service. Rather than hoset sites on a single centralized server, edge platforms have many, sometimes dozens of servers around the world.  Content is accessed from the geographically closest server so response time is minimized.  The problem with these is the software to accomplish this is complex and a simple configuration change from a normal update or fixit build can crash the system.  That is pretty much what caused a similar edge platform Fastley to crash last week.The problem with these is the software to accomplish this is complex and a simple configuration change from a normal update or fixit build can crash the system.That's not a problem. The strength of these systems is that they can control wide ranges of configuration with a single fix/push. Without that, the complexity would become unmanageable. Their goal is to have fail safes to ensure that no is able to push anything that could crash the system, as happened this time. This was a bug that no one had thought of ahead of time, which has now been fixed. They will have built in tests to ensure it cannot happen again (unless they are entirely incompetent). Someone may say \"yeah, but these bugs can happen again\", and they'd be right. But that would also be ignoring that these CDN's run 24 hours a day, serving 10s of thousands of sites, with a set of fail safes that enable their service to run almost never having disruptions like this. This is an anomaly, not the standard. We shouldn't define something by its outliers.This is an anomaly, not the standard. We shouldn't define something by its outliers.Fastely's analogous problem last week has been traced to poorly written configuration change that misrouted traffic leading to a crash.  The cause of yesterdays problem at Akamai hasn't been publicly announced. The point I was making is that in all likelihood what happened yesterday was not due to hacking but due to a software problem.  Incidentally CloudFlare had a similar problem a year ago.  Many who post here are predisposed to assume any internet problem is the result of hacking and overlook the more prosaic causes of these problems.Use your Facebook account to login or register with JapanToday. By doing so, you will also receive an email inviting you to receive our news alerts.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberA mix of what's trending on our other sites\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t", "Section": "", "Writers": "", "URL": "https://japantoday.com/category/tech/major-banks-airlines-report-online-outages", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}