{"Type": "Sport", "Time": "2021-06-18", "Headline": "Football: Dumfries the main man as Dutch start to think big", "Text": "AMSTERDAM: Netherlands defender Denzel Dumfries has taken Euro 2020 by storm, having scored twice, set up another two goals and earned a penalty, all in two games.As the Dutch earned their knockout stage spot with aconvincing 2-0 victoryover Austria on Thursday, man-of-the-match Dumfries was on target for their second goal, settling nerves as the Austrians pressed for an equaliser.He had earlier been awarded a penalty for a foul by David Alaba and Memphis Depay converted it to earn the hosts an 11th-minute lead.The 25-year-old PSV Eindhoven defender, who made his professional debut seven years ago but did not come out of the youth system of any of the big Dutch clubs, was indefatigable as the Netherlands looked for their first knockout spot in a major tournament since the 2014 World Cup.They had missed out on Euro 2016 and the 2018 World Cup after failing to qualify but Dumfries is giving them hope this could be a successful tournament for the 1988 European champions.\"2 wins, 6 points 1 Dumfries=Qualification,\" fellow defender Patrick van Aanholt tweeted.Dumfries locked down his side of the pitch as the Austrians, also looking for a second group win that would have sent them through, struggled to break down the Dutch defence.His modern right wing back role gave him the opportunity to find space and create passing options as the Dutch controlled the game throughout and he also adding blistering pace to his team's attacks.That was demonstrated when Dumfries raced clear and tapped in a pass from Donyell Malen to kill off the game in the 67th minute, becoming only the second Dutch player to score in his first two European Championship games, after prolific striker Ruud van Nistelrooy.It is not the first time that Dumfries defied expectations after being plucked out of the amateur leagues as an 18-year-old and making the Dutch national team only four years later.\"It's starting to feel like a fairytale. We are really growing, it feels good,\" Dumfries said.A transfer target for major clubs before the tournament, Dumfries will now see his shares on the football stock market rise sharply as he leads his country to the sharp end of the tournament.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Netherlands,sports,Denzel Dumfries,Euro 2020", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/euro-2020-dumfries-the-main-man-as-dutch-start-to-think-big-15037864", "Source": "google"}