{"Type": "", "Time": "2021-06-17", "Headline": "COVID quarantines confusing, inconsistent: Singapore residents", "Text": "SINGAPORE — Inconsistent and sometimes conflicting information given by officials enforcing quarantine orders (QOs) has left some Singapore residents alarmed at the lack of clear communication and apparent gaps in procedures. Two women who were recently quarantined – one of them alongside her family and helper – told Yahoo News Singapore that they found their recent experiences confusing and frustrating. Multiple online comments by others who have served quarantine also suggest that the women's experiences are not unique. \"The whole thing felt a shambles,\" said Elaine (not her real name), a 35-year-old employment pass holder with a background in healthcare. \"Everyone in this new world is working as hard as they possibly can. But they (personnel overseeing quarantine orders) need better leadership and better communication.\"After going for a family staycation at a hotel from 7-9 May with her husband and two children aged one and four, Elaine was notified via text on 14 May of possible exposure to a COVID case at the hotel pool. The family and their helper were then issued a seven-day quarantine order by Certis officers.Over multiple calls with Certis officers about whether the family home was suitable for quarantine and when their swab tests were taking place, the overall impression Elaine had was of a \"disorganised\" effort. \"The next day, someone turned up with a quarantine order and armbands (which we had to wear). They installed these little black boxes, which work in tandem with the RFID in the armbands,\" recalled Elaine. \"We said we already had the Home app, where you can log your temperature three times a day and it tracks your location. It felt like we were criminals.\"Elaine and her two children were eventually conveyed to a hospital for swab tests, but not her husband. Certis officers were \"unhelpful\" when she called the local security company and asked why. \"When we called MOH (Ministry of Health), they were much more helpful and sent a nurse around to do swab tests.\"She added, \"Literally no one told us what would happen if we tested positive. We were really worried that the kids might be taken away from us if they were positive.\"After multiple calls, Elaine obtained negative results for herself and her boys, while the results for her husband and helper came two to three days later. On 15 May, a day before the QO was to end, a nurse was sent to their home, after Elaine had made multiple calls to MOH to clarify her family's quarantine status, to conduct swab tests. Her one-year-old son was not tested for a second time as the nurse said it was not necessary. \"They told us we would be fine as long as we didn’t get a positive,\" said Elaine, who was informed of her four-year-old son's negative test results on 17 May. However, the next day, there was a knock at the door in the morning. \"My helper was given a document by a Certis officer, and she felt she had to sign it. They didn’t tell her what it was for. It was an extension of my one-year-old boy's QO. I called MOH, and they couldn’t give me any info,\" said Elaine, who noted that the family had been to multiple places since the end of their quarantine. Her husband took their younger son to get tested, where he was told that the extension was likely due to the fact that the boy had not been tested when the family was let out of quarantine. The boy was eventually cleared.\"The lack of communication is very frustrating. It really impacts your anxiety levels,\" said Elaine. A 37-year-old lawyer who only wished to be known as Ms Wang also endured a \"frustrating and confusing\" experience after being issued a QO from 18-25 May, following her possible exposure to COVID-19. Having confined herself to her room, the mother of two was informed that Certis officers would assess her home for quarantine suitability but no one turned up. At the end of the QO, having received a negative swab result on 21 May, she interacted with her family members.On 26 May, she received an SMS telling her to go for a swab test and that she had been issued another QO from 20-29 May. After numerous calls to the Certis hotline, Ms Wang was told that her QO would be rescinded if she were to get a negative swab result.The following day, despite her HealthHub app displaying a negative result, a Certis officer came to issue her the new QO. She was then told by two other officers over the phone that the negative result was invalid as her quarantine had been extended and she needed another swab. After multiple calls, her QO was finally rescinded in the evening.\"You basically have to keep calling until you find someone helpful,\" said Ms Wang, who was in a \"state of anxiety\" for fear of possibly infecting her family members. \"The communication is abysmal. I understand that they need to do this, but they need to manage the process properly. These are people’s lives.\"Alluding to Prime Minister Lee Hsien Loong's remarks last month that the government will take a more aggressive approach to testing and quarantine, she added, \"The current process already seems overstretched. I think it would be so easy to improve this just by being clear. If you tell people what to expect, there won’t be so much anxiety.\"As neither woman wanted to be identified, their detailed accounts and personal details could not be shared with the MOH.Yahoo News Singapore asked MOH about the volume and nature of complaints it has received regarding the serving and enforcement of QOs during Phase 2 (Heightened Alert), which lasted from 16 May to 13 June. In light of PM Lee's remarks on more aggressive testing and quarantine, the ministry was also asked if it is confident that it has sufficient resources to test and quarantine potentially thousands more.In response, an MOH spokesperson said that extensive contact tracing, including leveraging on TraceTogether and SafeEntry records, is a key strategy to cast a wide net to isolate and ring-fence any possible emerging transmissions in the community.The spokesperson noted that \"wider rings\" are being drawn around cases to combat the more transmissible strains, while more people are now using TraceTogether and SafeEntry, which provides MOH with more data for contact tracing and quarantine. \"This has led to a higher number of persons under quarantine (PUQs), resulting in delays in the testing and conveyance to quarantine facilities,\" said the ministry. \"We seek the public’s understanding and patience. We will continue to improve our operating processes and improve communications between the various agencies involved in managing the quarantine process.\"Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeRelated stories:COVID swab test personnel not trained to deal with special needs people: Rahayu Mahzam9 of 14 new COVID cases in Singapore linked to Bukit Merah View Market clusterA fifth of asymptomatic Covid patients develop long Covid: studyGlobal stocks were mixed on Thursday as traders digested the Federal Reserve's move to bring forward its forecasts for hiking interest rates as the economy recovers.Beijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityNew $89 Portable Air Cooler Everyone In The U.S. Is Talking AboutThe PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saChinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Every PC user must read this in 2021 - Do it now.Browsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.The strategic partnership sees EMERGE working with Mediacorp's Bloomr.SG network to \"develop the knowledge and skills of up-and-coming\" content creators in esports.Italy became the first team to reach the knockout stage of Euro 2020 as midfielder Manuel Locatelli scored twice in a 3-0 win over Switzerland in Rome on Wednesday, while Wales moved to the brink of joining them by beating Turkey.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.China and other nations were attempting to “seize control” of strategically important international organisations so they could be “weaponised”, a new report by the UK parliament’s influential Foreign Affairs Committee said. The report, published Thursday, accused China in particular of “bullying” states to back their position or their candidates for top jobs, using measures including financial leverage “to shift policies away from the cooperation the organisations were created to promote”. TheHong Kong police have for the first time determined the publication of certain newspaper articles to be a national security crime as they arrested the editor-in-chief, publisher and three other executives of Apple Daily whom they held accountable for more than 30 reports calling for foreign sanctions. The force on Thursday cited the publication of the articles – understood to be mostly commentaries and opinion pieces, including several written by the tabloid’s jailed founder and opposition activJapan said on Thursday it will make a vaccine passport available from next month for Japanese travellers, as governments around the world experiment with ways to relaunch tourism and business trips.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.Washington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HousePrime Minister Boris Johnson warned Wednesday he will take \"necessary steps\" to unilaterally alter Britain's post-Brexit trade terms unless the EU changes the way it is implementing them in Northern Ireland.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.China’s economy is getting more globally competitive as a result of its success in managing the coronavirus pandemic, while Hong Kong’s has been dragged down by a deteriorating labour market and a decline in international investment, Switzerland’s IMD business school said in a report released on Thursday. The Chinese economy came in at 16th in the 2021 IMD World Competitiveness Rankings, up from 20th last year, the biggest jump among Asian economies. Hong Kong was ranked at seventh, down from NoThe freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.The Kremlin was guarded about future dialogue with Washington on Thursday, a day after the first face-to-face meeting between Russian President Vladimir Putin and US counterpart Joe Biden.New research has identified TEN favorite stocks for the upcoming yearJust a few weeks ago, ONE Championship announced the signing of Jhanlo Sangiao, the prodigal son of Team Lakay head coach Mark Sangiao. This week, the martial arts organization picked up another rising star from the fabled stable – Jeremy “The Juggernaut” Pacatiw. “I know this is God’s plan. This is the perfect time for … Continue reading \"ONE Championship Signs Second Team Lakay Athlete In Two-Week Span\"Enjoy The Good Life® with Standard Chartered credit cards. Here’s a roundup of the best deals in town when you swipe, tap or click checkout with your Standard Chartered card. With Standard Chartered, you’ll find a card for every need. A fuss-free cashback card with […] The post Standard Chartered Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.Hong Kong police rounded up 79 people in a series of raids that shut down two underground casinos and an unlicensed pub in the span of two hours on Tuesday night. In one raid on a Ko Shing Street flat in Sai Ying Pun, officers found a baccarat table and two large televisions used to play online card games, seizing HK$215,000 (US$27,697) in cash, HK$410,000 in chips and five account books. Sixteen men and six women, aged 31 to 74, were inside the premises when officers from the Western special du", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/covid-quarantine-procedures-confusing-inconsistent-singapore-100905061.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}