{"Type": "", "Time": "2021-06-18", "Headline": "Nadal, Osaka both out of Wimbledon; she'll go to Olympics - Japan Today", "Text": "\nJapanToday\nHigashi-Azabu IS bldg, 4F\n\t\t\t\t\t1-8-1 Higashi-Azabu\n\t\t\t\t\tMinato-ku\n\t\t\t\t\tTokyo 106-0044\n\t\t\t\t\tJapan\n\t\t\t\t\tTel: +81 3 5561 7755\n\t\t\t\t\tFax: +81 3 5561 7756\nEmail: editor@japantoday.com\n©2021 GPlusMedia Inc.\nRafael Nadal and Naomi Osaka are sitting out Wimbledon, leaving the oldest Grand Slam tennis tournament without two of the sport's biggest stars as it returns after being canceled last year because of the coronavirus pandemic.Nadal, a two-time champion at the All England Club, announced via a series of social media posts Thursday that he would also miss the Tokyo Olympics to rest and recover “after listening to my body.”“The goal,” the 35-year-old Spaniard said, “is to prolong my career and continue to do what makes me happy.”Osaka’s agent, Stuart Duguid, said Thursday in an email that the four-time Grand Slam champion does plan to head to the Summer Games after skipping Wimbledon.“She is taking some personal time with friends and family,” Duguid wrote. “She will be ready for the Olympics and is excited to play in front of her home fans.”Osaka is a 23-year-old who was born in Japan to a Japanese mother and Haitian father; the family moved to the United States when she was 3 and she is still based there.Osaka has been ranked No. 1 and is currently No. 2; she is the highest-earning female athlete and was the 2020 AP Female Athlete of the Year. She is 14-3 this season, including a title at the Australian Open in February.Last month, Osaka was fined $15,000 when she didn’t speak to reporters after her first-round victory at the French Open. The next day, Osaka pulled out of the tournament entirely, saying she experiences “huge waves of anxiety” before meeting with the media and revealing she has “suffered long bouts of depression.”In a statement posted on Twitter at the time, she said she would “take some time away from the court now, but when the time is right I really want to work with the Tour to discuss ways we can make things better for the players, press and fans.”Osaka has played at Wimbledon three times, twice exiting in the third round and losing in the first round in 2019.Another Grand Slam title winner, 2020 U.S. Open champion Dominic Thiem, tweeted Thursday that he will not go to the Olympics, saying: “I don’t feel ready to play my best in Tokyo.”Wimbledon, which was called off in 2020 for the first time since World War II because of COVID-19 concerns, begins main-draw play on June 28. The Olympic tennis competition opens on July 24.Nadal lost to Novak Djokovic in four grueling sets that lasted more than four hours in the semifinals of the French Open last week — just the third loss for Nadal in 108 career matches at Roland Garros, where he has won a record 13 championships.That defeat ended Nadal’s 35-match winning streak at the clay-court major tournament and his bid for a fifth consecutive title there.Nadal is tied with Roger Federer for the most Grand Slam titles won by a man with 20; Djokovic went on to win the French Open on Sunday for his 19th major.Nadal’s Slam total includes trophies at Wimbledon in 2008 and 2010. He also owns two Olympic gold medals, in singles at the 2008 Beijing Games and in doubles with Marc Lopez at the 2016 Rio de Janeiro Games, where Nadal was Spain’s flag bearer at the opening ceremony.In 2012, Nadal pulled out of the London Olympics and the U.S. Open because of knee tendinitis.Nadal said having only two weeks between the end of the French Open and the start of Wimbledon this year — normally there are three, but play in Paris was delayed a week because of COVID-19 concerns — “didn’t make it easier” for him to recover from “the always demanding” clay-court season.After the loss to Djokovic at Roland Garros, Nadal pointed to fatigue as an issue for him in the later stages of that match.On Thursday, he explained in one his tweets that avoiding “any kind of excess” wear and tear on his body “is a very important factor at this stage of my career in order to try to keep fighting for the highest level of competition and titles.”A former No. 1-ranked player who currently is No. 3, Nadal is 23-4 with two titles this season in Barcelona and Rome, both on clay courts.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberHappy to hear Noami is taking time off. I hope she decides to extend her break for a long, long, long time.Osaka has played at Wimbledon three times, twice exiting in the third round and losing in the first round in 2019.Smart move for Osaka. The Tokyo Olympics will be played on hard courts, the surface on which she performs best. She’s never performed well on grass (Wimbledon) or clay (French Open).What’s with her handlers & PR people?? ’They’ are creating an image of instability. Just yesterday: - “Osaka still set to play Wimbledon, say organizers“ Jun 17  “Wimbledon organizers say Japanese star Naomi Osaka is still down to play at the Grand Slam event which starts later this month and has not given any indication she will skip it.\nHope she pulls out of the Olympics as a form of protest for the disrespect this has been for the japanese people.snowymountainhellToday  06:50 am JSTWhat’s with her handlers & PR people?? ’They’ are creating an image of instability. Just yesterday: *- “Osaka still set to play Wimbledon, say organizers“ Jun 1**7  **“Wimbledon organizers say Japanese star Naomi Osaka is still down to play at the Grand Slam event which starts later this month and has not given any indication she will skip it.*Perhaps Wimbledon organizers said one thing yesterday, and today Osaka’s agent said another.She will pull out of the Olympics in a few weeks.no Nadal, No Thiem , no Federer and likely no djokovicNo Williams, No Osaka likely.scrap tennisno Nadal, No Thiem , no Federer and likely no djokovicWe gotta be proud of this generation of tennis players. They stand for their believes.Sad that Japanese population don't stand for nothing, just wait for some international movement that saves them.What’s with her handlers & PR people?? ’They’ are creating an image of instability. Just yesterday:Maybe Wimbledon was putting pressure on her by putting it out there publicly she was playing and the next day she let it be known she wouldn't be bullied to play when not ready.If she pulls out, no doubt japan will take it personally.Question for those who love Naomi Osaka's social justice stance and hate the Olympics, which side will you choose?Sad that Japanese population don't stand for nothingThere are many upon many Japanese protesting the Olympics. Sad that there are still people that judge an entire population based on government decisions and nationality.NOMINATIONToday  08:05 am JSTQuestion for those who love Naomi Osaka's social justice stance and hate the Olympics, which side will you choose?I’m ambivalent about her whole “social justice warrior” shtick. I think she does it for the right reasons, but it can be a bit cringe at times, especially when compared with the “I’m too delicate to talk to the press” stance.However, if she came out against the Olympics and said she wouldn’t be there because the games are clearly nothing more than a capitalist wet dream, I’d be down with that.If she pulls out, no doubt japan will take it personally.If she does pull out,she'd better stop representing Japan too.The backlash would be fierce.I didn't know Olympic athletes could simply pull out at the last minute.Use your Facebook account to login or register with JapanToday. By doing so, you will also receive an email inviting you to receive our news alerts.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberA mix of what's trending on our other sites\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t\n\t\t\t\t\tGaijinPot Travel\t\t\t\t", "Section": "", "Writers": "", "URL": "https://japantoday.com/category/sports/nadal-osaka-both-out-for-wimbledon-she%27ll-go-to-olympics", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}