{"Type": "", "Time": "2021-06-17", "Headline": "Bukit Merah View food centre cluster: 21 staff and 7 visitors test positive for Covid-19, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A total of 21 staff and vendors at 115 Bukit Merah View Market and Hawker Centre have tested positive for Covid-19 so far, as well as seven visitors to the centre and nearby shops.This comes as nine new cases were detected on Thursday (June 17) among those who had been to the market and its surrounding shops, following 19 cases reported on Wednesday.Altogether, 239 staff and vendors at the market, all of whom have been quarantined since June 12, have been tested.Meanwhile, the seven cases among visitors were detected from 4,892 people who voluntarily stepped forward for testing, after visiting 115 and 116 Bukit Merah View.Of these, 4,459 have tested negative for Covid-19, while test results for the remaining 426 are pending.All 144 staff and tenants at 116 Bukit Merah View who were tested have been found to be negative for Covid-19.The Ministry of Health (MOH) disclosed the figures on Thursday in response to media queries about updates to its Covid-19 testing operations.On a separate mandatory testing operation that was conducted at 79 and 85 Redhill Lane on Thursday, MOH said that 397 owners, tenants and staff of shops and commercial units who were tested were all negative for Covid-19 .It had conducted the testing operation \"out of an abundance of caution\" as two cases had been detected in the area.On the mandatory testing operation at Telok Blangah Market and Telok Blangah Food Centre that was also conducted on Thursday, MOH said all 118 people tested from the area were found to be negative as well.Two Covid-19 cases had earlier been detected among hawkers there.In another update to the results of its testing operation at Ion Orchard, which has been concluded, MOH said one person had tested positive so far, out of 12,928 visitors who volunteered to be tested.Test results for 767 people are pending, while the remaining 12,160 people were found to be negative for Covid-19 infection.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/bukit-merah-view-food-centre-cluster-21-staff-and-7-visitors-test-positive-for", "Source": "google"}