{"Type": "CommentaryCommentary", "Time": "2021-06-18", "Headline": "Commentary: Survivors of India’s ferocious second COVID-19 wave left scarred by crisis", "Text": "While India’s daily infections are down sharply, many now suffer from insomnia, panic attacks and other psychological symptoms, says the Financial Times’ Amy Kazmin.NEW DELHI: A friend stricken with COVID-19 at the peak of India’s ferocious second wave – as I was – called to catch up.Though she’d had breathing difficulties while ill, she’s fine physically now. But, she said, “I think we are all suffering post-traumatic stress disorder”.I had to agree. Days earlier another friend, Jyoti, who’d required oxygen support in her own battle with COVID in April, messaged that her cousin had just succumbed to the virus.But after her own terrifying illness, and the deaths of many other friends, she was too numb to grieve.For me, India’s devastating COVID wave – fuelled by the highly transmissible Delta variant now gaining ground in the UK and the US – has stirred painful memories of another deadly wave: The 2004 Indian Ocean tsunami, which killed more than 230,000 people.I was a correspondent in Bangkok when the tsunami struck and was dispatched to the battered Thai coast.Victims’ shrouded bodies were everywhere – in Buddhist temples and wrecked luxury hotels. Survivors recounted the seemingly chance factors that determined who lived and who perished.What affected me most deeply, though, were the billboards with photos of the missing, especially young children.I grew up near the Pacific Ocean and the rhythm of the waves was always a source of comfort. But after the tsunami, it took years before I could visit a beach without recalling the sea’s destructive power.‘THE VIRUS WAS EVERYWHERE’While India’s devastating COVID-19 wave is now receding, with new daily infections down sharply, it has left a trail of wreckage, grief and psychological scars that mental health experts say will haunt society.For many, the country’s surge truly felt like a tsunami, bearing down with destructive force as society – and government – stood paralysed.It looks like the email address you entered is not valid.Weeks on, I still can’t fathom how so many friends, their parents and professional contacts all fell ill almost simultaneously. “The virus was everywhere,” one said simply.Since early April, it seems as if virtually every Delhi resident has lost at least one family member, friend or colleague to COVID – if not many more since early April.Prominent universities lost dozens of professors. My colleague Jyotsna tallied well over 40 friends, relatives, neighbours and colleagues who succumbed.DESPAIR, HELPLESSNESS, ANXIETYYet people are not only reeling from the magnitude of personal losses, but also their struggles to access life-saving medical care and the distressing conditions in which loved ones died.“The way we look at stability in our lives – all of that has changed,” says Achal Bhagat, a veteran Delhi psychiatrist.For weeks, Delhi’s entire population seemed to be desperately – and often unsuccessfully – hunting for hospital beds, medicines and oxygen for family, friends and friends of friends. People tapped any contact they could muster.Such quests often proved futile – a psychological jolt to middle-class and affluent Indians, whose education, social networks and financial clout usually insulates them from India’s broader state failings.The despair, helplessness and anxiety left of their experiences will not dissipate easily.“Even rich people’s resources and networks were not able to get them support,” Bhagat says. “It’s like we are now going back to the 1970s or 80s, where no amount of network could get you the resources you needed. The helplessness of people looking for oxygen will stay with us for a long time.”Many people are now suffering from insomnia, panic attacks and other psychological symptoms.But Bhagat says the collective trauma is also likely to have serious social consequences, such as compassion fatigue, loss of empathy, growing anger and intolerance, greater risk-taking, violence and substance abuse.“The social contract has started breaking down,” he says. “You start … prioritising your own needs and the sense of community starts losing out.”Yet what India’s COVID tsunami has perhaps battered most severely, Bhagat tells me, is people’s confidence in themselves, their country’s prospects and their ability to fulfil their aspirations.And what the wave has left in its wake is “a sense of disillusionment and demoralisation as a society”.(Mental health groups have seen a surge in calls since COVID-19 hit. Who are the people tirelessly manning these helplines? Find out on Heart of the Matter.)", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,India,New Delhi", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/commentary/india-covid-19-wave-case-death-rate-oxygen-hospital-treatment-15032864", "Source": "google"}