{"Type": "", "Time": "2021-06-18", "Headline": "Biden 'committed' to holding one-on-one meeting with Chinese President | Daily Mail Online", "Text": "By Nikki Schwab, Senior U.S. Political Reporter For Dailymail.com  Published:  17:20 EDT, 17 June 2021   |  Updated:  17:26 EDT, 17 June 2021    2View  commentsPresident Joe Biden is 'committed' to holding some kind of one-on-one meeting with Chinese President Xi Jinping, National Security Advisor Jake Sullivan said Thursday, a day after Biden said he and the Chinese leader are not 'old friends.' 'What the president said about there being no substitute for leader-level dialogue as a central part of why he held the summit with Putin, also applies to China and President Xi Jinping,' Sullivan said on a press call Thursday. 'Now, it could be a phone call, it could be a meeting on the margins of an another international summit, it could be something else.' Sullivan pointed out that both Biden and Xi are 'likely to be at the G20 in Italy in October' but said the White House, for now, doesn't have firm plans for a future get-together.  President Joe Biden (left) is 'committed' to holding a one-on-one meeting with Chinese President Xi Jinping (right) his national security adviser told reporters Thursday National Security Advisor Jake Sullivan said Thursday the meeting with Xi 'could be a phone call, it could be a meeting on the margins of an another international summit, it could be something else' 'So I will leave it at that for now because we're not coming off of this trip the last thing we're doing on Thursday is planning the next thing,' Sullivan said on a call meant to rehash Biden's first foreign trip to the United Kingdom, Brussels and Switzerland. 'But soon enough we will sit down to work out the right modality for the two presidents to engage,' Sullivan said.   Biden returned to the United States late Wednesday night. Sullivan added that Biden will 'engage in the coming months with President Xi in some way to take stock of where we are in the relationship and ensure that we have that kind of direct communication that we found valuable with the president yesterday,' a nod to Biden's meeting with Russian President Vladimir Putin.'We're very much committed to that,' Sullivan said. 'It's now just a question of when and how. We'll work through that and have more to report.' During Wednesday's press conference in Geneva after the Putin meeting, Biden pushed back on the assertion that he was on friendly terms with Xi.     Biden was asked by Fox News White House correspondent Peter Doocy if Biden would call Xi 'old friend to old friend, and ask him to open up China to the World Health Organization investigators who are trying to get to the bottom of COVID-19.' 'Let's get something straight,' Biden replied. 'We know each other well. We're not old friends. It's just pure business.' President Joe Biden answered questions on the way out of his Wednesday presser including one from Fox News' Peter Doocy about pressuring the Chinese to open up the country to World Health Organization investigators looking into the origins of COVID-19 Doocy stood up and yelled his questions at Biden as the president was starting to depart. Biden was in Geneva to meet with Russian President Vladimir Putin for the first time as the U.S. leader.  But another headline that's been dominating the news over the past few weeks is the admission from U.S. intelligence agencies that they couldn't determine with certainty whether COVID-19 came from an animal-human interaction or escaped from the Wuhan lab. Biden is giving them several more months to dig in, while the G7 powers called on the WHO at the beginning of last weekend's summit in the United Kingdom to again investigate COVID-19's origins. Doocy pointed out that Biden said how important it is to have 'face to face dialogue' with world leaders, one of the reasons he gave for having an in-person meeting with Putin.'You have spoken many times about how you have spent perhaps more time with President XI than any other world leader,' the Fox News reporter said, before asking Biden if he'd reach out to his Chinese counterpart. Doocy then asked Biden 'what happens now' with the Chinese refusing to cooperate.  Biden suggested China could be motivated by the 'world's attitude' toward the country if the government drags its feet.  'China's trying very hard to project itself as a very responsible and very, very forthcoming nation,' Biden said. 'They are finding it hard to talk about how they’re helping the world in terms of COIVD-19, and vaccines, they’re trying very hard.' 'Look, certain things you don’t have to explain to the people of the world, they see the results,' he continued. 'Is China really trying to get to the bottom of this?'  \n\t    Share what you think\n          The comments below have been moderated in advance.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group", "Section": "", "Writers": "", "URL": "https://www.dailymail.co.uk/news/article-9698355/Biden-committed-holding-one-one-meeting-Chinese-President.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}