{"Type": "", "Time": "2021-06-17", "Headline": "'The doctor slipped and fell down': 10 Singapore dads share the most unforgettable moments of their child's birth, Lifestyle News - AsiaOne", "Text": "Bringing a child into this world does not just involve the mother huffing and puffing away on the delivery table — fathers play a crucial role too. Whether they bravely stood through the entire bloody delivery process or gave moral support from afar, they are often a family's pillar of strength.To celebrate these important men this Father's Day, we talked to 10 dads who shared some of the most memorable moments of their kids' births, from the nerve-racking to the heartwarming. Mark Chew, 35, auditorBefore my wife gave birth, we confirmed the epidural from the start whilst a C-section (Caesarean section) was something that was planned late in the pregnancy after advice from the gynaecologist.I didn't get to accompany her in the delivery room due to Covid-19 restrictions and I regret missing the delivery. However, there is nothing I could do differently — I was suited up and ready to enter when the nurses informed me that due to the measures and changes communicated, I was no longer allowed to go inside.When I finally saw my child, I felt a sense of wonderment. He was really fragile and small; something that I needed to protect.Sudesh Panicker, 57, consultantI planned to be present at the delivery but due to the emergency C-section, I was not permitted in.When I finally saw my child, I felt like crying. It was like falling in love again, like there are no problems in the world and everything is going to be fine. We must have done something right to deserve this gift. He's 27 now and truly is \"the gift that keeps giving\". We are so proud of who he is as a human being.I will always regret my wife and I not sharing that experience — me in a much more diminished manner, no doubt — in some small way. However, I trust that our doctor made the right call. He saved both my wife and my son. No question about it.Diren Dorai Raj, 57, chartered accountantWe opted for epidurals for both our children and prior to that, we discussed having a C-section and agreed that we will only do it unless absolutely necessary.I accompanied my wife in the delivery room when she was in labour. Our firstborn took two hours before the final push but our second baby was out within 20 minutes.One memorable part of my wife's labour was that the doctor slipped and fell whilst trying to pull my son out! But all was well in the end.Gregory Krygsman, 58, administratorPrior to my wife giving birth, we talked to the gynaecologist about the possibilities of using pethidine or an epidural to ease the expected labour pains.While she was in labour, I wanted to be positive and present for her. I looked at the monitor and told her when she should expect a contraction. I also held her hand and let her squeeze it every time there was one and wiped her brows with a cold towel.As we have five children in total, we've had to go through this five times and the entire process for each child took around four hours.My most memorable takeaway from all of this would be the first time I was asked to see the placenta to witness the afterbirth and I almost fainted.Some tips for soon-to-be parents — take note of the special days in the almanac when some mothers decide to induce their delivery to capture auspicious dates. We ended up with one of the kids born on this day and boy, was it crowded. Bernard Tang, 58, customer service officerWe had our boy late in our lives (50 and 40 years old respectively). He was conceived through in-vitro fertilisation. We tried that again but with no success.Before my wife gave birth, we opted for an epidural. However, during her labour, our gynaecologist decided to induce labour but after several hours, nothing happened. That's when the decision to do a C-Section was made. Overall, the whole process lasted nine hours.Of course, the most memorable part of the experience would be the birth of my boy and me customarily cutting the umbilical cord. I also witnessed the surgical assistant press down (quite forcibly, in my view) on my wife's belly to push the baby out.Johnson Lim, 35, engineerWe opted for a C-section, so it was all planned. It was my wife's decision as she didn't want to go through the labour pains.[[nid:528631]]The most memorable part was the first sight of my son. He was crying very loudly and covered in blood. Despite so, it was the most lovely moment.Interestingly, my wife chose to stay awake for her delivery. But after the baby was out, she was so happy and excited till she had difficulty breathing. The doctor had to give her a jab to let her sleep.I think it's a very magical moment in life and something you and your wife should go through together.Lim Ben Wei, 37, senior managerDuring the birth of my son, my wife opted for a delivery without an epidural. The pain was extremely unbearable, but my wife tried her very best to endure the pain and from her expressions, I could tell that she was suffering.When the baby was out, she cried and burst into tears upon seeing him for the first time. Overall, the entire procedure took 20 minutes.I can't imagine how much a human can endure for her kid during labour. Love is everything.Charlton Ng, 35, industrial relationsFor our first child, the contractions started at 4am and I went to the hospital and waited beside my spouse for sufficient dilation. She was finally admitted at 6am and the baby came out at 4pm.She was given an epidural so contractions wouldn't hurt. We had a momentary scare when the heart rate of our baby dropped drastically and the doctor had to intervene. Thankfully, the baby was fine.When it was time to push, my wife pushed for two hours, but baby couldn't come out because its head was in the wrong position. Eventually, the gynaecologist had to use forceps to pull our baby out and it was traumatic to watch that process. There was lots of blood and the respect for my wife went up tremendously.For our second child, we opted for induced labour at around 5pm and the baby came out on the third push at 11pm. However, my wife was in tremendous pain during dilation.Only when the dilation was 8cm then did the nurse tell us that because we were an A ward patient, only a senior doctor could administer an epidural for us. However, none of them were available at that moment and we were asked if we'd rather allow a medical officer to administer an epidural instead. Alamak, should have told us earlier — my wife had to endure so much pain.For our third child who is coming soon, we will request for an epidural immediately even if it's administered by a junior doctor.Richie Eu, 36, mergers and acquisitionsAlthough her water broke early in the morning at 6am, my wife remained completely calm. I, on the other hand, was panicking like a headless chicken and said we should go to the hospital straight away.My wife told me not to worry, proceeded to have a shower and completed a number of breathing exercises on a yoga ball. We finally left for the hospital at 8.30am and went straight into the delivery suite.There were varying waves of pre-labour contractions till she was fully dilated and my wife really only started 'pushing' at 3pm after an epidural was administered.Our daughter was born on July 1, 2020 at 3.30pm as a healthy and happy baby. It was truly a surreal, out-of-body experience for the both of us.I was amazed at how calm my wife was throughout the entire process. We had also attended a number of online antenatal classes so I was taken aback by how much of what we learned was employed during labour such as breathing and meditation exercises.I had held a preconceived notion — perhaps based on films and second hand accounts — that labour was a borderline traumatic experience filled with pain, but ours was the complete opposite. If I could go back in time, I would have told myself to calm down!Lambert Chen, 35, businessmanWe were on the bed listening to our favourite songs when her water broke. We quickly packed our bags and rushed to the hospital.When we reached the hospital, we brought out our cameras to video the process. But it took another six hours for dilation. In the end, when it was time for delivery, my back was blocking the camera. The entire time apse was showing my beautiful back. Sounds were not omitted though. Overall, the entire process took eight hours.For me, the most memorable part of the whole process was when my wife teared while hugging our new born. I would go through it all again and I won't change anything.melissateo@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/lifestyle/doctor-slipped-and-fell-down-10-singapore-dads-share-most-unforgettable-moments-their", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}