{"Type": "", "Time": "2021-06-18", "Headline": "The West is trying to create 'an adequate alternative' to China's New Silk Road", "Text": "Group of Seven (G7) leaders announced a new initiative called Build Back Better World (B3W) this week to better compete with China when it comes to funding the world's infrastructure needs. China’s Belt and Road Initiative (BRI), envisioned as the revival of an ancient trading route between Asia and Europe, has been plugging away since 2013. Through various infrastructure projects like ports and highways, the multi-trillion-dollar initiative is a key way that China is asserting itself on the world stage. The West, led by the U.S., wants to counter China's colossal geopolitical project.\"There is a tremendous demand for infrastructure globally, as countries are moving from lower middle-income to middle-income countries,\" Kaush Arha, senior fellow at the Atlantic Council's Scowcroft Center for Strategy and Security, told Yahoo Finance. \"There is a tremendous desire or hunger for an alternative to totalitarian state capitalist funding for infrastructure.\" That demand hasn't been met, added Arha, and there hasn't been an \"adequate alternative to meet the infrastructure aspirations\" of these countries.According to the White House's fact sheet, the B3W infrastructure initiative will be a \"a values-driven, high-standard, and transparent infrastructure partnership led by major democracies to help narrow the $40+ trillion infrastructure need in the developing world.\"Much like the existing U.S. approach to development finance thus far, B3W looks to mobilize private sector funds and encourage them to invest in overseas projects. (The BRI's funding comes from state-backed Chineses banks.)The White House is expecting the B3W initiative to collectively mobilize \"hundreds of billions of dollars of infrastructure investment for low- and middle-income countries in the coming years.\"The competition to win over participating countries has already begun: A Indonesian Ministry of Maritime Affairs and Investment spokesperson told Reuters that that while the country welcomes the B3W, they also hoped \"this time they put their money where their mouth is.\" Along with the U.S. European countries, Japan and Australia will likely be key players in the B3W.\"I think [Japan] has the most to gain, being in the region,\" said Josh Lipsky, Director of Atlantic Council's Geoeconomics Center. \"I think they're going to want to invest in this heavily, and that would be a pretty significant statement.\"Japan, already one of the largest investors in Southeast Asia and the Indo-Pacific region, is committing $10 billion for an initiative to help Association of Southeast Asian Nations (ASEAN) member countries cut green house gas emissions and move towards decarbonization.Australia, a key Western ally in the region, recently scrapped its own BRI project with China and banned Chinese telcom companies Huawei and ZTE from building its 5G network in 2018.Lipsky noted that playing catchup with China will be a tall task, given the sheer size of its investments and the scope of projects tied to BRI.\"Belt and Road has a 10-year head start, with projects all over the world including, by the way, in a G7 country, Italy,\" Lipsky said. \"[B3W] was a good announcement, but a lot of questions remain about how much money is going into it. Who's funding it? What projects will be funded? And China is well on its way in terms of their infrastructure projects.\"What happens to the BRI projects in Europe is an open question, particularly since EU solidarity is a crucial part to the West countering China's global infrastructure ambitions.\"The biggest entity that can move on this would be the EU,\" Arha said.—Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujitaAarthi Swaminathan is a reporter for Yahoo Finance. She can be reached at aarthi@yahoofinance.com. Follow her on Twitter @aarthiswami.Read more:First Solar CEO: New factory allows the US ‘to think through’ decoupling from ChinaU.S.-China relationship 'going down a path of great confrontation,' analyst says'Biden needs Putin more than Putin needs Biden,' expert arguesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Chinese officials don’t care if they offend Western audiences, according to one of Beijing’s top envoys in Europe.Reporter Julia Johnson's question comes after a Supreme Court challenge to the Mississippi Gestational Age Act.This startup launched a free tool to match you with qualified fiduciary advisors so you can get sound financial advice in a volatile market.What the Nord Stream 2 means for Europe — and the worldAntonio Perez/GettyWith less than two months before R. Kelly’s federal trial in New York on charges of racketeering for allegedly running an “enterprise” that sex trafficked young women and underage girls, his legal team appears to be in shambles.The R&B singer’s Chicago-based criminal defense lawyers Steve Greenberg and Michael Leonard filed a motion last week seeking to be removed from his defense team, claiming it had become “impossible” to represent Kelly due to clashes with co-counsel NicolThe U.S. government barred China from work on the International Space Station, so the Chinese are building their own - and fast.Our technology will match you with the best lenders at super low rates. Trusted by over 15 million. Save thousands each year. (1.97% APR)House Speaker Nancy Pelosi has no plans to remove the metal detectors installed at each entrance of the lower chamber.His attorney said he believed he could get the masks. “He didn’t start out with the intent to defraud anyone.”Data: Atlantic Council; Map: Andrew Witherspoon/AxiosAs of 1980, China was the most influential player in just one country: Albania. Now, China is the leading power across most of sub-Saharan Africa and Southeast Asia and is catching up to the U.S. in its own hemisphere.What we’re reading: That's according to a new report from the University of Denver and the Atlantic Council that seeks to measure the influence countries have on each other, and in so doing offers a dramatic portrait of China's rThe #1 trend in investing isn’t crypto. You can now buy into the hottest pre-IPOs in America -- and for only around $10 a share. But you must act now.The court upheld Obamacare (again), and in its ruling on a Catholic foster care agency, it beat back radical changes sought by the court’s extremistsAfter being kicked out of his grandfather’s home in Davie for not paying rent or taking his medications, Kaazim Campbell pulled out a handgun and fired five times into the tires of cars parked in the driveway, according to police.Yesterday, Democratic lawmakers took the next step in their effort to codify Roe v. Wade, the Supreme Court decision that circumvented the Democratic process to legalize abortion in nearly all cases.Take advantage of lower mortgage rates & cut your monthly payments. 5 Best Mortgage Refinance of 2021The Trump administration tried hard to prove the COVID-19 Wuhan lab-leak theory, came up short(Bloomberg) -- California faces a white-knuckle evening of possible blackouts with grid officials warning that power supplies may not meet demand as a triple-digit heat wave grips the western U.S.The Golden State could run short of electricity between 7 p.m. and 9 p.m. as solar power production fades with sunset, grid managers warned Thursday. All available generation sources were either already in use or expected to be at that time, according to officials, who also urged Californians to turn ofHECTOR RETAMAL/AFP via Getty ImagesChinese-language anti-communist media and Twitter are abuzz this week with rumors that a vice minister of State Security, Dong Jingwei defected in mid-February, flying from Hong Kong to the United States with his daughter, Dong Yang.Dong Jingwei supposedly gave the U.S. information about the Wuhan Institute of Virology that changed the stance of the Biden administration concerning the origins of the COVID-19 pandemic.Dong is, or was, a longtime official in ChinIf you've got more than $1,000 in your checking account, you need to make these moves as fast as possible.“I want this guy to go out and do well for our country,” Trump said of Biden.Treasury Secretary Janet Yellen on Wednesday defended President Joe Biden’s proposed $6 trillion budget for 2022, telling lawmakers on the Senate Finance Committee that now is the time to embrace an “ambitious fiscal policy” to help reverse “destructive forces” like inequality, declining labor force participation and climate change. Yellen said in testimony before the Senate panel that the U.S. economy is “well on the way” to a strong recovery from the Covid-19 pandemic, but that the private secTexas Gov. Greg Abbott (R) announced Wednesday the state budget would provide $250 million as a \"down payment\" to help fund the construction of a wall at the state's border with Mexico.Why it matters: Former President Trump pledged to build a wall along the southern border, but only 450 miles of new barriers had been completed by the end of his term, per the Washington Post.Stay on top of the latest market trends and economic insights with Axios Markets. Subscribe for freePresident Biden terminaLast time we did this, we saw an average return of almost 300%...in one year!With the pandemic waning, Californians who receive unemployment benefits will next month have to start showing that they are looking for workThe travel industry and travel enthusiasts may be anxiously waiting for the return to travel but Canada’s approach to border management has not been as adaptable and proactive as some experts would have liked to see, which should be fixed before border restrictions are significantly loosened.\n“Generally Canada has pretty much a wait-and-see approach,” Dr. Kelley Lee, professor at Simon Fraser University, Canada Research Chair in global health governance, leading the Pandemics and Borders Project, told Yahoo Canada.Following their \"very robust conversation\" with Vice President Kamala Harris, Democratic state legislators from Texas conceded that while the Biden administration wants to see federal voting reform legislation make it to the president's desk, the hurdle to passage is the U.S. Senate -- but they aren't giving up on conversations with those lawmakers.  \"We know it's a priority for the administration but quite frankly it lies in the Senate,\" state Sen. Carol Alvarado, the chair of the Texas Senate Democratic Caucus, said after the meeting at the White House Wednesday.  Harris met with more than a dozen Democratic lawmakers from Texas, applauding them as \"courageous leaders\" for staging a walkout in the final hours of the state's regular legislative session last month.", "Section": "", "Writers": "", "URL": "https://finance.yahoo.com/news/west-infrastructure-china-new-silk-road-202628631.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}