{"Type": "", "Time": "2021-06-17", "Headline": "Apple Daily: the Hong Kong tabloid that dared to challenge China", "Text": "Keep up to speed at a glance with the Top 10 daily storiesKeep up to speed at a glance with the Top 10 daily storiesOver the past 26 years Hong Kong's Apple Daily newspaper has evolved into the city's most popular tabloid by punching up against a particularly powerful entity that brooks little criticism: China's communist leadership.It has now been declared a threat to national security and its future is deeply uncertain.Caustic criticism of Beijing has been part of the paper's DNA from the beginning.It was founded in 1995 \"as a newspaper for Hong Kong people\" by Jimmy Lai, a billionaire mogul who had fled to the city from the mainland as a penniless child, and amassed a fortune selling clothes.Lai had not been especially political until the events of June 4, 1989, when he and many other Hong Kongers watched in horror as China sent tanks and troops to crush democracy protesters in Beijing's Tiananmen Square.In the ensuing years he became increasingly outspoken -- often using especially colourful language to describe China's leaders -- and his clothing brand Giordano soon found itself in trouble with mainland authorities.So Lai sold up and ploughed the proceeds into a new endeavour -- founding a media empire.The emergence of Apple Daily coincided with Hong Kong's return by Britain to China in 1997.As many Hong Kongers fretted about their future freedoms, Apple Daily became the voice of the city's pro-democracy, Beijing-sceptical wing.- Scandal and sex -Much like Rupert Murdoch before him, Lai carved a space out in a crowded media landscape by being brasher and louder than his rivals, combining often populist right-wing politics with ample lashings of sex, celebrity and scandal.He also launched a brutal price war.The tactics paid off. In just a few years Apple Daily was printing 400,000 copies a day. Lai also opened up a Taiwan edition.Much like the rest of the print media, its circulation has crumbled in recent years -- to around 80,000 daily copies in Hong Kong.Apple Daily has struggled to successfully monetise online content, with Lai writing cheques to keep the paper afloat.But it remained a voice of defiance as local media increasingly began to self-censor and avoid taking on China's leaders directly.As Hong Kong's pro-democracy movement gathered steam from 2014 onwards, Lai became public enemy number one to Beijing, with state media routinely describing him as a \"traitor\" and a \"black hand\".Apple Daily's support for the huge and often violent democracy protests that rocked Hong Kong in 2019 infuriated Beijing further, as did Lai campaigning for international sanctions.Lai and Apple Daily's editorials were also vocal in support of former US president Donald Trump's confrontations with China.- 'See you in prison' -Beijing's imposition of a sweeping national security law last year radically changed the paper's fortunes.Lai, 73, was among the first high-profile democracy activists arrested under the law.He was jailed for attending protests, and faces a national security charge of collusion that could land him a life sentence.In an interview with AFP almost exactly a year ago, shortly before the law came in, he predicted it would be used to silence his newspaper.\"Whatever we write, whatever we say, can be subversion, can be sedition,\" he said.On Thursday, five Apple Daily executives were arrested under the same charge and some of its assets were frozen.A large number of items including 38 computers used by reporters were seized by police, Apple Daily said.\"They took away my computer,\" a reporter, who declined to be named, told AFP, adding that staff were rattled.\"No one knows where the red line is,\" he said. \"But for now I will continue my work as long as I can.\"A features reporter, who gave her surname Chan, said gallows humour had descended over the newsroom in recent months.\"We often made dark jokes like 'See you in prison'\", she told AFP.But she too vowed to plough on.\"If they really ban us, then we will remain a witness to history and will keep writing until the end.\"su-yan/jta/legGlobal stocks were mixed on Thursday as traders digested the Federal Reserve's move to bring forward its forecasts for hiking interest rates as the economy recovers.Beijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityNew $89 Portable Air Cooler Everyone In The U.S. Is Talking AboutThe PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saChinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Browsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.The strategic partnership sees EMERGE working with Mediacorp's Bloomr.SG network to \"develop the knowledge and skills of up-and-coming\" content creators in esports.Italy became the first team to reach the knockout stage of Euro 2020 as midfielder Manuel Locatelli scored twice in a 3-0 win over Switzerland in Rome on Wednesday, while Wales moved to the brink of joining them by beating Turkey.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.China and other nations were attempting to “seize control” of strategically important international organisations so they could be “weaponised”, a new report by the UK parliament’s influential Foreign Affairs Committee said. The report, published Thursday, accused China in particular of “bullying” states to back their position or their candidates for top jobs, using measures including financial leverage “to shift policies away from the cooperation the organisations were created to promote”. TheHong Kong police have for the first time determined the publication of certain newspaper articles to be a national security crime as they arrested the editor-in-chief, publisher and three other executives of Apple Daily whom they held accountable for more than 30 reports calling for foreign sanctions. The force on Thursday cited the publication of the articles – understood to be mostly commentaries and opinion pieces, including several written by the tabloid’s jailed founder and opposition activJapan said on Thursday it will make a vaccine passport available from next month for Japanese travellers, as governments around the world experiment with ways to relaunch tourism and business trips.Every PC user must read this in 2021 - Do it now.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.Washington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HousePrime Minister Boris Johnson warned Wednesday he will take \"necessary steps\" to unilaterally alter Britain's post-Brexit trade terms unless the EU changes the way it is implementing them in Northern Ireland.Protect yourself from mosquitoes the moment you turn it on. These are selling fast, here is how it works.China’s economy is getting more globally competitive as a result of its success in managing the coronavirus pandemic, while Hong Kong’s has been dragged down by a deteriorating labour market and a decline in international investment, Switzerland’s IMD business school said in a report released on Thursday. The Chinese economy came in at 16th in the 2021 IMD World Competitiveness Rankings, up from 20th last year, the biggest jump among Asian economies. Hong Kong was ranked at seventh, down from NoThe freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.The Kremlin was guarded about future dialogue with Washington on Thursday, a day after the first face-to-face meeting between Russian President Vladimir Putin and US counterpart Joe Biden.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Just a few weeks ago, ONE Championship announced the signing of Jhanlo Sangiao, the prodigal son of Team Lakay head coach Mark Sangiao. This week, the martial arts organization picked up another rising star from the fabled stable – Jeremy “The Juggernaut” Pacatiw. “I know this is God’s plan. This is the perfect time for … Continue reading \"ONE Championship Signs Second Team Lakay Athlete In Two-Week Span\"Enjoy The Good Life® with Standard Chartered credit cards. Here’s a roundup of the best deals in town when you swipe, tap or click checkout with your Standard Chartered card. With Standard Chartered, you’ll find a card for every need. A fuss-free cashback card with […] The post Standard Chartered Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.Hong Kong police rounded up 79 people in a series of raids that shut down two underground casinos and an unlicensed pub in the span of two hours on Tuesday night. In one raid on a Ko Shing Street flat in Sai Ying Pun, officers found a baccarat table and two large televisions used to play online card games, seizing HK$215,000 (US$27,697) in cash, HK$410,000 in chips and five account books. Sixteen men and six women, aged 31 to 74, were inside the premises when officers from the Western special du", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/apple-daily-hong-kong-tabloid-104055978.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}