{"Type": "", "Time": "2021-06-17", "Headline": "Warm, humid conditions to continue for rest of June, mercury to hit 35 deg C on some days, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The weather will stay warm and humid in the second half of the month, with daily temperatures ranging between 25 deg C and 34 deg C on most days.This is much like the weather in the first half of June. Prevailing south-west monsoon conditions mean low-level winds are expected to blow from the south-east or south-west, the Meteorological Service Singapore (MSS) said on Wednesday (June 16).Thundery showers have been forecast on some days during the second half of the month, although rainfall for the entire month should be below normal in parts of Singapore.Most of these should be short and localised, in the late morning and early afternoon, due to strong daytime heating of the land areas.One or two days, in particular, will see gusty winds with widespread thundery showers between the pre-dawn hours and morning.The MSS said that days with little or no rain will have a daily maximum temperature of around 35 deg C. The rest of the days will have a maximum temperature of 34 deg C.Warm and humid conditions can also be expected on some nights when prevailing winds from the south-east or south blow warm and humid air from the sea.On these nights, minimum night-time temperatures of up to 28 deg C can be expected, particularly over the south-eastern parts of the island.In the first half of June, thundery showers fell mostly over the western half of the island in the late morning and afternoon. There were also a few days when thundery showers fell during the night and in the pre-dawn hours.The highest total rainfall in the first half, at 93.8mm, was recorded in Mandai on Tuesday, when heavy thundery showers fell mainly over the western and northern parts of the island in the afternoon.Nine of the 15 days saw temperature exceeding 34 deg C. The hottest temperature was recorded at the Marina Barrage on June 4, at 35.5 deg C.There were also a few warm nights, particularly over the southern parts of the island where the minimum night-time temperatures ranged between 28 deg C and 29.2 deg C.Rainfall was below average for most parts of Singapore, except in the north-western parts of the island, in the first half of June.Choa Chu Kang had the highest rainfall anomaly of 138 per cent above average, while rainfall in Sentosa was 61 per cent below average, the highest anomaly the other way round.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/warm-humid-conditions-to-continue-for-rest-of-june-mercury-to-hit-35-deg-c-on-some-days", "Source": "google"}