{"Type": "Sport", "Time": "2021-06-18", "Headline": "Tennis: Nadal pulls out of Wimbledon, Tokyo Olympics", "Text": "PARIS: Rafael Nadal pulled out of Wimbledon and the Tokyo Olympics on Thursday (Jun 17), saying he took the decision after consultations with his team in a bid to prolong his career.The 35-year-old Spaniard said that the two-week gap between the French Open and Wimbledon - which starts on Jun 28 - was not enough time for him to recuperate after a demanding clay court season where he played in five tournaments.\"I have decided not to participate at this year's Championships at Wimbledon and the Olympic Games in Tokyo,\" Nadal, twice a Wimbledon champion, said on Twitter.\"It's never an easy decision to take but after listening to my body and discussing it with my team I understand that it is the right decision.\"Nadal, a 20-time Grand Slam winner, played at the Monte Carlo Masters, Barcelona, Madrid Masters and Rome Masters before the French Open.A record 13-time champion at Roland Garros, Nadal made a run to this year's semi-finals and was knocked out by eventual champion Novak Djokovic in a four-set thriller - only his third loss on the Parisian clay where he has won 105 matches.\"The fact that there has only been two weeks between (Roland Garros) and Wimbledon, didn't make it easier on my body to recuperate after the always demanding clay court season,\" he added.\"They have been two months of great effort and the decision I take is focused looking at the mid and long-term.\"Nadal has won two gold medals at the Olympics - a singles title in 2008 in Beijing and a doubles gold at Rio 2016, where he was the flag bearer for Spain.\"The Olympic Games always meant a lot and they were always a priority as a sports person, I found the spirit that every sports person in the world wants to live,\" Nadal said.\"I personally had the chance to live three of them and had the honour to be the flag bearer for my country.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "tennis,Rafael Nadal,Wimbledon,Olympics,Tokyo 2020", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/tennis-nadal-pulls-out-of-wimbledon-tokyo-olympics-15034206", "Source": "google"}