{"Type": "", "Time": "2021-06-18", "Headline": "Experts divided on whether dining in should resume as cases spike, Latest Singapore News - The New Paper", "Text": "While the country cheered last week over the news that some measures in phase two (heightened alert) would be eased from June 13, the beleaguered food and beverage (F&B) industry also perked up when the Ministry of Health (MOH) said dining in for groups of five will be allowed to resume from next Monday, as long as the Covid-19 situation remained under control.But with community infections spiking of late, they may now have to delay welcoming back dine-in customers.In a video on Facebook yesterday, Finance Minister Lawrence Wong, co-chair of the multi-ministry task force tackling the pandemic, said the Government is \"evaluating the timing and scope of the next stage of reopening\" because of the \"latest outbreak of cases\".Dr Paul Tambyah, president of the Asia-Pacific Society of Clinical Microbiology and Infection, does not believe the current situation is dire enough to postpone lifting the restriction on dining in, especially with the country's vaccination numbers ticking up.He said: \"All these public health interventions are risk versus benefit calculations. The economic and social impact of further restricting dining in is most likely going to far outweigh any possible benefit in reducing infections in a highly vaccinated society like ours.\"Associate Professor Hsu Li Yang, vice-dean of global health at the Saw Swee Hock School of Public Health at the National University of Singapore (NUS), said: \"We will have to ease measures sooner or later.\"The food and beverage industry has been severely affected over the past year, and the impact is disproportionately higher on the smaller establishments and elderly hawkers that are less tech-savvy and who are less able to transit to online deliveries.\"A delay in reopening would be tough on restaurants, hawkers and other F&B outlets, and will also be a blow to members of the public who have been looking forward to eating out.For Dr Hannah Clapham, assistant professor at the Saw Swee Hock School of Public Health at NUS, vaccinations, transmissibility and timing are the keys to deciding whether to continue to ease measures.\"Vaccination rates are rapidly increasing in the population, but we still have some way to go. With the current Delta variant being more transmissible, it is important to continue to keep a handle on the transmission until more people in the population are protected,\" she told The New Paper yesterday.From June 6 to 12, the number of community infections here averaged 4.6 cases. The average for linked and unlinked cases was 2.6 and 2, respectively.Over the next four days, the average number of community infections grew to 15.25, with an average of 12.75 linked cases and 2.5 unlinked cases.And as of yesterday, there were 39 cases linked to the cluster at Bukit Merah View Market and Food Centre.Referring to the spike in cases, Dr Leong Hoe Nam, an infectious diseases specialist at Mount Elizabeth Novena Hospital, said: \"The number of unlinked cases is important. In fact, it is the more important of the two (linked and unlinked cases). It tells us when cases were not anticipated and where contact tracing failed.\"With unlinked cases, we risk the virus spreading uncontrollably.\"While it is \"expected\" and \"normal\" for Covid-19 community cases to hit double digits, he added: \"The number of unlinked cases should be below two and ideally none at all. Anything between three and five is worrying. The virus spreads very fast.\"Singapore moved to phase two (heightened alert) on May 16 after a spike in community cases, and it was slated to end on June 13 if the measures worked.With the number of cases falling, the MOH announced that the country would move to phase three (heightened alert) starting from June 14, with people allowed to gather in groups of five, up from two, and operating capacity limits for attractions, cruises, museums and public libraries going up from 25 per cent to 50 per cent, among other moves.A further relaxation of measures, including dining in, was set to follow a week later.Professor Dale Fisher, an infectious diseases expert from the NUS Yong Loo Lin School of Medicine, has consistently emphasised the importance of the rate of vaccination.\"Economically, many hawkers, restaurant owners and workers have been suffering. On the other hand, there is a high risk of Covid-19 spreading as people mingle with masks off. This is the argument to balance,\" Prof Fisher said.\"Of course, if everyone in the country were to be vaccinated, we would be comfortable that anyone infected would usually have only a mild illness, if anything.\"Get The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/experts-divided-whether-dining-should-resume-cases-spike", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}