{"Type": "", "Time": "2021-06-18", "Headline": "Centuries-old shipwrecks found off Singapore", "Text": "Two centuries-old shipwrecks packed with ceramics and other artefacts have been found off Singapore in a rare discovery that will shed light on the city-state's maritime heritage, archaeologists said Wednesday.The prosperous island nation has long been a key trading hub on global shipping routes connecting the Indian Ocean and the South China Sea.The wrecks were found off Pedra Branca, a rocky outcrop east of Singapore, according to the National Heritage Board and think tank the ISEAS-Yusof Ishak Institute, which worked together on the project.The first wreck, discovered after divers accidentally came across ceramic plates in 2015, was carrying Chinese ceramics that possibly date back to the 14th century, when Singapore was known as Temasek.Some of the items were similar to artefacts found in archaeological digs on land, which showed that Singapore was a trading hub well before the arrival of British colonisers in 1819.Undersea excavations on the first wreck led to the discovery of the second, which is likely to be the Shah Munchah, a merchant vessel built in India that sank in 1796 while sailing from China to India.Items recovered from the second wreck ranged from Chinese ceramics to glass and agate objects, as well anchors and cannons, the heritage board and think tank said.The survey and recovery of artefacts from the two wrecks was completed this year.Such cannons were typically mounted on merchant ships used by the East India Company --- the trading behemoth through which the British empire expanded in Asia -- in the 18th and 19th centuries, they added.The vessel discovered in 2015 was the first ancient shipwreck to be found in Singapore's waters.It was carrying \"more Yuan dynasty blue-and-white porcelain than any other documented shipwreck in the world,\" said Michael Flecker, a visiting fellow at the ISEAS-Yusof Ishak Institute's archaeology unit.\"Many of the pieces are rare, and one is believed to be unique.\"The Yuan dynasty existed in what is now China in the 13th and 14th centuries.Much of the Chinese cargo in the second wreck was destined for eventual shipping to Britain, said Flecker.mba/sr/qanIsraeli jets launched air strikes on Gaza overnight Thursday to Friday after militants in the Palestinian territory again set off incendiary balloons into southern Israel, the army and AFP journalists said.Rafael Nadal and Naomi Osaka, with 24 Grand Slam titles between them, both withdrew from Wimbledon on Thursday with the Spanish star also pulling out of the Tokyo Olympics in a bid \"to prolong my career\".Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.A spiked drink, a puff of dust, missing memories, and an empty bank account.Beijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityThe PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saGuided by MIT faculty, gain practical knowledge to embrace blockchain as a business tool.A US journalist detained in Myanmar since May appeared Thursday in a special court, his employers said, where he faces charges under a law that criminalises encouraging dissent against the military.Lim Chung Chun, may be the co-founder and CEO of homegrown wealth management firm iFAST Corporation, but he is still an investor at heart and a research analyst at his core. Learn more about his journey and his investment philosophy here.Hong Kong authorities could impose a tighter limit on the number of legal aid cases an individual lawyer can take on, amid rising pressure from legislators to reform the system to stop its “abuse” by anti-government protesters. The possible measure was part of an ongoing review of the city’s challenged legal aid system that was expected to be completed within this year, Chief Secretary Matthew Cheung Kin-chung told lawmakers on Wednesday. The revelation came as pro-establishment legislators agaiLastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Prime Minister Boris Johnson warned Wednesday he will take \"necessary steps\" to unilaterally alter Britain's post-Brexit trade terms unless the EU changes the way it is implementing them in Northern Ireland.China and other nations were attempting to “seize control” of strategically important international organisations so they could be “weaponised”, a new report by the UK parliament’s influential Foreign Affairs Committee said. The report, published Thursday, accused China in particular of “bullying” states to back their position or their candidates for top jobs, using measures including financial leverage “to shift policies away from the cooperation the organisations were created to promote”. TheWashington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HouseEvery PC user must read this in 2021 - Do it now.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.A reporter with a pro-Beijing newspaper in Hong Kong accused of making a false statement when accessing a government car registry has been let off the hook after prosecutors agreed to drop the charge on condition of a binding-over order. The prosecution’s decision stood in marked contrast to the justice department’s handling of a case last year involving an RTHK contributor accused of the same act, prompting Principal Magistrate Ivy Chui Yee-mei to question the difference in approach at ThursdayIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).The first astronauts arrived at China's new space station on Thursday in the country's longest crewed mission to date, a landmark step in establishing Beijing as a major space power.North Korean leader Kim Jong Un has said his country needs to prepare for \"both dialogue and confrontation\" with the United States under President Joe Biden, state media reported Friday.Former Taiwanese president Ma Ying-jeou has called on the government to listen to public opinion and allow civilian groups which have different political leanings to the ruling Democratic Progressive Party to import much-needed Covid-19 vaccines. Taiwan, which is battling a surge in cases, has struggled to secure vaccines although it has signed deals to buy 10 million doses from AstraZeneca, 5 million from Moderna and more than 4.7 million doses via the Covax Facility, which is supported by theNew research has identified TEN favorite stocks for the upcoming yearHong Kong police have for the first time determined the publication of certain newspaper articles to be a national security crime as they arrested the editor-in-chief, publisher and three other executives of Apple Daily whom they held accountable for more than 30 reports calling for foreign sanctions. The force on Thursday cited the publication of the articles – understood to be mostly commentaries and opinion pieces, including several written by the tabloid’s jailed founder and opposition activGlobal stocks were mixed on Thursday as traders digested the Federal Reserve's move to bring forward its forecasts for hiking interest rates as the economy recovers.China’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the bu", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/centuries-old-shipwrecks-found-off-093907017.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}