{"Type": "", "Time": "2021-06-17", "Headline": "Malaysia's rulers meeting: Lives and livelihood must be given priority, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.KUALA LUMPUR (THE STAR/ASIA NEWS NETWORK) - It was 7pm on Wednesday (June 16) when the Malay rulers concluded their meeting with the Yang di-Pertuan Agong (Malaysian King) at Istana Negara.The special meeting of the rulers started at 2.30pm and most of them spoke openly and candidly.This was not a scheduled Conference of Rulers meeting, which would have included the respective Yang di-Pertuan Negeri (heads of states), in the presence of the Menteris Besar and Chief Ministers.This time, it was just the Malay rulers and no one else.On their minds were four main issues - the Emergency which ends Aug 1, the Covid-19 pandemic, vaccination exercise and Parliament.It was clear they wanted the Parliament to convene as soon as possible although no date was mentioned.In the statement issued after the meeting by Keeper of the Rulers' Seal, Tan Sri Syed Danial Syed Ahmad, the Malay rulers declared that there was no need to place the country under the Emergency beyond Aug 1.The rulers concurred with the view of the King that Parliament should be reconvened as soon as possible.\"The rulers are also of the view that state legislative assemblies can reconvene soon,\" the statement added.But they clearly understood their roles - in a constitutional monarchy, rulers cannot encroach into politics. Meaning, rulers cannot force Parliament to meet, and neither could they fix a date. This has to come from the Prime Minister.Still, it would not be wrong to say that some of the rulers have not been happy with political developments in the country.The key words in their statement, which some media missed or felt it was not important, were this - \"the rulers concur that lives and livelihood must be given priority above other matters.\"By that, it meant the endless politicking by politicians, as well.One or two have privately expressed their disdain at the level of political manoeuvring, attempts at power grab and push for an immediate general election.Mr Syed Danial said the rulers agreed that the political temperature in the country needed to be brought down, and that it was important to have a stable government which has the support and confidence of the majority of the people.\"The rulers concur that lives and livelihoods must be given priority above other matters and for the vaccination drive to be ramped up by minimising bureaucracy, so that 80 per cent of the population can be inoculated to achieve the targeted herd immunity quickly,\" he said. He added that the rulers also wanted measures to tackle the Covid-19 pandemic to be inclusive and involve various stakeholders.While the rulers merely said that Parliament should meet \"as soon as possible\", they are also well aware of the provisions, in that the Speaker must give a minimum 28 days notice.This means, for example, if the Dewan Rakyat (Parliament) were to convene on Aug 28, the notice must go out by Aug 1.Upon receiving the notice from the PM, the Secretary of the House would then proceed.The Members of Parliament must be given 10 working days to submit questions and at least 14 days for any motions.There will also be a need to facilitate travelling plans of MPs to gather including flights, as the country is still imposing a ban on inter-state and inter-district travels.Since it is possible that this meet of MPs would be a new session, the PM would then has to seek the advice of the King on his availability as he would need to address Parliament, as is done every start of the annual parliamentary meeting. August is also the National Day month.But there is also a provision which stipulates that the PM can call for a special meeting of the Parliament by merely writing to the Speaker to inform him of the need.In this case, it is for a specific reason, and the PM will decide on the agenda. It would most likely be a short meeting and almost certainly, would be criticised by MPs.So, when (Prime Minister) Tan Sri Muhyiddin Yassin suggested that Parliament can only convene in September or October, he was not far off the mark, but he has come under fire because he did not explain the rationale behind it.Given the stand made by the rulers, the PM can perhaps expedite the date and at the same time, meet the requirements of the Parliament rules.Finally, Mr Muhyiddin could have explained better why he suggested that the meeting should be in September or October.Not many Malaysians including reporters who do not cover the Parliament beat would understand the requirements.In short - the PM cannot decide by saying, let's meet next week.It isn't a meeting at the kopi tiam or the spa.But as the rulers rightly pointed out, the political temperature needs to be brought down - and a stable government that has the support of the people.The rulers were very clear at the meeting: Parliament is the base of the people and for a democracy to function properly, the MPs must go back to the august House.The challenge now is to see how many of these MPs would be able to participate intelligently in the debates without the theatrics.We do not need any more shouting matches, walk-outs and name calling.That is what the rakyat (people) hates most.• Datuk Seri Wong Chun Wai is a columnist with The Star. He is adviser and former editor in chief of Malaysia's Star Media Group.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/malaysias-rulers-meeting-lives-and-livelihood-must-be-given-priority", "Source": "google"}