{"Type": "", "Time": "2021-06-18", "Headline": "Singapore non-oil exports growth picks up pace in May, but lower than expected | The Star", "Text": "\n                    Thursday, 17 Jun 2021\n                SINGAPORE (The Straits Times/ANN):- Singapore's non-oil domestic exports (Nodx) grew at a faster rate last month compared with April, aided by electronic and non-electronic shipments such as machinery and chemicals.Nodx rose 8.8 per cent last month, following a 6 per cent gain in April, continuing the positive growth trend seen since December last year, according to data released by government agency Enterprise Singapore (ESG) on Thursday (June 17).But last month's export growth was less than the 16 per cent growth forecast by analysts polled by Bloomberg.On a month-on-month seasonally adjusted basis, Nodx decreased 0.1 per cent in May, after the previous month's 8.8 per cent decline.Exports of electronic products rose 11 per cent year on year last month, higher than the 10.9 per cent growth achieved in April.Shipments of diodes and transistors jumped 53.9 per cent and telecommunications equipment saw a 52.3 per cent rise, contributing the most to the growth in electronic Nodx.Non-electronic product exports grew 8.1 per cent from the same month last year. In April, they were up 4.7 per cent.Primary chemicals led the non-electronics growth, rising 96.8 per cent, specialised machinery was up 58 per cent and petrochemicals rose 55.7 per cent.Prakash Sakpal, senior economist for Asia at ING Bank in Singapore, said that while Nodx growth picked up pace from April, it was still disappointing as it came well below consensus forecasts and his own estimate of 19.9 per cent.“The low base effect held year-on-year growth in positive territory. However, the second consecutive month-on-month fall reflects a possible pause in the export-led recovery as the Covid-19 second wave struck the economy via tighter restrictions on activity, ” he told The Straits Times.Shipments to Singapore’s top markets as a whole rose last month.However, Nodx to the United States, Japan and the European Union declined.The markets that contributed the most to the rise in Nodx were China, up 36.9 per cent, Hong Kong, 30.2 per cent, and Malaysia, 27.1 per cent.Shipments to China still grew at a slower pace than the 55.5 per cent they saw in April.Export growth also eased for Malaysia, from 57.2 per cent in April.Nodx to emerging markets grew by 41.4 per cent last month, following the 70.4 per cent expansion in April.Total trade, on a year-on-year basis, expanded by 30.9 per cent last month - extending a 26.3 per cent growth in April.Total exports rose by 29.8 per cent, following April’s 26.6 per cent growth. Total imports grew by 32.2 per cent, after a 25.9 per cent increase in April.Last month, official forecasts for Singapore's key exports and overall merchandise trade were raised, amid better-than-expected growth seen in the first quarter of this year.Nodx is expected to expand between 1 per cent and 3 per cent for this year, up from 0 per cent to 2 per cent. Total trade is predicted to increase 5 per cent to 7 per cent, higher than the 2 per cent to 4 per cent forecast in February.Nodx rose 9.7 per cent year on year in the first quarter, driven by increases in both electronics and non-electronics shipments and reversing the 0.5 per cent decline seen the previous quarter, according to data released by ESG on May 25. - The Straits Times/Asia News Network\nTags / Keywords:\nSingapore\n                                                                ,\n                                                                                                exports\n                                                                ,\n                                                                                                May\n                                                                ,\n                                                                                                non-oil\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/17/singapore-non-oil-exports-growth-picks-up-pace-in-may-but-lower-than-expected", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}