{"Type": "", "Time": "2021-06-17", "Headline": "Blackpink to mark 5th anniversary with a movie, Entertainment News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SEOUL (THE KOREA HERALD/ASIA NEWS NETWORK) - K-pop girl group Blackpink are celebrating the fifth anniversary of their debut with a movie that will hit cinemas in over 100 countries, their label YG Entertainment said on Wednesday (June 16).Titled Blackpink The Movie, it will premiere on Aug 8, although release dates may differ in some countries. The film will show the quartet reminiscing over shared memories and include never-before-seen interviews with the bandmates.There will also be performances from their January online concert The Show, as well as the 2018 concert In Your Area, for fans to relive the moments.The movie is part of the \"4+1 Project\" which the band announced earlier in the week.YG said on Tuesday that Blackpink are preparing a \"big project\" to mark their fifth anniversary, as the company uploaded a poster that read \"4+1 Project\" without providing further details.It added that the contents will be unveiled gradually through a website dedicated for the event, with several projects aimed to meet the fans' expectations.Blackpink, which comprise Jisoo, Jennie, Rose and Lisa, presented a Frozen version of their hit song, How You Like That, on their fourth anniversary last year.The quartet debuted in August 2016 with the EP, Square One, which included the songs Whistle and Boombayah.The music video of Boombayah recently surpassed 1.2 billion views on YouTube, becoming the band's third to reach the milestone, following Ddu-Du Ddu-Du and Kill This Love.Blackpink's first full-length studio album, released last October, ranked No. 2 on both the Billboard 200 and Britain's Official Chart, the highest ever for a K-pop female act.The group have also collaborated with global pop stars such as Lady Gaga, Dua Lipa and Selena Gomez.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/life/entertainment/blackpink-to-mark-5th-anniversary-with-a-movie", "Source": "google"}