{"Type": "", "Time": "2021-06-17", "Headline": "Actress Cecilia Cheung says she would no longer make public her relationships, Entertainment News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SHANGHAI - Hong Kong actress Cecilia Cheung has revealed that she is looking for someone who loves her but adds that she would not make it public when she starts a new relationship.Cheung, who turned 41 in May, made the comments while chatting with fellow Hong Kong actress Sheren Tang on Chinese variety show Life Is Beautiful 2, Chinese media reported on Thursday (June 17).Cheung, who is formerly married to singer-actor Nicholas Tse, poked fun at herself and said she is very picky when it comes to love. Her other half should not cling to her too much, she says, but it is also not ideal if he does not cling to her at all.Even if she gets into a new relationship, she said that she would not disclose this to the public, citing bad past experiences.\"I don't think I received lots of blessings when I shared about (my relationships) in the past,\" said the actress who recently appeared in Chinese reality show Sisters Who Make Waves 2.\"The more you share, the more they would find a way not to give their blessings.\"Tang, 55, agreed, saying: \"They can complicate matters out of nothing.\"Cheung added that she would keep mum even if it was discovered that she is dating.Cheung was married to Tse from 2006 to 2011, and they have two sons - Lucas, 13, and Quintus, 11.She has a third son, Marcus, two, and has never revealed the identity of his father.Besides the two actresses, Hong Kong veteran actor Paul Chun, 75, also appeared on the show. The trio discussed the lack of younger talent in the entertainment industry, with some male actors seeing themselves as idols instead.\"Being a star doesn't mean he is a good actor,\" said Chun.Agreeing, Tang said: \"People nowadays don't love acting enough, as what they love is being actors.\"Cheung and Tang later posted on social media photos of the three of them together.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/life/entertainment/actress-cecilia-cheung-says-she-would-no-longer-make-public-her-relationships", "Source": "google"}