{"Type": "", "Time": "2021-06-17", "Headline": "Man who digitally altered bank records and created fake e-mails jailed for 14 weeks, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A 47-year-old man digitally altered his bank account records to prove that he could fulfil his financial obligations, even though he did not have the funds to do so.Frederic Willy Gaillard also created fake e-mails purportedly from bank personnel in a bid to keep up the facade.The Swiss national was jailed for 14 weeks on Thursday (June 17) after pleading guilty to four counts of forgery.Five other similar charges were taken into consideration by District Judge Ronald Gwee during sentencing.Court documents stated that Gaillard committed the offences between 2018 and 2019.Two of them involved purported transfers amounting to about US$6 million ($8 million) in total from his bank account in Switzerland to a company owned by a Mr Peh Wei Siang.Mr Peh, who mistakenly believed that Gaillard had at least US$10 million, had asked for a loan on an investment venture, the court heard.In April 2018, Gaillard created payment order slips which purported to show that the transfers were approved and were to be subsequently executed.The court heard that he could generate the payment order slips using his Internet banking account even though he did not have sufficient funds for the transfers.Gaillard also took a screenshot of his account's overview page and digitally altered it to show that his account had about US$6.2 million.When Mr Peh later requested documentation from Gaillard to explain why the company had not received the money, the latter created an e-mail purportedly from his relationship manager at the Union Bank of Switzerland (UBS).The e-mail stated in French that the transactions had raised suspicions of money laundering and were being studied by UBS' security service.As part of the deception, Gaillard used an online e-mail spoofing service to make it seem as though the manager had sent the e-mail to him.He used the same methods to falsify his bank account balance and create another fake e-mail in early 2019.He did so to deceive individuals to whom former lawyer Then Feng owed money.These individuals were informed that Gaillard would transfer the money to them.Then has been sued in three civil cases, including one in which he is alleged to have misappropriated more than $8 million.He also faces 30 criminal charges, including for cheating and forgery.In their sentencing submissions, deputy public prosecutors Haniza Abnass, Tan Pei Wei and Samyata Ravindran urged the court to jail Gaillard for at least four months.They said his offences were difficult to detect, given the \"sophistication of the forgeries and, in particular, the use of an online e-mail spoofing service\".For each of his forgery offences, Gaillard could have been jailed up to 10 years and fined.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/man-who-digitally-altered-bank-records-and-created-fake-emails-jailed-for-14", "Source": "google"}