{"Type": "Sport", "Time": "2021-06-18", "Headline": "Football: We'll beat Russians for Eriksen, says Denmark coach Hjulmand", "Text": "LONDON: Yussuf Poulsen's early goal for Denmark in their Euro 2020 match against Belgium on Thursday lifted the spirits of a team still traumatised by Christian Eriksen's cardiac arrest and they are now determined to beat Russia for him, coach Kasper Hjulmand said.Although the Danes were beaten 2-1 by Belgium, they can still make the knockout round from Group B with a 2-0 win over Russia provided Finland do not get a result against Belgium.With Eriksen recovering well five days after collapsing to the ground during their opening match of Euro 2020, Denmark are eager to ensure they can prolong their stay in the tournament.\"With Christian in our minds and our hearts, we know that he's still here, we know it's going to be a tough few weeks for you Christian, we're here for you,\" Hjulmand told a media conference.\"We're going to stick together and we're gonna beat the Russians, we're not done in this competition.\"Eriksen passed on his congratulations to the team when they returned to the dressing room, striker Martin Braithwaite said.\"He sent us a message in the WhatsApp group. I think he said that we were really awesome, I haven't had time to look, but there was a message when we entered the dressing room,\" Braithwaite said.After an emotionally-charged build-up, Poulsen scored in the second minute to put the smiles back on the faces of Danish fans, and though Hjulmand's side showed great character, they conceded twice in the second half to fall to their second consecutive defeat in Group B.\"We were prepared for the emotional side of the game. I was very moved when the national anthem was being played, but once we're together we press the 'on' button and we used all the huge energy that was in the stadium,\" Hjulmand said.\"As I told the players in the dressing room, the only thing I am disappointed with is the result. I didn't' expect too much from this game, I can't explain the pride I feel for this squad.\"Four days after almost losing one of their best friends, they get up and play such a game, it's amazing They dominated the best team in the world,\" Hjulmand said.Braithwaite promised to harness the Parken energy for their must-win final group game against Russia at their home stadium.\"We have a game on Monday and I'm already looking forward to it, even if we're only just finished this one. We're going to finish this, we're going to get through the group stage. With this team there are no limits,\" a defiant Braithwaite said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "sports,Belgium,beat,Denmark,Christian Eriksen,Russia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/euro-2020-we-will-beat-russians-for-eriksen-says-denmark-coach-15037374", "Source": "google"}