{"Type": "", "Time": "2021-06-17", "Headline": "Hundreds of vaccinated healthcare workers infected in Indonesia, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.JAKARTA • More than 350 doctors and medical workers in Indonesia have tested positive for Covid-19 despite having received the Sinovac vaccine, with dozens hospitalised, said officials as concerns grow over the efficacy of some vaccines against infectious variants.Most of the workers were asymptomatic and self-isolating at home, but dozens were in hospital with high fevers and declining oxygen levels, said Mr Badai Ismoyo, head of the health office in the Kudus district in central Java.Kudus, which has about 5,000 healthcare workers, is battling an outbreak believed to be driven by the more transmissible Delta variant, which has pushed its bed occupancy rates above 90 per cent.Designated as a priority group, healthcare workers were among the first to be vaccinated when inoculations began in January.Almost all have received the Covid-19 vaccine developed by Chinese biopharmaceutical company Sinovac, said the Indonesian Medical Association (IDI).While the number of Indonesian healthcare workers dying from Covid-19 has dropped sharply from 158 in January to 13 last month, according to data initiative group LaporCovid-19, public health experts say the Java hospitalisations are a cause for concern.Dr Dicky Budiman, an epidemiologist at Australia's Griffith University, said: \"The data shows they have the Delta variant (in Kudus) so it is no surprise that the breakthrough infection is higher than before. Because, as we know, the majority of healthcare workers in Indonesia got Sinovac, and we still don't know yet how effective it is in the real world against the Delta variant.\"The World Health Organisation (WHO) approved emergency use of Sinovac's vaccine this month, saying results showed it prevented symptomatic disease in 51 per cent of recipients and prevented severe Covid-19 and hospital stays in all of those studied.As Indonesia grapples with one of Asia's worst outbreaks, registering more than 1.9 million infections and 53,000 deaths, its doctors and nurses have suffered a heavy toll of 946 deaths.Many are experiencing pandemic fatigue and taking a less vigilant approach to health protocols after being vaccinated, said Ms Lenny Ekawati of LaporCovid-19.\"That phenomenon happens quite often these days, not only within the community, but also healthcare workers,\" she said. \"They think because they are vaccinated that they are safe.\"But as more cases of the highly transmissible Delta variant are identified in the world's fourth-most populous nation, the data is starting to tell a different story.At least five doctors and one nurse have died of Covid-19 in Indonesia despite being vaccinated, according to the data initiative group, although one had received just the first shot. In Kudus, one senior doctor has died, said IDI, although it is understood that he had a co-morbidity.In capital city Jakarta, radiologist Prijo Sidipratomo said he knew of at least half a dozen doctors who had been hospitalised with Covid-19 in the past month, despite having been vaccinated, with one in the intensive care unit.\"It is alarming for us because we cannot rely on vaccinations only,\" he said.Weeks after the Muslim Eid al-Fitr holidays, Indonesia has experienced a surge in cases, registering 12,624 new infections - its highest since February - and 277 deaths yesterday.In its latest report, the WHO urged Indonesia to tighten its lockdown as increased transmission due to variants of concern demanded urgent action.REUTERSJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/hundreds-of-vaccinated-healthcare-workers-infected-in-indonesia", "Source": "google"}