{"Type": "", "Time": "2021-06-18", "Headline": "Dow Jones, Nasdaq 100 Outlook: Reflationary Trade Dissipating, Nikkei 225 Eyes BoJ", "Text": "\nWe use a range of cookies to give you the best possible browsing experience. By continuing to use this website, you agree to our use of cookies.You can learn more about our cookie policy here, or by following the link at the bottom of any page on our site. See our updated Privacy Policy here.\nNote: Low and High figures are for the trading day.Note: Low and High figures are for the trading day.Note: Low and High figures are for the trading day.Note: Low and High figures are for the trading day.Note: Low and High figures are for the trading day.Note: Low and High figures are for the trading day.Following Wednesday’s Fed monetary policy announcement, market sentiment was mixed on Wall Street. On Thursday, the growth-oriented Nasdaq 100 gained 1.31% while the value-focused Dow Jones (E-mini futures) weakened 0.63%. Fading dovish expectations from the central bank may be playing a key role here, the US Dollar gained ground against its major counterparts.Diminishing prospects of the reflationary trade may have been the driver behind equities on Wall Street. On the chart below, the Nasdaq Composite can be seen climbing since the middle of May. During this time, the US breakeven rate (5-year) declined from above 2.75% to just around 2.40%. This is the weakest reading in roughly four months.Since breakeven rates are calculated by taking the difference between nominal yields and real equivalents, the outcome is a market gauge of anticipated inflation. In this case, the 5-year represents a long run outlook. Given the central bank’s less dovish stance, opening the door to rate hikes sooner than expected, this might be trimming inflation bets down the road. This may consequentially be driving investors back into growth stocks.From a technical standpoint, the Nasdaq 100 appears to be trading higher within the boundaries of a bearish Rising Wedge chart pattern. However, negative RSI divergence does show that upside momentum is fading. That can at times precede a turn lower. Such an outcome may place the focus on rising support. Further clearing the latter may open the door to extending losses.Chart Created in TradingViewThe Dow Jones has extended losses after a bearish crossover between the 20- and 50-period Simple Moving Averages on the 4-hour chart below. This is offering a near-term downward bias as prices sit above the minor 14.6% Fibonacci extension at 33645. Further losses would likely place the focus on lows from May, making for key support between 33200 and 33402.Chart Created in TradingViewWith that in mind, Asia Pacific equities could be looking at a mixed session to wrap up the remainder of the week. The economic docket is fairly quiet, with the key event risk being the Bank of Japan rate decision. Right before the decision, Japan’s latest inflation report turned positive for the first time in over a year. The year-over-year CPI (excluding fresh food) clocked in at 0.1% versus 0.0% anticipated. But, that is unlikely to meaningfully shift the central bank’s policy approach. With price pressures still remaining so low, especially compared to other parts of the world, lose policy is still probably likely for some time. That may offer a boost to the Nikkei 225 benchmark stock index. Australia’s ASX 200 index could be vulnerable if commodity prices, especially metals like iron ore and copper, struggle climbing.The ASX 200 continues to hover around record-high territory. This is as negative RSI divergence emerged, hinting that a top could be in store. But, both the 20- and 50-period SMAs continue to offer a near-term upward bias. A drop through the latter risks opening the door to extending losses. Otherwise, the 38.2% Fibonacci extension is in focus at 7450.Chart Created in TradingView--- Written by Daniel Dubrovsky, Strategist for DailyFX.comTo contact Daniel, use the comments section below or @ddubrovskyFX on TwitterDailyFX provides forex news and technical analysis on the trends that influence the global currency markets.\nDISCLOSURES\n\nLeveraged trading in foreign currency or off-exchange products on margin carries significant risk and may not be suitable for all investors. We advise you to carefully consider whether trading is appropriate for you based on your personal circumstances. Forex trading involves risk. Losses can exceed deposits. We recommend that you seek independent advice and ensure you fully understand the risks involved before trading.\nFX PUBLICATIONS IS A MEMBER OF NFA AND IS SUBJECT TO NFA'S REGULATORY OVERSIGHT AND EXAMINATIONS. HOWEVER, YOU SHOULD BE AWARE THAT NFA DOES NOT HAVE REGULATORY OVERSIGHT AUTHORITY OVER UNDERLYING OR SPOT VIRTUAL CURRENCY PRODUCTS OR TRANSACTIONS OR VIRTUAL CURRENCY EXCHANGES, CUSTODIANS OR MARKETS.FX Publications Inc (dba DailyFX) is registered with the Commodities Futures Trading Commission as a Guaranteed Introducing Broker and is a member of the National Futures Association (ID# 0517400). Registered Address: 32 Old Slip, Suite 803; New York, NY 10005. FX Publications Inc is a subsidiary of IG US Holdings, Inc (a company registered in Delaware under number 4456365) ", "Section": "", "Writers": "", "URL": "https://www.dailyfx.com/forex/market_alert/2021/06/18/Dow-Jones-Nasdaq-100-Outlook-Reflationary-Trade-Dissipating-Nikkei-225-Eyes-BoJ.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}