{"Type": "", "Time": "2021-06-18", "Headline": "No rush for DIY Covid-19 test kits on first day of sales, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Sales of self-administered Covid-19 test kits started at all major pharmacies in Singapore yesterday.All 79 Guardian pharmacy stores islandwide have been stocked with two antigen rapid test (ART) kits: the Abbott PanBio Covid-19 Antigen Self-test and the QuickVue At-Home OTC Covid-19 Test.The two test kits are also avail-able at Watsons Singapore and Unity stores.A Guardian spokesman said: \"Both brands are approved by the Health Sciences Authority (HSA). The instructions on how to use these two brands differ, hence customers are advised to follow the specific instruction leaflet carefully for the brand they purchase.\"Their retail prices range from $10 to $13 per test kit, as recommended by the Ministry of Health (MOH).The Abbott PanBio test kit costs $13 at Guardian. The same kit costs $12.80 at Unity and $13.10 at Watsons. It is cheaper to purchase the test kits in boxes of 10 or more.There were few buyers for the test kits when The Straits Times checked Guardian, Watsons and Unity pharmacy outlets in Jurong East, Bukit Panjang, Potong Pasir and Toa Payoh yesterday morning.Mr Eric Lim, 33, who works as a kitchen staff at a Japanese restaurant, said he plans to buy three kits next month, when he has a cruise to nowhere.\"I plan to use one kit to test myself before I go on my trip and the other two to occasionally check on myself as my grandparents live with me. I don't want to risk spreading anything to them,\" said Mr Lim.He will buy more kits if he can use them with ease.Mr Jordan Lim, 30, director of the Red Ginger eatery chain, intends to buy 150 test kits for his employees in his four outlets.He said the kits give them the convenience of administering the test once every two weeks without having to go to a test centre.But he is concerned about the cost of testing, saying: \"With the pandemic, our revenue has significantly decreased, so we are unsure if we can absorb the cost of the test kits in the long run.\"The self-administered test kits are meant to make testing fast, easy and accessible as Singapore gradually resumes more activities.They will allow MOH to detect infected cases more quickly, in particular among asymptomatic individuals and those concerned that they might have been exposed to Covid-19.Sales across all pharmacies are currently limited to 10 ART kits per person to ensure adequate supplies for all.The Guardian spokesman said its pharmacies have sufficient stock to cater to the expected demand.\"The limit of 10 kits has been set to ensure sufficient stocks for everyone... Our pharmacists will exercise discretion with regard to the sale of test kits, and we will encourage customers to shop safely and purchase only what they need,\" she said.\"We will continue to closely monitor the situation and adapt our measures where needed.\"Individuals who have a positive result for their ART self-test should immediately approach a Swab And Send Home public health preparedness clinic for a confirmatory polymerase chain reaction (PCR) test, MOH said.They are then required to self-isolate until they receive a negative PCR test result.Meanwhile, those who test negative on their ART kit should still stay vigilant and adhere to prevailing safe management measures.Individuals who have acute respiratory infection symptoms have also been urged to visit a doctor for a full diagnosis and PCR test instead of relying on an ART kit.The HSA has also noted that ARTs have a lower sensitivity than PCR tests and a higher chance of false negative results.In general, ARTs can achieve a sensitivity of about 80 per cent for cases with higher viral loads and a specificity range of 97 per cent to 100 per cent, it added.Sensitivity refers to a test's ability to identify those infected as positive, while specificity refers to a test's ability to correctly identify those not infected as negative.• Additional reporting by Fang Yi YangJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/no-rush-for-diy-covid-19-test-kits-on-first-day-of-sales-0", "Source": "google"}