{"Type": "", "Time": "2021-06-18", "Headline": "Liverpool should be thankful for Gennaro Gattuso ahead of Tottenham move - Liverpool Echo", "Text": "Gennaro Gattuso has had a bit of previous with Liverpool as he prepares to become Tottenham Hotspur managerFollow LFC stars in the Euros, transfer news and more with our Reds newsletterLiverpool supporters becoming mildly perturbed at the relative lack of transfer action from their club should at least take some solace.At least their club isn't looking for a new manager.Clearly, it isn't easy in the current climate given Premier League rivals Everton, Crystal Palace and Tottenham Hotspur have gone weeks without appointing a permanent boss since the previous incumbent either quit, retired or was sacked.Tottenham have flirted heavily with a number of contenders, with Mauricio Pochettino, Antonio Conte and Paulo Fonseca all ultimately unwilling to make the move.Now, though, it appears Gennaro Gattuso is close to agreeing to take over from the deposed Jose Mourinho having lasted just 23 days as head coach of Fiorentina.And the prospect of going up against the former Italy international will bring back floods of memories for Liverpool supporters of one night in particular.The 2005 Champions League final against AC Milan in Istanbul will forever be etched in the annals, the Reds coming from 3-0 down to force a penalty shoot-out they subsequently won.Gattuso was in the Milan midfield that evening. But to say he wasn't exactly highly regarded by his opponents was an understatement.\"Gattuso made a lot of noise but he never worried me,\" said Steven Gerrard, Liverpool skipper on the night. \"He’s not the sort of midfielder to play a brilliant pass or score many goals.“He played up to the fans but as an opponent, he didn’t scare me. But I remember him smirking after it went to 3-0.“You could just tell by Gattuso’s demeanour that he thought it was over. All I was thinking of then was, ‘How do we get a bit of pride and respect back?’”Jamie Carragher evidently had a plan. He spotted Gattuso urging the Milan fans to cheer for their team at the start of the second half, and suggested to his team-mates the midfielder was already celebrating a win.\"You have to try to use any kind of motivation,\" said Carragher. \"At that time we were down in the dumps, and to be honest, you look at it and you think, 'Is he celebrating?'\"Now, Gattuso isn't that type of person, and, anyway, he wasn't celebrating at the end.\"Get all the latest Liverpool breaking news, team news, transfer rumours, injury updates plus analysis of what's next for the Reds.You'll also get the latest transfer talk and analysis straight to your inbox every day with our FREE email newsletter.Sign up here - it only takes a few seconds! We all know what happened next, Gattuso hauling down Gerrard in the box to allow Xabi Alonso to eventually score Liverpool's third goal in six minutes.Gattuso, speaking afterwards, was in no doubt. \"Any footballer or any fan will tell you that it's better to lose 3-0 without ever touching the ball, than to lose the way that we did,\" he said.Of course, Gattuso was part of the Milan team that exacted revenge with a 2-1 win in the Champions League final two years later.And he was on Merseyside in March 2019 as part of a Milan Legends side beaten 3-2 by their Liverpool counterparts thanks to a last-minute goal from, yep, Gerrard.Now, after a 10-year managerial career - including two seasons at Napoli, where he replaced Carlo Ancelotti - Gattuso could be about to renew rivalries with Liverpool once again.Just a shame the Premier League fixture list has ensured the Reds will have to wait until the week before Christmas - if Gattuso lasts that long. It won't be dull, that's for sure.", "Section": "", "Writers": "", "URL": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-thankful-gennaro-gattuso-tottenham-20842675", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}