{"Type": "Sport", "Time": "2021-06-18", "Headline": "Football: De Bruyne leads Belgium to 2-1 comeback Euro 2020 win over Denmark", "Text": "COPENHAGEN: Kevin de Bruyne came off the bench to inspire Belgium to a 2-1 comeback win over Denmark on Thursday and a place in the Euro 2020 knockout stages on an emotional afternoon of tributes to Christian Eriksen.Denmark got off to a dream start when Yussuf Poulsen put them ahead after 99 seconds as the team rode a wave of sentiment over playmaker Eriksen's cardiac arrest in their first game.The Danes dominated the first half but Belgium turned to a bench bursting with talent and De Bruyne, who came on right after the interval, laid on a sublime pass for Thorgan Hazard to level in the 54th minute after a galloping run by Romelu Lukaku.De Bruyne completed the comeback by finishing off another classy move to thump the ball into the net in the 74th minute.Denmark never gave up and had numerous attempts to equalise, striker Martin Braithwaite hitting the bar with a header and narrowly failing to connect with a cross.Belgium lead Group B with six points and became the second side after Italy to clinch their place in the last 16. Denmark have yet to earn a point and will need to win their final game against Russia and hope it is enough to get them through.Denmark keeper Kasper Schmeichel was hugely proud of his side's performance, especially after the trauma of Eriksen's collapse, and was in awe of the unified atmosphere made by the 25,000 fans present at Parken Stadium\"Everything that has been said about us is true. We fought to the last. We played a great game. It was not enough and we were not lucky. They put one of the world's best players on the field (De Bruyne),\" Schmeichel said.\"I've experienced a lot, but nothing beats this. It sounded like there were 75,000 fans. We would like to have rewarded them with a point or a victory.\"TEAM SPIRITBelgium's Lukaku also praised the Danes' spirit both in the game and in their reaction to Eriksen, his Inter Milan team mate who is recovering in hospital.\"I respect them as men. They saved my friend's life and I appreciate that. Their character today was incredible,\" he said.\"I had to put my feelings to one side in the first half, because I was thinking of Christian. Denmark must continue to believe in it and complete the job against Russia.\"Both sides' fans and players participated in a tribute to Eriksen before kickoff as a giant Denmark shirt with the player's name and number 10 was displayed on the pitch.The teams then stopped for a moment's applause in the 10th minute and the Danish crowd unfurled a banner saying: \"All of Denmark is with you Christian\".Denmark came alive in the atmosphere and pounced on a poor pass from Belgium's Jason Denayer which allowed Pierre-Emile Hojbjerg to feed Poulsen, who fired into the bottom corner.It was the second fastest goal in European Championship history, only trailing Dmitri Kirichenko's for Russia against Greece in Euro 2004 after 67 seconds.Denmark continued to overwhelm the 2018 World Cup semi-finalists with rapid, direct attacks and should have added to their lead, with Joakim Maehle and Mikkel Damsgaard going close.But Belgium made the Danes pay for not increasing their advantage.Lukaku burst down the right to take out two defenders and pass to De Bruyne, who showed remarkable poise to play in Hazard to score.The Manchester City midfielder, who missed the start of the tournament with a head injury, then provided an unstoppable finish as his side's superior talent shone through.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "sports,Belgium,Denmark,football,Euro 2020", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/football-de-bruyne-belgium-2-1-comeback-euro-2020-win-denmark-15036510", "Source": "google"}