{"Type": "Asia", "Time": "2021-06-18", "Headline": "Dolphins, turtles killed by fire-ravaged ship in Sri Lanka", "Text": "COLOMBO: Dozens of turtles and dolphins were killed by intense heat and chemical poisoning from a container ship that burned for almost two weeks off Sri Lanka, authorities said on Thursday (Jun 17).The Singapore-registered MV X-Press Pearl has been partially submerged off the island nation's coast since early June after an onboard blaze released tonnes of plastic raw materials that swamped local beaches.Wildlife officials said 48 dead turtles and eight dolphins, as well as many small fish, had washed up on the country's western and southern beaches in recent weeks.\"To see these images of dead turtles and dolphins is very distressing for our people,\" Environment Ministry Secretary Anil Jasinghe told reporters in Colombo.\"The carcasses that washed up soon after the fire had clear signs of burns from the intense heat of the ship.\"Jasinghe said preliminary reports also suggested that chemical poisoning was behind more recent discoveries of dead turtles.Autopsies were being conducted to finalise the causes of death, he added.Authorities were also probing the death of a 9m blue whale off the Jaffna peninsula about 400km north of Colombo.The whale washed up on the islet of Kayts on Tuesday, officials said.The burnt-out ship was known to be carrying 81 containers of hazardous chemicals, including 25 tonnes of nitric acid, when it caught fire.Officials have said about 1,200 tonnes of plastic pellets and other debris scooped from beaches are being stored in 45 shipping containers.They have also warned of the impact of microplastic pollution from the country's \"worst marine disaster\".Sri Lanka isseeking US$40 million in damagesfrom the ship's operators X-Press Feeders.Environmentalists are suing the government and X-Press Feeders for allegedly failing to prevent the disaster.Sri Lankan police have launched a criminal probe against the ship's captain, chief engineer and chief officer.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Sri Lanka,X-Press Pearl,environment", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/x-press-pearl-dolphins-turtles-killed-ship-fire-sri-lanka-15034792", "Source": "google"}