{"Type": "", "Time": "2021-06-18", "Headline": "Suga calls on public to watch Olympics on TV as Japan eases state of emergency - Japan Today", "Text": "\nJapanToday\nHigashi-Azabu IS bldg, 4F\n\t\t\t\t\t1-8-1 Higashi-Azabu\n\t\t\t\t\tMinato-ku\n\t\t\t\t\tTokyo 106-0044\n\t\t\t\t\tJapan\n\t\t\t\t\tTel: +81 3 5561 7755\n\t\t\t\t\tFax: +81 3 5561 7756\nEmail: editor@japantoday.com\n©2021 GPlusMedia Inc.\nJapan said on Thursday it would ease emergency coronavirus curbs in nine prefectures including Tokyo while keeping some measures, including limiting spectator numbers at big events, amid fears that next month's Olympics could trigger a surge in infections.Prime Minister Yoshihide Suga called on the Japanese public to watch the Olympics on TV to avoid spreading the virus, saying it was crucial to avoid any rebound in COVID-19 cases at the Games, due to start on July 23 after being postponed last year.\"The important thing is to continue with our policies with a sense of urgency to prevent the spread of infections. At the same time we must keep up our vaccination efforts to prevent the collapse of the medical system,\" he told a news conference.Suga said authorities were lifting the state of emergency for nine areas but would maintain \"quasi-emergency\" measures in the nine -- Tokyo, Hokkaido, Aichi, Kyoto, Osaka, Hyogo, Okayama, Hiroshima and Fukuoka, until July 11. The state of emergency had been set to expire on Sunday.Okinawa will to remain under a state of emergency until July 11.Under the \"quasi emergency\" measures, bars and restaurants, which are now barred from serving alcohol, will be allowed to do so until 7 p.m. provided they maintain COVID precautions. But local authorities can choose to keep the ban if they think it is necessary. Restaurants will still be asked to shut by 8 p.m.\"It's important to hold safe and secure Tokyo Games, curb the spread of infections during the period and prevent the spread of infections after the Games,\" said Suga. \"I would like to ask everyone to support the athletes at home, such as by watching television,\" Suga said.Japanese media have reported that the government, which has barred foreign spectators, is considering allowing up to 10,000 domestic fans into stadiums during the Games, in line with a plan endorsed by health experts on Wednesday for events.Polls have shown most Japanese people remain wary about the possibility that the Games will spread infections, particularly as vaccination rates are still lower than in other wealthy countries. Suga said on Thursday that the vaccination of over-65s was likely to be completed by the end of July.IOC HAS 'FINAL SAY'With the pace of decline in new infections in Tokyo slowing in recent days, some experts have warned of a likely rebound and stressed the need to respond quickly through further curbs or even the reinstatement of a state of emergency in the capital, Economy Minister Yasutoshi Nishimura said earlier.Asked whether the government would ask the International Olympic Committee (IOC) to cancel or postpone the Games even after they have started if there was a threat to public health and lives, Nishimura said: \"The IOC has the final say.\"\"Our top priority is to protect life and health. We will do our utmost to control infection and secure hospital beds.\"The organizers are due to decide as early as Monday on whether to allow domestic spectators at the Games and look likely to keep some restrictions on crowd numbers.Under the \"quasi-emergency\" measures, just as under a state of emergency, spectators at major events are limited to 5,000 or half of a venue's capacity, whichever is smaller.Health experts including top medical adviser Shigeru Omi agreed that the number of spectators at venues could be raised to 10,000, but only in areas where the \"quasi-emergency\" had been lifted.The Mainichi newspaper reported the government aimed to allow spectators into the Games, with the 10,000 cap. A decision on the maximum number of spectators is expected early next week.Public broadcaster NHK said on Thursday that Omi and other health experts had compiled proposals for the Games, stating that banning spectators would be the least risky approach.If spectators are to be allowed, the experts proposed there should be more restrictions than those applied to other large-scale events, NHK reported.Omi will hold an online news conference on Friday about experts' advice on how best to control the pandemic during the Games, the Japan National Press Club said.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberMore experts' advice, more meetings, more considerations, more \"quasi-stuff\".Nothing new so far.  Coming up with GOOD, sense-making ideas can be so difficult!Or don't watch it at all. It's gonna be horrific.”You’re all free Now, to do as you like … so, why not ‘stay indoors’ & watch it on TV” -PS:  You were always free and did as you liked. (There were never any real “restrictions”.) -Suga calls on public to watch Olympics on TV as Japan eases state of emergencyIf you are one of the 80% of the population in Japan that are against the event going ahead, as I am, just don’t watch it!What he means is watch the Olympics on T.V. So the IOC can get their money that they are expecting for the reason to not cancel the Olympics no matter what the people of Japan say…This is what Mr. Suga said, \"It's important to hold safe and secure Tokyo Games, curb the spread of infections during the period and prevent the spread of infections after the Games,\"This is what he was thinking,\"It's IMPOSSIBLE to hold safe and secure Tokyo Games, curb the spread of infections during the period and prevent the spread of infections after the Games,\"Do as we say not as we do...since this pandemic started how many government officials have flaunted the rules they set...everybody stopped listening long ago to this hopeless government..Suga calls on public to watch Olympics on TV as Japan eases state of emergencyNo.I just want to see the athletes do their best - on TV.Unless you subscribe to NBC International it will be difficult to find stations. I think Peacock TV?Me too. I will not watch it, is is an abomination and a disgrace to humanity to hold these Games now.Of course ignoring the whole thing is a better option. Luckily there are a lot of options to be entertained now that open TV is no longer the main thing many people see.So he is tacitly admitting the safe and secure Olympics are safe secure only on tv? Could have held them anywhere if it’s TV driven. I’m lucky my TV has a mask so I should be OK.Won’t be watching, spineless leader. But I look forward to the tv ratings during that timeYea, so they can make ad revenue. I won't be watching.zichiToday  07:16 am JSTUnless you subscribe to NBC International it will be difficult to find stations. I think Peacock TV?I’m gonna go out on a limb and suggest that NHK and several other Japanese outlets will be broadcasting. Not likely in English, but …As I've said many times, I've already decided not to support this event as soon as it became apparant it serves np other purpose than to generate profit for the IOC via T.V. revenue and the total disregard for the opinions of medical experts and the well being of the Japanese people.Suga is...well I've nothing positive to say......WTF....and line the pockets of nbc & the ioc......NO way in HELL!!I think the IOC and Japan should apologize to all these Olympic athletes being forced to compete in these dismal conditions. These aren't the Olympics they dreamed about while growing up and training their guts out for. It didn't have to be this way.These aren't the Olympics they dreamed about while growing up and training their guts out for.oh yes it is When Olympics are held in a foreign country, we watch it on TV. So it is exactly the same.But was Suga expecting thousands of locals to rush to the stadium. The message is clear. During the Olympics, priority to the games. You, the sheep, you stay home during that time. Ok, you understand? Do not disturb our party. If you want, watch TV, you will follow much better and can have beers and CHEERS.Watch the fiasco. Maybe I’ll paint a wall and watch that instead.Oh yes, Suga. We will obey and watch. (Sarcasm). I'll spend my time watching The Sopranos. If this is another State of Emergency, I'd actually rather spend my time with my kids. No thanks, Suga.I will not be watching at all.No not interested in watching. It will be remembered for all the wrong reasons.Nice hypocrite words Mr.Suga.On my side I won’t spend even a second of my life to watch this amplified Japan’s sport event formerly known as the World Olympics.Not only unethical to hold these games in such times but also pretty xenophobe to have only local spectators.Let’s do like with the World Heritage thing,give them all the gold medals and let the right wingers feel proud and let’s get over with this circus.I will not be watching or supporting the sponsors.I don't watch TV. Too busy with my own life to care about Suga and Koike lining their pockets.No thanks all the hassle IOC put us through why should I be told to watch it on tv. I won’t watch. I have more important things to do than watch covid lypicsWhen can we travel??? Open the borders. Not much people care about the Olympics that has lost its momentum.People can't say they aren't watching yet be the first to jump on event articles and grace us with their comments.No visitors from overseas. But Macron will come from France to attend the opening ceremony. People in Japan should watch on TV, not in person. But Suga and Koike will go to as many events as they want. Of course, we have to pay for this farce.The Olympics now represent something I find disgusting, so its a \"no\" from me.As someone who doesn’t watch TV at all (unless Netflix and YouTube count), I am pleased that I will not be contributing to the avaricious officials of the IOC. And even if I did watch TV (if for some reason I wanted my IQ lowered), I can’t really imagine watching the 100 meters final being run in front of a) nobody but a bunch of VIPs who don’t care who wins, or b) Japanese fans only (nothing against Japanese fans, but it won’t be much of an atmosphere).I doubt he has the imaginative powers to do so, but I wonder if Suga has ever considered the fact that he will be known as the man in power when the most meaningless Olympics in history were held.Can watch on TV as will be all Japanese athletics all the time like the past as never seen others anyway so what's the point.I don’t own a tv.  But this sounds like an attempt to have NHK collect an Olympic viewing tax.Like others have said, even if this was a normal Olympics, I wouldn't be watching. Japanese TV coverage concentrates only on Japanese athletes, to the extent that if a Japanese athlete gets a silver, you are still left wondering at the end of the coverage who got the gold.@zichi: Difficult to find a TV Channel to watch them on?  NHK, Fuji, TBS, Asahi - all showing in Japan - or whatever your local affiliates are in Hyogo.So long as Coates receives his $150 million, what else matters.Japanese paid with credit and loans for useless Olympics games that they did not want. very expensive TV program!!  repeat again the meaningless word DEMOCRACYNishimura said: \"The IOC has the final say.\"\"Our top priority is to protect life and health. And what all that means is the games are going to happen even if it kills everyone in Japan.Remember despite all the false promises by the IOC the following said by the IOC spokesperson makes it clear nothing is going to change their minds!Clearly stated by the IOC:Barring ArmageddonThat was the only possible situation the games would not proceed.Armageddon, think about that!I guess we now know the real reason for holding the Olympics (and not delaying until October or November when more are vaccinated) is so the IOC can get the revenue from the TV rights broadcasting.This is quite amusing - Lot of anger and hatred here this morning.So is Suga also going to stay at home and watch it on TV? A little hypocritical if I see him on TV enjoying a nice meal in a skyboxi will boycott these \"olympics\" as idea to organize it now during covid panic is truly insane,dont need to mention bruning of loads of money from taxpayers.I am not interested watch tons of advertisement in tv as well.NOMINATIONToday  08:29 am JSTPeople can't say they aren't watching yet be the first to jump on event articles and grace us with their comments.Of course they can. I’m going to be expressing dissent in articles right up until the start of the games.There’s no hypocrisy there.Hypocrisy is saying ‘Public health is my top priority’ then Ignoring medical advice and the wishes of the majority, all while surrendering control of your country to whoever can buy you the best steak.I'm confused about the surrounding areas of Tokyo that simply seem to copy whatever Tokyo does. Are the prefectures of Kanagawa, Chiba, Saitama autonomous of just suburban slaves of almighty Tokyo? They're not mentioned in the list of  \"quasi-emergency\" areas, but I bet they will do exactly the same thing as Tokyo.I'm confused about the surrounding areas of Tokyo that simply seem to copy whatever Tokyo doesYeah, don't they know the virus follows human rules of borders, meaning that these separate prefectures can have separate rules?!Athletes competing without masks (unavoidable) in the middle of a pandemic.  The results could be pretty gross.  If you like spatter movies you may find the Olympics to your taste.Asked whether the government would ask the International Olympic Committee (IOC) to cancel or postpone the Games even after they have started if there was a threat to public health and lives, Nishimura said: \"The IOC has the final say.\"I don’t understand. How can the IOC dictate anything to Japan? They are just a sports committee and Japan is a country.Never mind. Just read the other article. It’s all in the contract that Japan signed with the IOC. What a mess.No.er...The Olympics 'belong'to the IOC. Japan signed a contract to host them. That is why the IOC can dictate terms. Why this constant question over something that is well documented?Me too. I will not watch it, is is an abomination and a disgrace to humanity to hold these Games now.\"Agreed..not watching it either.\nIs the hypocrat strawberry farmer gonna watch it on TV too or will he be in the VIP stand with the other lords to be followed by fine steaks and booze at Ginza while peasants are told to stay home and drink a can of beer?Definition of a corporate tool.Sorry Sugi.  I gotta go to work.  You know, pay my taxes, the money you've been wasting?  I don't have time to sit and watch fencing.Unfortunately we can’t watch reruns of the games from the 40% of multimillion dollar connected who get the Olympic Village apartments after the pesky one year postponed event CAN.Shouldn't be too hard. From my experiences in Japanese homes, the TV is generally always on and someone is drooling in front of the nonsense it emits.Stuff you Suga, I'll do what I like in my free time and I won't watch your damned Olympics.Use your Facebook account to login or register with JapanToday. By doing so, you will also receive an email inviting you to receive our news alerts.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberA mix of what's trending on our other sites\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tSavvy Tokyo\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t", "Section": "", "Writers": "", "URL": "https://japantoday.com/category/national/Suga-calls-on-public-to-watch-Olympics-on-TV", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}