{"Type": "", "Time": "2021-06-18", "Headline": "Hong Kong approves plan to ease city's strict travel quarantine, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.HONG KONG (BLOOMBERG) - Hong Kong will shorten hotel quarantine for fully vaccinated travellers from most places to seven days as long as they pass an antibody test, people familiar with the matter said, easing a border policy which has been criticised by residents and the city's powerful finance industry for being among the strictest in the world.Authorities are now trialling various antibody tests - which are meant to confirm that a person has been vaccinated or has recovered from Covid-19 - like those that require a prick of the finger, said the people, who asked not to be identified as they're not authorised to speak publicly.There's been no decision on when the policy will take effect as it depends on when the testing facilities are ready, the people said. Those coming from \"high-risk\" locations where outbreaks are uncontrolled won't be included in the plan, said one of the people.Places like the UK, US and Japan are currently designated \"high risk,\" while six nations including India are judged \"extremely high risk,\" with travel banned from these locations. The list is updated regularly.Travellers entering Hong Kong currently need to quarantine in a hotel for up to 21 days, even if they're fully vaccinated. Shortening that for some would be the city's most significant move yet to ease the stringent restrictions that have threatened its status as a financial hub as major western economies open up and vaccination pulls ahead in regional rival Singapore.Like a handful of other \"Covid-19 havens\" that have largely eliminated local transmission of the virus, Hong Kong has been struggling to find a path to reopen as the rules that allowed it to stamp out Covid-19 increasingly become a straitjacket.The easing was first recommended by a government advisory panel earlier this month. The city's Food and Health Bureau didn't immediately respond to a request for comment.The current, 21-day rule has been a growing source of public anger. Travellers have to book their own hotel rooms, and they're being reserved quickly over the summer period. The new rule will benefit fully vaccinated, Covid-negative travellers coming from \"low-risk\" countries like Australia and New Zealand.In Hong Kong, fully vaccinated people are also required to serve quarantine in government facilities if they come into close contact with infected people, even if they've tested negative for the virus. With vaccine uptake slow amid widespread distrust of the Beijing-backed government, calls have grown for the strict rules to be relaxed for inoculated people in order to boost rates.According to Bloomberg's vaccine tracker, 24.2 per cent of people in Hong Kong have received a first dose, compared to 47.3 per cent in Singapore and 53.8 per cent in London - despite an consistent supply of vaccine in the former British colony.Last month, the government said that senior executives of listed companies and major financial industry companies could apply to travel into Hong Kong without serving quarantine, a policy that incited backlash for being elitist. That plan has been postponed and no applications have yet been approved, Bloomberg reported this week.Chief Executive Carrie Lam said on Tuesday when asked about the panel's recommendation to shorten quarantine for vaccinated travellers that \"we have no objection in principle, but there is still a lot of work to follow up - how to meet the public health requirements without causing great inconvenience to visitors or colleagues in charge for taking blood samples for antibody tests.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/hong-kong-approves-plan-to-ease-citys-strict-travel-quarantine", "Source": "google"}