{"Type": "", "Time": "2021-06-17", "Headline": "S'pore population growth at slowest pace since 1965, Politics News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Singapore's population grew at its slowest pace since independence, with more residents staying single and even those who marry having fewer babies.The nation's sixth census since independence in 1965 also found other key trends set in motion decades ago to have solidified further. Singapore residents of all ages and races are now better educated and more do not consider themselves as having a religion.Conducted once every 10 years, the census is the largest national survey undertaken here on key characteristics of the population such as demographic, social, economic and employment trends.More findings from the Census of Population 2020 will be released tomorrow.Over the past 10 years, Singapore's total population grew by 1.1 per cent each year - the lowest decade of growth since independence.The number of citizens grew from 3.23 million to 3.52 million, while the number of permanent residents held steady at around half a million.The population is ageing. Those aged 65 years and older formed 15.2 per cent of the resident population last year, a marked rise from 9 per cent in 2010.In a trend that has implications for continued population growth, the proportion of singles rose across all age groups over the past 10 years, with the sharpest increase among younger Singaporeans aged 25 to 34 years.Less-educated men were more likely to stay single, whereas the opposite was true of women.Women, especially if they were more educated, had fewer children. The average number of children born per resident woman aged 40 to 49 years who had ever been married fell from 2.02 in 2010 to 1.76 last year.Within this age group, women who were university graduates had an average of 1.66 children last year - marking a steady decline from 1.74 children 10 years ago and 1.95 in 2000.Singaporeans are also better educated. Among residents aged 25 years and over, almost six in 10 (58.3 per cent) attained post-secondary or higher qualifications, up from less than half (46.5 per cent) in 2010. The Chinese, Malay and Indian communities all saw improvements.Women closed the educational gap with men in each successive cohort. When it came to those aged 25 to 34 years, the proportion of women (90.2 per cent) with post-secondary or higher qualifications exceeded men (90 per cent).English was the language most frequently spoken at home for 48.3 per cent of residents aged five years and over last year, up from 32.3 per cent in 2010. Most of them also spoke a vernacular language at home.There are growing numbers of Singaporeans who cite no religious affiliation.The proportion was 20 per cent last year, up 3 percentage points from a decade ago. This number was 15 per cent in 2000.The increase took place across all age groups and most types of educational qualifications.At a media briefing on Monday, Minister in the Prime Minister's Office Indranee Rajah said the census data showed Singaporeans had enjoyed significant progress over the past 10 years, and that the country remains multiracial, multi-religious and multilingual.Observing that Singapore citizens account for a greater proportion of population growth in this decade, she said: \"Singaporeans who wish to start and raise families remain a priority because we want to grow the Singapore population, the Singapore core. At the same time, we have to supplement our population with some immigration, because we also need to support our economy. But that has to be very carefully calibrated.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/politics/spore-population-growth-at-slowest-pace-since-1965", "Source": "google"}