{"Type": "", "Time": "2021-06-18", "Headline": "Tottenham transfer news: Fabrizio Romano reveals big Heung-min Son development | GiveMeSport", "Text": "According to famed journalist Fabrizio Romano, Tottenham winger Heung-min Son is expected to sign a new contract with the club soon.Romano claims that South Korean winger Son is closing in on a new contract with Spurs and all parties involved are confident that an agreement can be completed.The journalist reveals that Tottenham have been in negotiations with the 28-year-old since December and the proposed long term deal would be an improvement on his current salary.According to WhoScored, Son had the most prolific season of his career in the 2020/21 Premier League campaign as he netted 17 goals and registered ten assists.The South Korean international was Tottenham’s most creative spark as he led the way with two key passes per game, more than any other player in the squad.He was also rated as the third best performer for Spurs by WhoScored, with a rating of 7.27.Paulo Fonseca is ON THE VERGE of becoming the new Spurs boss! Hear what Tottenham fans are saying on The Football Terrace...Son remaining in north London is crucial for Tottenham. It is important that they tie down their greatest assets as they enter an uncertain summer transfer window.It has been widely reported that Spurs talisman Harry Kane has expressed his desire to leave north London, as some of the Premier League’s top clubs take an interest in the England captain.Ensuring that Son is part of their long-term future will be a big coup for the Spurs hierarchy as they cannot afford to lose both of their best attacking players.Tottenham are entering a fresh era under their new director of football Fabio Paratici. They are also reportedly on the brink of announcing Paulo Fonseca as head coach, and securing Son for the foreseeable future would surely be a big relief for the Portuguese manager.According to Spotrac, Belgian central defender Toby Alderweireld is set to be available on a free transfer upon the expiry of his contract in 2023.The Belgium international has been a mainstay in the side as he made 25 Premier League appearances in defence for Spurs this season, therefore it could be smart to ensure that he remains at the club on a long term basis.Hugo Lloris, Erik Lamela and Moussa Sissoko are also among players with less than two years remaining on their deals, however fresh contracts for the trio seem unlikely. Lloris is getting no younger at 34, whilst Sissoko and Lamela struggled for game time this season with just 20 Premier League starts combined.As a new era gets underway, the board may be keen to make space for fresh faces in the coming years. Once you have subscribed we will use the email you provided to send you the newsletter. You can unsubscribe at any time by clicking the unsubscribe link at the bottom of the newsletter email.© 2021 Sports New Media Limited. All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.givemesport.com/1708368-tottenham-transfer-news-fabrizio-romano-reveals-big-heungmin-son-development", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}