{"Type": "Singapore", "Time": "2021-06-18", "Headline": "Store assistant injured after glass panel at Bobbi Brown in ION Orchard shatters on first day of reopening", "Text": "SINGAPORE: A store assistant was injured after a glass panel at a Bobbi Brown outlet in ION Orchard shattered on the first day of the mall's reopening on Wednesday (Jun 16).ION Orchard wasclosed for four days from Jun 12as a precautionary measure after several COVID-19 cases were linked to the mall.The mall said in a statement on Wednesday that the incident happened at about 11am at the Bobbi Brown store.A single glass panel shattered when the shop was being opened for the day by the store assistant, said ION Orchard in response to questions from CNA.The worker suffered some cuts and was given first aid by an ION Orchard officer.The individual was subsequently taken to the Singapore General Hospital, the Singapore Civil Defence Force told CNA.\"We are in touch with the Bobbi Brown management and understand that the staff is recovering at home. We will render additional support to them as necessary,\" said ION Orchard.ENTIRE MALL \"THOROUGHLY CLEANED\"The mall was reopened on Wednesday with approval from the Ministry of Health (MOH), said ION Orchard in a separate statement on Wednesday.ION Sky will also be reopened to visitors, with enhanced safe management measures in place, it added.The entire mall and its stores were \"thoroughly cleaned and disinfected\" in line with guidelines from the authorities during the closure.All staff and tenants - including contractors and vendors who worked at the mall from May 28 to Jun 11 - were alsorequired to undergo a swab testduring the period of closure, said MOH previously.\"ION Orchard continues to focus on the safety and well-being of its shoppers, visitors, and working communities, and will continue to work closely with the authorities on any additional necessary precautionary measures,\" said the mall.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "ION Orchard,Bobbi Brown,MOH,COVID-19", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/ion-orchard-bobbi-brown-glass-panel-shatter-first-day-reopen-15026126", "Source": "google"}