{"Type": "Business", "Time": "2021-06-17", "Headline": "Bonds stung, dollar cheered by sudden hawkish turn at Fed", "Text": "SYDNEY:     Asian markets looked set for a rough ride on Thursday after the U.S. Federal Reserve stunned investors by signalling it might raise interest rates at a much faster pace than assumed, sending yields and the dollar sharply higher.The dollar boasted its strongest single day gain in 15 months as 10-year U.S. Treasury yields jumped by the most since early March.The initial fallout in equities was not as bad with S&P 500 futures down just 0.2per cent in early Asian trade, while Nasdaq futures were off 0.3per cent. Nikkei futures were also down a modest 0.3per cent.Emerging markets might not fare as well as they are particularly vulnerable to the chance of early U.S. rate hikes to contain inflation, which could suck funds out of riskier assets.\"The new Fed ‘dot plot’ indicating that the median FOMC member now forecasts two Fed rate hikes in 2023, versus none in the March iteration, represented the hawkish surprise out of the June Fed meeting,\" said Ray Attrill, head of FX strategy at NAB.The Fed forecasts, or dot plots, showed 13 of the 18 person policy board saw rates rising in 2023 versus only six previously, while seven tipped a first move in 2022.While the plots are not commitments and have a poor track record of predicting rates, the sudden shift was still a shock.The Fed rubbed salt into the wound by signalling it would now be considering whether to taper its asset purchases meeting by meeting and downgraded the risk from the pandemic given progress in vaccination.Analysts at JPMorgan noted Chair Jerome Powell was not as aggressive in his media conference.\"It appears that faster progress toward reopening and higher inflation surprises revealed some hawks on the FOMC, but we suspect that leadership is predominantly anchored at zero or one hike in 2023,\" they said in a note.\"We continue to look for lift-off in 2023, with tapering starting early next year.\"Markets moved quickly to price in the risk of earlier action and Fed fund futures shifted to imply a first hike by the end of 2022. Yields on 10-year bonds shot up almost nine basis points to 1.57per cent.The dollar smashed up out of recent tight ranges, rising 0.9per cent overnight against a basket of currencies to 91.387 for its biggest gain since March last year.The euro was down at five-week lows of US$1.1995 having shed 1.1per cent overnight, the sharpest fall since March 2020. The dollar also surged to 110.69 yen and looked set to test its 2021 peak at 110.96.The rise in bond yields and the dollar were a double blow for non-yielding gold which was down at US$1,817 an ounce after sliding 2.5per cent overnight.Oil prices were insulated by the prospect of stronger world demand and still tight supply, with Brent reaching its highest since April 2019 before running into profit taking.Brent was last off 12 cents at US$73.87 a barrel, while U.S. crude lost 65 cents to US$71.50.(Editing by Lincoln Feast.)It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "business and finance,U.S.,Fed,Bonds,yield,cheer", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/business/bonds-stung--dollar-cheered-by-sudden-hawkish-turn-at-fed-15031000", "Source": "google"}