{"Type": "", "Time": "2021-06-17", "Headline": "US stocks dip as Fed inches closer to policy shift, Companies & Markets News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.NEW YORK (AFP) - Wall Street stocks declined on Wednesday (June 16) as the Federal Reserve edged a bit closer to tightening monetary policy while adopting a broadly dovish response to recent signs of inflation.Shares hit session lows shortly after the US central bank raised its inflation and growth forecast and released projections that showed a majority of Fed officials expect interest rate hikes in 2023.However, equities recovered somewhat during Fed chairman Jerome Powell's press conference during which he emphasised that he views recent price hikes as temporary, and that steps to restrict monetary supply are not imminent.Jason Schenker of Prestige Economics said the overall message was \"highly accommodative,\" but included \"some hawkish changes at the margin.\"The Dow Jones Industrial Average finished at 34,033.67, down 0.8 per cent.The broad-based S&P 500 ended down 0.5 per cent at 4,223.70, while the tech-rich Nasdaq Composite Index lost 0.2 per cent at 14,039.68.Large banks mostly rose, with JPMorgan Chase up 0.7 per cent and Bank of America gaining 0.6 per cent as long-term bond yields climbed following the Fed announcement.Among individual companies, General Motors jumped 1.6 per cent as it again lifted its investment plan for electric and autonomous vehicle technology. The auto giant now expects to spend US$35 billion through 2025, up 30 per cent from its prior plan.Oracle slumped 5.6 per cent despite reporting better-than-expected results. Analysts expressed disappointment with the software giant's forecast.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/companies-markets/us-stocks-dip-as-fed-inches-closer-to-policy-shift", "Source": "google"}