{"Type": "", "Time": "2021-06-18", "Headline": "Covid-19 testing for visitors to Redhill, Tiong Bahru shops; Bukit Merah View food centre cluster grows to 56, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Special testing operations for staff and tenants who work in parts of Redhill and Tiong Bahru will be conducted from Friday (June 18), said the Ministry of Health (MOH) on Thursday (June 17) night.The testing operation comes as more cases were confirmed in the Tiong Bahru neighbourhood on Thursday, including one that was unlinked.The swabbing operation is therefore meant to detect and curb any community transmission, said MOH.\"MOH is investigating cases of Covid-19 infection among individuals who work in or visited 78, 79, 80, 84 and 85 Redhill Lane, 86 Redhill Close, 18 Jalan Membina and Tiong Bahru Yong Tao Hu Coffeeshop (56 Eng Hoon Street).\"In order to disrupt any wider, undetected community transmission, we will conduct special testing operations for all staff and tenants who have been working at these premises, \" said the ministry.There were 17 more people added to the Bukit Merah View food centre cluster on Thursday night (June 17), most of whom work at the food centre or are their family members, said the ministry.Linked cases in the cluster include a 73-year-old female Singaporean who works as a stall assistant at Tiong Bahru Yong Tao Hu (56 Eng Hoon Street).She is a family member and household contact of a cleaner who tested positive on Sunday, and the workplace contact of another stall assistant who tested positive for the virus on Thursday.She was quarantined and tested on Monday. On the same day, her test result came back positive for Covid-19 infection. Her serology test result is pending.She had received her first dose of Covid-19 vaccine on March 6, and the second dose on March 27.Another case linked to the cluster is a 23-year-old female Singaporean who works as a patient service associate at Singapore General Hospital. She was tested for Covid-19 on Tuesday as part of the hospital’s surveillance testing for staff. Her test result came back positive for the coronavirus on Wednesday. On the same day, she developed a sore throat and blocked nose.She received her first dose of Covid-19 vaccine on Feb 1 and the second dose on Feb 24. Her serology test result is pending. Two of her family members, a 62-year-old homemaker and a 10-year-old student also tested positive on Wednesday.The new cases bring the total number of cases in the Bukit Merah View cluster to 56. This makes it the largest open cluster to be declared since the MINDSville @ Napiri cluster on June 2, which currently has 33 cases.The 17 new cases in the cluster formed the bulk of the 19 linked cases that were announced by MOH on Thursday.The 19 linked cases consist of 14 cases who have already been placed under quarantine and five that were detected through surveillance.There is also one unlinked case and seven imported cases confirmed on Thursday, for a total of 27 new cases. The 27 confirmed cases as at Thursday take Singapore's total to 62,366, said MOH.The unlinked case is a 72-year-old Singaporean woman who works as a counter employee at McDonald's at Tiong Bahru Plaza. She is asymptomatic, and was detected when she was tested as part of surveillance testing of staff who work at the mall on Wednesday.All seven of the imported cases were already on stay-home notice or isolated upon arrival in Singapore. Three are Singaporeans or permanent residents.There were no new cases from migrant workers' dormitories.The weekly total number of community cases is 93 in the past week, up from 40 in the previous week. The number of unlinked cases has also risen to 18 in the past week, compared with seven cases in the week before.There are currently 41 active clusters of infection, down from 44 on Wednesday.As at Thursday night, 151 patients remain hospitalised, including one in critical condition in the intensive care unit, while 221 are recuperating in community facilities.Singapore has had 34 deaths from Covid-19 complications, while 15 who tested positive have died of other causes.READ MORE: MOH's press release in fullJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/bukit-merah-view-food-centre-cluster-grows-to-56-special-testing-operations-for-eng", "Source": "google"}