{"Type": "", "Time": "2021-06-18", "Headline": "Biden is now ‘clear and consensus leader of the free world’ following G7 and Putin talks, White House official says | The Independent", "Text": "European leaders were hesitant to take a hardline on China despite US rhetoric painting the country as a rising threatFind your bookmarks in your Independent Premium section, under my profileJoe Biden is now the \"leader of the free world\", according to his national security adviser, Jake Sullivan. The White House aide made the comment on Thursday, claiming \"I really do not believe that it is hyperbole to say that @POTUS returns from this this trip as the clear and the consensus leader of the free world.\"Mr Biden has been touting the line \"America is back”, distancing himself from former President Donald Trump's often antagonistic stance with US allies and friendliness with longtime adversaries like Russia and, earlier on in his presidency, China. The president's tagline has been to \"build back better”, an ideology he took into the G7 Summit in England.However any implication that democratic world leaders have fallen totally in step with Mr Biden's agenda may be an overstatement. While leaders largely agree on issues concerning the global response to the coronavirus, European leaders were less ready to jump into Mr Biden's foreign policy focus on painting China as a threat to global democracy. According to CNN, US officials said that authorities in Italy and Germany were uneasy with messaging in the G7's communique that China might view as provocative. German Chancellor Angela Merkel stressed a need for \"balance\" in dealing with China, saying the country \"is our rival in many questions but also our partner in many aspects”.French Prime Minister Emmanuel Macron also seemed unwilling to take a hardline stance against China, saying France wanted to work with Beijing on climate, trade, development and other issues. \"I will be very clear: The G7 is not a club hostile to China,\" he said in a statement. Despite the tiptoeing by European leaders, Beijing has already taken the messaging from the G7 as a provocation, saying it \"deliberately slanders\" the country and condemned the \"sinister intentions of a few countries such as the United States”.The summit attendees agreed they would develop an alternative to China's Belt and Road infrastructure initiative, and also called on China to respect human rights, specifically pointing out protesters in Hong Kong and Xinjiang province. Additionally, the world leaders called for a full investigation into the origins of Covid-19 – which conspiracy theorists have alleged was created in a lab in the Wuhan Institute of Virology – and for calm in the South and East China seas where China has been accused of attempting to assert its naval dominance of the region. Mr Biden told reporters that \"we haven't had access to the laboratories\" when asked about investigations into the origin of the coronavirus. The president said that it was not yet certain if the virus came from \"a bat interfacing with animals and the environment\" or if it \"was an experiment gone awry in a laboratory”.The headline, at least in US media, of Mr Biden's overseas visit was his meeting with Russian President Vladimir Putin, marking the first time the leaders have met in person since taking office. Though not part of the G7 summit, Mr Biden met with Mr Putin in Geneva on Wednesday. Mr Biden summarised the meeting's tone as \"good, positive\" and said he gave the Russian president \"basic rules of the road that we can all abide by”.Join thought-provoking conversations, follow other Independent readers and see their repliesAPWant to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.Log inNew to The Independent?Want an ad-free experience?Subscribe to Independent Premium.", "Section": "", "Writers": "", "URL": "https://www.independent.co.uk/news/world/americas/us-politics/biden-world-leader-g7-summit-b1868106.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}