{"Type": "", "Time": "2021-06-18", "Headline": "Lawrence Wong hints at possible delay in Phase 3 reopening", "Text": "SINGAPORE — Finance Minister and multi-ministry taskforce (MTF) co-chair Lawrence Wong has raised the possibility of a delay in the next stage of Singapore's re-opening following a recent outbreak of COVID-19 community cases. In a video posted on his Facebook page on Wednesday (16 June), Wong noted that a further easing of pandemic restrictions, including the resumption of dining in at hawker centres and eateries, is scheduled to take place on 21 June. Singapore is currently in Phase 3 (Heightened Alert) of its reopening, which started on 14 June.\"Unfortunately, we've had a latest outbreak of cases and we are likely to be dealing now with a very large cluster in Bukit Merah, where the cases are breaking out not only at the market and the hawker centre but also all around the vicinity. And day by day we are seeing the number of cases, the cryptic cases in the community are likely to be rising too,\" he said.Wong was referring to a cluster of infections linked to the Bukit Merah View Market and Food Centre, which currently has 25 cases.With this in mind, Wong added the government is \"evaluating the timeline and the scope of our second stage of opening\" and, in consultation with public health experts, would announce its decision soon.\"We want to ensure that we do not have another flare up before we reach sufficiently high levels of vaccination in our community,\" he said.In the video, Wong also demonstrated the use of an antigen rapid test (ART) kit, which can be used for self-testing to detect COVID-19. These kits are currently available at all major pharmacies, with prices ranging from $10 to $13.\"The process is fast, simple and very easy to use. All of us must get used to the idea of regular testing as part of our routine, like taking our temperatures,\" said Wong.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:Of 24 new COVID cases in Singapore, 19 in communityMore Singapore residents identifying as having no religion: censusPopulation growth slowed, higher proportion of singles in Singapore: censusIsraeli jets launched air strikes on Gaza overnight Thursday to Friday after militants in the Palestinian territory again set off incendiary balloons into southern Israel, the army and AFP journalists said.Rafael Nadal and Naomi Osaka, with 24 Grand Slam titles between them, both withdrew from Wimbledon on Thursday with the Spanish star also pulling out of the Tokyo Olympics in a bid \"to prolong my career\".Guided by MIT faculty, gain practical knowledge to embrace blockchain as a business tool.A spiked drink, a puff of dust, missing memories, and an empty bank account.Beijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityThe PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saMeet the PayPal business debit card. Use it everywhere Mastercard® is accepted.A US journalist detained in Myanmar since May appeared Thursday in a special court, his employers said, where he faces charges under a law that criminalises encouraging dissent against the military.Lim Chung Chun, may be the co-founder and CEO of homegrown wealth management firm iFAST Corporation, but he is still an investor at heart and a research analyst at his core. Learn more about his journey and his investment philosophy here.Hong Kong authorities could impose a tighter limit on the number of legal aid cases an individual lawyer can take on, amid rising pressure from legislators to reform the system to stop its “abuse” by anti-government protesters. The possible measure was part of an ongoing review of the city’s challenged legal aid system that was expected to be completed within this year, Chief Secretary Matthew Cheung Kin-chung told lawmakers on Wednesday. The revelation came as pro-establishment legislators agaiLastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Prime Minister Boris Johnson warned Wednesday he will take \"necessary steps\" to unilaterally alter Britain's post-Brexit trade terms unless the EU changes the way it is implementing them in Northern Ireland.China and other nations were attempting to “seize control” of strategically important international organisations so they could be “weaponised”, a new report by the UK parliament’s influential Foreign Affairs Committee said. The report, published Thursday, accused China in particular of “bullying” states to back their position or their candidates for top jobs, using measures including financial leverage “to shift policies away from the cooperation the organisations were created to promote”. TheWashington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HouseMore than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.A reporter with a pro-Beijing newspaper in Hong Kong accused of making a false statement when accessing a government car registry has been let off the hook after prosecutors agreed to drop the charge on condition of a binding-over order. The prosecution’s decision stood in marked contrast to the justice department’s handling of a case last year involving an RTHK contributor accused of the same act, prompting Principal Magistrate Ivy Chui Yee-mei to question the difference in approach at ThursdayIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Wax On, Wax Off? Try Spray On And Relax (Never Detail Your Car Again)The first astronauts arrived at China's new space station on Thursday in the country's longest crewed mission to date, a landmark step in establishing Beijing as a major space power.North Korean leader Kim Jong Un has said his country needs to prepare for \"both dialogue and confrontation\" with the United States under President Joe Biden, state media reported Friday.Former Taiwanese president Ma Ying-jeou has called on the government to listen to public opinion and allow civilian groups which have different political leanings to the ruling Democratic Progressive Party to import much-needed Covid-19 vaccines. Taiwan, which is battling a surge in cases, has struggled to secure vaccines although it has signed deals to buy 10 million doses from AstraZeneca, 5 million from Moderna and more than 4.7 million doses via the Covax Facility, which is supported by theNew research has identified TEN favorite stocks for the upcoming yearHong Kong police have for the first time determined the publication of certain newspaper articles to be a national security crime as they arrested the editor-in-chief, publisher and three other executives of Apple Daily whom they held accountable for more than 30 reports calling for foreign sanctions. The force on Thursday cited the publication of the articles – understood to be mostly commentaries and opinion pieces, including several written by the tabloid’s jailed founder and opposition activGlobal stocks were mixed on Thursday as traders digested the Federal Reserve's move to bring forward its forecasts for hiking interest rates as the economy recovers.China’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the bu", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/government-raises-possible-delay-next-stage-reopening-lawrence-wong-090401641.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}