{"Type": "", "Time": "2021-06-17", "Headline": "Major banks, airlines in Australia and US report brief online outages, Australia/NZ News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SYDNEY (AFP, BLOOMBERG, REUTERS) - Major banks and airlines in Australia and the United States suffered brief online outages Thursday (June 17), with several blaming an \"external provider\" for the disruption.Most of Australia's major financial firms reported customers could not access websites and mobile apps, while website Downdetector said a slew of US airlines were also affected.American, Delta, United and Southwest airlines were among them, although all four websites appeared to be working shortly after.“Our website and other internet-based tools are back up and running today after a brief outage late Wednesday evening,” Southwest spokesperson said in a statement. “We are continuing to look into the root cause of last night’s outage but it’s believed to be related to the broad Akamai outage.”American Airlines, United Airlines and Delta Air Lines were not immediately available for comment.Hong Kong Exchanges & Clearing and Australia’s central bank also went down briefly Thursday in the second global internet outage in as many weeks. Some of the outages, including those that affected Commonwealth Bank of Australia, Westpac Banking Corp and Australia & New Zealand Banking Group were linked to a failure at Akamai Technologies, which helps clients manage web services, people familiar with the matter said, asking not to be identified discussing internal affairs.The Reserve Bank of Australia was forced to cancel a scheduled bond-buying operation Thursday, blaming “technical difficulties”.A representative for Akamai in Asia didn’t respond to emails and calls seeking comment, Bloomberg reported. The widespread downtime recalled an hour-long global outage earlier this month, triggered by a software failure at content delivery platform Fastly that affected services from Amazon.com to Shopify and Stripe.In Thursday's incident, issues appeared to be more prolonged in Australia - where problems hit in the mid-afternoon as much of the rest of the world slept - with services only slowly returning an hour after the first reports.A spokesman for ANZ bank told Agence France-Presse that the incident was \"related to an external provider\" but that \"connectivity was restored quickly and the most impacted services are back online\".Commonwealth Bank told AFP that it and many of the country's major banks had been affected.Westpac and ME Bank also reported problems with their mobile apps or online banking products, while customers for St George and several regional banks reported they were down too.The outages began around 2.10pm Sydney time (12.10pm Singapore time) and did not appear to be limited to the banking sector.Virgin Australia airline said it was “one of many organisations to experience an outage with the Akamai content delivery system,” though the situation was now resolved.Australia Post, the country's postal service, said some services were hit by an \"external outage\".A series of high profile hack-for-ransom attacks have also left corporations around the world jittery over cybersecurity risks, although there was no indication the latest problems were caused by malicious actors.Colonial Pipeline was briefly shuttered after an attack in May, and JBS, the world's largest meat producer, was forced to stop operations in the United States and Australia.Both firms reportedly paid ransom to get operations back up and running.The issue of cybersecurity was at the top of the agenda when US President Joe Biden and his Russian counterpart Vladimir Putin met in Geneva this week.Washington believes hackers who have extorted hundreds of millions of dollars from Western governments, companies, and organisations operate from Russian soil.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/australianz/major-banks-airlines-in-australia-and-us-report-online-outages", "Source": "google"}