{"Type": "", "Time": "2021-06-18", "Headline": "Are Asia's Covid 'winners' entering shaky new territory? - BBC News", "Text": "By Andreas Illmer and Frances Mao  BBC NewsAustralia. New Zealand. Singapore. Vietnam. Japan. Hong Kong. South Korea. Taiwan.These places in the Asia Pacific region have all been praised for their pandemic response; with several ranked among the best in the world.All were able to get on top of Covid-19 in 2020 through aggressive actions like strict lockdowns and contact tracing, which were later often replicated by the rest of the world.Yet in the second year of the pandemic, they are being challenged by new issues. Stronger variants have broken through established defences, creating the worst outbreaks yet in some countries. Meanwhile, many other parts of the world appear to be surging ahead with vaccinations and are beginning to gradually open up again. That means that many of these poster boys of Covid containment are now facing criticism that they don't have a solid plan to get out of their zero-case approach - and that they can't hide from the world forever. First, let's look at how these states managed to combat Covid so successfully early on. The map below shows case and death rates far lower than those seen in most other nations.Shutting borders was one of the first and most effective measures taken by those eight places when the virus first reached their shores. The fact that many of them are islands made border control relatively easy. The strict border policies meant either blocking almost all entries or requiring long hotel quarantines to ensure the virus would not take hold in the general population. Australia was the most strict - at one point during India's second wave, it even banned its own citizens from returning because of fears they could carry back the virus.When cases did leak out into the community, there was swift and meticulous contact tracing to stop the virus from spreading. Singapore, which already had a highly capable police surveillance system, was a prime example of how effective it is to quickly shut down chains of transmission. Australia plunged state capitals into snap lockdowns over the discovery of even a single case. This happened eight different times for six different cities.Such policies may be viewed as extreme - but they worked and created a protective bubble. After the initial lockdown during the first Covid wave, all of these places were able to return to a near-normal state.New Zealand was the first to essentially be Covid-free after becoming one of the first to enter lockdown. In June 2020, it lifted almost all of its social distancing measures. Meanwhile, the other places in our group also saw infections fall to a trickle, allowing them to ease many of the internal containment measures. However, stronger variants of the virus combined with a gradual complacency and a relaxing of rules have since May sparked a minor resurgence in many of those places.The most serious surges have been seen in Taiwan and Vietnam - places which are only now experiencing the full brunt of a Covid wave.In Taiwan, a slight easing of quarantine rules for airline pilots led to a rapid cluster, while in Vietnam, a fast-moving new variant has seen multiple clusters spring up, exacerbated by community gatherings.South Korea and Japan hit new heights in Covid waves a few months back - prompting alarm, particularly in Japan where many are concerned about the upcoming Olympic Games.However the rate of infection since those peaks has halved. For places like South Korea - which has never gone into a hard lockdown - experts say that vigilant tracing and a united community effort has once again helped to bring the curve down.Smaller outbreaks have also been recorded in Singapore, Hong Kong and Australia, prompting immediate reaction from authorities, such as a snap two-week lockdown of Melbourne or a four-week partial lockdown in Singapore. Yet while those recent outbreaks are being successfully tackled with trusted methods, they have also brought home a bitter truth.As much as the places in question succeeded in keeping the virus at bay, they were not nearly as successful when it came to securing vaccines. Initial procurement was difficult around the globe yet it was often countries hit hard by the pandemic that quickly managed to get a vaccination programme going, if they could afford it. Those with low infection rates have appeared slow and complacent in securing enough jabs for their citizens. The US and Europe for instance have vaccinated around half or more of their populations and many South American countries have administered millions of Covid shots. These nations are now slowly working their way to a vaccination level that will allow them to open up - even with the virus still around.This has not been the case with the Covid success places in the Asia Pacific.The percentage of people vaccinated is still below a quarter of the population - and that's for rich countries like Australia, Japan, New Zealand and the island of Taiwan where you would expect procurement to be as easy or difficult as for Europe and the US. There is also hesitancy among some citizens, for instance in Hong Kong or Taiwan, who don't trust health authorities and vaccination safety, which is further slowing progress. The only exception to that poor showing is Singapore, where some 42% have received at least one shot.Singapore however is a city state with just over 5 million people, so the actual number of shots given remains small. Compare that, for example, to India's 250 million doses.With Covid-19 likely to become an endemic disease, the only way out for countries is through vaccination.But until herd immunity is achieved, it appears that the Asian Covid stars are reluctant to loosen the strict measures that have worked so well for them - closed borders, lockdowns and social distancing rules. When Australia said its borders would remain closed until mid-2022, a public debate was sparked about how long it could remain a \"hermit kingdom\".  While there are no plans to fling the doors open, there is talk of gingerly stepping into a phased exit. Discussions are also under way about potential travel bubbles opening between various \"safe\" countries. Hong Kong and Singapore had talked of such a plan before it was scuppered by case outbreaks.And such a channel already operates between Australia and New Zealand - which both report almost no local cases on most days. However, both nations shut that channel whenever a new rash of cases emerge.Experts have warned that with Covid so prevalent around the world, to have the nations truly be open, their societies have to do away with the idea of a \"zero Covid\" mentality which is unrealistic, and come to \"live\" with the virus.People have called for a clearer exit strategy to be put in place - one with staged targets in sync with rapid vaccination programmes - but that is currently missing.The battle to open up 'Fortress Australia'Covid 19: What went wrong in Singapore and Taiwan?What's it like in the best place to live during Covid?Celebrity rush exposes Australian 'double standard'US Supreme Court rejects big challenge to ObamacareThe justices' 7-2 ruling preserves medical insurance for millions of low-income Americans.Iran presidential vote marred by disqualificationsBiden signs bill creating Juneteenth holidayOnce the future, US now captive to its pastWhy US millennials are quitting big cities. VideoWhy US millennials are quitting big citiesWhat's the big deal about In The Heights?Ethiopia election: A sham or democratic rebirth?Quiz of the week: What was on the G7 menu?Asia's Covid stars struggle with exit strategiesBBC Future: The forgotten tricks of 'letterlocking'Alarming Covid surge cools Russia’s football feverThe islanders up in arms on this Indian archipelagoFootball phrases15 sayings from around the worldUS couple who waved guns at protesters plead guilty1Victoria’s Secret hires Megan Rapinoe in rebrand2US Supreme Court rejects big challenge to Obamacare3Once the future, US now captive to its past4Women sue Pornhub alleging lack of consent5Two US executions halted over lack of firing squad6David Guetta sells his songs for a nine-figure sum7Osaka will not play at Wimbledon8Iran presidential vote marred by disqualifications9Outrage in Italy after cable car crash video aired10© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "Section": "", "Writers": "", "URL": "https://www.bbc.com/news/world-asia-57492961", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}