{"Type": "", "Time": "2021-06-18", "Headline": "Re/insurers on edge as Tokyo Olympics nears: Bloomberg - Reinsurance News", "Text": "\nReinsurance News 16th June 2021 - Author: Katie BakerRe/insurers are expected to be on edge over the next six weeks as the Tokyo Olympics’ opening nears, according to Bloomberg Intelligence.After much deliberation, the International Olympic Committee (IOC) has decided to go ahead with the postponed 2020 Olympics.However, the IOC has taken out around $800 million in event-cancellation insurance, with additional cover purchased by the local organising committee.Including broadcasters, sponsors, professional sports teams and hospitality, analysis from Bloomberg Intelligence estimate the insured cost of cancelling the event to be in the $2-$3 billion range.With the Olympic Games set to begin at the end of next month, insurance losses could be large if the Games are cancelled, as Japan faces emergency measures to contain COVID-19 infections.Swiss Re said last year that its direct Olympic exposure was $250 million (or about 1% of net-earned premiums) and Munich Re hasn’t specified, but it likely has exposure in the hundreds of millions of euros, some of which may already have been reserved.Charles Graham, Senior Industry Analyst at Bloomberg Intelligence says: “Insurers and reinsurers will be on tenterhooks over the next six weeks as the Tokyo Olympics’ opening nears, with any cancellation of the already postponed 2020 event potentially costing the sector $2-$3 billion in aggregate, based on our calculations. That would hit an event-cancellation industry already battered by record 2020 claims.”According to the latest polls, opposition in Japan to holding the Olympic Games may be easing after the number of COVID-19 cases dropped.Medical opinion remains strongly opposed to the games taking place, with reports that Japanese corporate sponsors also favoured a postponement after international spectators were excluded.The IOC is focused on making the games as safe as possible, with plans for daily testing and the vaccination of athletes, yet vaccination won’t be compulsory. A decision on allowing spectators into venues will be taken later this month.By submitting the form you are giving your consent to be emailed by us.Advertise on Reinsurance NewsWe have 185,000+ monthly reinsurance news readers & 15,500+ daily email subscribers. Reach the largest reinsurance audience.\nWe also publish Artemis.bm, the leading publisher of news, data and insight for the catastrophe bond, insurance-linked securities, reinsurance convergence, longevity risk transfer and weather risk management sectors.. We’ve published and operated Artemis since its launch 20 years ago and have a readership of around 60,000 every month.Get in touch directly using our contact form. Or find and follow Reinsurance News on social media.\nGet reinsurance news by email here.All content copyright © Steve Evans Ltd. 2021 All rights reserved. Steve Evans Ltd. registered in England No. 07337195\nWebsite Privacy & Cookies and DisclaimerInsurance Commissioner Dennis B. Funa has been reelected as the chairman of the management board of Asian Reinsurance Corporation. He...", "Section": "", "Writers": "", "URL": "https://www.reinsurancene.ws/re-insurers-on-edge-as-tokyo-olympics-nears-bloomberg/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}