{"Type": "Asia", "Time": "2021-06-18", "Headline": "'It has to be an all Malaysian effort': Businesses, lawmakers roll out perks for COVID-19 vaccination", "Text": "Cash incentives, lucky draws and burger vouchers are among the incentives given out to encourage people to register for their shots.KUALA LUMPUR: When Louis Ooi, the chief executive of a lab testing company, realised that almost half of his employees have not registered for the COVID-19 national immunisation programme, he decided to encourage them.My CO2, which provides accreditation services for products, has been allowed to operate during thecurrent nationwide total lockdown. Hence, Ooi felt it was important for his employees to be vaccinated to avoid potential disruptions to operations.After discussing with senior management, Ooi decided to offer employees an RM150 (US$36.20) cash incentive to get vaccinated. Employees are able to claim the cash incentive after they have received their first dose.Ooi told CNA that after the incentive was announced, the rate of registration among his employees for the national immunisation programme rose from around 50 per cent to more than 90 per cent.“You can never stop future lockdowns without getting vaccinated and achieving herd immunity. That’s the only way,” said Ooi.He added that RM150 was a \"small token\" in comparison with the amount his company would need to fork out in paying for COVID-19 swab tests if an outbreak occurs within the premises.“There’s a chain effect, a multiplier effect, to encourage more people to get vaccinated,” said Ooi.The company's decision is an example of a wider collective effort, from businesses to politicians, to nudge the country towards herd immunity by offering various incentives to persuade Malaysians to get vaccinated.Examples of these incentives include lucky draws, vouchers, off days from work as well as cash.As of Jun 17, statistics published by Malaysia’s Special Committee on COVID-19 Vaccine Supply (JKJAV) show that more than 14 million people have signed up for the national COVID-19 immunisation programme. Out of this, just over 3.6 million have been fully vaccinated.However, this is still some way off Malaysia’s target of achieving herd immunity by inoculating 80 per cent of its population, or 26.7 million out of the total 33 million people in the country.Four months after the government rolled out its immunisation programme, vaccine hesitancy remains an issue. Among the reasons include the distance involved when getting to vaccination centres, fear of the side effects and a lack of understanding of why it was important for the country to achieve herd immunity, said observers.Khairy Jamaluddin, the minister who heads the National COVID-19 Immunisation Programme, was quoted as saying by Malaysian media earlier this month that the government was considering incentives to boost the registration rate. However, he did not provide any specifics or a timeline.The minister also reportedly said that he was in favour of providing “carrots” before wielding a “stick” at those who have yet to register themselves as part of the national vaccination drive.Besides My CO2, another company also offering incentives for its employees to get jabbed was OCBC Malaysia.In a move to encourage its 5,000 employees to register for the national immunisation programme, the company is offering incentives such as off days, medical leave, transport reimbursement as well as post-vaccination support.Responding to CNA's queries, head of human resources for OCBC Malaysia Kok Lai Ching said that since the offer was announced, “an encouraging number of employees” has applied for vaccination leave.“From the various fragmentary statistics we have on those who have been vaccinated or have registered interest, it is safe to say we are well on our way to a favourably high vaccination rate in the weeks to come,” said Kok.BURGER CHAIN OFFERS RM10 VOUCHER TO CUSTOMERSMeanwhile, other businesses are offering incentives not only for their employees but also for customers.Gourmet burger chain myBurgerLab posted on its social media channels that it is offering those who have received their first dose a RM10 voucher for takeaway orders.The company's co-founder Chin Ren Yi told CNA that he is hopeful the offer will encourage those who have been hesitant to register.\"If we were to move forward and return to some form of normalcy, vaccination is key ... We have a responsibility to encourage and educate the people of Malaysia that getting vaccinated is not just for yourself but for the people around you,\" said Chin.Chin said that around 3,700 customers have redeemed the vouchers and he is expecting more to come.Chin also said that it was possible that in the future, myBurgerLab would only allow customers who have been fully vaccinated to dine-in.\"I understand that some people can't get vaccinated because they have health issues or unique problems but those are rare,\" said Chin.\"We should encourage and reward people who are vaccinated to come to our stores because they should not have to fear contracting COVID-19 (when dining with us),\" he added.MP OFFERS RM1,000 LUCKY DRAW FOR CONSTITUENTSPoliticians are also getting involved.An example is Member of Parliament Sim Tze Tzin who had learnt, through discussions with his friends who were living abroad, about how some countries were turning to an array of persuasive methods to entice people to get vaccinated.Sim cited how in the United States, residents in some areas would qualify for a US$1 million lottery ticket if they were inoculated. Additionally, he noted how in Hong Kong, property tycoons havedonated brand new apartment units to vaccine lotteries.Maintaining that he only had “limited finances” at his disposal, Sim decided to hold monthly RM1,000 lucky draws for those in his constituency who have registered for their vaccination appointments through the MySejahtera application.“The response has been overwhelming,” Sim told CNA.“Residents have flooded my Instagram and Facebook pages with messages asking how they can join the lucky draw. Some are also encouraging their parents and family members to register for vaccination so that they can also participate,” he added.From speaking to his constituents on the ground, Sim realised that the lucky draw was a positive tipping point for some people.“Usually these people who are hesitant, they took the wait-and-see approach. If you have something to incentivise them, that little bit of nudge, they will register,” said Sim.He added that around 55 per cent of those in his ward have registered to receive the vaccine, higher than the national average of around 42 per cent.Sim, who represents opposition party Parti Keadilan Rakyat (PKR), plans to continue the monthly lucky draw until residents in Bayan Baru, Penang, reach herd immunity.Other lawmakers have offered free transportation to vaccination centres.Through his Facebook page, MP for Simpang Renggam Maszlee Malik is offering residents, especially the elderly or those with special needs, a free taxi ride to vaccination centres.In Sabah, the state representative of Sook district Ellron Alfred Angin told local media that he has provided transportation for dozens of residents living in rural villages to the city to receive their vaccine shots.Sim of PKR stressed that it was important for Malaysia to have a holistic approach in encouraging residents to be vaccinated, to ensure the country’s economic survival and exert less pressure on its healthcare system.“It has to be an all society approach, it cannot just be the government, the opposition members of parliament must (commit to this) regardless of political affiliations,” said Sim.“Achieving herd immunity is a tall order, so we are putting aside political differences, and pushing together for the country,” he added.Sim also expressed hope that the private sector, which has a larger pool of finances, could play a bigger role in encouraging people to be vaccinated.“They can maybe offer huge incentives like free motorbikes or condominium units as part of CSR (corporate social responsibility) for the state governments to conduct lucky draws,” said Sim.“It has to be an all community, all Malaysian effort,” he added.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Malaysia,COVID-19,vaccination", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/malaysia-covid-19-vaccination-businesses-mp-incentives-cash-15032792", "Source": "google"}