{"Type": "Sport", "Time": "2021-06-17", "Headline": "Football: Bale the provider at the beating heart of a Welsh dragon", "Text": "BAKU: Gareth Bale skied a penalty over the bar, and extended his international goal drought to 13 games, but in every other respect his contribution toWales' 2-0 Group A defeat of Turkeyat Euro 2020 on Wednesday (Jun 16) was immense.The goals may not be flowing but the captain was the provider who set up Aaron Ramsey and Connor Roberts with the sort of precision passing and persistence that made all the difference.It would be easy to characterise Wales as a team who rely heavily on the Real Madrid winger, however much of a shift they all put in, but Bale's link up play with Ramsey and his vision stood out.\"It's unfortunate, but what he did show was character after it,\" Wales manager Rob Page said of the shocking penalty miss in Baku.\"Everybody's going to make mistakes, everybody's going to miss chances. OK, he missed a penalty. So what?\"He got on with it. He's got man of the match tonight. He plays a massive part as a captain and he's a big, big part of what we want to do.\"When Juventus midfielder Ramsey scored the 42nd minute opener it was the third great chance he had been fed through by Bale.Roberts' extra time icing on the cake came after Bale dribbled along the byline and then slipped the ball through at an angle.Barely 10 minutes into the match he had cleared away a corner in the Welsh area and then secured one at the other end on the counter-attack. His shots on goal, like the penalty that he won, came to nothing.Turkey had 56 per cent of the ball, more attempts on goal and completed way more passes but were vulnerable in defence and, despite Welsh nerves, offered little real threat on the attack. They had the crowd in Baku but have yet to score a point.Possession has never been a secret of Wales' success, their players lifted by a strong and indefatigable sense of team spirit.In Ramsey and Bale, the Euro 2016 semi-finalists have two players who can stand with the best but Wales are much more than that as a unit and their fans will be dreaming of another mazy run in the knockout stages.\"We're not little Wales, we're not viewed like that any more,\" said former Wales striker and manager Mark Hughes, in the BBC studio as a pundit, after a game that left them with four points from two games.Italy, who beat Turkey 3-0, are still to come in the final game of the group but Wednesday's performance will give Wales plenty of belief that they can take something away from it.\"I thought that first half today was superb,\" said Ramsey. \"To a man we created so many opportunities and we really dominated the play.\"Second half we showed great character, we dug in and I thought we thoroughly deserved the win at the end... what we've built our success on over the last few years is really working hard for each other and we showed it again tonight.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Turkey,sports,Wales,Gareth Bale,Aaron Ramsey,football", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/euro-2020-bale-at-the-beating-heart-of-a-welsh-dragon-15029810", "Source": "google"}