{"Type": "Asia", "Time": "2021-06-18", "Headline": "Pushing against China, US lawmakers plan pro-Taiwan Bill", "Text": "WASHINGTON: Democratic and Republican members of the US House of Representatives will introduce legislation this week seeking to boost US support for Taiwan, part of an effort in Congress to take a hard line in dealings with China.Representatives Ami Bera and Steve Chabot, the Democratic and Republican leaders of the House Foreign Affairs Committee's Asia subcommittee, will introduce the \"Taiwan Peace and Stability Act,\" a measure \"to support the diplomatic, economic and physical space\" of the self-governing island.\"Hopefully we're able to pass something in a bipartisan way on the House floor,\" Bera said in a telephone interview. \"I think this is an area where we can hopefully speak with one voice.\"Bera said he expects much of the Taiwan Act eventually to be included in the \"Eagle Act,\" a sweeping Bill on dealings with China that Representative Greg Meeks, chairman of the House Foreign Affairs Committee, introduced last month.The Senate on June 8 passed by a strong bipartisan 68-32 majority the \"US Innovation and Competition Act,\" or USICA, a Bill worth some US$250 billion to boost the country's ability to compete with China, including massive support for semiconductors and telecommunications equipment.House leaders do not currently plan to vote on the Senate Bill. Instead, House committees are writing their own legislation, which must pass the House, be combined with the Senate Bill and pass both chambers before it can become law, a process that can take weeks.'STRATEGIC AMBIGUITY'The new House Taiwan Bill does not advocate a switch from the long-standing US stance of \"strategic ambiguity\" despite calls from some of the most hawkish members of Congress for a clear commitment to defend Taiwan in the event of a Chinese attack.The Biden administration opposes such a shift.The United States is Taiwan's strongest international backer and main source of arms, which angers China, but like most countries Washington has no formal diplomatic ties with Taipei. Beijing says the democratically ruled island is part of \"one China\" and routinely denounces foreign involvement as an interference in its internal affairs.The legislation stresses the importance of stability. It calls on the Biden administration to report within 90 days on a whole-of-government strategy to enhance deterrence against a cross-Strait conflict, stressing cooperation with allies.Bera said that despite its concerns over Taiwan, the United States should not send a signal to Beijing that it favours the island's independence.\"The last thing we want is China to misinterpret the United States' and the world's commitment to what has worked very well in the past, the one-China policy,\" he said.The Biden administration opposes such a shift, but has committed to deepening its unofficial relationship with Taipei in the face of growing pressure on the island from Beijing.The Bill also calls on US agencies to analyse ways to help Taiwan economically and expand development.And it recognises Taiwan as an important contributor to the global community and calls on the Biden administration to submit a strategy for advancing Taiwan's \"meaningful participation\" in international organisations.NATO leaders, encouraged by US President Joe Biden, warned at a summit on Monday that China presents \"systemic challenges,\" taking a more forceful stance towards Beijing.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "US,China,Taiwan,news and politics", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/pushing-against-china-us-lawmakers-plan-pro-taiwan-bill-15029706", "Source": "google"}