{"Type": "", "Time": "2021-06-17", "Headline": "Football: Denmark and Belgium pause Euro clash to honour Eriksen, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.COPENHAGEN (REUTERS) - Denmark and Belgium stopped their Euro 2020 Group B clash on Thursday (June 17) for a minute's applause as a tribute to Danish midfielder Christian Eriksen, who suffered a cardiac arrest in the Danes' opener against Finland at the Parken Stadium.As the stadium match clock showed minute 10 - Eriksen's shirt number - Belgium's Dries Mertens brought play to a halt and the players applauded as the Danish crowd unfurled a banner saying: \"All of Denmark is with you Christian\".Eriksen is recovering at a nearby hospital and will have an implantable cardioverter defibrillator (ICD) fitted to regulate his heart rhythm.His future in the game remains in doubt.Eriksen's collapse shocked millions of viewers around the globe. The Finland game was suspended and when it eventually resumed, the Danes lost 1-0.The red-and-white clad fans in the 25-000-strong crowd on Thursday gave the Danish players a warm welcome as they came out before the game, and Belgian fans held up a banner saying \"Belgium loves you Christian\" before kickoff.That display was topped when a giant Denmark shirt featuring Eriksen's name and number was revealed during the opening ceremony to the jubilation of the crowd, followed by a rendition of You'll Never Walk Alone.The gestures continued with a lusty rendition of the Danish national anthem before Denmark team captain Simon Kjaer was presented with a signed Belgium shirt featuring Eriksen's name and number by Jan Verthongen.Denmark took the lead in the second minute through Yussuf Poulsen in a game the Danes need a result from following their defeat by the Finns.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-denmark-and-belgium-pause-euro-clash-to-honour-eriksen", "Source": "google"}