{"Type": "", "Time": "2021-06-18", "Headline": "Hong Kong police arrest Apple Daily executives, seize reporting materials in national security law raid, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.HONG KONG - Nine months after the Apple Daily newsroom was raided, hundreds of officers again swept the office early Thursday morning (June 17)  and arrested five top executives under national security charges, in what the local journalist body calls “a heavy blow to press freedom”.Hong Kong police said 500 officers raided the anti-government tabloid’s Tseung Kwan O office at 7.30am, going through reporters’ documents and notes, with Apple Daily streaming the event live online.In a briefing, senior superintendent Steve Li said  at least 30 articles published in 2019 may have breached national security by calling for foreign sanctions against the Hong Kong and central governments.This is the first time where authorities said news articles could potentially violate the security law.Supt Li, who heads the police force’s national security department, said Secretary for Security John Lee had issued  an order to freeze HK$18 million (S$3.8 million)  worth of assets from Apple Daily Limited, Apple Daily Printing Limited and AD Internet Limited.Five executives of Apple Daily and Next Digital - editor-in-chief Ryan Law, chief executive Cheung Kim Hung, Chief Operating Officer Chow Tat Kuen, Deputy Chief Editor Chan Pui Man and Chief Executive Editor Cheung Chi Wai were detained on allegations of colluding with foreign forces to endanger national security.Next Digital publishes Apple Daily, a well-read tabloid that is often critical of Hong Kong and mainland Chinese leadership.Said Mr Li: “We have very strong evidence that the questionable articles play a very crucial part for the conspiracy which provides the ammunition for foreign countries and institutions or organisations to impose sanctions to Hong Kong and the People’s Republic of China.”He also warned the public that they could face prosecution for sharing the reports on social media.Hours after the raid,  the secretary for security told the public and media to cut all ties with the five arrested executives.“If you stand with these suspects, you will pay a hefty price. You should cut ties with the suspects or you’ll regret it very much,”  said Mr Lee.Without elaborating on whether the articles were news reports or opinion pieces, he added that the operation was aimed at those who use reporting as a “tool to endanger” national security.“No one should use news reporting as a disguise or safe haven to endanger national security. The Hong Kong government will use all legal measures to prevent, interdict, and suppress such activities,” he said.The Hong Kong Journalists Association (HKJA) said  that the police sweep is a heavy blow to  press freedom.Chairman Chris Yeung described the raid as “horrible”, saying that it will spread fear among the news industry.“If news reporting materials are not protected by the law, self-censorship among journalists will become more and more common,” he said.The European Union said the raid shows that China is using its new national security law to silence the media and freedom of expression.“This morning’s raid on the offices of newspaper Apple Daily and the arrests of five of its senior management further demonstrates how the national security law is being used to stifle media freedom and freedom of expression in Hong Kong,” Nabila Massrali, EU spokesperson for foreign affairs and security policy said in a statement.“It is essential that all the existing rights and freedoms of Hong Kong residents are fully protected, including freedom of the press and of publication,\" she added.Similarly, British Foreign Secretary Dominic Raab accused China of using the law to target dissent, rather than deal with public security.“Today’s raids and arrests at Apple Daily in Hong Kong demonstrate Beijing is using the National Security Law to target dissenting voices, not tackle public security,” British Foreign Secretary Dominic Raab said.“Freedom of the press is one of the rights China promised to protect in the Joint Declaration and should be respected,” he said.Taiwan’s Foreign Minister Jaushieh Joseph Wu wrote on social media that he is saddened to witness the raid  on the news tabloid, which is a desperately endangered symbol of freedom in Hong Kong. The raid is  the latest blow to media tycoon Jimmy Lai, the tabloid’s owner and a vocal Beijing critic, whose assets are already frozen under the security law and who is serving prison sentences for taking part in illegal assemblies.Lai, whose meetings with former United States vice-president Mike Pence and other top American officials in 2019 outraged China, has been a persistent thorn for Beijing who views him as a traitor.He is the highest-profile figure in the pro-democracy camp and was part of a 2019 full-court press of Hong Kong pro-democracy figures who urged the US to pass laws imposing sanctions if Beijing eroded Hong Kong’s semi-autonomous status. The security law clearly outlaws seeking sanctions from foreign governments.Trading in shares of Next Digital were suspended on Thursday and it is unclear how Apple Daily’s operations will be affected.  \n \nPolice officers unload outside the headquarters of the Apple Daily newspaper and its publisher Next Digital Ltd. in Hong Kong, on June 17, 2021. PHOTO: BLOOMBERG\n\nA police vehicle is seen outside the headquarters of Apple Daily and Next Media in Hong Kong, on June 17, 2021. PHOTO: REUTERS\nJune 30, 2020\nChina formally adopts a new national security law for Hong Kong. The law criminalises secession, subversion, terrorism and collusion with foreign forces. It is seen as curtailing protests and freedom of speech.July 31\nHong Kong police issue arrest warrants for six prominent pro-democracy figures who are overseas: democracy campaigner and US citizen Samuel Chu; disqualified lawmaker and key former member of the now-defunct Demosisto party Nathan Law; former British consulate staff member Simon Cheng; and activists Ray Wong, Wayne Chan and Honcques Laus. They are alleged to have breached the national security law by inciting secession and colluding with foreign forces.Aug 7\nThe United States imposes sanctions on Chief Executive Carrie Lam, Hong Kong's current and former police chiefs and eight other top officials for what Washington says is their role in curtailing political freedoms in the territory.Aug 10\nPolice conduct a raid of Apple Daily. They also arrest Jimmy Lai, a staunch critic of Beijing and owner of Apple Daily, on suspicion of collusion with foreign forces and conspiracy to commit fraud.Dec 2\nLeading Hong Kong activist Joshua Wong is jailed, alongside two other young activists, for taking part in 2019's huge democracy protests. The two are Agnes Chow and Ivan Lam.Dec 11\nLai is charged under the security law with colluding with foreign forces.Jan 6, 2021\nHong Kong police arrest 55 activists in the opposition bloc for subversion under Article 22 of the national security law.April 7\nLaw is granted asylum in Britain after fleeing Hong Kong following the introduction of the Chinese security law.June 17\nAbout 500 police officers descend on the headquarters of Apple Daily for the second time in 12 months after the tabloid's leaders are accused of violating the security law. Three top editors and two senior executives are arrested.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/hong-kong-arrests-apple-daily-editor-on-security-law-local-media-says", "Source": "google"}