{"Type": "", "Time": "2021-06-17", "Headline": "Ya’akov Finkelstein writes: The Hamas uses civilians as shields in attacks against Israel.", "Text": "During the Muslim holy month of Ramadan, a time traditionally dedicated for peace, reconciliation and forgiveness, Hamas terrorists fired around 4,000 rockets from Gaza, directed at innocent civilians in Israel. Twelve people fell victim to these attacks. Among them were Jews and Muslims, women and children. More than 70 per cent of Israel’s population was living under the shadow of hundreds of rockets every day. Depending on their distance from Gaza, they had between 15 seconds to one minute to find shelter. Just imagine 70 per cent of Indians living that kind of life for two weeks. Surely, India, like every other country, and like Israel, would have exercised its legal right to defend its citizens from terror.The reason for sharing these facts — plain numbers are often used to blame Israel for allegedly committing war crimes by punitively attacking Gaza without caring for civilian casualties. Every war is tragic. Every person’s death is a world lost. It’s sad when children die in such armed conflicts. One common misconception in public perception relating to armed conflicts is the term “proportionality”. The number of casualties on each side is compared in order to deduce which side used force disproportionately. From a legal standpoint, this notion is completely legally flawed, and indeed, illogical.The universally accepted principle of proportionality is defined as the obligation to refrain from any attack which may be expected to cause incidental loss or injuries to civilians, or damage to civilian objects. The proportionality principle essentially means that before every military strike, the military commanders must assess two factors.First, they must examine the concrete and direct military advantage anticipated from an attack, when naturally, the neutralisation of some targets would have a higher advantage than others. First, in order to offer such an advantage, the target must be a military one, such as a weapons depot, a command and control centre or the adversary’s armed forces. Importantly, a seemingly civilian object, used by the adversary for military purposes may be considered a lawful target.Second, the commanders must assess, based on reasonably available information at the time of the attack, the expected incidental loss of civilian life or property (collateral damage). The military commander assesses how many civilians, if any, will be present in the area of the planned attack. Then, they assess the extent of the expected damage to civilian property, including the indirect damage that is to be accounted for, as long as it is reasonably expected. Lastly, the military commander must implement all feasible precautions to mitigate harm to civilians and civilian objects.Based on these assessments, the commander must balance these two components and decide whether to carry out the attack. If the assessment leads to the conclusion that the expected damage to civilians or civilian objects is deemed excessive in relation to the anticipated military advantage, the attack would be unlawful.How is this principle of proportionality affected when instead of protecting its civilians, Hamas intentionally conducts its military activity from within densely populated areas? To be more precise, how is Israel expected to protect its major cities from Hamas rockets, when these rockets are developed, built and launched from within the Gazan civilian population?The Law of Armed Conflict clearly states that when civilian presence is used to shield military objectives from attacks, that presence does not grant the target immunity. That is, when Hamas commits the double war crime of attacking Israeli children, schools and airports from within its own civilian population, the analysis of the situation would be distorted if Hamas’ criminal behaviour is not taken into account.Despite Hamas’s blatant disregard for the law or its citizen’s wellbeing, Israel does everything feasible in order to prevent or at least minimise the harm to the Palestinian civilian population, often at the cost of operational advantage. In doing so, Israel employs precautions that exceed the requirements of international law, as well as the practices commonly employed by advanced militaries of Western states. Fighting an enemy that deliberately abuses the law of armed conflict in the most cynical way creates grave challenges for Israeli soldiers. Nevertheless, Israeli commanders strictly apply international law, including the principle of proportionality in every military action.One must ask why Hamas uses its own population as human shields? The answer brings us back to the beginning of this article — the miscomprehension of the concept of proportionality, and the knee-jerk reaction that ignores the question who put Gazan civilians in danger in the first place? In other words, Hamas pays no price for its war crimes against its own civilians, and, indeed, often Israel is wrongfully blamed by the very same terrorist organisation. This situation provides an incentive to Hamas to continue with its heinous practices.Hamas is internationally recognised as a radical Islamic terror organisation. Its ultimate goal, which is clearly specified in its charter, is not to establish a Palestinian state, but rather to destroy Israel. In 2006, when Hamas won elections in Palestinian territories, they refused to respect the existing written agreements between Israel and the Palestinian leadership, committing to non-violent dialogue and recognition of Israel. Hamas forcefully and violently seized power in Gaza and diverted billions of dollars of aid meant for building schools, hospitals and civic amenities to build terror tunnels and rockets meant for destroying Israel. Hamas is committing a double war crime — deliberately targeting Israeli civilians and endangering Gazan civilians by using them as human shields. At the same time, Hamas is engaged in a misinformation campaign to provoke Palestinians and Israeli Arabs. The absurdness of their propaganda is obvious: Israel has normalised relations with five Muslim countries in the last one year, adding to its historic peace agreements with Egypt and Jordan. Israel’s commitment to peace is clear to countries like Sudan, Morocco, UAE, Bahrain and others. Let’s hope it will be the same also for our immediate neighbours, the Palestinians.This article first appeared in the print edition on June 17, 2021 under the title ‘An enemy like Hamas’. The writer is Consul General of Israel, Mumbai. This article was written before the Naftali Bennett government took office in Israel📣 The Indian Express is now on Telegram. Click here to join our channel (@indianexpress) and stay updated with the latest headlinesFor all the latest Opinion News, download Indian Express App.", "Section": "", "Writers": "", "URL": "https://indianexpress.com/article/opinion/columns/israel-gaza-violence-hamas-attack-ramadan-7362385/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}