{"Type": "Asia", "Time": "2021-06-17", "Headline": "'No regrets': Myanmar dissidents evade junta with life on the run", "Text": "BANGKOK: Burner phones, safehouses, sheltering with rebels and months away from loved ones - Myanmar's anti-coup activists have been driven underground by a brutal crackdown but have no regrets about choosing a life on the run.Myanmar has been in turmoil since the armed forces ousted civilian leader Aung San Suu Kyi in February, plunging the country back under military rule after a 10-year experiment with democracy.The power grab triggered a massive uprising which the junta has sought to quell with mass arrests and bloody crackdowns.Some - like longtime activist Thinzar Shunlei Yi - had always known they might have to leave their home and family in order to keep up their battle against the regime.\"It's something I expected in my life as an activist,\" she told AFP by phone from a hidden location.The 29-year-old is among the hundreds of social media-savvy fugitive - social influencers, celebrities, activists and journalists - wanted by the junta for disseminating information that \"causes fear\".\"When (the coup) happened, we found that many people were on the run,\" she said.\"We didn't expect that we would have an uprising like this and ordinary people would become protesters and activists.\"But for Ko Ko - not his real name - the life of a fugitive was something much harder to imagine.Just months ago he was working full-time at a government hospital on Myanmar's COVID-19 response.\"Everything has changed,\" said the 30-year-old doctor, who now organises covert tele-medicine consultations for anti-coup protesters too afraid to go to military hospitals.Moving frequently to avoid arrest, Ko Ko said he \"stopped counting the days\" after Myanmar's Thingyan New Year festival in April - a period usually spent celebrating with family.ALWAYS ON GUARDMyanmar's medical workers were among the first to join a nationwide anti-junta movement, which grew to bring hundreds of thousands to the streets.By March, Ko Ko was training civilians to give first aid as the junta crackdown on dissent grew bloodier.But increasing raids on makeshift trauma centres and mass arrests of healthcare workers were a wake-up call.\"If they found me, what would they do to my family?\" he recalled thinking.Two days after Armed Forces Day in March -  the single deadliest day since the coup, with more than 100 people killed across the country - Ko Ko decided to leave his wife and parents.After two weeks slipping furtively from house to house, he fled to territory controlled by a rebel group near the border with Thailand.Always on alert, he carries a burner phone with a fake Facebook account in case authorities stop him.\"Every minute that I hear a car stop out front or if there's a loud voice, I always go out and check,\" he told AFP.He is currently working to source supplies for a makeshift hospital he and other doctors are setting up - a vast departure from his life just four months earlier.\"THIS IS OUR DUTY\"More than 850 people have been killed since the coup while thousands languish behind bars, according to a local monitoring group.\"It's a nightmare,\" said musician Ko Thein - a pseudonym - who grew in prominence for his vitriolic Facebook posts about the military after it ousted Aung San Suu Kyi's government.He had stubbornly refused to go into hiding despite weeks of warnings from friends.But when his name was broadcast on the nightly state-run TV news in early April, he immediately packed a bag, said farewell to his sister, and stole away from the back door of his apartment building.\"I didn't have a chance to say goodbye to my dog. He died on May 4,\" he said, speaking to AFP from an undisclosed location.Still, he continues to share information on Facebook and connect local civilian groups with a shadow government working to oust the junta.\"I never feel regret about posting things. This is our duty as citizens of Myanmar,\" Ko Thein said, though he admits he misses his family.Even for a seasoned activist like Thinzar Shunlei Yi, life on the run can be isolating, and monitoring the news can be \"mentally draining\".\"But it also gives us strength because many people have suffered and sacrificed their lives,\" she said.\"We need to keep moving, no matter what.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Myanmar,Myanmar coup", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/myanmar-coup-activists-dissidents-junta-life-on-run-fugitive-15031762", "Source": "google"}