{"Type": "Sport", "Time": "2021-06-17", "Headline": "Football: Ukraine affected by nerves in win over North Macedonia, says Shevchenko", "Text": "BUCHAREST: Ukraine struggled to conquer their nerves against North Macedonia at the European Championship, coach Andriy Shevchenko said after his team'snail-biting 2-1 victoryat the National Arena Bucharest on Thursday (Jun 17).Shevchenko's team dominated the first half against the lowest-ranked side at the finals, going into the interval two goals ahead, but went off the boil in the second half, nearly conceding from North Macedonia's first attack.Ukraine's Georgiy Bushchan denied midfielder Arijan Ademi in the 47th minute and that attempt set the tone for a much more competitive game in which North Macedonia pulled a goal back via Ezgjan Alioski, who followed up after his penalty was saved.\"First of all this part of the European Championship is a very different atmosphere. It's very emotional,\" Shevchenko told reporters. \"It's a different kind of tournament. At any second, the balance of the team can change.\"We played a very good first half but they started the second half very well and our mistake caused a penalty that they scored (from).\"Some sort of anxiety, nervousness appeared. We got more chances and we should have scored for the third time... but we also need to praise North Macedonia's character.\"Ukraine's Ruslan Malinovskiy missed a late penalty that would have extended their lead and Shevchenko defended his decision to substitute both scorers, Andriy Yarmolenko and Roman Yaremchuk, in the 70th minute.\"We changed it completely because we had to protect our goal and we had to press a little bit in front to prevent long passes,\" the coach added. \"We got two fresh players who were pressing quite a lot.\"I think during the game we had enough chances to score more... The main point is that we got the victory.\"Ukraine have three points after two games and play Austria on Monday. Netherlands face Austria later on Thursday with both sides on three points after opening victories.Yarmolenko, who scored Ukraine's first and assisted their second, said their coaches had warned them at halftime that North Macedonia would come out fighting.\"They told us North Macedonia will start attacking because they have nothing to lose,\" the Ukraine captain said. \"They made us nervous. When the score was 2-1 we panicked a little bit.\"We didn't want to lose and it was obvious that everyone was nervous, but it's very good we managed to hold on for victory.\"North Macedonia, who lost to Austria in their first game, need the Austrians to beat the Dutch if they are to have any hope of extending their stay at their first major tournament.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Austria,Andriy Shevchenko,sports,Euro 2020,Ukraine,North Macedonia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/football-ukraine-affected-by-nerves-in-win-over-north-macedonia-15036072", "Source": "google"}