{"Type": "", "Time": "2021-06-18", "Headline": "Father recalls rushing to help son after electric shock, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Mr Muhammad Nazlan, 34, was resting at home on Sunday after getting his second Covid-19 vaccination shot when he heard his 10-year-old daughter screaming for help from outside their Lorong 5 Toa Payoh flat.From his ground-floor unit in Block 63, the pest control technician saw his son had collapsed against a lamp post at the nearby fitness corner.Muhammad Rifqy, 14, had been playing football with a friend from the neighbourhood near the fitness corner when the ball went astray.Running towards the fitness corner to retrieve the ball, Rifqy apparently reached out towards a lamp post to break a fall and received a shock. His friend, who tried to help him, also received a shock.Mr Nazlan, who is asthmatic, immediately rushed to help his elder son and also felt a shock.\"My heart felt like something sharp poked it, and I became breathless,\" he said.\"I also felt another two shocks: one in my hand and the other in my leg, as I used my hand to pull him away and my leg to gently kick his leg away from the lamp post as it was entangled with the post.\"\"All I could think of was: If he dies, I will also die with him.\"Mr Nazlan added: \"The other boy touched my son but ran away as soon as he got a shock.\"He said he did not know who the boy was or exactly where he lived, but that Rifqy had met him about three days earlier while playing in the area.Mr Nazlan also has a younger son, aged five.He said his wife rushed forward to save their son too, but was held back by Mr Nazlan's close friend, Mr Khairul Anuar, 36.\"I had to hold her back to prevent a tragedy from happening,\" said Mr Khairul, who is a delivery rider.He also said that Rifqy's muscles looked tense from the shock.\"He was such a happy boy who loved to play pranks, but he has been so traumatised after the shock,\" said Mr Khairul.\"He can only speak with one or two words at a time now.\"Both boys were sent to KK Women's and Children's Hospital on Sunday. Rifqy remains in hospital with electrical burns to his right hand and an elevated muscle enzyme count, an indication of muscle injury.His friend was discharged on Monday afternoon.Said Mr Nazlan: \"The doctor told us that he has to be warded until his muscle enzyme count stabilises or goes lower, as there is a risk of heart and kidney problems.\"Electrical engineer Simon Lee told The Straits Times that cable insulation or lighting components in the lamp post may have been behind the incident.\"Electric current can leak out and flow through the exposed metallic part of the lamp post which is in contact with the cable within the lamp post,\" said Mr Lee, who is chairman of the mechanical and electrical engineering technical committee at The Institution of Engineers, Singapore.Mr Lee said bystanders trying to help a person experiencing an electric shock should not touch the victim directly, as they may also get electrocuted.Instead, they should use a dry cloth or an insulated object to pull the person away from the source of shock.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/father-recalls-rushing-to-help-son-after-electric-shock", "Source": "google"}