{"Type": "", "Time": "2021-06-18", "Headline": "Hong Kong Refuses Visa Extensions for Non-Local Cabin Crew, Cathay Pacific Appeals", "Text": "Mateusz Maszczynski is a serving international flight attendant with experience…Hong Kong immigration officials have refused to extend work visas for non-local Cathay Pacific cabin crew who live in the territory the airline confirmed on Thursday.  The airline is understood to be appealing the decision on language skill needs according to the local South China Morning Press (paywall).At the same time, Hong Kong’s immigration department did grant work visa extensions for non-local pilots although the renewals are a lot shorter than what would be expected in previous years.  Pilots on Cathay Pacific’s profitable and in-demand Boeing 747 freighter aircraft will receive a three-year work visa extension, while Boeing 777 and Airbus A350 be granted a one-year extension and pilots on the airline’s Airbus A330 will only receive a six-month extension which could be renewed at a later date.Cathay Pacific’s business has been decimated by the pandemic and hundreds of local pilots and cabin crew have lost their jobs over the last 15 months.  With no domestic network and no clear path out of existing travel restrictions, it remains unclear when Cathay Pacific can start its recovery.In April, the airline transported just 22,404 passengers – a 99.3 per cent drop on pre-pandemic levels.Cathay Pacific justified hiring non-local cabin crew because of a lack of language skills including Japanese and Korean.  It’s not known how many jobs are now at risk because of Hong Kong’s decision to refuse visa extensions.Although expat pilots have been granted visa extensions there remains a surplus of local pilots and there is more pressure on the authorities to prioritise the needs of local workers.Photo Credit: Brostock / Shutterstock.com\n\t\tGet the latest cabin crew recruitment news delivered to your inbox once a week...\tMateusz Maszczynski is a serving international flight attendant with experience at a major Middle East and European airline.  Mateusz is passionate about the aviation industry and helping aspiring flight attendants achieve their dreams.  Cabin crew recruitment can be tough, ultra-competitive and just a little bit confusing - Mateusz has been there and done that.  He's got the low down on what really works.Receive the latest cabin crew recruitment news, along with breaking aviation stories...Your email address will not be published. Notify me of follow-up comments by email. \n\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.", "Section": "", "Writers": "", "URL": "https://www.paddleyourownkanoo.com/2021/06/17/hong-kong-refuses-visa-extensions-for-non-local-cabin-crew-cathay-pacific-appeals/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}