{"Type": "", "Time": "2021-06-18", "Headline": "The West is trying to create 'an adequate alternative' to China's New Silk Road", "Text": "Group of Seven (G7) leaders announced a new initiative called Build Back Better World (B3W) this week to better compete with China when it comes to funding the world's infrastructure needs. China’s Belt and Road Initiative (BRI), envisioned as the revival of an ancient trading route between Asia and Europe, has been plugging away since 2013. Through various infrastructure projects like ports and highways, the multi-trillion-dollar initiative is a key way that China is asserting itself on the world stage. The West, led by the U.S., wants to counter China's colossal geopolitical project.\"There is a tremendous demand for infrastructure globally, as countries are moving from lower middle-income to middle-income countries,\" Kaush Arha, senior fellow at the Atlantic Council's Scowcroft Center for Strategy and Security, told Yahoo Finance. \"There is a tremendous desire or hunger for an alternative to totalitarian state capitalist funding for infrastructure.\" That demand hasn't been met, added Arha, and there hasn't been an \"adequate alternative to meet the infrastructure aspirations\" of these countries.According to the White House's fact sheet, the B3W infrastructure initiative will be a \"a values-driven, high-standard, and transparent infrastructure partnership led by major democracies to help narrow the $40+ trillion infrastructure need in the developing world.\"Much like the existing U.S. approach to development finance thus far, B3W looks to mobilize private sector funds and encourage them to invest in overseas projects. (The BRI's funding comes from state-backed Chineses banks.)The White House is expecting the B3W initiative to collectively mobilize \"hundreds of billions of dollars of infrastructure investment for low- and middle-income countries in the coming years.\"The competition to win over participating countries has already begun: A Indonesian Ministry of Maritime Affairs and Investment spokesperson told Reuters that that while the country welcomes the B3W, they also hoped \"this time they put their money where their mouth is.\" Along with the U.S. European countries, Japan and Australia will likely be key players in the B3W.\"I think [Japan] has the most to gain, being in the region,\" said Josh Lipsky, Director of Atlantic Council's Geoeconomics Center. \"I think they're going to want to invest in this heavily, and that would be a pretty significant statement.\"Japan, already one of the largest investors in Southeast Asia and the Indo-Pacific region, is committing $10 billion for an initiative to help Association of Southeast Asian Nations (ASEAN) member countries cut green house gas emissions and move towards decarbonization.Australia, a key Western ally in the region, recently scrapped its own BRI project with China and banned Chinese telcom companies Huawei and ZTE from building its 5G network in 2018.Lipsky noted that playing catchup with China will be a tall task, given the sheer size of its investments and the scope of projects tied to BRI.\"Belt and Road has a 10-year head start, with projects all over the world including, by the way, in a G7 country, Italy,\" Lipsky said. \"[B3W] was a good announcement, but a lot of questions remain about how much money is going into it. Who's funding it? What projects will be funded? And China is well on its way in terms of their infrastructure projects.\"What happens to the BRI projects in Europe is an open question, particularly since EU solidarity is a crucial part to the West countering China's global infrastructure ambitions.\"The biggest entity that can move on this would be the EU,\" Arha said.—Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujitaAarthi Swaminathan is a reporter for Yahoo Finance. She can be reached at aarthi@yahoofinance.com. Follow her on Twitter @aarthiswami.Read more:First Solar CEO: New factory allows the US ‘to think through’ decoupling from ChinaU.S.-China relationship 'going down a path of great confrontation,' analyst says'Biden needs Putin more than Putin needs Biden,' expert arguesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Chinese officials don’t care if they offend Western audiences, according to one of Beijing’s top envoys in Europe.Yesterday, Democratic lawmakers took the next step in their effort to codify Roe v. Wade, the Supreme Court decision that circumvented the Democratic process to legalize abortion in nearly all cases.This startup launched a free tool to match you with qualified fiduciary advisors so you can get sound financial advice in a volatile market.President Biden's eight-day trip overseas culminated with a summit with Russian President Vladimir Putin. While Mr. Biden said he accomplished his goal of restarting diplomacy with Russia, it's not clear if progress was made on key issues. CBS News senior White House and political correspondent Ed O'Keefe reports from Geneva on the summit, and former U.S. Ambassador to Ukraine William Taylor, who is vice president of strategic stability and security at the U.S. Institute of Peace, spoke with CBSN's Tanya Rivero about what to expect moving forward.The Biden administration Thursday unveiled a new mapping tool that shows much greater gaps in use of high-speed internet service across the U.S. than the government's previous maps reported.Why it matters: The White House is pushing for big spending to provide more, better broadband service to underserved areas after the pandemic made Americans more dependent than ever on their internet connections. Stay on top of the latest market trends and economic insights with Axios Markets. Subscribe for fThe Education Department announced that it would expand the federal civil-rights statute banning sex discrimination to include gender identity.Our technology will match you with the best lenders at super low rates. Trusted by over 15 million. Save thousands each year. (1.97% APR)Treasury Secretary Janet Yellen on Wednesday defended President Joe Biden’s proposed $6 trillion budget for 2022, telling lawmakers on the Senate Finance Committee that now is the time to embrace an “ambitious fiscal policy” to help reverse “destructive forces” like inequality, declining labor force participation and climate change. Yellen said in testimony before the Senate panel that the U.S. economy is “well on the way” to a strong recovery from the Covid-19 pandemic, but that the private secTexas Gov. Greg Abbott (R) announced Wednesday the state budget would provide $250 million as a \"down payment\" to help fund the construction of a wall at the state's border with Mexico.Why it matters: Former President Trump pledged to build a wall along the southern border, but only 450 miles of new barriers had been completed by the end of his term, per the Washington Post.Stay on top of the latest market trends and economic insights with Axios Markets. Subscribe for freePresident Biden terminaA pig that became an unlikely national icon in China after surviving 36 days under rubble in the aftermath of a powerful earthquake in 2008 died at the age of 14 on Wednesday, sparking an outpouring of emotion. Zhu Jianqiang, or \"Strong Pig\", shot to fame after being discovered alive following the 7.9-magnitude earthquake in southwestern Sichuan province on May 12, 2008. The earthquake left nearly 90,000 people dead or missing and the pig's miraculous story, subsisting on a bag of charcoal and rThis top cash back card offers a super easy $200 sign up bonus and unlimited 1.5% cash back on purchases, all with no annual fee.Activists in Albuquerque this week commemorated the 50th anniversary of one of the first modern Mexican American rebellions against police over discrimination and harassment.Why it matters: The \"Albuquerque uprising\" is part of the forgotten history of protests against police mistreatment of Latinos in the 1960s and 1970s. Since the murder of George Floyd, Latino advocates have tried to draw attention to that history and the often-overlooked police violence against Hispanics today.Get market newA young man accused of deliberately running over a Pakistani Muslim family in London, Ontario, on June 6 has been charged with terrorism this week.  The charges: The incident, which killed four adults and injured a child, led to multiple charges against the suspect, Nathaniel Veltman, who was arrested shortly after fleeing the scene.  The 20-year-old was first charged with four counts of first-degree murder and one count of attempted murder.Three astronauts entered China's new space station for the first time after riding into space on the Shenzhou-12 spacecraft launched from the edge of the Gobi Desert on Thursday, according to AP. Why it matters: Astronauts Nie Haisheng, Liu Boming and Tang Hongbo are set to occupy the station for a three-month mission, marking the country's longest crewed space mission ever and the first in almost five years.Stay on top of the latest market trends and economic insights with Axios Markets. SubscrThe #1 trend in investing isn’t crypto. You can now buy into the hottest pre-IPOs in America -- and for only around $10 a share. But you must act now.The Justice Department has closed its criminal investigation into whether President Trump's former national security adviser John Bolton disclosed classified information with his tell-all memoir, “The Room Where it Happened,\" according to a source with direct knowledge.Why it matters: The move comes a year after the Trump administration tried to silence Bolton by suing him in federal court, claiming he breached his contract by failing to complete a pre-publication review for classified informatiChina's government issued a warning to \"foreign forces\" after Taiwan reported a record 28 Chinese military planes flew over the self-governed island's airspace Tuesday, per Reuters.Why it matters: The warning and deployment of aircraft including fighter jets and bombers comes after G7 leaders issued a statement Sunday urging the Chinese government to respect human rights and calling on peace and \"stability across the Taiwan Strait.\"Get market news worthy of your time with Axios Markets. SubscribNew data shows COVID hospitalizations are up in states where vaccination rates are low. As the U.S. works to get a shot in the arm of every American, a poll found many are waiting for full FDA approval of COVID-19 vaccines before they get one. Dr. Leo Nissola, an immunotherapy scientist and adviser to COVID Act Now, joined CBSN to discuss the country's vaccination effort.Take advantage of lower mortgage rates & cut your monthly payments. 5 Best Mortgage Refinance of 2021The court upheld Obamacare (again), and in its ruling on a Catholic foster care agency, it beat back radical changes sought by the court’s extremistsAccording to the Defense Department’s Office of Inspector General, the Taliban has increased its violence against Afghan citizens since the beginning of the year. Peace talks with the Afghan government have led to a U.S. vow to pull troops from the country by Sept. 11. While Afghanistan gets most of the attention in the region, we, at least, are proposing a “plan” to neutralize anti-West terror development there. We’ll support intelligence, counter narcotics aid and freezing funds and assets goiEGOT-winner Rita Moreno has issued a statement on social media tonight, saying that she’s “incredibly disappointed” in herself after comments she made on The Late Show With Stephen Colbert last night regarding the In The Heights colorism controversy. During the interview, Moreno brought up (apparently unprompted) criticism that’s been levied against the film for its lack of Afro-Latino representation, including specific critiques of her friend and sometimes collaborator Lin-Manuel Miranda. PraisIf you've got more than $1,000 in your checking account, you need to make these moves as fast as possible.Andrew Giuliani reportedly employs a TikTok-famous zookeeper on his campaign staffWhat the Nord Stream 2 means for Europe — and the worldThe heir and the minister didn't seem to know quite how to say hello.", "Section": "", "Writers": "", "URL": "https://finance.yahoo.com/news/west-infrastructure-china-new-silk-road-202628631.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}