{"Type": "", "Time": "2021-06-18", "Headline": "Stock Market Today: Dow, S&P Live Updates for Jun. 18, 2021 - Bloomberg", "Text": "WATCH: Two hikes in 2023 caught some people off guard, says Joshua Younger, head of U.S. interest-rate derivatives strategy at JPMorgan.Asian stocks opened on a mixed footing Friday after U.S. technology shares rallied and Treasuries advanced, with investors unwinding some of this year’s dominant reflation trades. The dollar pared gains and commodities steadied after overnight losses.Equities opened in the green in South Korea and Australia, while Japanese shares slipped. U.S. futures were little changed after a fresh bout of rotation from cyclical stocks pushed the tech-heavy Nasdaq gauge to another record. The benchmark S&P 500 ended the U.S. session flat.Treasury yields steadied from a tumble amid speculation investors were unwinding bets on a steeper curve, after Federal Reserve officials signaled monetary-policy tightening could start sooner than previously thought, helping to rein in the risk that inflation might get out of hand.The Bloomberg Dollar Spot Index steadied after a fifth day of gains, the longest winning streak since March 2020. Its advance makes commodities that are priced in greenback more expensive, driving declines across the complex. Copper is headed for its worst week since the start of the pandemic and oil fluctuated Friday.Meanwhile, Chinese equities will be in focus after U.S. regulators proposed a ban on products from Huawei Technologies Co. and four other Chinese electronics companies. And the Bank of Japan delivers its policy statement later in the Asia session.Investors are now debating when the Federal Reserve is likely to start trimming its monthly bond purchases, after Chairman Jerome Powell flagged in his post-meeting press conference that policy makers are ready to discuss the prospect. The meeting also showed the central bank is likely to start raising interest rates sooner than its prior guidance suggested, with two hikes penciled in by the end of 2023.“What we are seeing here is an interpretation that economic growth is improving and inflation is accelerating; historically both of those are positive for areas like the Nasdaq, tech stocks and even small caps,” Dave Mazza, Direxion managing director and head of product. “Once we peel the onion a bit, what we are seeing in the data, all of this is generally positive for the economy.”Read: Stock-Market Doldrums Face Shake-Up With Friday’s ‘Witching’For more market commentary, follow the MLIV blog.These are some of the main moves in markets:— With assistance by Nancy Moran", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-17/asia-set-for-gains-after-tech-rally-yields-drop-markets-wrap", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}