{"Type": "", "Time": "2021-06-17", "Headline": "Treasury’s Yellen navigates inflation test - The Washington Post", "Text": "Friends who have known Janet L. Yellen for decades describe her as a naturally reserved person, most comfortable at intimate dinner parties with a circle of California economists or her $15,000 stamp collection.And yet the treasury secretary is now playing a leading role in some of Washington’s most high-profile dramas — charged with navigating the Biden administration through a vexing inflation test and besieged by rivals in the Capitol and on Wall Street who are counting on her to stumble.The stakes of Yellen’s public economic posture only intensified Wednesday, when she testified to Congress that inflation is likely to remain transitory hours before the Federal Reserve dramatically increased its inflation projections for the year. Both Yellen and Fed Chair Jerome H. Powell made clear that the economic outlook remains fluid because of uncertainty caused by the pandemic and that they see inflation as likely to subside next year. But the next few months of the economic recovery will be crucial to the legacy of the treasury secretary, who is widely viewed by administration officials as Biden’s leading macroeconomic voice.Yellen, 74, has occasionally struggled to translate her scholarly views to the public since her appointment. She caused the stock market to dive last month, for instance, by trying to address inflation fears and explain the mechanics of central bank interest rate policy.But aides and colleagues insist Yellen’s presentation style belies a political savvy that has propelled her to greater prominence — initially as the first female chair of the Federal Reserve, now as the first female treasury secretary — than any female economist in American history.Federal Reserve boosts inflation expectations to 3.4 percent this year, moves up expectations for interest rate hikeThis article is based on interviews with more than a dozen administration officials, economists, congressional aides and former Yellen colleagues, many of whom spoke on the condition of anonymity to share private observations of someone they believe can be misunderstood and underestimated.Aides and colleagues say she is meticulous in preparation almost to the point of excess, occasionally joining Zoom conferences as much as 15 minutes ahead of time before anyone else is on the call.She has proved to be a far more deft dealmaker than many critics expected, given her lack of experience in high-stakes corporate or congressional negotiations. Yellen and her international tax lead, Itai Grinberg, recently deployed a “good cop, bad cop” strategy with the six other international finance ministers in the Group of Seven, people familiar with the strategy said, leading to an initial accord this month on the first-ever global minimum tax on corporations.Despite her mastery of esoteric economic theories, Yellen has also meshed with a boss known to exhort his advisers to be plain-spoken. One senior administration official said Yellen personally briefed President Biden and answered his pointed questions about the Federal Reserve’s new framework in accessible terms.Yellen pushes global minimum tax as White House eyes new spending planIn navigating heavily male congressional and business arenas, some observers say, she makes a point of praising men’s observations where consistent with her positions — careful to avoid alienating allies, while simultaneously standing firmly behind her own carefully considered arguments.“You can tell she has spent an entire career reassuring self-important men,” said one senior female Democratic official, speaking on the condition of anonymity to frankly describe private conversations. “She is thought to be a policy wonk and not a political actor. But when you watch her close-up, you see her political chops are as good as anybody’s.”A Treasury spokeswoman declined to comment on that characterization.Yellen’s political and economic acumen will face major new tests in the months ahead. Her defense of Biden’s $1.9 trillion stimulus plan — amid attacks from conservative and even many centrist economists — will perhaps shape her ultimate legacy more than any other single policy choice. Yellen’s careful assessment of the risks of the stimulus plan has set her apart from some nervous colleagues, but her estimates have not yet been proven incorrect amid forecasts on Wall Street and elsewhere that the U.S. economy will grow at a very fast clip in 2021.Many Republicans supported her appointment, but now some say her apolitical standing is at risk of being tarnished amid signs that the stimulus package may have been too large, sparking a rise in inflation as demand outstrips supply.Yellen also faces second-guessing from some of her Democratic predecessors, including Clinton administration treasury secretary Larry Summers, who has been critical of the plan in public.“Yellen came into Treasury with significantly more gravitas and respect than most treasury secretaries. She has been very good at portraying herself as nonpartisan and above the fray,” said Brian Riedl, a former aide to Sen. Rob Portman (R-Ohio) now at the libertarian-leaning Manhattan Institute. “But clearly, the deference to her will decrease, particularly among Republicans, to the degree she was promising strong economic performance from the stimulus that does not materialize.”Yellen’s comments on inflation spark confusion, clarification as White House tries to navigate economic pressuresOther critics say Yellen is at the helm of an economic team that has failed to release adequate evidence explaining why its policies would lead to projected growth, as prior administration economists have. Treasury released a “Green Book” of detailed estimates of its tax plans this year, something the Trump administration never did.“I think Treasury is missing in action. We haven’t seen a white paper on the American Jobs Plan, the American Families Plan, the American Rescue Plan — why not?” said Doug Holtz-Eakin, a Republican and former director of the Congressional Budget Office. “The economic agencies are missing in action on what is supposed to be economic policy. It’s the treasury secretary’s job to make sure that happens.”To supporters, Yellen’s critics illustrate that she is correct in identifying the failures of 40 years of macroeconomic policy consensus that have badly damaged the nation’s political and economic fabric.As treasury secretary, Yellen has been unsparing in highlighting wealth inequality, racial income gaps, sluggish middle-class wage growth and the economic dangers posed by climate change — a major shift not only from Trump treasury secretary Steven Mnuchin but also from the more business-friendly money men of the Obama era.“These destructive forces … are combining to block tens of millions of Americans from the prosperous parts of our economy,” Yellen told the Senate Finance Committee on Wednesday. Yellen said greater public-sector investments such as in infrastructure and education were necessary to reverse that trend. But “for 40 years, we haven’t done that.”Yellen’s personal trajectory reflects the broader shift in macroeconomic policymaking that has oscillated over decades.Born in the aftermath of the Great Depression in Brooklyn, she studied economics at Yale University and became a star disciple of James Tobin, a Nobel laureate who served as a chief economist to President John F. Kennedy.Tobin was one the most important Keynesian economists of the late 20th century, helping to establish the empirical basis for government interventions in the economy. Yellen’s notes were so meticulous that generations of Tobin’s students would use them as a reference for his lectures. Economists who have known Yellen for decades say Tobin’s influence remains central to her worldview.“That is why she is comfortable with many of the most progressive elements of the Biden administration’s programs, because in some sense intellectually that is where she has always been even though she’s a card-carrying hard-nosed economist,” said Edwin M. Truman, an economist at the Peterson Institute for International Economics who hired Yellen for the Federal Reserve Board and has known her for decades.As a member of President Bill Clinton’s White House Council of Economic Advisers and the Federal Reserve, Yellen tended to side with the economists less concerned about inflation and more worried about sluggish economic growth. But hers was not the dominant view, among either Republicans or Democrats. Summers, for instance, was Clinton’s treasury secretary and remained more influential in Democratic policymaking circles.By the Obama administration, however, things were beginning to change. Summers was still viewed as an indispensable Obama adviser, leading his White House National Economic Council and later emerging as the likely pick to lead the Federal Reserve. But a revolt against Summers led by Obama’s liberal allies during his second term derailed Summers’s candidacy for the central bank, and the job went to Yellen in 2014.How Larry Summers went from Obama’s top economic adviser to one of Biden’s loudest criticsSummers and Yellen have tangled ever since. In 2015, Summers blasted the central bank for being stuck to “traditional paradigms” that made economic stagnation more likely. The attacks have grown more pointed under the Biden administration, with Summers saying the administration has executed “the least responsible fiscal macroeconomic policy we’ve have had for the last 40 years” by spending more than necessary.Yellen is now arguably the most prominent voice backing a shift away from Summers’s worldview. J.W. Mason, an economist at the City University of New York, said federal policymakers have for decades been “obsessively” worried about inflationary risks, a fear that led to overly cautious spending policies and contributed to low wage growth for four decades. The Biden administration’s diverging approach has been given crucial intellectual heft from Yellen’s support.“There’s been a huge shift in the economic debate — a really dramatic shift — over the past generation and past decade. Yellen has been at the forefront of those shifts,” Mason said. “When she says we need a more active government — a more active role for the public sector — that’s a real shift from the Clinton administration and even the Obama administration.”Yellen is not a believer in Modern Monetary Theory — the voguish left-wing theory supportive of much more unrestrained federal spending — and has been careful not to dismiss the potential inflationary effects of higher spending. Yellen served on the board of the Committee for a Responsible Federal Budget, which pushes deficit reduction, and took more than $7 million in speaking fees from large financial institutions opposed to the administration’s tax plans. She also faced criticism for raising interest rates as chair of the central bank, a decision many now believe prematurely hurt the economy.But she has “really stayed the course when it comes to anti-austerity,” or the belief that the U.S. government should stimulate the economy until it rebounds from the downturn, said Bob Hockett, a former central bank official now at Cornell University. “There’s a sense in which she has heft reputationally that can be a tremendous advantage. … She has a kind of ballast that comes with her academic credentials in defending these expansionary policies.”White House officials tend to say that Yellen is not ideological and open to incorporating new data as it emerges. Internally, Treasury officials led a thorough review of whether Biden’s proposed more-than-$4 trillion infrastructure and education spending plans would lead to an inflationary spike, two people familiar with the matter said. She has given her full-throated endorsements of the policies, and it was Biden — not Yellen — who insisted they be paid for in full with new taxes on the rich and corporations, the people said.“What I really admire about her is she follows the data — she has very rigorous standards in terms of interpreting the empirical evidence and looking at it from all sides. I see her following the empirical evidence and being flexible,” Cecilia Rouse, chair of the White House Council of Economic Advisers, said in an interview.Yellen has also withstood tremendous pressure on Treasury from Wall Street and other business elites skittish about the administration’s tax plans. On a conference call with business leaders this spring, White House Office of Public Engagement Director Cedric L. Richmond signaled the Biden administration was willing to soften its proposed corporate tax hikes to pass an infrastructure package, two people on the call said. Yellen, meeting with the same group of executives a few weeks later, did not offer similar overtures toward compromise.Attendees described Yellen as respectful but “frank” in insisting the companies should pay a 28 percent corporate tax rate, up from the current rate of 21 percent — something everyone on the call knew the executives opposed. (A White House official noted Richmond’s comments were in line with public remarks of other administration officials, such as spokeswoman Jen Psaki.)Yellen “really stuck to her guns,” said one person on the call with business officials, who spoke on the condition of anonymity to reveal details of the off-the-record conversation. “She did not leave a lot of room for discussion.”Yellen will face more politically fraught moments in the months ahead, even as rumors begin to circulate that her deputy, 40-year-old Adewale “Wally” Adeyemo, could be next in line for her job. As much as half of Biden’s massive spending agenda runs through Yellen’s Treasury Department, which also oversees the Internal Revenue Service, on everything from a new child benefit to paid family and medical leave. Yellen will be forced to defend Biden’s aggressive tax proposals in the face of increasingly loud Republican opposition. And on the international front, she is trying to cement a global minimum tax agreement with dozens of countries that is only in its earliest days.But Yellen’s low-key style has played to her benefit thus far. She has little need for political favors, and while in the later stages of her career, she will not struggle for employment once she leaves the government.And, supporters say, she has already been neutralizing powerful male opponents for a half-century.“This generation of successful women economists have a way of being super polite, not yelling, but totally sticking the knife in, and turning it with better arguments and a better professional disposition,” said Claudia Sahm, who worked with Yellen at the central bank. “She will engage with arguments, be incredibly gracious — and then tell you why she thinks you’re wrong.”The latest: The Fed project inflation will rise 3.4 percent this yearInflation comeback: Americans are facing the unfamiliar risk of inflationDon’t panic: Experts weigh in on how you should respond to consumer prices increasing as stocks are going downUsed cars: Do rising used car prices mean inflation is coming?FAQ: Why used cars, gas, airfares, meat and other products are getting more expensive?Rental cars: Rental car shortage shows economic recovery will not be smoothAsk The Post: What questions do you have about the economy and inflation?The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/us-policy/2021/06/17/yellen-inflation-treasury-biden/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}