{"Type": "", "Time": "2021-06-18", "Headline": "Editorial: The Supreme Court saved Obamacare for the third time. It should never have had to", "Text": "In rejecting yet another in a seemingly endless series of Republican attacks on the Affordable Care Act, a divided Supreme Court did more than just preserve a crucial protection for millions of Americans with preexisting health conditions that make them vulnerable to gouging or exclusion by insurers. It also preserved the notions that people have to be injured in order to sue and that Congress, not the courts, write the laws in this country.Writing for a 7-2 majority Thursday, Justice Stephen G. Breyer held that the two individuals and 18 Republican-controlled states behind the lawsuit  hadn't shown that a change Congress made in the ACA in 2017 was responsible for the financial harm they claimed to have suffered. The court ordered the case dismissed.In so doing, the justices rejected the lawsuit's invitation to speculate about what Congress might have intended or what Congress would have done when lawmakers' actions were clear. Congress has voted over and over again not to repeal or even rework the 2010 healthcare law, so it's not the courts' place to refashion it as they see fit.At issue in California vs. Texas was the law's mandate that adults obtain health insurance, which is enforced by a tax penalty, not by civil or criminal fines. Opponents of the mandate challenged its constitutionality right after the law was passed, but a sharply divided Supreme Court held in 2012 that it was a lawful exercise of Congress' power to tax.Once Republicans took control of the House, the Senate and the White House in 2017, GOP lawmakers offered several bills to repeal or replace the ACA, but Congress rejected all of them. Instead, it eliminated the tax penalty for not obtaining insurance, leaving the ACA's many other provisions intact. Among those left standing are requirements that insurers in the individual market — where people not covered by an employer's health benefits shop for coverage — accept all applicants and charge all enrollees in a certain geographic area the same premiums regardless of their health, adjusting only for age and tobacco use, and that insurers offer comprehensive policies that don't exclude coverage for 10 fundamental categories of care.Those provisions guarantee that people with preexisting conditions are protected against discrimination in the individual market, just as they have been when covered by employers' group plans. Republican lawmakers have said repeatedly that they want to protect Americans with preexisting conditions, but the lawsuit brought by a group of GOP state attorneys general and two individuals put the lie to that assertion.The suit claimed that because Congress eliminated the penalty for failing to buy insurance, the individual mandate was no longer a tax and was therefore unconstitutional. And because the mandate is the centerpiece of the law's insurance reforms, the lawsuit claimed, the entire law had to be deep-sixed.But it was an exercise in sophistry that begged the federal courts to engage in the worst form of judicial activism: ruling that Congress intended to do something it patently did not, and then rewriting the law to match the judges' assumptions. And sadly, two lower courts fell for it in whole or in part, setting the stage for the justices to weigh in.The high court did what the lower courts should have done. It observed that neither the states nor the individuals had shown any harm, or prospect of harm, suffered as a consequence of Congress enacting what amounted to a tax cut. And with no harm, there can be no lawsuit.This should have been obvious from the get-go. No one can claim with a straight face to be injured by Congress' decision to reduce the penalty to zero. It's a tax with a 0% rate — what's not to like?It's equally stupefying that a judge would find, as U.S. District Judge Reed O'Connor of the Northern District of Texas did, that Congress killed the entire law when it neutered the mandate. For one thing, the mandate has nothing to do with the law's premium subsidies and its extension of Medicaid to more low-income Americans, among other major provisions. For another, Congress clearly did not intend to repeal the ACA — instead, it voted multiple times not to do so. And third, the ACA marketplaces around the country have continued to function well without the tax penalty, proving that it's hardly an indispensable piece of the law's reforms.It is true, as Justices Clarence Thomas observed in a concurring opinion and Samuel A. Alito Jr. in a dissent, that the mandate to buy insurance was initially seen as indispensable to a central part of the law: the new insurance marketplaces, with premium subsidies for low- and moderate-income consumers. Supporters argued the first time the high court took up the issue that the marketplaces could collapse without the mandate because younger, healthier people would gradually stop buying coverage, causing premiums to spiral upward. But what we've seen since 2017 is that the subsidies are the key to sustaining the marketplaces, not the mandate.The ACA has grown in popularity in recent years, and it won over more doubters during the pandemic, when it provided a crucial safety net to hundreds of thousands of laid-off workers who lost their employer-sponsored coverage. In California alone, enrollment through the state's ACA-based marketplace surged by 200,000 above the previous year's pre-pandemic enrollment period.The relief suggested by the lower courts — tossing out the entire law or just the insurance reforms at its core — would have ripped that safety net to shreds. It also would have inflicted grave damage to the notion that Congress writes the laws.This story originally appeared in Los Angeles Times.The Supreme Court on Thursday released its highly anticipated decision on a challenge to the Affordable Care Act (ACA), also known as Obamacare. By a 7-2 vote, the court rejected the Republican-led challenge to the law.A fast-moving wildfire forced evacuations of homes, snarled highways and drew a rapid response Wednesday from firefighters using helicopters to drop water on flames south of Reno, authorities said. Part of I-580 was closed but it later reopened. (June 17)Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.Republicans tried for a third time to kill Obamacare and fell short.A shrinking proportion of buyers see it as a gamble, but the regulator warns they could lose the lot.More people see crypto assets as a mainstream investment rather than a \"gamble\" as ownership of bitcoin and similar crypto currencies has risen to 2.3 millon adults in Britain this year, the Financial Conduct Authority said on Thursday.  But people increasingly see crypto assets as a potential investment, even though the level of understanding of the sector is declining, the FCA said in its fourth study into crypto assets ownership.  The number of UK adults owning crypto assets has risen quickly from 1.9 million in 2020, the FCA said, adding that the number of people who view them as a gamble fell to 38% from 47% over the same period.Get the best information at your fingertips, here. Yahoo Search provides quick and efficient solutions for all your needs.On Thursday, the Supreme Court released its highly anticipated decision on a challenge to the Affordable Care Act (ACA), also known as Obamacare. By a 7-2 vote, the court rejected the Republican-led challenge to the law.Andy Slavitt, former White House COVID-19 Response Team adviser, author of ‘PREVENTABLE: The Inside Story of How Leadership Failures, Politics, and Selfishness Doomed the U.S. Coronavirus Response’, joins Yahoo Finance to discuss the COVID-19 response in the U.S. and the Supreme court upholding the Affordable Care Act.There is anger in the travel sector over how the government has made decisions over the green list.Cut your monthly payment while rates are low. Free Quotes. Wont affect your credit. Calculate New Payment. (1.97% APR)Irish airline Ryanair is launching legal action against Britain.It's over the country's \"traffic light\" system for international travel.The airline has teamed up with Manchester Airports Group, and the pair plan to file papers at England's High Court on Thursday (June 17).They're seeking clarity over the transparency of the system.With other airlines expected to join the move.There are just weeks before the peak summer travel season when most airline profits are made.The industry has repeatedly criticised the UK's traffic light system for international destinations.Airlines say it is unpredictable and doesn't make scientific sense.And that some low risk countries and islands should be open for travel.A government spokesperson said it could not comment on legal proceedings.Britain allowed vacations again from May after months of lockdown, but discourages travel to popular holiday destinations such as Spain, France, Greece and the United States.They're classified as \"amber\" on the system, meaning travelers have to take multiple tests and quarantine for 10 days on their return. Only a few places a listed as \"green\", and none in the EU. The aviation industry had been banking on Britons to be at the forefront of the resumption in travel.As the country has one of the fastest vaccine rollouts in the world.Public officials have taken the idea of affordable college from something everyone should have to a luxury item only for the super-rich and super lucky California’s governor, Gavin Newsom, celebrates the end of pandemic-era restrictions by drawing 10 lucky winners to receive $1.5m each. Photograph: Jay L Clendenin/Los Angeles Times/Rex/Shutterstock Bernie Sanders, Elizabeth Warren and Chuck Schumer have spent months asking Joe Biden to use his authority to eliminate or reduce crushing student deThe Supreme Court has dismissed a challenge to the Obama era health care law, preserving insurance coverage for millions of Americans.Today's mortgage refi rates at 1.77% FIXED - No hidden points or fees! 1.97% APR. Cut your payment while rates are still low.For years, Miami Democratic Rep. Frederica Wilson commemorated Juneteenth with her Congressional Black Caucus colleagues, and Black celebrities frequently joined lawmakers in Washington to celebrate.The congresswoman maintains her post at the National Endowment for Democracy despite criticism over how she cast doubt on Biden’s election.The new Supreme Court ruling guarantees the law's survival, but Democrats and Republicans are set to clash over efforts to expand government health coverage.New research has identified TEN favorite stocks for the upcoming year‘“I received information yesterday (at midnight) regarding a plan (with a timeline) to murder me made by William Braddock in an effort to prevent me from winning the election for FL-13,’ Florida GOP candidate claimsCuomo told a shoulder-to-shoulder, unmasked crowd at One World Trade Center on Tuesday that the state’s pandemic-era restrictions are no longer in effect \"across commercial and social settings.\"Hong Kong police used a sweeping national security law Thursday to arrest five editors and executives of a pro-democracy newspaper on charges of colluding with foreign powers — the first time the legislation has been used against the press in yet another sign of an intensifying crackdown by Chinese authorities in the city long known for its freedoms.Top Surgeon and Author of the Best Selling Book \"Dr. Gundry's Diet Evolution\" Discovers Link Between Gut Health and the Rising Number on the Scale.Dir: Paul WS Anderson. Starring: Milla Jovovich, Tony Jaa, Ron Perlman, Meagan Good, Diego Boneta, T.I. 12A cert, 104 mins Monster Hunter started life as a 2004 action role-playing game on the PlayStation 2, and has expanded to become a mammoth success, luring in a new generation with the 2018 upgrade Monster Hunter: World. It’s second only to the Resident Evil series as a hit title for its developer, Capcom – and given the profitability of the latter’s film spin-offs, it was only a matter of tiSome energy experts warn that the recent failings of the state's grid may portend additional shutdowns should temperatures continue to climb this summer.We the voters of Florida are quite concerned about the motivation and level of passion coming from the new Florida Democratic Party chairman.", "Section": "", "Writers": "", "URL": "https://news.yahoo.com/editorial-supreme-court-saved-obamacare-152924975.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}