{"Type": "", "Time": "2021-06-18", "Headline": "Far-flung Taiwan island Pratas risks triggering a US-China clash, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.TAIPEI (BLOOMBERG) - When 28 Chinese warplanes streaked through the skies around Taiwan on Tuesday (June 15) - the largest such incursion this year - they followed a pattern that has generated alarm among US and Taiwanese military planners.Some of the People's Liberation Army planes, including bombers, fighter jets and surveillance and reconnaissance aircraft, flew east from the Chinese coast around the southern tip of Taiwan. The rest broke off and briefly darted further south toward tiny Pratas Island in the South China Sea before turning back.The PLA has flown close to the atoll - uninhabited except for a garrison of Taiwanese marines and coast guard officers - once a week on average since Sept 16, when the Taiwanese Defense Ministry began releasing detailed data.If all incursions into Taiwan's air-defense-identification zone between Pratas and the Chinese mainland are included, the patrols have become an almost daily occurrence.The exercises signal Beijing's displeasure with the democratically elected government in Taipei and its successful effort to court greater US support, as seen by a mention in the Group of Seven communique this week.In response to China's moves, President Joe Biden's administration has stepped up surveillance flights near Pratas, raising the risk of a confrontation or clash between two of the world's most powerful militaries.The Chinese focus on Pratas serves several aims of President Xi Jinping, highlighting Taiwan's vulnerability to attack while probing its defenses.The strategy also tests the limits of Washington's security commitment, and whether it's willing to go to war to defend largely vacant reefs hundreds of miles from the nearest American base.The aerial campaign demonstrates that Beijing has options for striking a blow against Taipei that fall well short of a dangerous invasion across the 130km Taiwan Strait, which is becoming a more urgent concern for American military planners.Taking Pratas Island - located closer to Hong Kong than Taiwan - could give China a new launching ground for future military operations without provoking a full-scale conflict with the US.\"There is now a serious possibility that China seeks to occupy one of the outer islands,\" Prof Ben Schreer, who studies Taiwan's defense policy and heads Macquarie University's department of security studies and criminology in Sydney.\"If that happens, what is the international community going to do? What is the US going to do?\"Even if Mr Xi has no immediate plans to seize any land, regular incursions help establish China's long-term presence in territory it claims as its own.Meanwhile, the drumbeat of exercises adds to the domestic political concerns for Taiwanese President Tsai Ing-wen, who rejects Beijing's claims to sovereignty.The campaign has put new strain on Taiwan's aging air force, which has seen three fatal crashes in the past nine months. The service announced in March that it expected to spend NT$2.1 billion (S$101.5 million) more this year countering PLA operations.China's warplanes made more incursions into the southern part of Taiwan's air defense identification zone last year than in the previous five years combined. While Beijing has blamed the exercises on Tsai's refusal to accept that both sides belong to \"one China,\" the increase has tracked with U.S. efforts to step up arm sales and diplomatic exchanges with Taiwan.Tuesday's operation came after the G-7 called for a \"peaceful resolution\" of the dispute in a statement more critical of China than past communiques.\"We urge the relevant countries to observe their promise to China and handle the Taiwan question properly and stop sending wrongful signals to Taiwan separatist forces,\" Taiwan Affairs Office spokesman Ma Xiaoguang told reporters on Wednesday in Beijing.Such exercises help \"carry out military simulations according to an actual combat plan and rehearse in the real environment\", Mr Song Zhongping, a former PLA instructor on missile technology, told a social media account run by the Beijing Youth Daily newspaper.While Taiwan's military has expressed confidence in its ability to defend Pratas, it would be operating more than 400 kilometers from its coast and facing the world's largest navy. Taiwan has scrambled to upgrade its defenses around the atoll, reinforcing the garrison with 200 marines, sending in anti-armor rockets and restarting a stalled project to upgrade the local airstrip.Another concern for Taiwan is a permanent loss of control over the skies between the main island and its territories in the South China Sea, as Taipei seeks to avoid close confrontations with China that could escalate into a clash.Chinese state media have hinted at an expansion of the strategy amid domestic calls for a tougher response to US moves.The Global Times newspaper, which last year said Beijing was considering military flights directly over Taiwan, reported that China may retaliate over a visit by an American C-17 cargo plane earlier this month by sending patrols closer to Taipei.Enodo Economics, an independent macroeconomic and political forecasting company focused on China, raised the chances of a military conflict between the US and China to 65 per cent in March, compared with 10 per cent in January 2019.\"While a surprise attack on Taiwan is possible, a more characteristic Chinese approach would be to ratchet up threats with a view to both eroding Taiwan's will to resist and providing a retrospective justification for its actions,\" said Ms Diana Choyleva, Enodo's chief economist.\"China is currently attempting to bring about reunification through a 'gray zone' campaign of mounting pressure, confident that time is on its side and that within the next few years the PLA will be able to overmatch the U.S. in the Taiwan Strait.\"The flights show China demonstrating its ability to project force far from its coast, potentially encircling Taiwan and denying the US access to possible battlefields. With no troops on Taiwan, the bulk of American forces during any conflict would be deployed from their main bases in Japan, South Korea and Guam, hundreds of miles away.US warships in the Western Pacific seeking to intervene near Pratas would need to pass through the Bashi Channel, which separates southern Taiwan from the northern Philippines.Correspondingly, the PLA has made nine flights into the channel since September, giving its long-range H-6 bombers a route to the open sea while picking up data on rival defense systems and allowing its pilots to become more comfortable.China also test-fired anti-ship missiles into the South China Sea last year, in what US Indo-Pacific Command Admiral Phil Davidson called an \"unmistakable message\" of the country's focus on \"countering any potential third-party intervention during a regional crisis\".The PLA Air Force separately released a video in September showing H-6 bombers making a simulated strike on a runway that looked similar to one at Anderson Air Force Base on Guam.The US has sought to prove its commitment to ensuring the security of key shipping routes inside the so-called first-island chain, which includes the Philippines, Japan and Taiwan.The Pentagon has roughly doubled reconnaissance flights over the South China Sea this year, according to Peking University's South China Sea Strategic Situation Probing Initiative, with 72 such patrols last month.Much of those flights passed over the Bashi Channel, according to sites that monitor military air traffic. In a written response to questions from Bloomberg News last month, Lieutenant Mark Langford, a spokesman for the US' Seventh Fleet, declined last to provide specifics on such flights, citing a need to maintain \"operational security\".Mr Ely Ratner, Biden's nominee to be assistant secretary of defence for the Indo-Pacific, told the Senate Armed Services Committee on Wednesday that the US needs a \"combat-credible\" posture in the region to counter China.He added that he would \"carefully review the current military balance across the Taiwan Strait to ensure that our defense cooperation with Taiwan is commensurate with the threat posed\" by China.All that military activity increases the risk of a confrontation, such as the crisis that erupted in April 2001 when a US Navy EP-3 reconnaissance plane collided with a Chinese F-8 fighter jet.Two dozen American crew members were held for 11 days after making an emergency landing on Hainan Island.The Biden administration has renewed calls for China to open a hotline to help keep a misunderstandings between the two sides from escalating into a conflict, so far with little success.\"I worry about accidental collisions with tragic results given the PLA's aggressive actions close to Taiwan and other countries,\" said Ms Shirley Kan, an independent specialist in Asian security who previously worked for the US Congressional Research Service. \"China is playing a dangerous game.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/far-flung-taiwan-island-pratas-risks-triggering-a-us-china-clash", "Source": "google"}