{"Type": "", "Time": "2021-06-17", "Headline": "Super powers are super reckless (and foolish) | Joe Biden | Al Jazeera", "Text": "The summit between Putin and Biden solved nothing, and showed that they have not learned much from the mistakes of their predecessors.After the leaders of the United States and Russia concluded their summit on Wednesday, President Vladimir Putin assured a Canadian journalist that such meetings are meant to save the world from nuclear destruction, and find solutions to the world’s economic, climate and medical problems. President Joe Biden, for his part, told journalists that there are no secret codes to foreign policy, that it is all about personal relationships, about human nature.All this sounded rather comical, if not tragic, considering the two men supposedly on a quest to save the world could not even find it in themselves to hold a joint news conference after their three-hour chat to assure their people, and the rest of the international community, of their noble intentions.Not only had their first face-to-face meeting not made the world safer or better; but like old brats, they took swipes at each other’s countries, using stale cliches and sinister arguments.In other words, the summit solved nothing; none of the serious challenges to global security, whether cyber or strategic. And though Biden and Putin did agree to begin a strategic dialogue, it can hardly be considered a reboot or a “reset”.And since this was a preview for a future US-China summit, there is certainly little to celebrate and much to contemplate as the Biden administration hardens US positions and changes the rules of diplomatic engagement to keep its rivals in check. Biden will undoubtedly pursue a similar strategy in his future interactions with China’s Xi Jinping in the hope of containing Beijing before it becomes a leading global power.Clearly, global power politics is not about leaders’ personal chemistry; looking into each other’s eyes, soul-searching to save the world.Clearly, the endgame of these summits is not achieving a peaceful, healthy and clean world free of nuclear weapons.And clearly, the challenges are too vast and indeed too complicated and consequential to global and individual security.But the logic that guides the superpowers tackling these challenges is rather simple – it is the logic of power. Neither human rights and democracy, nor sovereignty and international law, just power. And that applies to democratic and authoritarian regimes alike.That is not to say, I see no difference between liberal-democratic and totalitarian regimes, I certainly do, and have a strong preference.But when it comes to foreign policy, certain democracies have been no less imperialistic or criminal in their foreign policy than their authoritarian counterparts. Colonialism is one stark example. And in the case of totalitarian regimes, some like China, have delivered more prosperity to their people, especially poor people, than many democracies.For centuries, great powers, regardless of their colours and stripes, competed under the pretext of security, but eventually led to greater global insecurity.Their attempts to dominate regions and continents to deter other ambitious powers from doing the same have ruined the lives and livelihoods of countless people around the world.And for much of the second part of the 20th century, their rivalry had turned nuclear, endangering the world with total, Mutually Assured Destruction.MAD, indeed.In sum, despite their claim to benevolence, enlightenment, liberty, civilisation, and even total human emancipation; despite their preaching of democracy and human rights, or insisting on international law and an international rules-based system, global powers have led the world to the worst conflicts and most devastating wars.Like pyromaniac firemen, they repeatedly tried to put out fires with more fire, burning down everything they touched.And yet, as Biden put it, there is no secret code as to why and how they do it – it is not rocket science.Still, despite appearances to the contrary, theirs is no personal business but rather a dirty business. Once you shun the enormous humbug coming out of governments, it all becomes rather clear.Here is my simplified version of this complicated picture.Life in a world dominated by superpower politics is very much like life in a tough neighbourhood, where a few bullies take advantage of the absence of authority to dominate the streets by force. That is geopolitics.They continuously accumulate arms and assets to expand their influence and surpass other tough bullies around the block. The fancy phrase for that is “offensive realism”.When they agree to a certain division of the neighbourhood into areas of influence; that is “defensive realism”.Improving one’s standing to take on potential threats using all available means is strategy. Demonising others to justify one’s own threatening posture is propaganda.Some intimidate or manipulate powerless neighbours, providing them with protection in return for loyalty and support, others may use more carrots than sticks to attract support; these are patron-client relationships that come in handy to indirectly dominate vast areas of the world.When a bully gets super cocky, another may avoid confrontation by nudging a third bully to step up to the challenge; that is called “passing the buck”. For the past two decades, careful not to antagonise Washington, Beijing has passed the buck to Moscow, leaving it to face an aggressive post 9/11 America.But when one bully joins another bully against an aggressive third, that is “band-wagoning”. In that way, European powers join the US and an alienated Russia may join China, as they compete for world domination in the 21st century.Both are repeating what their predecessors did over centuries eyes wide open: jostling for power and influence regardless of the cost to the world.And judging from delusional performances at this week’s news conferences, Biden and Putin do not seem to have learned much from the mistakes of their predecessors.Follow Al Jazeera English:", "Section": "", "Writers": "", "URL": "https://www.aljazeera.com/opinions/2021/6/17/super-powers-are-super-reckless-super-foolish", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}