{"Type": "", "Time": "2021-06-17", "Headline": "McDonald's BTS meal in Singapore to be available via delivery only amid Covid-19, Consumer News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Fans of popular South Korean boy band BTS, take note. The McDonald's BTS meal will be available only via delivery services in Singapore to prevent long queues amid the Covid-19 pandemic.The meal cannot be purchased in-store or via drive-through facilities, said the fast-food chain in a Facebook post on Wednesday (June 16).Launching in Singapore next Monday, the meal will be available at a discounted price of $8.90, which is 10 per cent off the usual delivery price, said McDonald's.The meal, which comprises Chicken McNuggets, fries, a drink as well as sweet chilli and Cajun dipping sauces, can be purchased via delivery services such as McDelivery, Grab or FoodPanda.The launch of the new celebrity meal had sparked a frenzy in several countries.In Indonesia, the fast-food chain temporarily shut several outlets on June 9 over virus fears after huge crowds gathered.There was a surge in online orders once the limited-edition meal was made available, and McDonald's outlets across Indonesia were overwhelmed as delivery drivers converged on them to collect the orders.Malaysia, the first country in Asia where the meal was launched, saw long lines of people and cars queueing at several McDonald's outlets.The McDonald's delivery app and the website's online delivery service crashed on the launch day, May 26.In the Facebook post, McDonald's Singapore assured delivery riders that safety measures will be put in place to maintain orderly queues and prevent crowding inside and outside outlets.The BTS meal was originally scheduled to be released locally on May 27, but the launch was delayed following a spike in Covid-19 cases.Seven-member K-pop sensation BTS made its debut in 2013 and has since amassed a large following here.Tickets for their 2019 concert in Singapore sold out in less than four hours after going on sale in October 2018.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/consumer/mcdonalds-bts-meal-in-singapore-to-be-available-via-delivery-only-amid-covid-19", "Source": "google"}