{"Type": "", "Time": "2021-06-18", "Headline": "Loki continues Marvel’s quest to make Thor: The Dark World truly matter | GamesRadar+", "Text": "GamesRadar+ is supported by its audience. When you purchase through links on our site, we may earn an affiliate commission. Learn more\nBy\nBradley Russell\n17 June 2021\nLoki is doing its best to make us care about the Thor sequel againThor: The Dark World is (probably) no-one’s favorite Marvel movie.While not inherently bad, the Thor sequel wastes a great villain in Malekith – and an even greater actor in Christopher Eccleston – in favor of an oddly gritty, low-energy traipse around London via Asgard.Before and since, Thor has been treated better – both as Shakespearean superhero and as comedic lightning rod – yet Marvel has continued to set its sights on retroactively improving the perception of The Dark World. Remarkably, it has worked. That’s all thanks to two scenes, both of which have come years down the line: first in Avengers: Endgame and then in Loki on Disney Plus. It’s proof that, even with an eye to the future, Marvel can keep improving its past.Endgame, for all its epic CGI showdowns, was a movie filled with tear-jerking moments. Chief among them was Thor’s travels back in time to the events of The Dark World and the surprise reunion with his mother Frigga (Rene Russo). Taking place just minutes before her death in Asgard’s palace, the scene in question re-frames an event that, in the grand scheme of the MCU, was glossed over pretty quickly. Thanks to Endgame, the moment is imbued with serious weight. Thor, after all, is a broken man after Thanos snaps half the universe away. He’s without a home, without a hammer, and without a family. The Dark World reprise temporarily gifts him the latter and, by having Thor literally revisit his past and share a conversation with his mother on her final day, it gives the God of Thunder some closure.“Everyone fails at who they’re supposed to be,” Frigga tells her despondent son. Maybe The Dark World’s similar: it didn’t quite live up to the expectations upon it but, like Thor, it eventually found a new lease of life. Thor found his mojo again in Thor: Ragnarok, while the revisited scene strikes a new chord as a worthy epilogue for the hero’s adventures so far. That’s not half-bad for a five-minute scene tucked away in a three-hour epic.Similarly, The Dark World is integral to the fabric of Loki. In our interview with writer Michael Waldron, he said: “I think that Thor: The Dark World was probably the most influential for me for Loki's development in the show.” Not the original Thor, not 2012’s Avengers, not Thor: Ragnarok – but The Dark World.Why? Loki’s own personal home movies collection at TVA HQ during the Disney Plus series answers that. Aided by Tom Hiddleston’s performance – check out the subtlety of each tic and facial expression – the God of Mischief’s trip down not-quite memory lane helps crystalize The Dark World as a juncture at which Loki decides to change.His accidental betrayal of Frigga and Loki’s reaction to finding out the news underlines more about the character than The Dark World ever could. Here, Loki is reduced to a scared child quivering, ranting, and whimpering over the death of his mother.Loki might not believe what he’s seeing, but he’s quietly accepting of what’s locked into his future. Again, The Dark World is set in stone – for Loki, it’s his future and for us it’s the past – but we can continue to re-evaluate it thanks to however much Marvel chooses to parse out of it. Something that was only teased in The Dark World with Loki’s angry prison reaction upon hearing of Frigga’s death is now brought fully into the light. Loki, the show, has built on what The Dark World originally lacked by allowing us to fully witness the deity’s emotional response to the news. They each work in tandem to create a better, more cohesive whole. Without The Dark World, the scene in Loki wouldn’t feel as important. Without Loki, The Dark World doesn’t live long in the memory.Both Endgame and Loki go to show how much Marvel has evolved in its approach to the past. It’s worlds away, for example, from hammering the square peg of Jake Gyllenhaal’s Quentin Beck into the round hole of canon by ‘featuring’ the soon-to-be-villain bitterly lurking in the background during Tony Stark’s BARF presentation in Captain America: Civil War.Loki is about to blow the bloody doors off the MCUInstead, it’s made Thor: The Dark World truly matter; it’s no longer a sequel that many would gladly pass over. It’s now become an integral cog in understanding the whirring machinations of two half-brothers from Asgard, and one that deserves a second chance. It also pays dividends elsewhere, too. Avengers: Age of Ultron has been immeasurably improved thanks to the fleshing out of Wanda and Vision in WandaVision. Similarly, Bucky and Sam Wilson’s arcs from Civil War onwards are all the better on a rewatch thanks to the end button that is The Falcon and The Winter Soldier.With time travel and the multiverse looming large in Marvel Phase 4, it’s a smart step showing how the MCU’s shows can present past events from new, intriguing angles without ruining characters or presenting us with plot holes.It’s achieved that thanks to The Dark World’s inclusion at the heart of Thor’s character arc in Avengers: Endgame and, latterly, Loki’s own evolution in his six-part series. It’s a storytelling choice that is not only brave and bold – but proves that even the black sheep of the family is not without serious merit in Marvel’s grand vision. Is it anyone’s favorite Marvel movie now? Probably not. But it speaks to the talents of Marvel Studios that they’ve now redefined it as one of its most important.Catch up on the MCU story so far with our guide on how to watch the Marvel movies in order.I'm the Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.The best Xbox One headsets for 2021Best Xbox Series X headset: pick up the best audio accessory for your new Xbox consoleThe best PS4 headsets for 2021Get the best gaming deals, reviews, product advice, competitions, unmissable gaming news and more!Thank you for signing up to GamesRadar+. You will receive a verification email shortly.There was a problem. Please refresh the page and try again.GamesRadar+ is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.©\nFuture US, Inc. 11 West 42nd Street, 15th Floor,\nNew York,\nNY 10036. ", "Section": "", "Writers": "", "URL": "https://www.gamesradar.com/loki-continues-marvels-quest-to-make-thor-the-dark-world-truly-matter/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}