{"Type": "", "Time": "2021-06-18", "Headline": "Loki Just Introduced a Major New Comic Book Character to the MCU", "Text": "Southeast AsiaThis story contains spoilers for Marvel’s Loki, season 1, episode 2. The second episode of Marvel’s Loki has concluded with quite the major reveal, introducing a significant character from the Thor comics to the MCU. In the closing scenes of the second episode, it is revealed that the cloak and hooded variant that Loki and Agent Mobius have been hunting is not, in fact, simply just an identical variant of the God of Mischief. Instead, it is Lady Loki, a female variant of our protagonist, played by Sophia Di Martino.Lady Loki is a fairly major part of the recent-ish Asgardian mythology of Marvel comics. She was introduced in 2008 as part of J. Michael Straczynski’s famed run on Thor, in which Loki was reborn as a woman following the apocalyptic events of Ragnarok. Born into a body originally intended for Lady Sif, Loki lived as a woman for a lengthy period, extending through to the Dark Reign storyline in which she teamed up with Norman Osborn. In the comics, Loki is both gender fluid and also able to take the form of a number of Loki variations, Kid Loki being a particularly popular form. It’s part of the character’s trickster personality; regardless of if they are a man, woman, or child, they are always Loki. The MCU may well be taking a slightly different approach to this, in that these gender/form variations of Loki are present in different timelines, rather than the choice of the prime “sacred” timeline Loki. This second episode has already confirmed variants that include a Frost Giant and a Hulk Loki, but further episodes and more time spent with Lady Loki may reveal more about the MCU’s Loki lore. This all links back to the recent confirmation that Loki is gender fluid, as seen in his Time Variance Authority file. For more from Loki, be sure to check out our episode 2 review, as well as our deep-dive on Loki’s evolution from villain to an agent of chaos. Matt Purslow is IGN's UK News and Entertainment Writer. ", "Section": "", "Writers": "", "URL": "https://sea.ign.com/loki-tv-series/173215/news/loki-just-introduced-a-major-new-comic-book-character-to-the-mcu", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}