{"Type": "", "Time": "2021-06-18", "Headline": "Bukit Merah View market cluster in S'pore grows to 56 cases", "Text": "SINGAPORE — The Ministry of Health (MOH) on Thursday (17 June) confirmed 27 new COVID-19 cases in Singapore, taking the country's total case count to 62,366.Twenty of them are local cases in the community. Of them, 17 – out of 19 linked cases – are linked to the 115 Bukit Merah View market and food centre cluster. Thursday marks the 53rd consecutive day with local cases reported. Seven remaining cases are imported, including one Singaporean and two permanent residents who returned from India. Three others are work permit holders who arrived from Indonesia and Malaysia, of whom two are foreign domestic workers while a 26-year-old man entered Singapore waters from Indonesia without valid documentation, and was arrested by the Police Coast Guard. \"Amongst the new cases today, 12 are asymptomatic, and were detected from our proactive screening and surveillance, while 15 were symptomatic,\" said the MOH.The sole unlinked community case is a 72-year-old Singaporean woman who works as a counter staff at Tiong Bahru Plaza's McDonald‘s outlet. The fully-vaccinated woman was detected when she was tested for COVID-19 on 16 June as part of surveillance testing for staff who work at the shopping centre.Separately, a 12-year-old female PR, a student at Tanglin Trust School, was identified as linked to a previously reported case but not to any active cluster.The MOH also announced the closure of three clusters – Learning Point, Jin Tai Tong Food Industries, and \"Case 63336\" – as there have been no cases linked to them for the past two incubation periods, or 28 days. Singapore currently has 41 active COVID-19 clusters.The ministry noted that the number of new cases in the community has increased from 40 cases in the week before to 93 cases in the past week. The number of unlinked cases in the community has also increased from seven cases in the week before to 18 cases in the past week.The cluster was first linked to a 74-year-old Singaporean man who works at a sundry store at the market. The fully-vaccinated man was confirmed to have COVID-19 on 9 June.Most of the 17 new cases – aged between three and 87 – are family members and household contacts of infections in the cluster. Of them, 12 had been quarantined earlier:a 32-year-old female PR who works as an administrative staff at MSIG Insurancea 73-year-old Singaporean woman who works as a stall assistant at Tiong Bahru Yong Tao Hu (fully vaccinated)an 87-year-old Singaporean woman who works at a sundry store at the marketa 52-year-old Singaporean woman who works as a food store vendor at the market (fully vaccinated)a 14-year-old female PR who is a student at Bukit Merah Secondary Schoola 3-year-old Singaporean girl who does not attend any childcare facilitya 69-year-old female India national who is currently unemployeda 50-year-old female India national who is currently unemployeda 5-year-old male PR who is a student at Henderson's PCF Sparkletots Preschoola 13-year-old female PR who is a student at Bukit Merah Secondary Schoola 62-year-old Singaporean woman who is a homemaker (fully vaccinated)a 69-year-old Singaporean man who is a retiree, and helps out at a food stall at the market (fully vaccinated)Five cases were detected via surveillance testing:a 60-year-old Singaporean woman who works at Bioinfocomm and is a frequent visitor to the market (fully vaccinated)a 36-year-old Singaporean man who works as a shipping operator at Skyline Shipping and is a frequent visitor to 116 Bukit Merah Viewa 65-year-old Singaporean man who works as a part-time food stall assistant at the marketa 23-year-old Singaporean woman who works as a patient service associate at Singapore General Hospital (fully vaccinated)a 10-year-old Singaporean girl who is a student at Zhangde Primary SchoolThe MOH announced that it is investigating cases of COVID-19 amongst those who work in or have visited 78, 79, 80, 84 and 85 Redhill Lane, 86 Redhill Close, 18 Jalan Membina and Tiong Bahru Yong Tao Hu Coffeeshop at 56 Eng Hoon Street.The ministry said it will be conducting special testing operations for all staff and tenants who have been working at these premises. Free COVID-19 testing will also be extended to members of the public who visited these places between 1 and 15 June:Any of the shops at 78, 79, 80, 84 and 85 Redhill Lane and 86 Redhill Close between 1 and 15 JuneAny of the shops at 18 Jalan Membina between 9 and 15 JuneTiong Bahru Yong Tao Hu Coffeeshop between 7 and 14 JuneThe cluster is named after the case number of a 27-year-old male India national who works as an engineer at Ecoxplore and was confirmed to have COVID-19 on 12 June.The new addition to the cluster is a 52-year-old Singaporean man who works as a private hire driver for Tada. As the fully-vaccinated man had been identified as a close contact of a previously reported case in the cluster, he was placed on quarantine on 15 June.With 29 more patients discharged from hospitals or community isolation facilities on Thursday, 61,960 cases – or 99.3 per cent of the total – have fully recovered from the infection.Most of the 151 hospitalised cases are stable or improving, while one of them is in critical condition in the intensive care unit.A total of 221 patients – with mild symptoms or are clinically well but still test positive – are isolated and cared for at community facilities.Apart from the 34 patients who have died from COVID-19 complications, 15 others who tested positive for the virus were determined to have died from unrelated causes, including three whose deaths were attributed to a heart attack and another four, whose deaths were attributed to coronary heart disease.Among the 130 confirmed cases reported from 11 to 17 June, 45 cases have tested positive for their serology tests, 66 have tested negative, and 19 serology test results are pending.Finance Minister and multi-ministry taskforce (MTF) co-chair Lawrence Wong in a Facebook video post on Wednesday raised the possibility of a delay in the next stage of Singapore's re-opening, due to the growing cluster at the Bukit Merah View market.With this in mind, Wong said the government is \"evaluating the timeline and the scope of our second stage of opening\" and, in consultation with public health experts, would announce its decision soon.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeRelated stories:COVID quarantine procedures confusing, inconsistent: Singapore residentsLawrence Wong raises possible delay in next stage of reopeningBukit Merah View Market COVID cluster grows to 39 casesSinovac vaccine has 2-year shelf life, still being assessed for use in Singapore: MOH officialRafael Nadal and Naomi Osaka, with 24 Grand Slam titles between them, both withdrew from Wimbledon on Thursday with the Spanish star also pulling out of the Tokyo Olympics in a bid \"to prolong my career\".China and other nations were attempting to “seize control” of strategically important international organisations so they could be “weaponised”, a new report by the UK parliament’s influential Foreign Affairs Committee said. The report, published Thursday, accused China in particular of “bullying” states to back their position or their candidates for top jobs, using measures including financial leverage “to shift policies away from the cooperation the organisations were created to promote”. TheGuided by MIT faculty, gain practical knowledge to embrace blockchain as a business tool.Global stocks were mixed on Thursday as traders digested the Federal Reserve's move to bring forward its forecasts for hiking interest rates as the economy recovers.The PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saBrowsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.Every PC user must read this in 2021 - Do it now.A reporter with a pro-Beijing newspaper in Hong Kong accused of making a false statement when accessing a government car registry has been let off the hook after prosecutors agreed to drop the charge on condition of a binding-over order. The prosecution’s decision stood in marked contrast to the justice department’s handling of a case last year involving an RTHK contributor accused of the same act, prompting Principal Magistrate Ivy Chui Yee-mei to question the difference in approach at ThursdayWashington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HouseBeijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityExpand Wifi Signal in Every Single Room & Boost Wifi Speed by 200%If you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.The Kremlin was guarded about future dialogue with Washington on Thursday, a day after the first face-to-face meeting between Russian President Vladimir Putin and US counterpart Joe Biden.Hong Kong police have for the first time determined the publication of certain newspaper articles to be a national security crime as they arrested the editor-in-chief, publisher and three other executives of Apple Daily whom they held accountable for more than 30 reports calling for foreign sanctions. The force on Thursday cited the publication of the articles – understood to be mostly commentaries and opinion pieces, including several written by the tabloid’s jailed founder and opposition activLastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Israeli jets launched air strikes on Gaza overnight Thursday to Friday after militants in the Palestinian territory again set off incendiary balloons into southern Israel, the army and AFP journalists said.Former Taiwanese president Ma Ying-jeou has called on the government to listen to public opinion and allow civilian groups which have different political leanings to the ruling Democratic Progressive Party to import much-needed Covid-19 vaccines. Taiwan, which is battling a surge in cases, has struggled to secure vaccines although it has signed deals to buy 10 million doses from AstraZeneca, 5 million from Moderna and more than 4.7 million doses via the Covax Facility, which is supported by theJapan said on Thursday it will make a vaccine passport available from next month for Japanese travellers, as governments around the world experiment with ways to relaunch tourism and business trips.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).The scientific community should find ways to overcome political divides and push for more collaboration in space exploration, as well as solve global problems by making use of China’s new space station, a Hong Kong-based space expert says. Professor Quentin Parker, head of the Laboratory for Space Research at the University of Hong Kong, made the remarks ahead of China’s first crewed space flight in nearly five years, with three astronauts expected to travel to its new Tiangong space station forChinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiChina’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the buNew research has identified TEN favorite stocks for the upcoming yearIf you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.The World Bank rejected a request from El Salvador for assistance in its bid to adopt bitcoin as a currency, a spokesperson for the Washington-based development lender said Thursday.With Afghan troops in retreat and soon to lose vital American air support, Taliban commanders are voicing exuberance about quickly seizing full control of the country and re-establishing their version of an Islamic state.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/of-27-new-covid-cases-20-in-community-080035689.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}