{"Type": "", "Time": "2021-06-18", "Headline": "Singapore reviews timing of next stage of reopening amid latest outbreak of Covid-19 cases | The Star", "Text": "\n                    Wednesday, 16 Jun 2021\n                The second stage of the economy's reopening is being reviewed in the light of the emergence of a major Covid-19 cluster in Bukit Merah and other new Covid-19 cases. - ST SINGAPORE (The Straits Times/ANN): The multi-ministry task force tackling Covid-19 is reviewing the timing and scope of the second stage of the economy's reopening, in the light of the emergence of a major Covid-19 cluster in Bukit Merah and other new Covid-19 cases, Finance Minister Lawrence Wong said on Wednesday (June 16).In an Instagram and Facebook post, Wong noted that Singapore is now in the first stage of its reopening following the phase two (heightened alert) restrictions, and that further relaxation of the rules was due to take place on June 21, including allowing dine-ins at eateries.\"Unfortunately we now have new cases breaking out and a major new cluster in Bukit Merah. Given these developments, we are evaluating the timing and scope of the next stage of reopening. The multi-ministry task force is studying the situation carefully with public health experts, and will provide further updates soon,\" said Wong, who is co-chairman of the task force, in his post.\"Day by day, we are seeing (that) the number of unlinked cases - the cryptic cases in the community - is likely to be rising too,\" he noted.Wong acknowledged that this is a difficult period for everyone in Singapore.\"I want to assure all of you that we are doing our very best to control the infection, and we want to ensure that we do not have another flare-up, before we reach sufficiently high levels of vaccination in our community.\"Singapore had planned to ease restrictions in two stages, following a steady drop in the number of Covid-19 cases in the community.From Monday (June 14), people were able to gather in groups of up to five. Should the situation remain under control, further relaxation of the rules - including permitting dining in at food and beverage outlets - may take place a week later, on June 21.The closure of Bukit Merah View Market and Food Centre was extended to June 26 on Tuesday, after nine more cases were linked to the cluster, taking the total number of linked cases to 25.The centre has been closed since Sunday and was originally meant to reopen on Wednesday. - The Straits Times/Asia News Network \nTags / Keywords:\nSingapore\n                                                                ,\n                                                                                                covid-19\n                                                                ,\n                                                                                                cases\n                                                                ,\n                                                                                                reopening\n                                                                ,\n                                                                                                review\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/16/singapore-reviews-timing-of-next-stage-of-reopening-amid-latest-outbreak-of-covid-19-cases", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}