{"Type": "", "Time": "2021-06-18", "Headline": "S'pore evaluating timing, scope of next stage of reopening amid latest outbreak of Covid-19 cases: Lawrence Wong, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The multi-ministry task force tackling Covid-19 is reviewing the timing and scope of the second stage of the economy's reopening, in the light of the emergence of a major Covid-19 cluster at the Bukit Merah View Market and Food Centre and other new Covid-19 cases, Finance Minister Lawrence Wong said on Wednesday (June 16).In an Instagram and Facebook post, Mr Wong noted that Singapore is now in the first stage of its reopening following phase two (heightened alert) restrictions, and that further relaxation of the rules was due to take place next Monday, including allowing dine-ins at eateries.\"Unfortunately, we now have new cases breaking out and a major new cluster in Bukit Merah. Given these developments, we are evaluating the timing and scope of the next stage of reopening. The multi-ministry task force is studying the situation carefully with public health experts, and will provide further updates soon,\" said Mr Wong, who is co-chairman of the task force, in his post.He also noted that the situation in Bukit Merah is particularly worrying, as cases are breaking out not only in the market and the hawker centre, but also in the vicinity.\"Day by day, we are seeing (that) the number of unlinked cases - the cryptic cases in the community - is likely to be rising too,\" he noted.Mr Wong acknowledged that this is a difficult period for everyone in Singapore.\"I want to assure all of you that we are doing our very best to control the infection, and we want to ensure that we do not have another flare-up before we reach sufficiently high levels of vaccination in our community.\"Singapore had planned to ease restrictions in two stages, following a steady drop in the number of Covid-19 cases in the community.From Monday, people were able to gather in groups of up to five, an increase from two previously. Should the situation remain under control, further relaxation of the rules - including permitting dining in at food and beverage outlets - may take place a week later, on June 21.The closure of Bukit Merah View Market and Food Centre was extended to June 26 on Tuesday. On Wednesday, 14 more cases were linked to the cluster, taking the total number of linked cases to 39.The centre has been closed since Sunday and was originally meant to reopen on Wednesday.Dr Leong Hoe Nam, an infectious diseases specialist at Mount Elizabeth Novena Hospital, said the spread of Covid-19 in an open-air environment like the Bukit Merah hawker centre is alarming.\"What the US Centres for Disease Control and Prevention and we have been saying is that ventilation helps (reduce the spread of Covid-19). In terms of outdoor dining and preparation of food, it doesn't get better than a hawker centre - but yet we succumbed to many cases,\" he noted.This means that there could be risks if Singapore returns fully to dining in, including in air-conditioned settings, he said.Dr Leong believes dining in may have to be put on hold unless the country is prepared to take drastic, large-scale measures, such as requiring all residents to go through antigen testing once every few days, or setting up antigen testing and Covid-19 breathalyser systems at all malls and food centres.But Professor Paul Tambyah, president of the Asia-Pacific Society of Clinical Microbiology and Infection, believes that Singapore should continue with its reopening plans.\"The numbers remain low and the rationale for lockdowns has always been to protect the healthcare system. The healthcare system in Singapore is well protected and the high rate of vaccination has ensured that the number of ill patients remains relatively low despite the large number of elderly cleaners infected,\" he said.As at Monday, more than 2.7 million people, or close to half of the population, have received at least one dose of the Covid-19 vaccine, and almost two million people have received both doses.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/spore-evaluating-timing-scope-of-next-stage-of-reopening-amid-latest-outbreak-of-covid-19", "Source": "google"}