{"Type": "", "Time": "2021-06-18", "Headline": "Football: Dutch delight as Euro victory over Austria seals top spot in Group C, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.AMSTERDAM (REUTERS) - An early Memphis Depay penalty and a Denzel Dumfries goal gave the Netherlands a convincing 2-0 victory over Austria on Thursday (June 17) and a place in the Euro 2020 last 16 as Group C winners.The Dutch cannot be overtaken at the head of the standings after a second win while Austria's hopes rest on the result of their last match against Ukraine.The 11th-minute spot-kick provided an early platform for the home side and flying full back Dumfries proved a popular scorer at the Johan Cruyff Arena as he doubled the tally in the 67th minute with his second goal in as many matches.Dumfries had netted the dramatic late winner as the Dutch edged Ukraine 3-2 on Sunday but there was less of a frenetic feel this time as they coasted through the match.They were awarded the penalty after Dumfries was caught on the foot by Austrian captain David Alba on the corner of the penalty area. But it was only given after referee Orel Grinfeeld consulted the pitchside VAR monitor, with Depay dispatching spot-kick powerfully underneath the diving Daniel Bachman.Depay had two more first-half chances to add to his tally, hitting the side netting with snap effort after another Alaba mistake and conjuring up a horror miss five minutes before the break.Attack partner Wout Weghorst played a square ball in for the unmarked Depay at the back post, but he rushed the effort and skied his side-footed effort wide.The second goal came after Donyell Malen beat the offside trap and unselfishly played in the charging Dumfries, whose finish was enthusiastically celebrated by his team mates and the 16,000-strong crowd.\"It's starting to feel like a fairytale. We are really growing, it feels good,\" said Dumfries.\"We controlled the game and dominated all aspects and deserved the win.\"The visitors' first effort on goal came as late as the 84th minute but substitute Karim Onisiwo headed straight at home goalkeeper Maarten Stekelenburg. Without the suspended Marko Arnautovic, Austria lacked a cutting edge in attack that they will need against Ukraine on Monday.The Dutch host North Macedonia at the same time safe in the knowledge they have already secured a place in the last 16.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-dutch-delight-as-euro-victory-over-austria-seals-top-spot-in-group-c", "Source": "google"}