{"Type": "", "Time": "2021-06-18", "Headline": "Biden bristles at Fox News reporter’s question on China", "Text": "At a press conference following his meeting with Russian President Vladimir Putin in Geneva on Wednesday, President Biden disputed a journalist’s characterization of Chinese President Xi Jinping as an “old friend” who might be persuaded to allow an international investigation into the origins of the coronavirus pandemic.“Let’s get something straight — we know each other well, we’re not old friends,” Biden said. “It’s just pure business.”Biden had several sharp exchanges with journalists after he concluded his bilateral meeting with Putin, including an especially heated one with CNN’s Kaitlan Collins. Before boarding Air Force One on his way back to Washington, he approached a scrum of reporters and apologized for being a “wise guy.”The characterization of Biden and Xi as something other than adversaries came courtesy of Fox News reporter Peter Doocy, who has become a White House adversary in recent months. Doocy pressed Biden on whether his long-standing relationship with the Chinese leader could help as the United States and other nations try to find out how, as researchers believe, the pandemic originated in the Chinese city of Wuhan sometime in late 2019.“Is there going to become a time where you might call him, old friend to old friend, and ask him to open up China to the World Health Organization investigators who are trying to get to the bottom of COVID-19?” Doocy asked.Biden may dispute the terms of his relationship with Xi, but during the presidential campaign he frequently invoked having traveled 17,000 miles with him as vice president to Barack Obama. Xi was the Chinese vice president at the time.“That’s how I got to know him so well,” Biden said of their travels. But the extent of the travels was “misleading,” the Washington Post found earlier this year. Now that both men are presidents of their respective nations, they must figure out how to resolve the virus origin issue. Republicans have been especially adamant that Biden confront China more forcefully over the possibility that human activity was responsible for a pandemic that has sickened 177 million people worldwide.While scientific consensus has held that the virus began at a market, an alternate view is that it “escaped” from a laboratory where it was being studied.While Biden has allowed that China has not been forthcoming about how the coronavirus began, he has thus far failed to explain how he will confront the communist nation over the increasingly contentious issue of the pandemic’s origins.“China is trying very hard to project itself as a responsible and very, very forthcoming nation,” the president said Wednesday.Biden portrayed Beijing’s shipment of millions of doses of coronavirus vaccine as an effort by China to try to cast itself as a responsible global citizen. He predicted that those efforts would come to naught unless Chinese leaders allow a more thorough investigation into how the coronavirus began.“Certain things you don’t have to explain to the people of the world,” Biden said. “They see the results. Is China really, actually trying to get to the bottom of this?”Many scientists believe that the hypothesis that the coronavirus escaped from the Wuhan Institute of Virology needs to be taken as a serious possibility, and the theory has entered the mainstream, with Biden’s own approval. But evaluating what remains a highly speculative notion will be impossible without China’s cooperation.Republicans, meanwhile, are already calling for new sanctions on China, though there is only circumstantial evidence to suggest a lab accident was responsible, and even that evidence has been forcefully disputed.Investigators for the World Health Organization have been allowed only limited access to Wuhan, and their ensuing report — which endorsed the hypothesis that the coronavirus originated at a wildlife market there — was widely criticized.Biden recently asked the intelligence community to provide a detailed report on how the pandemic originated. Yahoo News reported last spring that the intelligence community was considering the possibility of a lab escape in the earliest stages of the pandemic.Without unfettered access to the Wuhan Institute of Virology — its facilities, records and staff — no investigation will be deemed complete; such access is fully dependent on China. Beijing has forcefully disputed any suggestion that its scientists were in any way responsible for the advent of the coronavirus.As the president’s comments on Wednesday made clear, that impasse will be difficult to resolve. Biden tried to move past it, saying he would “rally the world” in trying to stop the next pandemic. Epidemiologists believe that another will be on its way shortly.____Read more from Yahoo News:Exclusive: Saudi assassins picked up illicit drugs in Cairo to kill KhashoggiFrom Chicago to NYC, cities grapple with rise in shootings, murders: 'It's been a very bloody year'Marjorie Taylor Greene leads conspiracy-heavy attack on FauciRansomware attacks: How should the U.S. respond?Israeli jets launched air strikes on Gaza overnight Thursday to Friday after militants in the Palestinian territory again set off incendiary balloons into southern Israel, the army and AFP journalists said.Rafael Nadal and Naomi Osaka, with 24 Grand Slam titles between them, both withdrew from Wimbledon on Thursday with the Spanish star also pulling out of the Tokyo Olympics in a bid \"to prolong my career\".Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.The World Bank rejected a request from El Salvador for assistance in its bid to adopt bitcoin as a currency, a spokesperson for the Washington-based development lender said Thursday.A reporter with a pro-Beijing newspaper in Hong Kong accused of making a false statement when accessing a government car registry has been let off the hook after prosecutors agreed to drop the charge on condition of a binding-over order. The prosecution’s decision stood in marked contrast to the justice department’s handling of a case last year involving an RTHK contributor accused of the same act, prompting Principal Magistrate Ivy Chui Yee-mei to question the difference in approach at ThursdayBeijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityLastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.North Korean leader Kim Jong Un has said his country needs to prepare for \"both dialogue and confrontation\" with the United States under President Joe Biden, state media reported Friday.The PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saBrowsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.Guided by MIT faculty, gain practical knowledge to embrace blockchain as a business tool.Global stocks were mixed on Thursday as traders digested the Federal Reserve's move to bring forward its forecasts for hiking interest rates as the economy recovers.The first astronauts arrived at China's new space station on Thursday in the country's longest crewed mission to date, a landmark step in establishing Beijing as a major space power.Washington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HouseEvery PC user must read this in 2021 - Do it now.Hong Kong immigration officials will renew the visas of all of Cathay Pacific’s expatriate pilots, but its large contingent of foreign cabin crew will be denied extensions permitting them to remain based in the city, the airline has said. The decision leaves Cathay’s foreign cabin crew at risk of losing their jobs, with the airline saying it would offer the same voluntary redundancy package to affected staff that it offered to others in late April. In its memo on Thursday, Cathay expressed regreIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Former Taiwanese president Ma Ying-jeou has called on the government to listen to public opinion and allow civilian groups which have different political leanings to the ruling Democratic Progressive Party to import much-needed Covid-19 vaccines. Taiwan, which is battling a surge in cases, has struggled to secure vaccines although it has signed deals to buy 10 million doses from AstraZeneca, 5 million from Moderna and more than 4.7 million doses via the Covax Facility, which is supported by theNew research has identified TEN favorite stocks for the upcoming yearChina’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the buThe Kremlin was guarded about future dialogue with Washington on Thursday, a day after the first face-to-face meeting between Russian President Vladimir Putin and US counterpart Joe Biden.Chinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiMore than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Japan said on Thursday it will make a vaccine passport available from next month for Japanese travellers, as governments around the world experiment with ways to relaunch tourism and business trips.A US journalist detained in Myanmar since May appeared Thursday in a special court, his employers said, where he faces charges under a law that criminalises encouraging dissent against the military.Lim Chung Chun, may be the co-founder and CEO of homegrown wealth management firm iFAST Corporation, but he is still an investor at heart and a research analyst at his core. Learn more about his journey and his investment philosophy here.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/biden-bristles-at-fox-news-reporters-question-on-china-195507881.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}