{"Type": "", "Time": "2021-06-18", "Headline": "Editorial: The Supreme Court saved Obamacare for the third time. It should never have had to", "Text": "In rejecting yet another in a seemingly endless series of Republican attacks on the Affordable Care Act, a divided Supreme Court did more than just preserve a crucial protection for millions of Americans with preexisting health conditions that make them vulnerable to gouging or exclusion by insurers. It also preserved the notions that people have to be injured in order to sue and that Congress, not the courts, write the laws in this country.Writing for a 7-2 majority Thursday, Justice Stephen G. Breyer held that the two individuals and 18 Republican-controlled states behind the lawsuit  hadn't shown that a change Congress made in the Affordable Care Act in 2017 was responsible for the financial harm they claimed to have suffered. The court ordered the case dismissed.In so doing, the justices rejected the lawsuit's invitation to speculate about what Congress might have intended or what Congress would have done when lawmakers' actions were clear. Congress has voted over and over again not to repeal or even rework the 2010 healthcare law, so it's not the courts' place to refashion it as they see fit.At issue in California vs. Texas was the law's mandate that adults obtain health insurance, which is enforced by a tax penalty, not by civil or criminal fines. Opponents of the mandate challenged its constitutionality right after the law was passed, but a sharply divided Supreme Court held in 2012 that it was a lawful exercise of Congress' power to tax.Once Republicans took control of the House, the Senate and the White House in 2017, GOP lawmakers offered several bills to repeal or replace the healthcare law, but Congress rejected all of them. Instead, it eliminated the tax penalty for not obtaining insurance, leaving the law's many other provisions intact. Among those left standing are requirements that insurers in the individual market — where people not covered by an employer's health benefits shop for coverage — accept all applicants and charge all enrollees in a certain geographic area the same premiums regardless of their health, adjusting only for age and tobacco use, and that insurers offer comprehensive policies that don't exclude coverage for 10 fundamental categories of care.Those provisions guarantee that people with preexisting conditions are protected against discrimination in the individual market, just as they have been when covered by employers' group plans. Republican lawmakers have said repeatedly that they want to protect Americans with preexisting conditions, but the lawsuit brought by a group of GOP state attorneys general and two individuals put the lie to that assertion.The suit claimed that because Congress eliminated the penalty for failing to buy insurance, the individual mandate was no longer a tax and was therefore unconstitutional. And because the mandate is the centerpiece of the law's insurance reforms, the lawsuit claimed, the entire law had to be deep-sixed.But it was an exercise in sophistry that begged the federal courts to engage in the worst form of judicial activism: ruling that Congress intended to do something it patently did not, and then rewriting the law to match the judges' assumptions. And sadly, two lower courts fell for it in whole or in part, setting the stage for the justices to weigh in.The high court did what the lower courts should have done. It observed that neither the states nor the individuals had shown any harm, or prospect of harm, suffered as a consequence of Congress enacting what amounted to a tax cut. And with no harm, there can be no lawsuit.This should have been obvious from the get-go. No one can claim with a straight face to be injured by Congress' decision to reduce the penalty to zero. It's a tax with a 0% rate — what's not to like?It's equally stupefying that a judge would find, as U.S. District Judge Reed O'Connor of the Northern District of Texas did, that Congress killed the entire law when it neutered the mandate. For one thing, the mandate has nothing to do with the law's premium subsidies and its extension of Medicaid to more low-income Americans, among other major provisions. For another, Congress clearly did not intend to repeal the healthcare law — instead, it voted multiple times not to do so. And third, the marketplaces around the country have continued to function well without the tax penalty, proving that it's hardly an indispensable piece of the law's reforms.It is true, as Justice Clarence Thomas observed in a concurring opinion and Justice Samuel A. Alito Jr. in a dissent, that the mandate to buy insurance was initially seen as indispensable to a central part of the law: the new insurance marketplaces, with premium subsidies for low- and moderate-income consumers. Supporters argued the first time the high court took up the issue that the marketplaces could collapse without the mandate because younger, healthier people would gradually stop buying coverage, causing premiums to spiral upward. But what we've seen since 2017 is that the subsidies are the key to sustaining the marketplaces, not the mandate.The Affordable Care Act has grown in popularity in recent years, and it won over more doubters during the pandemic, when it provided a crucial safety net to hundreds of thousands of laid-off workers who lost their employer-sponsored coverage. In California alone, enrollment through the state's health marketplace surged by 200,000 above the previous year's pre-pandemic enrollment period.The relief suggested by the lower courts — tossing out the entire law or just the insurance reforms at its core — would have ripped that safety net to shreds. It also would have inflicted grave damage to the notion that Congress writes the laws.This story originally appeared in Los Angeles Times.The Supreme Court has dismissed a challenge to the Obama era health care law, preserving insurance coverage for millions of Americans.The ruling is the latest in the struggle over where protections for LGBT people end and firmly-held religious beliefs begin.Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.The justices' 7-2 ruling preserves medical insurance for millions of low-income Americans.The court's ruling was unanimous, but it was narrowly confined to the facts of this case and is therefore unlikely to have a nationwide impact.Ted Cruz is tweeting while Texas friesOur technology will match you with the best lenders at super low rates. Trusted by over 15 million. Save thousands each year. (1.97% APR)Missouri, federal and Kansas City offices will be closed Friday in observance of the new holiday.Many fans assumed Sophia Di Martino was playing Lady Loki but the Spanish credits at the end of episode two revealed her character to be someone else.“That was a typo that was corrected,\" said Republican Party of Florida Executive Director Helen Aguirre Ferré.Today's mortgage refi rates at 1.77% FIXED - No hidden points or fees! 1.97% APR. Cut your payment while rates are still low.(Bloomberg) -- Big batteries intended to save California from blackouts haven’t been added in time to stave off the threat of outages as the state struggles to meet power demand during this year’s first major heat wave.That leaves the Golden State again dependent on conservation pleas to ease demand for tight electricity supplies amid soaring temperatures, an approach that fell short during the hot weather that forced rolling outages in August.Now the most populous state and its $3.1 trillion ec\"We have an enormous amount of work in front of us,\" Sanders said Thursday. He's eyeing an expansion of Medicare.“If you can go to a restaurant in New York City, you can come in to the office,” James Gorman said.COPD patients experience symptoms that may warrant their doctor prescribing COPD oxygen therapy. Search for Inogen G4 Oxygen ConcentratorAccording to the Defense Department’s Office of Inspector General, the Taliban has increased its violence against Afghan citizens since the beginning of the year. Peace talks with the Afghan government have led to a U.S. vow to pull troops from the country by Sept. 11. While Afghanistan gets most of the attention in the region, we, at least, are proposing a “plan” to neutralize anti-West terror development there. We’ll support intelligence, counter narcotics aid and freezing funds and assets goiThe travel industry and travel enthusiasts may be anxiously waiting for the return to travel but Canada’s approach to border management has not been as adaptable and proactive as some experts would have liked to see, which should be fixed before border restrictions are significantly loosened.\n“Generally Canada has pretty much a wait-and-see approach,” Dr. Kelley Lee, professor at Simon Fraser University, Canada Research Chair in global health governance, leading the Pandemics and Borders Project, told Yahoo Canada.The former House Speaker will travel to South Carolina on Friday with U.S. Tim Scott, a popular GOP figure.Top Surgeon and Author of the Best Selling Book \"Dr. Gundry's Diet Evolution\" Discovers Link Between Gut Health and the Rising Number on the Scale.The first three episodes of the revival were released on Paramount+ on Wednesday, starring Miranda Cosgrove, Jerry Trainor, and Nathan Kress.Philadelphia 76ers veteran Dwight Howard recalls his own meniscus tear and he has a message for Joel Embiid.Republicans want to know why the first female Supreme Court justice isn’t on a list of famous women in US history.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.When you’re traveling, the first problem that you have every day is what to have for breakfast. If you’re staying in a nice hotel, the breakfast at the restaurant in the lobby can be tempting, but shockingly expensive. But when you have to search the surrounding area for a bite to eat, it can take …With Kawhi Leonard out indefinitely, it was time for Paul George to step up. He did and silenced 'Playoff P' doubters in the process.Another year and another mandatory minicamp tryout signed by the Chiefs.", "Section": "", "Writers": "", "URL": "https://news.yahoo.com/editorial-supreme-court-saved-obamacare-152924975.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}