{"Type": "", "Time": "2021-06-18", "Headline": "Spurs open talks with Gennaro Gattuso after Paulo Fonseca move breaks down | Tottenham Hotspur | The Guardian", "Text": "Last modified on Thu 17 Jun 2021 18.34 EDTTottenham have opened talks with Gennaro Gattuso after their move to appoint Paulo Fonseca broke down in the latest blow to their search for a manager.Fonseca, a former Roma and Shakhtar Donetsk manager, had been expected to sign after a contract was verbally agreed. Sources close to him said the deal collapsed because of issues relating to tax that became apparent to Fonseca in the past 48 hours. Italian law provided him with tax breaks that do not apply in the UK and he wanted his pay adjusted accordingly.Gattuso is available after leaving Fiorentina on Thursday, 22 days after his appointment was announced, and Spurs hope to conclude a deal swiftly to appoint the former Italy international. His previous jobs as a manager include spells at Napoli, from December 2019 until his sacking last month, and Milan.Tottenham’s hunt for permanent successor to José Mourinho has been fraught with problems. They called off talks with Antonio Conte after thinking they were close to a deal and interest in candidates including Hansi Flick and Mauricio Pochettino has come to nothing. Ajax’s Erik ten Hag, Leicester’s Brendan Rodgers and Julian Nagelsmann, who joined Bayern Munich, were also targets.Fonseca had been the choice of Tottenham’s new managing director of football, Fabio Paratici, and the pair met in Como to discuss next season. Fonseca had been lined up for effectively a job swap with Mourinho, who was sacked by Spurs in April and has taken the Roma post vacated by Fonseca this month.Gattuso’s swift departure from Fiorentina was over disagreements on transfer policy and the club said it was “by mutual agreement”. He won the Coppa Italia with Napoli in 2020 but has never finished in Serie A’s top four as a manager. Napoli were pipped by Juventus to a Champions League spot on the final day of last season.The combative former midfielder famously headbutted Tottenham’s then first-team coach Joe Jordan after playing for Milan in a Champions League tie at San Siro in February 2011. He apologised and was banned for four matches.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/football/2021/jun/17/tottenham-move-for-paulo-fonseca-breaks-down-in-latest-manager-blow", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}