{"Type": "", "Time": "2021-06-17", "Headline": "There's still no evidence of a Chinese lab leak. But here’s what's changed, scientists say.", "Text": "Alina Chan isn't saying the coronavirus definitely leaked from a lab in China. What she is saying is what more scientists have grown comfortable discussing publicly: There's no clear evidence either way.\"I know a lot of people want to have a smoking gun,\" said Chan, a postdoctoral associate at the Broad Institute of MIT and Harvard University who specializes in genetic engineering and has been vocal about the need to investigate the possibility of a lab leak. \"It's more like breadcrumbs everywhere, and they're not always leading in one direction. It's like the whole floor is covered in breadcrumbs.\"Chan was one of 18 scientists who published a letter in the journal Science last month calling for a more in-depth investigation into the virus's origin that takes into account theories about both natural occurrence and laboratory spillovers. The letter helped kick-start a new round of calls to investigate the \"lab leak hypothesis,\" including demands from President Joe Biden and several leading scientists.And while public discussion of a potential lab leak has shifted significantly in recent months, as more people pay attention to a theory that was originally promulgated by former President Donald Trump and his followers, the scientific evidence has remained unchanged, according to interviews with five virologists who have experience in microbiology, infectious disease ecology and viral evolution.The researchers offered near-uniform summations that few conclusions can be drawn based on the available scientific evidence, but they noted that the context and circumstances of the origin debate have changed, particularly as critics point out that China hasn't been fully transparent about the earliest days of the pandemic.The shift reflects how some scientists who previously avoided the topic or were quick to dismiss it are grappling with enduring uncertainties about the virus's origin, free from the politicization that clouded such discussions during the Trump administration.Chan said there had been trepidation among some scientists about publicly discussing the lab leak hypothesis for fear that their words could be misconstrued or used to support racist rhetoric about how the coronavirus emerged. Trump fueled accusations that the Wuhan Institute of Virology, a research lab in the city where the first Covid-19 cases were reported, was connected to the outbreak, and on numerous occasions he called the pathogen the \"Wuhan virus\" or \"kung flu.\"\"At the time, it was scarier to be associated with Trump and to become a tool for racists, so people didn't want to publicly call for an investigation into lab origins,\" she said.Now, more scientists are comfortable confronting the gamut of plausible theories — particularly given China's opacity about the topic — although many still caution that entertaining the idea of a lab leak requires clear scientific proof, which hasn't materialized.\"There has been no new evidence over the past 16 months that the virus had a lab origin,\" said Maciej Boni, an associate professor of biology at Penn State University, who specializes in tropical disease epidemiology and viral evolution.A number of theories about how the virus may have emerged have been thrown out. Most that remain fall under three possible scenarios:The virus evolved naturally before spilling over into humans from an infected animal.The virus evolved naturally, but an employee at the lab became infected from a sample and accidentally \"leaked\" it into the community.Scientists at the lab were manipulating virus samples and accidentally or intentionally released the pathogen.What makes the virus's origin a complicated matter is that the various threads can be difficult to reconcile. While most of the virologists who spoke to NBC News said the coronavirus probably evolved in nature, they agreed that it's reasonable to look into the possibility that it came from a lab.At the heart of those suspicions is the Wuhan Institute of Virology, a research facility founded in the 1950s that was the first in China to receive the highest level of biosafety clearance. The institute's lab has a biosafety level of 4 (known as BSL-4, the highest level), meaning it is equipped to study the world's highest-risk infectious agents and toxins, those that require the strictest biocontainment measures. It's that designation, and the lab's location in the city where the outbreak was first reported, that made the institute an early suspect.\"If we had a pandemic that was sourced near to a BSL-4 lab in the U.S., the first thing you would be asking is if they were working with that pathogen in that lab,\" said an expert on evolutionary genetics of infectious diseases, Andrew Read, a professor of biology at Penn State.Still, he cautioned that while a lab leak is plausible, that doesn't necessarily mean it's the most probable explanation.Boni said it's still more likely that the virus passed from an animal, such as a bat, into humans. He said his experiences conducting field epidemiology work on avian influenza in Vietnam from 2008 to 2016 showed how close contact with wildlife, such as in \"wet markets\" around the world where outdoor stalls sell meat, seafood and live animals for consumption, can create easy opportunities for pathogens to spill into human populations.\"Going back over the past 25 years of emerging viruses that have crossed species boundaries from animals to humans, the most common route is something like a wet market or farm or some other form of human and animal contact,\" he said. \"These are far more common than lab accidents.\"The first cluster of Covid-19 infections was traced to the Huanan Seafood Market in Wuhan, leading to early speculation that it may have been where the virus jumped from animals into humans. But Chinese researchers have since found that several of the earliest known cases of Covid-19 in the city were unrelated to the market, meaning the virus may already have been spreading in the community.A joint investigation this year by the World Health Organization and China focused on the possibility of a zoonotic, or animal, origin. The team's report, released in March, found that the virus probably emerged in bats and jumped to an intermediary animal before it spread to humans.The team also downplayed the theory that the virus leaked from the Wuhan institute, describing the scenario as \"extremely unlikely.\" But the WHO-led investigation was heavily criticized for not doing enough to review all plausible hypotheses. And the validity of the findings was questioned because the investigation hinged on China's cooperation, and the Chinese government didn't give researchers access to full records and raw data.Chan and 17 other scientists, including Ralph Baric, a virologist at the University of North Carolina, Chapel Hill; David Relman, a microbiologist at Stanford University; and Akiko Iwasaki, an immunologist at Yale University, signed the letter in Science in response to the shortcomings of the WHO report.Within the scientific community, the letter was seen as something of a turning point, lending credibility to the hypothesis that the virus may have escaped from the lab.\"I think it had a big effect,\" Chan said. \"I think It literally helped all the people who wanted to investigate this by saying: This is not bogus. Top scientists think this is plausible.\"Calls for a more in-depth investigation into both the natural origin theory and the lab leak hypothesis have been fueled, at least in part, by growing circumstantial evidence uncovered over the last year by a band of anonymous internet sleuths.Last year, a member of the amateur investigative team, which calls itself DRASTIC (short for Decentralized Radical Autonomous Search Team Investigating Covid-19), combed through online records and found a 2013 thesis by a postgraduate student at Kunming Medical University in China that described six workers at a mine in Yunnan province who fell ill with severe pneumonia caused by a \"SARS-like\" coronavirus.Three of the mine workers eventually died, but not much else is known about the situation. In research published in November by scientists at the Wuhan institute, serum samples from four of the mine workers were tested and showed no trace of SARS-CoV-2, the virus that causes Covid-19.Separately, a U.S. intelligence report disclosed that three researchers at the Wuhan institute sought treatment at a hospital after they fell ill in November 2019, as The Wall Street Journal first reported in May.During the WHO-led investigation this year, officials at the Wuhan institute said all staff members had tested negative for Covid-19 antibodies. Its leaders have been adamant that the virus didn't escape from the facility, but the Chinese government's reluctance to share records and test results has cast suspicion over what the lab's scientists knew — and when.Although they are far from conclusive, the intelligence report and the mine workers' mysterious illnesses have been presented as circumstantial evidence that scientists at the Wuhan institute were studying risky coronaviruses similar to SARS-CoV-2 and that the virus may have escaped from the lab, perhaps after an employee became infected.The mine incident also drew attention to a separate SARS-like virus that Chinese researchers collected from a bat in Yunnan province in 2013. Shi Zhengli, a prominent bat researcher who directs the Center for Emerging Infectious Diseases at the Wuhan Institute of Virology, co-wrote a paper published in February 2020 detailing the virus, known as RaTG13.The genomes of RaTG13 and SARS-CoV-2 were found to be 96.2 percent alike, prompting some to wonder whether the pandemic had been caused by lab experiments on RaTG13 that had gone awry. The similarities between the two viruses also raised questions about the possibility that Chinese researchers were conducting \"gain of function\" experiments, which involve manipulating viruses in a lab to make them more dangerous or more transmissible to understand their inner workings.Gain-of-function research isn't altogether uncommon in virology, but such experiments are controversial because of the risks. A scientist could, for example, unwittingly or by design create a pathogen that is better adapted to invade human cells or cause more severe infections. But there are real benefits to gain-of-function research, said Robert Garry, a virologist at Tulane University in New Orleans. For one, understanding the characteristics of a virus and its transmissibility is critical to developing vaccines and lifesaving drugs, he said.He said most virologists take the responsibility of such experiments seriously.\"It's not the Wild West,\" he said. \"It's very highly regulated.\"In 2014, the U.S. National Institutes of Health imposed a moratorium on gain-of-function research after two lab accidents involving anthrax and a strain of H5N1 bird flu occurred at the Centers for Disease Control and Prevention. Funding for gain-of-function experiments was paused for three years while the government conducted safety assessments. The ban was reversed in January 2017, during the Trump administration, after an independent science advisory panel found that the overall risk to public safety was low.While it's possible that scientists at the Wuhan institute were making genetic tweaks to samples, a coronavirus like RaTG13 that is 96.2 percent similar still can't easily be altered to create SARS-CoV-2, Garry said.\"Taking a virus that is 96 percent similar and sequencing and converting it to SARS-CoV-2 is impossible,\" he said. \"That kind of evolution takes maybe three to five decades in nature. You just can't force that in a lab.\"Dr. Charles Chiu, a virologist at the University of California, San Francisco, added that the differences between RaTG13 and SARS-CoV-2 exceed the capabilities of genetic engineering.\"The differences are scattered throughout the genome,\" he said. \"There's a big difference between 96 percent similar and 100 percent identical. We just don't have the ability to make those kinds of changes.\"In other words, the experts say, it's unlikely that scientists could snip and splice bits of a virus or tweak a pathogen's genome in such a way that would create SARS-CoV-2, even if researchers were using closely related coronaviruses.\"We're very good at imitating nature — we have, for instance, been able to synthesize polio virus — but our ability to manipulate or change the sequence of viruses is still limited,\" Chiu said.Chan, of the Broad Institute, wasn't ready to rule out the possibility of genetic engineering, saying that if minor tweaks were being made to virus samples, it could be difficult to detect the fingerprints of such work.\"You can do recombination without leaving a trace,\" she said. \"Basically, it's like you can 3D-print clothing with no seams, so it's difficult to tell if anything has been manipulated or stitched together in a lab.\"Chan acknowledged that it's \"definitely possible\" that the virus evolved in nature but added that all options should be kept on the table because neither the natural origins theory nor the lab leak hypothesis can be ruled out.\"All the evidence right now is circumstantial, and it's consistent with both lab and natural origins,\" she said. \"There's precedents for lab leaks, the genetic data could swing either way, and the epidemiological data, which is how it unfolded in Wuhan, can also swing either way. None of this is pointing in any one direction.\"And it may be years, or even decades, before scientists have any clarity on the topic. The Ebola virus, which was discovered in 1976, is thought to have spread to humans from bats or nonhuman primates, but scientists still haven't identified the origin from a specific animal host.\"The key issue here is that we simply don't have the information to make really firm conclusions,\" said Chiu, of the University of California, San Francisco, referring to Covid-19. \"Unless we know exactly what happened, we're simply making guesses.\"Prosecutors urged a judge Wednesday to impose a “very substantial” prison sentence on Michael Avenatti for trying to extort millions of dollars from Nike.  Prosecutors noted in a Manhattan federal court submission that Probation Office officials recommend an eight-year prison term for the California attorney who gained fame three years ago through his representation of porn star Stormy Daniels against then-President Donald Trump.  The government said Avenatti, representing the director of a youth basketball program in Los Angeles, tried to force the apparel maker to pay him up to $25 million to keep him quiet about allegations of corruption involving Nike and college athletics.PEOPLE WHO START TO EXERCISE BEFORE OR DURING MIDDLE AGE TYPICALLY SAVE FROM $824 TO $1,874 ANNUALLY ON HEALTH CARE COSTS AFTER RETIREMENT. Becoming more physically active today might help us avoid thousands of dollars in health care costs later, according to a new study of exercise and Medicare claims. It finds that people who start to exercise before or during middle age typically save anywhere from $824 to $1,874 annually on health care costs after retirement, and the earlier they start theirHave you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.A St. Paul man accused of speeding up and driving into a group of protesters in Minneapolis while he was drunk, killing one person, was charged Wednesday with intentional second-degree murder.  Prosecutors say Nicholas Kraus, 35, was visibly intoxicated Sunday night when he sped up and tried to “jump” a car that was being used as a barricade by protesters in the city’s Uptown neighborhood.  Thirty-one-year-old Deona Knajdek,  also known as Deona Erickson, was killed.More than 60% of Americans know “nothing at all” or only “a little bit” about Juneteenth, the holiday celebrating the end of slavery in the United States, according to a new Gallup survey. The 37% of respondents who reported having “a lot” or “some” knowledge of the holiday may be an increase from previous years, pollsters and academics believe, reflecting growing awareness after last summer’s protests against racism and police brutality. The survey, the results of which were released on TuesdayFor Cimino, criticism has come from all sides, including from those who do not approve of him playing gay — and long-running and complex issue within the LGBTQ community.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Best Buy shoppers say these buds rival AirPods — for a whole lot less.Russian President Vladimir Putin lavished praise on his U.S. counterpart Joe Biden on Thursday, a day after the two leaders held a summit, saying Biden was incorrectly portrayed in the Russian and U.S. media as being unfocused and vague.  Biden and Putin agreed to launch arms control and cyber-security talks at a Geneva summit on Wednesday, recording small gains and big differences at a meeting which they both described as pragmatic rather than friendly.  Speaking to university graduates by video link later on Thursday, Putin, 68, had only warm words for Biden, 78, in contrast to Russian state media which has sometimes portrayed the U.S. president as struggling to do his job both physically and mentally.When President Joe Biden took office in January, there was an expectation that changes to policies on the southern border would help reverse the crisis there.  In addition, hopes of reuniting families of children separated by Trump's controversial separation policy have also been slow-going and the issue of immigration generally has been a source of contention for the new administration.  Illustrating the turmoil is a dramatic surge in unauthorized U.S. southern border crossings.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Rafa tweeted that he needs more time to recuperate than the two weeks between the French Open and Wimbledon.The Supreme Court on Thursday  unanimously sided with a Catholic foster care agenc y that says its religious views prevent it from working with same-sex couples as foster parents.  The justices said the city of Philadelphia wrongly limited its relationship with the group as a result of the agency's policy.  Philadelphia violated the Constitution in limiting its work with the agency, Catholic Social Services, the court said.Eriksen is having a device implanted in his chest that can send an electrical shock to restart his heart.Cut your monthly payment while rates are low. Free Quotes. Wont affect your credit. Calculate New Payment. (1.97% APR)Experts say it’s possible for a relationship to work after a breakup — but the odds aren’t great.The South Carolina Supreme Court on Wednesday blocked the planned executions of two inmates by electrocution, saying they cannot be put to death until they truly have the choice of a firing squad option set out in the state's newly revised capital punishment law.  The high court halted this month's scheduled executions of Brad Sigmon and Freddie Owens, writing that corrections officials need to put together a firing squad so that inmates can really choose between that or the electric chair.  The executions were scheduled less than a month after the passage of a new law compelling the condemned to choose between electrocution or a firing squad if lethal injection drugs aren’t available.The Biden administration Thursday unveiled a new mapping tool that shows much greater gaps in use of high-speed internet service across the U.S. than the government's previous maps reported.Why it matters: The White House is pushing for big spending to provide more, better broadband service to underserved areas after the pandemic made Americans more dependent than ever on their internet connections. Stay on top of the latest market trends and economic insights with Axios Markets. Subscribe for fToday's mortgage refi rates at 1.77% FIXED - No hidden points or fees! 1.97% APR. Cut your payment while rates are still low.The Justice Department is warning Missouri officials that the state can’t ignore federal law, after the governor signed a bill last week that bans police from enforcing federal gun rules.  In a letter sent Wednesday night and obtained by The Associated Press, Justice officials said the U.S. Constitution's Supremacy Clause outweighs the measure that Gov. Mike Parson signed into law Saturday.  The new rules penalize local police departments if their officers enforce federal gun laws.A group of researchers have found a new species of giant rhino from fossils dating back to 26.5 million years in China.White people regularly appropriate African-American Vernacular English (AAVE) like \"slay,\" \"spill the tea\" and \"sis\" without thinking.Top Surgeon and Author of the Best Selling Book \"Dr. Gundry's Diet Evolution\" Discovers Link Between Gut Health and the Rising Number on the Scale.China is building a new space station, expected to be complete by the end of 2022, and just sent three astronauts to one part of it.The Bachelor star Matt James advises former host Chris Harrison to 'buy bitcoin'.(Bloomberg) -- A plethora of websites operated by financial institutions, governments and airlines including Hong Kong Exchanges & Clearing Ltd. and Australia’s central bank went down briefly Thursday in the second global internet outage in as many weeks.Some of the outages, including those that affected Commonwealth Bank of Australia, Westpac Banking Corp. and Australia & New Zealand Banking Group Ltd., were linked to a failure at Akamai Technologies Inc., which helps clients manage web service", "Section": "", "Writers": "", "URL": "https://www.yahoo.com/news/science-around-lab-leak-theory-204525152.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}