{"Type": "Business", "Time": "2021-06-17", "Headline": "US won't back global tax plan with carve-outs for China: Yellen", "Text": "WASHINGTON: The United States will not agree to any type of special treatment for China or other countries that would weaken a global minimum tax regime, US Treasury Secretary Janet Yellen said on Wednesday (Jun 16).Yellen said the United States and other countries were continuing their efforts to convince China to support plans endorsed on Sunday by the Group of Seven advanced economies.She said she was hopeful Beijing would decide it was in its interest to support the plans - which calls for a global corporate minimum tax of at least 15 per cent - but made clear that Washington would not endorse a weak agreement.\"We would not agree to any type of carve-out that would meaningfully weaken a robust global minimum tax regime. Not for China, not for other countries,\" Yellen told the Senate Finance Committee at a hearing.\"We want this to work and not be filled with loopholes.\"G7 finance officials on Jun 5 agreed to support a minimum corporate tax rate of at least 15 per cent, a move endorsed by G7 leaders on Sunday.But some countries, including China, are reluctant to give up tax incentives to advance policy priorities ranging from boosting research and development to attracting foreign investment, including special economic zones with low taxation to attract foreign investment.One official briefed on the G7 talks told Reuters that China was against the 15 per cent agreed by the G7 and winning carve-outs would be its condition for getting behind the rate.Finance officials from the Group of 20 major economies - which include China - will focus on the US global minimum tax proposal when they meet in Venice in July.Yellen told senators that the United States was pursuing every avenue to ensure that countries suspended or rolled back digital services taxes that Washington says discriminates against US technology companies, but would keep tariffs as an option if that does not happen.She said she had engaged in \"very constructive\" bilateral conversations with the Irish finance minister on the issue, and believed the entire European Union would ultimately support an increase in global minimum taxes.She said she was hoping for progress on the tax issue, which is being negotiated under the leadership of the Organization for Economic Cooperation and Development, by the time the leaders of the Group of 20 major economies meet in October.Yellen said US moves to raise its corporate minimum tax would help provide momentum for a broad-based agreement. She said the United States was also proposing changes to prevent foreign companies working in the United States from shifting their profits offshore.Asked about rising consumer and durable goods prices, Yellen said the Biden administration was monitoring inflation \"very carefully\" and took the issue seriously.\"No one wants to return to the bad high inflation days of the 70s,\" Yellen told the committee.She said the current burst of inflation reflected the difficulty of reopening the US economy, and the Biden administration was also taking steps to deal with bottlenecks in certain supply chains that had resulted in higher prices.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "business and finance,US,United States,China,tax,Janet Yellen", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/business/us-won-t-back-global-tax-plan-with-carve-outs-for-china---yellen-15028326", "Source": "google"}