{"Type": "", "Time": "2021-06-18", "Headline": "Opinion: Gennaro Gattuso - I have never been more ashamed of Spurs - Spurs Web - Tottenham Hotspur Football News", "Text": "We have been taken on a managerial merry-go-round this summer – except no one asked to get on, we are all feeling sick and Daniel Levy is still pushing.It feels as if we have gone through a who’s who catalogue of big names in the world of football, only to land at the feet of Paulo Fonseca. An underwhelming appointment, but one many of us were warming to the more we researched him.Hey, is he prime Pep Guardiola? No. But he plays attacking football, presses high and gets bums off seats. Not a bad prospect for a couple of years after the past 18 months of Mourinho football.Yet somehow, once again, talks have apparently fallen through. God knows how talks with a small name manager out of contract and on a free can fall through, but there we go. Apparently, according to some reports, it was because Spurs had their head turned.Who turned out head? Poch? Conte maybe? Ten Hag? … Gennaro Gattuso. Yes, the guy who tried to strangle Joe Jordan back in the Harry Redknapp years.Not only does Gattuso have a track record of being a bit of a hot-headed thug, a less than useful trait in a manager, but he also happens to be a rather disgusting individual.Case 1 – In December 2013, Gattuso claimed that he didn’t see a place in football for women when AC Milan chief executive Adriano Galliani agreed to share his role with Barbara Berlusconi (BBC).What are our female fans meant to think of that? What are Tottenham Hotspur’s women’s team meant to think of that? What are Rebecca Caplehorn and other senior board members meant to think of that? Spurs cannot actively back this man!Case 2 – Also in 2013, Gattuso hinted that white players getting booed was no worse than racist chanting. When former teammate Kevin Prince Boateng walked off the pitch due to racist chanting, Gattuso dismissed it and claimed that ‘there are no racists there’ (Metro).What are our black players meant to think of that? What are our minority fans meant to think? Spurs cannot actively back a man who dismissedd racism.Case 3 – Across his career, Gattuso has proven to act first and think later when it comes to lashing out. In 2003, he was sent off for slapping Ibrahimovic. In 2011, he was sent off for strangling and head-butting Joe Jordan. He also had slapping incidents with David Beckham and Marcello Lippi.Even beyond his failures as a decent person, Gattuso also has a shocking managerial record. The stats going around on Twitter today are: Sion – Sacked after 3 months. Palermo- Sacked after 3 months. OFI Crete – Resigned twice. Pisa – Resigned twice. AC Milan – left with Mutual Consent after 1.5 years. Napoli – Sacked after 1.5 years. Fiorentina – Resigned after 22 days.I had resigned myself to an underwhelming new manager after our failed attempts to re-sign Pochettino and lure in Antonio Conte. However, this appointment goes far beyond that. It alienates huge sections of the Spurs fan base and leaves the rest of us embarrassed to be associated with the club.Daniel Levy told us that Spurs had lost sight of their DNA. He promised us that the next coach would reflect the true Tottenham way. This is not our DNA.Enough is enough. No to Gennaro Gattuso.Have something to tell us about this article?When will you open your eyes to enic and levy. They care only for things that are important to them but will say anything. Levy is a snake who hides behind the stadium and the training facilities but don’t mention the team or trophies. This man has failed on so many times for spurs from the cost of the stadium to a long long long list of players who were wrong for spurs but were bought by levy because they fitted his purse. He gets richer while the club continues to fail.Save my name, email, and website in this browser for the next time I comment. \n\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.Suite 8 Homes House, 253 Cowbridge Road West, Cardiff, Wales, CF5 5TDCompany number: 13367321", "Section": "", "Writers": "", "URL": "https://www.spurs-web.com/spurs-news/opinion-gennaro-gattuso-i-have-never-been-more-ashamed-of-spurs/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}