{"Type": "", "Time": "2021-06-17", "Headline": "Toa Payoh shock: Man who rescued electrocuted son feared the worst when he saw motionless body", "Text": "Nadine ChuaThe New PaperJun 16, 2021It was his day off and he was resting at home, nursing a fever after getting his second Covid-19 vaccine dose a day earlier.Mr Muhammad Nazlan was watching TV with his wife on Sunday night while their three children were out at the playground, located about 50m in front of his Housing Board unit.Suddenly, his daughter, 10, burst into their first-storey flat, screaming and crying.Mr Muhammad, 34, a pest control technician, told The New Paper yesterday: \"I could not hear what exactly she was saying. All I knew was something bad had happened to my son.\"I rushed out with my wife and saw my son lying on the ground, his arm stuck to a lamp post. My son was unconscious but his eyes were still open, and I thought he was gone.\"His eldest son, 14-year-old Muhammad Rifqy, was playing football with a friend when both teenagers got an electric shock from a lamp post near the fitness corner at Block 63 Lorong 5 Toa Payoh.The Singapore Civil Defence Force (SCDF) said it received a call for assistance at 8.25pm and two people were taken to KK Women's and Children's Hospital.Mr Muhammad said his son was initially in the intensive care unit but was moved to a regular ward on Monday afternoon. He said Rifqy's friend had been discharged.While his son is conscious, Mr Muhammad's friend, Mr Khairul Anuar, 36, said Rifqy is \"not his old self\" yet.\"I have been talking to him through video calls. He is traumatised and his speech is slurred. Sometimes he talks using one word at a time. But at least he is slowly recovering,\" said Mr Khairul, a GrabFood rider.It could have been much worse, if not for Mr Muhammad's prompt action.Rifqy had lost consciousness from an electric shock after he went to retrieve a ball that had rolled towards the lamp post.\"When I saw him lying there, I quickly tried to pull him away from the lamp post but his arm was stuck to it,\" said Mr Muhammad, who is asthmatic.\"That part of his arm looked like it was burned. My heart felt like something sharp poked it, and I became breathless. I also felt another two shocks, one in my hand and one in my leg, as I used my hand to pull him away.\"All I could think of was: If he dies, I also die with him.\"Mr Muhammad said his son seemed as if he had tensed up, and he felt helpless.\"I felt like a useless father because I wanted to give him CPR (cardiopulmonary resuscitation) but people around me were reminding me not to touch him,\" he said.The SCDF arrived moments later to tend to his son and the friend.Mr Muhammad said his son told him the two had got to know each other three days prior to their Sunday meeting, and the boy received a jolt when he touched Rifqy.When TNP visited the scene yesterday afternoon, workers were completing the installation of four new lamp posts.Mr Muhammad, whose youngest is a five-year-old boy, said staff from Bishan-Toa Payoh Town Council (BTPTC), which manages the estate, had contacted him and offered assistance.TOWN COUNCIL STATEMENTIn a statement last night, the town council said it had completed checks to establish the probable cause of the electric shock.\"The BTPTC licensed electrical worker (LEW) noticed a small tear to the insulation of the live wire inside the lamp post. This would not be visible unless we remove the junction box.\"From the finding, the LEW assessed that the exposed part of the wire touching the metal part of the lamp post could be the cause of the electric shock,\" said the town council.\"The LEW has also checked other lamp posts within the same circuitry and found no similar situation. The incident could be an isolated case as there was also no previous similar incident of such nature.\"The BTPTC added that works to rectify the issue were completed yesterday and it will \"continue to ensure the safety of (the) electrical installations (it manages)\".\"I have lived in this flat for 13 years. My children have been playing at the playground since they were babies. But now, even with new lamp posts installed, I am not sure if it is safe to let my kids play outside any more,\" said Mr Muhammad.\"All I can think of is if my son will recover fully. I am worried because this is not just a fall or a fracture. I don't know how he will be affected by this in the long run.\"Get The New Paper for more stories.Get more of Stomp's latest updates by following us on Facebook, WhatsApp, Twitter, Instagram and YouTube.View the discussion thread.View the discussion thread.Download the new STOMP app today.SPH Digital News | The Straits TimesAll rights reserved | Terms & Conditions | Data Protection Policy | Advertise with usSPH Digital News / STOMP / Copyright (c) 2019 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E.", "Section": "", "Writers": "", "URL": "https://stomp.straitstimes.com/singapore-seen/toa-payoh-shock-man-who-rescued-electrocuted-son-feared-the-worst-when-he-saw", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}