{"Type": "", "Time": "2021-06-17", "Headline": "China disease expert says Covid-19 origins probe should shift to US, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SHANGHAI (REUTERS) - A senior Chinese expert said the United States should be the priority in the next phase of investigations into the origin of Covid-19 after a study showed that the disease could have been circulating there as early as December 2019, state media said on Thursday (June 17).The study, published this week by the US National Institutes for Health (NIH), showed that at least seven people in five different US states were infected with Sars-CoV-2, the virus that causes Covid-19, weeks before the first official cases were reported.Dr Zeng Guang, chief epidemiologist with the Chinese Centre for Disease Control and Prevention, told state-owned tabloid Global Times that attention should now shift to the United States, which was slow to test people in the early stages of the outbreak, and is also the home of many biological laboratories.\"All bioweapons-related subjects that the country has should be subject to scrutiny,\" he was quoted as saying.Commenting on the study on Wednesday, foreign ministry spokesman Zhao Lijian said it was now \"obvious\" that the Covid-19 outbreak had \"multiple origins\" and that other countries should cooperate with the World Health Organisation (WHO).The origin of the pandemic has become a source of political tension between China and the United States, with much of the focus on the Wuhan Institute of Virology, located in the city where the outbreak was first identified in late 2019.A report by a US government national laboratory concluded that it was plausible that the virus had leaked from the Wuhan lab, The Wall Street Journal reported earlier this month.A previous study has raised the possibility that Sars-CoV-2 could have been circulating in Europe as early as September, but experts said this did not necessarily mean it did not originate in China, where many Sars-like coronaviruses have been found in the wild.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/china-disease-expert-says-covid-19-origins-probe-should-shift-to-us", "Source": "google"}