{"Type": "", "Time": "2021-06-17", "Headline": "People's Association withdraws offer to meet couple, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.The People's Association (PA) has withdrawn its offer to meet a Malay/Muslim couple whose photo was used as a standee for Hari Raya decorations without permission, citing disagreements with them over the purpose of the meeting and how they had characterised the incident.Communications specialist Sarah Bagharib, 30, had posted on social media on May 28 about the inappropriate use of her wedding photograph at an HDB estate in Radin Mas constituency.This drew a public apology from the PA and an offer from the government agency to meet her and her husband, Mr Razif Abdullah, to apologise in person for the distress caused by its mistakes.But in a Facebook post yesterday, the PA, which oversees various grassroots groups, said it saw no point in going ahead with the meeting, citing Ms Sarah's recent comments on the matter.It said Ms Sarah had shared claims that the incident \"perpetuate(s) the racist culture\" and was \"racist\". The agency rejected these claims, saying: \"While the error was culturally insensitive, it was certainly not racist. It is not right to raise the allegation of racism, without basis, to stoke emotions and sentiments.\"It also noted that she had made a public call for messages and suggestions ahead of the meeting. \"We find this odd. We do not see why our meeting should be appropriated as a platform for her to funnel the views and comments of persons unrelated to the incident,\" the PA added. \"All these lead us to believe her purpose in agreeing to meet with us has gone far beyond the Radin Mas incident. We therefore see no point in proceeding with the meeting.\"The couple's wedding photo had been downloaded online and used by vendor Warabi Enterprise (Art Studio) for a standee alongside a decorative platform and banner of Radin Mas MP Melvin Yong and his Hari Raya greetings to residents. After Ms Sarah drew attention to the matter, the PA removed the standee, and offered to meet the couple.Yesterday, the PA said it had wanted to clarify its position, elaborate on the steps it had taken to prevent such incidents recurring, and hear her suggestions of how it might improve, at the meeting. It had, over e-mail, explained to Ms Sarah that it values racial and religious harmony in Singapore.Ms Sarah's claims that the PA referred to were in two Instagram Stories she posted recently. In the first, she reshared an Instagram Story by @jeanpsychologist who thanked Ms Sarah for posting about the incident and called for Chinese Singaporeans to \"educate ourselves on our conditioned racism\", saying this is \"long overdue towards our friends in minority communities who have to put up with our ignorance - which continues to perpetuate the racist culture that hurts them\".In the second, she said she was thankful to those who stood in solidarity with her and her husband as well as other ethnic minorities after \"this incident (and other racist attacks and incidents)\".The PA also claimed Ms Sarah had insinuated in an online talk show hosted by Nanyang Technological University academic Walid Jumblatt Abdullah on June 7 that PA's staff and volunteers did not find anything wrong with the standee as they might be \"blind to racism\".Assistant Professor Walid had asked whether she would accept an invitation from Mr Yong to meet, if he made such an offer. Ms Sarah replied she would, wondered if the MP had seen the standee, and added that \"something is definitely wrong\" if he had seen the standee and did not say anything about it.She also referred to someone's comment on internalised racism, and spoke on how some people are blind to racism, or feel there is nothing wrong with racism as it does not impact them.In its post, the PA stressed it remains steadfast in its mission to promote racial harmony, and that its grassroots organisations Mesra and Narpani Pearavai play a key role in representing the interests of the Malay and Indian communities. It also said that what happened at Radin Mas was an isolated incident, but nevertheless shows that it can fall short.\"We are now looking at establishing a resource panel to guide and advise our staff on cultural matters,\" it said. \"We will also step up training efforts to enhance staff and volunteers' understanding and appreciation of our different cultures. Singaporeans becoming 'one people' is a work in progress - and so is the PA.\"The PA added Ms Sarah's allegation in her June 1 e-mail, that it was \"hasty in sharing the name of the vendor\" to \"distance and deflect blame\" from itself, was untrue.It said the vendor had identified himself directly to Ms Sarah on May 28 and apologised, before the PA statement on May 29.The Straits Times has reached out to Ms Sarah for comment.\"Enhancing our understanding of Singapore's various races, religions and cultures is a ceaseless effort - this lapse having been a good reminder of this,\" the PA said. \"We hope that this incident will not tar the other good work which our staff and volunteers have done.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/peoples-association-withdraws-offer-to-meet-couple", "Source": "google"}