{"Type": "", "Time": "2021-06-17", "Headline": "MTI's chief information officer faces drink driving charge, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The chief information officer at the Ministry of Trade and Industry (MTI) appeared in a district court on Thursday (June 17) on a drink driving charge.Bernard Donald Miranda is also the director of the corporate operations division at the ministry.The 59-year-old Singaporean allegedly had not less than 43mcg of alcohol in 100ml of breath while driving along Sembawang Road at around 9pm on March 18.The prescribed limit is 35mcg of alcohol in 100ml of breath.His bail was set at $10,000 and the case has been adjourned to July 15.The Straits Times had earlier reported that before joining MTI, Miranda was a rear-admiral with the Republic of Singapore Navy (RSN).He later became an adjunct senior fellow with the Maritime Security Programme at the S. Rajaratnam School of International Studies.The school's website said: \"He was the Commander Task Group for three missions to the North Arabian Gulf in support of the reconstruction of Iraq; Mission Commander of the Republic of Singapore Navy's first deployment to the anti-piracy mission in the Gulf of Aden; and RSN's first Commander CTF 151, the combined force dealing with Somalia piracy in the Gulf of Aden.\"Responding to queries from ST on Thursday, the MTI said: \"As court proceedings are ongoing, we are unable to comment on the case.\"For drink driving, a first-time offender can be jailed for up to a year and fined up to $10,000. A repeat offender can be jailed for up to two years and fined up to $20,000.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/mtis-chief-information-officer-faces-drink-driving-charge", "Source": "google"}