{"Type": "", "Time": "2021-06-18", "Headline": "Covid-19 clusters in S'pore's north-east swiftly brought under control with testing, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - When the authorities noticed that nine confirmed Covid-19 cases from four different households lived in the same HDB block, they swung into action to set up mandatory testing for all residents and visitors there.The nine cases involving residents of Block 506 Hougang Avenue 8 had not been linked to one another at the time, but the Ministry of Health (MOH) said on May 23 it was \"not taking any chances\".A week later, on May 30, an unrelated cluster emerged at the NTUC Foodfare outlet in Anchorvale, just a few kilometres away.A few days after that, on June 2, another cluster emerged at the MINDSville @ Napiri Adult Disability Home, a mere 20-minute walk from Block 506.Meanwhile, MOH gave regular updates on the progress of mandatory - and later voluntary - testing efforts in the Hougang vicinity. The last voluntary testing operation wrapped up on Thursday (June 17).The emergence of three noteworthy clusters in close proximity over a short period, along with the intensity of the testing operations that followed, may have given rise to the impression that the north-east region of Singapore was becoming a Covid-19 hot spot early this month.Infectious diseases expert Leong Hoe Nam from the Rophi Clinic at Mount Elizabeth Novena said the fact that a cluster had formed among different households within the same HDB block made many take notice, as most transmissions are usually among members of the same household.\"There was some transmission between households because the cases turned out to be linked, but it was limited. That means there was some transient, limited cross-infection somewhere. If there were more cases, across many households, we would be worried, but thankfully it didn't happen.\"Another source of concern could have been the fact that three of the first nine cases who lived in Block 506 were linked to the Changi Airport cluster, which was itself a significant cause for concern when it first emerged last month and remains as Singapore's largest active cluster.The three cases have not been linked to the Block 506 cluster.Dr Leong said there could have been an as yet undiscovered one-time super spreader event that caused many people in the north-east to get infected around the same time.But the clusters in the north-east were quickly brought under control. And out of the thousands screened during mandatory and voluntary testing operations for the area, only three eventually tested positive.The Block 506 cluster now has 13 cases, with no new cases having been linked to it since June 1.The NTUC Foodfare cluster also has 13, with the latest case added on June 8, while the MINDSville cluster has 33 and has not seen a new case since June 7.Dr Leong said it is likely there would be even more unlinked cases in the north-east now if the testing had not been done.He added that the clusters in Hougang were not major, especially compared with the quickly growing cluster at 115 Bukit Merah View Market and Food Centre.\"The chief reason is there's a lot more mingling at food centres compared with HDB blocks,\" Dr Leong said.The current active clusters in Singapore are spread across the island, with no discernible pattern of high rates of infection in any particular geographic region.The three largest open clusters as at last night were the Changi Airport cluster in the east with 108 cases, the Jem and Westgate cluster in the west with 63 cases, and the Bukit Merah View market and food centre cluster in the south with 56 cases.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/clusters-in-north-east-swiftly-brought-under-control-with-testing", "Source": "google"}