{"Type": "", "Time": "2021-06-17", "Headline": "More Singapore residents identifying as having no religion", "Text": "SINGAPORE — While Singapore continues to be religiously diverse, more residents are identifying as having no religion, said the Department of Statistics (DOS) in a report released on Wednesday (16 June).Among Singapore citizens and permanent residents aged 15 and above in 2020, those with no religious affiliation made up 20 per cent, an increase from 17 per cent in 2010, said the DOS in the first statistical publication on its Census 2020 findings. Within the ethnic groups, 25.7 per cent of Chinese identified as having no religion, while 0.4 per cent of Malays and 2.2 per cent of Indians said the same in 2020. Meanwhile, 14.6 per cent of those from other ethnic groups said they had no religion.Among the resident population aged 15 and above in 2020, Buddhists were the largest group at 31.1 per cent, followed by Christians at 18.9 per cent and Muslims at 15.6 per cent. Taoists comprised 8.8 per cent, while Hindus made up 5 per cent, with those prescribing to other religions accounting for 0.6 per cent.The proportion of Muslims and Christians also grew between 2010 and 2020 while the proportion of Buddhist and Taoists dipped. Among the Chinese, 40.4 per cent identified as Buddhists, while 21.6 per cent were Christian, 11.6 per cent Taoist and 0.5 per cent Muslim. Among the Malays, 98.8 per cent identified as Muslim, while 0.1 per cent said they were Buddhists and 0.4 per cent had no religion.For Indians, 57.3 per cent identified as Hindu, while 23.4 per cent were Muslim, 12.6 per cent were Christian and 0.7 per cent were Buddhist. Another 3.9 per cent of Indians identified with some other religion and 2.2 per cent said they had no religion.The DOS report is aimed at providing broad trends and changes relating to the demographic characteristics, marriage and fertility, education, literacy, home language and religion of Singapore's resident population – referring to citizens and permanent residents – between 2010 and 2020. The census data was collated from 150,000 households.More findings from Census 2020 will be shared on Friday.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:Man who fled to Thailand to avoid drug charges cheated mask buyers in SingaporeAll 14 new COVID cases in Singapore in communityLandlord who kept exposing himself to female tenant jailed and finedDickson Yeo, S'porean who spied for China, to remain behind bars'Not possible to have fair hearing': Woman without mask at MBSChina and other nations were attempting to “seize control” of strategically important international organisations so they could be “weaponised”, a new report by the UK parliament’s influential Foreign Affairs Committee said. The report, published Thursday, accused China in particular of “bullying” states to back their position or their candidates for top jobs, using measures including financial leverage “to shift policies away from the cooperation the organisations were created to promote”. TheIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Every PC user must read this in 2021 - Do it now.Browsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.The PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saThe scientific community should find ways to overcome political divides and push for more collaboration in space exploration, as well as solve global problems by making use of China’s new space station, a Hong Kong-based space expert says. Professor Quentin Parker, head of the Laboratory for Space Research at the University of Hong Kong, made the remarks ahead of China’s first crewed space flight in nearly five years, with three astronauts expected to travel to its new Tiangong space station forNew $89 Portable Air Cooler Everyone In The U.S. Is Talking AboutBeijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityHong Kong immigration officials will renew the visas of all of Cathay Pacific’s expatriate pilots, but its large contingent of foreign cabin crew will be denied extensions permitting them to remain based in the city, the airline has said. The decision leaves Cathay’s foreign cabin crew at risk of losing their jobs, with the airline saying it would offer the same voluntary redundancy package to affected staff that it offered to others in late April. In its memo on Thursday, Cathay expressed regreFormer Taiwanese president Ma Ying-jeou has called on the government to listen to public opinion and allow civilian groups which have different political leanings to the ruling Democratic Progressive Party to import much-needed Covid-19 vaccines. Taiwan, which is battling a surge in cases, has struggled to secure vaccines although it has signed deals to buy 10 million doses from AstraZeneca, 5 million from Moderna and more than 4.7 million doses via the Covax Facility, which is supported by theMeet the PayPal business debit card. Use it everywhere Mastercard® is accepted.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Los Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.China’s efforts to carve out global market share for its narrow body C919 passenger plane face a fresh hurdle after the United States and the European Union (EU) agreed to a truce in their near 17-year conflict over aircraft subsidies, analysts say. The US and EU announced on Tuesday a five-year suspension of tariffs and plan to establish a working group to address “non-market practices” in other countries, most notably China. China has spent tens of billions of dollars to develop the C919 jet,LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.A reporter with a pro-Beijing newspaper in Hong Kong accused of making a false statement when accessing a government car registry has been let off the hook after prosecutors agreed to drop the charge on condition of a binding-over order. The prosecution’s decision stood in marked contrast to the justice department’s handling of a case last year involving an RTHK contributor accused of the same act, prompting Principal Magistrate Ivy Chui Yee-mei to question the difference in approach at ThursdayThe freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.For Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).The field of candidates in Iran's presidential election thinned out Wednesday, two days before the vote in which a victory by ultraconservative cleric Ebrahim Raisi is widely seen as a foregone conclusion.The first astronauts arrived at China's new space station on Thursday in the country's longest crewed mission to date, a landmark step in establishing Beijing as a major space power.Australia recommended that AstraZeneca's Covid-19 jab should not be given to people under 60 on Thursday, a fresh blow to the country's glacial vaccine rollout.New research has identified TEN favorite stocks for the upcoming yearThe strategic partnership sees EMERGE working with Mediacorp's Bloomr.SG network to \"develop the knowledge and skills of up-and-coming\" content creators in esports.Hong Kong police rounded up 79 people in a series of raids that shut down two underground casinos and an unlicensed pub in the span of two hours on Tuesday night. In one raid on a Ko Shing Street flat in Sai Ying Pun, officers found a baccarat table and two large televisions used to play online card games, seizing HK$215,000 (US$27,697) in cash, HK$410,000 in chips and five account books. Sixteen men and six women, aged 31 to 74, were inside the premises when officers from the Western special duWashington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the House", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/more-singapore-residents-no-religion-census-064808058.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}