{"Type": "", "Time": "2021-06-18", "Headline": "Gaza recycles rubble as Israel upholds ban on construction goods | Gaza News | Al Jazeera", "Text": "Israel bans more than 1,000 ‘dual-usage’ construction materials, leaving Palestinians to repurpose debris for rebuilding.Gaza City – More than a month after Israel launched its deadly offensive on the Gaza Strip, residents are attempting to rebuild following the heavy destruction incurred by missiles and artillery shells.The 11-day offensive, which killed 256 Palestinians including 66 children, was marked by its intensity and the targeting of civilian structures. On the Israeli side 13 people, including two children, were killed by rocket fire from Palestinian armed groups.The coastal strip, one of the most densely populated areas in the world, sustained substantial damage to its infrastructure and buildings.According to Gaza’s ministry of public works and housing, 2,000 homes were destroyed, in addition to another 22,000 units that were partially damaged – resulting in the displacement of tens of thousands of Palestinians. At least four high-rise buildings were levelled, and 74 public structures, including ministry facilities, were targeted.“We believe the numbers will increase as our teams are still assessing the extent of the damage wrecked, but so far there is $500m worth of damage caused,” Naji Sarhan, under-secretary of Gaza’s public works ministry, told Al Jazeera.It takes 10-20 days to remove the rubble from each destroyed building in the Gaza Strip, depending on its size [Ashraf Amra/Al Jazeera]Sarhan said there were an estimated 200,000-300,000 tonnes of debris from the recent offensive.“The first step of recovery is the removal of rubble, especially from the high-rise and residential buildings that were destroyed, in order to prepare the sites for reconstruction,” he said.However, because of the 14-year Israeli-Egyptian blockade imposed on the strip, the reconstruction of these governmental, commercial and residential buildings is complicated. Israel does not allow building supplies through its border crossings, resulting in Palestinians in Gaza having “extensive experience” – as Sarhan puts it – in repurposing the rubble for construction needs.Ayman Talat Mushtaha, a Palestinian engineer, stood by the debris that used to be the Kuhail building.The 52-year-old owned an education centre in the building called Mahara that offered vocational diplomas. It was destroyed on May 18.“The centre had working labs, which cost a lot of money,” Mushtaha told Al Jazeera. “Some of the owners of the other centres in the building had hoped they could salvage some equipment, but unfortunately everything is lost.”Concrete blocks are made from the remains of destroyed homes after recycling [Ashraf Amra/Al Jazeera]The six-storey building housed offices and learning centres, some of them affiliated with the Islamic University of Gaza. For two weeks, a team of workers has been removing the rubble, extricating metal that will be straightened and remoulded for reuse again, and separating the stones from the concrete, which will be crushed and ground in quarries to make gravel.“These centres were our livelihoods,” Mushtaha said. “I had seven permanent employees working in my centre – now they don’t have jobs any more.”“It’s not a matter of simply renting another space,” he added. “We spent 10 years preparing this centre. But we’re hopeful that in the event we get to rebuild, we will reopen the centre again.”Workers toil to extract metal and concrete from the debris [Ashraf Amra/Al Jazeera]Mousa Mohammed, a contractor and supervisor of about 30 workers removing rubble for the Kuhail building, said each destroyed building takes between 10-20 days to clear, depending on its size.“The Gaza Strip is sorely lacking in building equipment,” the 42-year-old told Al Jazeera. “Due to the blockade, the few drill excavators and bulldozers that are available are rented out at high rates.”As a contractor, Mohammed estimates how much metal or concrete can be extracted from a destroyed or damaged building, as well as the manpower needed.“We then pay the owner of the building or the ministries of public works and economy the price of that,” he said. “We try to pay the workers a good price, but it’s difficult due to the expensive rates of renting equipment and paying out of our own pockets to remove the rubble.”“We rarely profit from this,” he added. Mohammed does not believe that building supplies will enter the Gaza Strip any time soon, pointing out some buildings and structures destroyed in the 2014 and 2008-09 offensives still have not been rebuilt.“We don’t suffer when we’re only being bombed by Israel,” he said. “People who expressed their solidarity with us during the war need to know we suffer in the aftermath too.”Wreckage is filtered then crushed to mark two types of a weaker quality of gravel [Ashraf Amra/Al Jazeera]There are three main stone quarries: one east of Khan Younis in the south, and two east of Gaza City.Ammar Yousef, the owner of one of the stone quarries east of Gaza City, said most of the debris recycled is from destroyed houses.“The rubble is filtered to separate the concrete from pieces of plastic, wood and metal,” he explained. “The concrete is then subjected to water treatment, and then transferred to a machine – called a crusher – to be grinded.”The result is two types of gravel – rough and smooth – nicknamed “lentils and sesame”.“The repurposed concrete, due to its low quality, is a supplementary material and is not used for the main construction structuring but for fences, enclosures, farm buildings and laying down new streets,” the 40-year-old said.According to Yousef, one tonne of gravel from Israel costs 110 shekels ($34), while the recycled gravel costs 50 shekels ($15). Yet there is barely any market for the recycled gravel, which has since aggregated because of lack of use.“Some people are reluctant to build and I don’t blame them,” Yousef said. “The economy is bad and people are on edge, waiting the next time Israel launches another offensive on us.”There are an estimated 200,000-300,000 tonnes of rubble in the Gaza Strip as a result of the 11-day Israeli attack [Ashraf Amra/Al Jazeera]For contractors, workers and owners of quarries, the opening and closing of the Israeli commercial crossing Karam Abu Salem (Kerem Shalom) to the Gaza Strip depends on the political climate and circumstances.The crossing opened partially after the offensive to let in animal feed, fuel and foodstuffs.“Israel bans more than 1,000 dual-usage materials – such as pipes, cement, paint, steel and iron – that is says can be used for civilian and military purposes,” Sarhan of the public works ministry said.Under-secretary of Gaza’s ministry of public works and housing Naji Sarhan sits in his Gaza City office [Ashraf Amra/Al Jazeera]The only other option for construction supplies to enter Gaza is through Egypt’s Rafah border crossing.Cairo, which has pledged $500m to fund the rebuilding of devastated areas in Gaza, has played the role of mediator between Palestinian armed groups and Israel.On June 4, dozens of bulldozers, trucks and cranes and a convoy of engineers entered Rafah from Egypt. The engineers, Sarhan said, reviewed the damage and drew up blueprints for building residential units in clusters of 500 or 1,000.They also agreed the levelled high-rise towers must be rebuilt, Sarhan said.“Egypt has sent 50 machineries, including cranes, bulldozers and drill excavators, to help with removing the rubble,” he said. “We prefer to get building materials from Egypt and not from those who are occupying us.”At least 2,000 housing units and 74 public buildings were destroyed during the May offensive on the Gaza Strip [Ashraf Amra/Al Jazeera]But he also pointed out that efforts to reconstruct Gaza extend beyond the damage inflicted upon it by four offensives.“The Gaza Strip needs approximately $3bn in order to rebuild it, including reviving its economy, which has been severely damaged due to 15 years of the blockade,” Sarhan said. “Unemployment is more than 50 percent – among graduates it is more than 70 percent – and the industrial and agricultural sectors are in tatters.”Mushtaha, the owner of the ruined learning centre in the destroyed Kuhail building, remains optimistic.“Hopefully, with the efforts and donor pledges of the Arab countries, rebuilding will be a possibility,” he said.Many of the commercial, innovative sites targeted by Israeli forces were invaluable resources for the blockaded enclave.Israeli air strikes are the first on Gaza since a shaky ceasefire with Hamas ended 11-days of fighting last month.The squad has carried out 1,200 missions to neutralise, defuse and destroy unexploded warheads in residential areas.More than 250 Palestinians, including 66 children, killed by Israeli air attacks.Follow Al Jazeera English:", "Section": "", "Writers": "", "URL": "https://www.aljazeera.com/news/2021/6/17/gaza-recycles-rubble-as-israel-upholds-ban-on-construction-goods", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}