{"Type": "", "Time": "2021-06-18", "Headline": "A new space race? As China’s space ambitions grow, NASA says it needs more money to compete - The Washington Post", "Text": "In an effort to galvanize NASA’s return to the moon, then-Vice President Mike Pence in 2019 sought to re-create the 1960s Cold War space race, when the United States beat the Soviet Union to the lunar surface. But this time the role of rival was played not by the U.S.S.R., but by China, which Pence warned was trying “to seize the lunar strategic high ground and become the world’s spacefaring nation.”Bill Nelson, President Biden’s new NASA administrator, has carried on that hawkish rhetoric, casting China as “a very aggressive competitor” that has big ambitions in space and is challenging America’s leadership. “Watch the Chinese,” he recently warned.Nelson’s strategy, like the Trump administration’s, is to cast China as a competitor racing not only to the moon, but for leadership in space more broadly. It’s a scenario that got a boost Thursday when China launched the first group of astronauts to its nascent space station for what is expected to be a three-month stay — the longest duration space mission ever by a Chinese crew.Some doubt the wisdom of Nelson’s approach, however.“Making the Chinese space station out to be such a serious threat is a mistake as it plays into China’s own political goals,” said Brian Weeden, the director of program planning at the Secure World Foundation, a think tank whose mission statement calls for the promotion of “ideas and actions to achieve the secure, sustainable, and peaceful uses of space benefiting Earth and all its peoples.”“China is trying to use its space station to show that it, too, is a space power, and these constant allusions to a space race and concerns about the threat posed by their space station are reinforcing that message,” Weeden said. Thursday’s launch, he said, was “an important achievement, but it does not mean China has equaled, let alone surpassed, the U.S.”Cooperation with China in space is not on the horizon. NASA, which landed men on the moon in 1969 and has had crew living aboard the International Space Station for 20 years, has been barred by law since 2011 from partnering with China — no Chinese astronaut has ever been aboard the International Space Station, which has been host to astronauts from nearly 20 nations. There is no prospect of that changing anytime soon in a Washington where China is seen as a fierce competitor in a wide range of technological endeavors, from quantum computers to the rollout of 5G.That is especially true for space, because the technologies used in space also are used for national defense, said Scott Kennedy, an analyst at the Center for Strategic and International Studies.“These deep concerns about China as a military competitor forestalls cooperation in dual-use technologies, and there are no technologies used in space that aren’t dual-use,” he said. U.S. and Chinese cooperation in space, he said, would require the kind of detente that the United States and Soviet Union achieved toward the end of the Cold War. “But we are very far from that.”China’s space agency has shown remarkable progress on its path to becoming a preeminent spacefaring power. In 2019, it landed an uncrewed spacecraft on the far side of the moon, a first. Last month, it became only the second country, after the United States, to land a rover on Mars. Earlier this week, China and Russia announced plans to build an international base on the moon. And then came Thursday’s launch.About six hours after that launch, the astronauts docked with China’s Tiangong space station.In a statement, Nelson congratulated China “on the successful launch of crew to their space station! I look forward to the scientific discoveries to come.”But, like the Trump administration before him, Nelson has sought to leverage China’s space ambitions as a way to get Congress to fund NASA’s plans to return to the moon, while the space agency works to build an international coalition of its own.Another front in the tensions between the U.S. and China: SpaceNASA had been planning to fly astronauts to the moon by 2028. But the Trump administration sought to accelerate that, mandating the space agency do it by 2024, a highly aggressive timetable that few thought possible. Under the Biden administration, NASA is reviewing the lunar program, dubbed Artemis, but Nelson has embraced it and its aggressive timeline. And he has spent his first few weeks as NASA administrator picking up where his predecessor, Jim Bridenstine, left off: lobbying Congress for the funds to make it happen.Nelson’s strategy, in part, is to cast China as a competitor.Speaking before House appropriators last month, Nelson said that China was seeking to land humans on the moon in the 2020s. That, he said, should motivate Congress to give NASA more money for its Artemis program as it seeks to develop a spacecraft, known as the Human Landing System, that would ferry astronauts to the lunar surface. In addition to the Artemis program, Nelson also has called for the life of the International Space Station, which has had humans living on it continuously for more than 20 years, to be extended to 2030.Last year, Congress appropriated $850 million for the lunar lander, well short of NASA’s $3.3 billion request. In its request for funding in this year’s budget, NASA has requested $1.2 billion for the lander, but the program is tied up in litigation.Meanwhile, Nelson has said he hopes Congress gives NASA the money it needs to compete. China’s lunar ambitions “should tell us something about our need to get off our duff and get on our Human Landing System program going, vigorously, and NASA can’t do it alone,” he said during the House hearing.At another point in the hearing, he held up a photograph for the committee of the Zhurong rover that landed on Mars last month. “I want you to see this photograph,” he said, adding that it was a part of China’s goal to eclipse the United States in space.The United States has had a proliferation of human space successes recently. Over the past year, SpaceX flew three human spaceflight missions for NASA. Boeing also hopes to fly one by the end of this year. And Blue Origin and Virgin Galactic are continuing development of their suborbital space tourism programs.A key part of NASA’s Artemis program is stalled, however.After NASA awarded SpaceX a $3 billion contract in April to use its Starship spacecraft to fly astronauts to and from the lunar surface, the losing bidders, Jeff Bezos’s Blue Origin and Dynetics, a defense contractor, protested the award with the Government Accountability Office. That has forced NASA to put a hold on the contract. (Bezos owns The Washington Post.)Meanwhile, Congress passed a bill that would require NASA to award two lunar lander contracts for future lunar missions. But it’s not clear that the $10 billion authorized to fund the contracts will get appropriated by Congress.A recent bright spot for the program, though, is NASA’s much-beleaguered Space Launch System rocket, which would send NASA astronauts to the moon. After years of delays, it successfully completed a full-duration engine test. The 212-foot core stage of the rocket was shipped to the Kennedy Space Center, where it has been mated with its side solid rocket boosters. Nelson has repeatedly said it could fly for the first time this year in a trip that would propel the Orion spacecraft, without any astronauts on board, on an autonomous trip around the moon.NASA also is building an international coalition to support the lunar mission and create norms of behavior in space. Signatories to the Artemis Accords would be able to partner with NASA in its lunar exploration program but would be required to adhere to a set of standards including the public release of scientific data. The program began in 2020 under the Trump administration but has been continued under Biden. Earlier this week, Nelson welcomed Brazil as the newest signatory.China, meanwhile, also is seeking international collaboration for the moon. Earlier this week, it announced an International Lunar Research Station, a joint program with Russia. In a statement, the two countries’ space agencies said they “jointly invite all interested international partners to cooperate and contribute more for the peaceful exploration and use of [the] moon in the interests of all humankind, adhering to the principle of equality, openness and integrity.”The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/technology/2021/06/17/china-space-race-nasa/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}