{"Type": "Sport", "Time": "2021-06-18", "Headline": "Tennis: Nadal, Osaka withdraw from Wimbledon", "Text": "LONDON: Rafael Nadal and Naomi Osaka, with 24 Grand Slam titles between them, both withdrew from Wimbledon on Thursday (Jun 17) with the Spanish star also pulling out of the Tokyo Olympics in a bid \"to prolong my career\".Nadal's snub of the Olympics was later followed by world No 5 Dominic Thiemalso withdrawing from Tokyo.Osaka, however, said she still intended to take part in her home Olympics.The 35-year-old Nadal, who won Olympic gold and Wimbledon in 2008, triumphing again at the All England Club two years later, revealed his decision on Twitter.\"I have decided not to participate at this year's Championships at Wimbledon and the Olympic Games in Tokyo,\" he tweeted.\"It's never an easy decision to take but after listening to my body and discuss(ing) it with my team I understand that it is the right decision.\"World No 1 Novak Djokovic last week ended Nadal's four-year reign as French Open champion and went on to seal his 19th Grand Slam.\"The goal is to prolong my career and continue to do what makes me happy, that is to compete at the highest level and keep fighting for those professional and personal goals at the maximum level of competition,\" said Nadal.The former world No 1 said the shorter break between the French Open and Wimbledon this year - Roland Garros was pushed back by a week - had influenced his decision.Nadal is a double Olympic champion, having won gold in singles in Beijing in 2008 and in doubles with Marc Lopez in Rio in 2016, when he also carried Spain's flag in the opening ceremony.'TAKING PERSONAL TIME'Japanese star Osaka also pulled the plug on the All England Club, just two weeks after withdrawing from the French Open citing her struggle with depression and anxiety.\"Naomi won't be playing Wimbledon this year,\" Osaka's agent Stuart Duguid said in an email to AFP. \"She is taking some personal time with friends and family.\"She will be ready for the Olympics and is excited to play in front of her home fans.\"Osaka has been in the spotlight since withdrawing from the French Open.She was fined US$15,000 and threatened with disqualification from Roland Garros after she refused to honour mandatory media commitments.Osaka lost in the third round of Wimbledon in 2017 and 2018 and bowed out in the first round in 2019. Last year's tournament was cancelled due to coronavirus.US Open champion Thiem said he wanted to concentrate on Wimbledon and then on defending his only Grand Slam title in New York later this summer.\"After talking with my team and analysing the situation I have taken the very difficult decision to withdraw from competing in the Tokyo Olympics,\" the 27-year-old Austrian wrote on Twitter.\"My goal is to work hard the coming weeks, give my best at Wimbledon and keep training and hopefully defend my US Open title.\"Thiem was knocked out of the French Open in the first round despite being a two-time runner-up in Paris.Thiem also missed the 2016 Rio Olympics due to fears over the Zika virus.\"I am young and I hope to be able to play for Austria at the Olympics in Paris 2024,\" he added.Nadal, who will be replaced as third seed at Wimbledon by defeated French Open finalist Stefanos Tsitsipas, missed the championships in London in 2004, 2009 and 2016 because of injury.His absence from Wimbledon means Djokovic, 34, will be an even stronger favourite to win the tournament for the sixth time.Eight-time Wimbledon champion Roger Federer, 39, is struggling to find his form after returning from knee surgery.He lost in the second round of the ATP grass court tournament in Halle on Wednesday after pulling out ahead of the fourth round of the French Open.If Djokovic wins at the All England Club he would join Nadal and Federer on 20 Grand Slam titles and would require just the US Open, which starts in late August, to complete the calendar Grand Slam.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Wimbledon,tennis,Rafael Nadal,Naomi Osaka,Grand Slam", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/tennis-nadal-osaka-withdraw-from-wimbledon-15038044", "Source": "google"}