{"Type": "", "Time": "2021-06-17", "Headline": "Want to offset Biden’s proposed inheritance tax? Talk to your insurer broker", "Text": "What’s that they say about crisis and opportunity being the same thing?It turns out that Americans spooked by the prospect of President Joe Biden’s proposed tax increase on capital gains could turn the fear of handing their life’s savings over to the government into an innovative workaround.The solution isn’t some complicated loophole hiding deep in the guts of American tax laws, either. It’s life insurance.Here’s how purchasing the right life policy can help your family hold onto more of what they’ve got coming to them.Biden has some big plans for his administration, particularly two giant spending bills concerned with improving the country’s aging infrastructure and providing a post-pandemic boost to employment.But with the proposed cost of those two bills being more than $4 trillion, the president has to find some way to pay for them.Biden has suggested a spate of tax increases that are projected to generate more than $1 trillion in revenue: returning the top individual tax rate to 39.6%, increasing the corporate tax rate from 21% to 28% and doubling the capital gains tax rate from 20% to 39.6% for individuals earning $1 million or more in annual income.Factor in the 3.8% Net Investment Income Tax high earners are required to pay in capital gains and they could be looking at a total capital gains tax rate of 43.4%. A related Biden strategy involves taxing capital gains on inherited property at death.Rather than allowing heirs to defer taxes on inherited property until they sell it, this particular proposal would see the transfer of assets from deceased to heir treated like a sale.So if an inherited property’s value is found to have grown by more than $1 million between when it was originally purchased and when it was inherited, the heirs could be hit with the newly hiked capital gains levy right away — no deferment.Let’s say you’re passing a swath of valuable farmland down to your daughter. Since you purchased it 20 years ago, its value has increased by $2 million.That increase could result in as much as $434,000 in immediate capital gains taxes, even allowing for the $1 million and not including state and local taxes.Those capital gains increases aren’t set in stone. Any bill that includes them will face stiff resistance in both the House and Senate.But if the increases do survive the congressional spanking machine, you can get around them by purchasing the right life insurance policy.For big earnersIf you were to transfer more than $11.7 million to your family, you could look into an irrevocable life insurance trust (ILIT), which controls your life insurance policy while you’re alive and distributes your assets once you join the great abyss.When an ILIT owns and controls your life insurance policy, the proceeds from your death benefit are not considered part of your gross estate and won’t be taxable at either the federal or state level.ILIT’s can also provide the kind of cash needed to pay estate taxes and other expenses. They’re more complex than your average insurance policy, so make sure you get advice from a trusted insurance provider.For everyone elseIf your family is facing a potentially mammoth capital tax hit once you’re gone, taking out a large enough life insurance policy could help ensure your life savings don’t evaporate after you’re gone.The first thing you’ll want to do is get your assets appraised to determine how much they have appreciated over the years. That’ll give you an idea of how big your capital gains bill might be.Once you have a dollar amount to work with, you can explore taking out a life insurance policy that pays out an amount equal to, or greater than, your capital gains costs.You can opt for either term or permanent policies. Permanent policies, which cover you until death, tend to be more expensive.Term policies are often cheaper, and because they cover a shorter period of time, may be a better hedge against Biden’s plans falling through.If taking out a hefty life insurance policy isn’t in the cards, there are other ways to help your family cover the costs associated with your passing.If you’re a homeowner and you haven’t refinanced your mortgage in the last year, you could be leaving a mountain of money on the table. With rates below 3%, mortgage data and technology provider Black Knight found that 14.1 million homeowners could save an average of $287 a month with a refi. That’s money you can funnel straight into savings vehicles and investments for your family.Choosing which assets are most likely to pay off over the long-term can be overwhelming if you’re not a market hound or finance nerd. It can be tempting to get your investing advice from social media, but you should always take the time to get your investment and retirement planning advice from professionals who know what they’re doing.Some investing, however, is simple and low-risk enough that anyone can do it. Taking a run at today’s booming stock market, for example, can be as simple as downloading an app that allows you to invest in a diversified portfolio using “spare change” from your everyday purchases.Just remember to set aside a chunk of your earnings -- possibly a big one -- for Uncle Sam.There's one group of borrowers that can count themselves as 'lucky' during periods of inflation.Employers are bracing for a wave of legal action if the Government introduces new legislation that would make home working permanent post-pandemic. City lawyers warned that any move to make working from home the \"default\" option for employees had the potential to significantly increase employment disputes and litigation. Hannah Netherton, an employment partner at law firm CMS, said: “The introduction of a default right to work from home for office-based workers would be a significant expansion oCut your monthly payment while rates are low. Free Quotes. Wont affect your credit. Calculate New Payment. (1.97% APR)Pharmaceutical companies can trade sideways for years, and may see a spike every now and then due to positive announcements or an FDA approval update. The newest subset of the biotech industry, known as gene therapy companies, has been multiplying at an astonishing rate. As a result, they have many new stocks listed to capital markets. These companies have recently piqued the interest of investors, and analysts are weighing in. Many individuals are born with disorders for which there is no cure,Gold prices dropped more than $50, a day after the Federal Reserve signaled faster and sooner interest rate increases. Watch this level, analysts sa.Inflations fears are rising, along with the price of gasoline and lumber and milk – and, oddly, the unemployment rate. The initial unemployment claims ticked up last week, even as the number of job openings reached a record high level. Between the COVID relief bill, the infrastructure proposal, and a jobs act, the Biden Administration's spending plans are totaling $6 trillion. And with economic activity reopening after the COVID pandemic, consumers are getting out, eager to spend, and holding plHiring the wrong financial advisor can wreak havoc on your investments and ruin your retirement. However, this new tool is changing everything.After an incredible run, lumber prices have been tumbling. Gold prices, meanwhile, have held up much better. Is it time to get defensive?The saga of Theranos, a unicorn biotech startup, and its enigmatic CEO, Elizabeth Holmes, from the rise to the fall and its aftermath.Bond yields went for a ride on Wednesday and Thursday after the Federal Reserve signaled the likelihood of rate hikes by the end of 2023.If you pay more than $99/month for power and own a home in Texas, you better read this.Yogi Adityanath, the Hindu priest tipped as successor to India’s Prime Minister Narendra Modi, has said hospitals lied about shortages of oxygen during the height of the Covid crisis, in an exclusive interview with the Telegraph. Mr Adityanath, the chief minister of India’s most populous state Uttar Pradesh, is seen as the third most powerful man in India behind his colleagues in the ruling Bharatiya Janata Party (BJP), Mr Modi and home minister Amit Shah. The controversial politician attracts fBiden hints that US operatives could begin to hack Russia's vital infrastructure.By the end of Ronaldo's press conference, Coca-Cola's shares had already started falling.Get a $200 checking bonus when you apply for an eligible checking account online in minutes with qualifying direct deposits. Learn more.Stocks traded mixed on Thursday as investors contemplated the Federal Reserve's latest monetary policy decision and updated projections, which signaled a quicker path to higher interest rates than previously anticipated.Chairman Powell and his colleagues expect to raise interest rates sooner.The reopening of the U.S. economy has benefited a handful of sectors, including suburban housing, airlines – and apparel.Take advantage of lower mortgage rates & cut your monthly payments. 5 Best Mortgage Refinance of 2021LAWRENCE A. CUNNINGHAM'S QUALITY INVESTING  Could insider sales of meme stocks signal a coming crash in their share price? The empirical research suggests the answer is yes. The substantial stock sales by directors of GameStop (GME) and AMC Entertainment Holdings (AMC) didn’t surprise most rational investors.Stocks are set for a poor performance on Thursday, as markets absorb the Federal Reserve’s indication that interest rate increases are coming sooner than expected, while the central bank remains alert to inflation risks.Plant-based foods are a compelling theme that likely has staying power. Here’s how to use options to enhance your returns.The Medicare Assistant is a licensed insurance broker representing several top Medicare companies. Our customers are our top priority!A survey of 1,000 U.S. employees revealed that many find their companies don't do enough to prioritize addressing racial justice in the workplace.Images of North Korean leader Kim Jong Un appearing thinner led some online speculators to believe his health could be in jeopardy, though a South Korean analyst recently downplayed such theories.(Bloomberg) -- Long-term Treasury yields spiraled lower and sparked the biggest two-day narrowing on the yield curve since March 2020.The move came after Federal Reserve officials pulled forward their signal for when monetary policy tightening could start, helping to rein in the risk that inflation might become unmoored.The 30-year bond yield fell as much as 16 basis points to 2.05% Thursday, its lowest level and biggest intraday drop since February. The plunge in long-end yields comes after new", "Section": "", "Writers": "", "URL": "https://finance.yahoo.com/news/want-offset-biden-proposed-inheritance-200000533.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}