{"Type": "", "Time": "2021-06-18", "Headline": "Opinion | Obamacare wasn’t as bad as critics thought it would be. It wasn’t revolutionary, either. - The Washington Post", "Text": "The Supreme Court has saved Obamacare — again. Thursday’s ruling in California v. Texas marks the third time that John G. Roberts Jr.’s court has rescued the law from an existential threat (though this threat was by far the weakest). Since no other legal challenges appear on the horizon, and even the feistiest Republicans have given up talking seriously about repeal, it seems safe to say that Obamacare we shall always have with us.That’s a bit personal for me, since I was one of Obamacare’s most committed critics. Obviously, I failed to persuade the rest of you. This seems an apt time for a bit of self-reflection: Was Obamacare really as bad as I thought it was going to be?In a lot of ways, the answer is no. But that’s often because it wasn’t as good as my opponents expected, either, which I think most would readily admit.My critique boiled down to four main points: First, I doubted we would improve our overly complex, balkanized health-care system with yet another major program that would make it even more complicated. Second, I feared committing more than $100 billion to new spending every year, at a time when we hadn’t even figured out how to pay for existing entitlement programs. Third, I worried that having the government subsidize even more of our medical bills would lead to price pressure, particularly on pharmaceuticals and medical devices, which in turn would reduce incentives for innovation. And fourth, I simply didn’t believe many of the claims supporters were making — explicitly or implicitly — about Obamacare dramatically reducing health-care costs or bankruptcies or infant mortality, or improving life spans.Eleven years on, that first worry seems overblown. Our system is still a Rube Goldberg-esque kludge, but not noticeably more so than in 2010. As for the effect on innovation, well, Pfizer and Moderna just brought two new cutting-edge vaccines to market in less than a year. And while I’m certainly worried about a fiscal crisis, Obamacare is the least of our worries, since no politician in either party appears to believe that government spending and government revenue have any relation to each other, or ought to.On the fourth point, however, I think my predictions have largely been vindicated. And that this is one major reason the others haven’t been.Obamacare’s supporters talked a lot about illnesses contributing to more than half of all bankruptcies, which implied there should have been a sharp decrease in 2014, when Obamacare’s major coverage provisions took effect. There wasn’t.Obamacare’s supporters frequently cited America’s abysmal infant mortality rate, which implied that once Obamacare was in full swing, infant mortality should decrease sharply. It didn’t.Obamacare’s supporters claimed that tens of thousands of people were dying every year because they didn’t have health insurance, which implied that by 2019, our overall mortality rate should be substantially lower than it had been in 2009, with a noticeable kink around 2014. Instead, mortality rates, which had been trending downward, leveled off around that time.Obamacare’s supporters talked a lot about reducing health-care costs, or at least the rate at which they were growing. Sadly, no.Partly that’s because those claims were always oversold; research performed in the years since suggests that offering people health insurance has more measurable impact on their financial health than their physical health, and that medical bankruptcies may be driven less by medical bills than by income loss, a problem Obamacare doesn’t address. But there’s another reason neither those optimistic promises nor my pessimistic prophesies bore fruit: We were all wrong about an even bigger question.In 2011, Doug Elmendorf, head of the Congressional Budget Office, testified that by 2021, 24 million people would be buying their insurance on the Obamacare exchanges. It’s fair to say that both Obamacare’s friends and foes assumed the number would be at least that high, if not higher. In reality, the most recent data suggest it’s half that.The Medicaid expansion has been more in line with projections, but it, too, is smaller than expected, in part because the first time the Roberts court rescued Obamacare, it ruled that the federal government had to let states opt out of expanding their programs. And that, in turn, has lessened the pressure for the government to exert more stringent pressure over health-care delivery or prices. Most of Obamacare’s gestures in that direction were less effective than hoped, or died on the vine.That’s not to say Obamacare did nothing; the percentage of Americans who are uninsured has fallen from 16.7 percent in 2009 to 9.2 percent in 2019. That’s a substantial achievement, which even the program’s harshest critics should acknowledge. But even its most zealous boosters should be willing to admit that the program that the Supreme Court saved this week is far from the revolutionary transformation its architects envisioned.Read more:The Post’s View: Obamacare is part of America now. Republicans must stop undermining it.Catherine Rampell: Obamacare lives! Now, Democrats should do right by those who fell through its cracks.Paul Waldman: The Supreme Court confirms it: Time for the GOP to give up on destroying the ACAVideo: ‘I hate that question’: 7 experts try to answer who has the world’s best health-care systemPaul Waldman: Why Democrats must keep pushing on a public option — even if Biden won’tThe most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/opinions/2021/06/17/obamacare-wasnt-bad-critics-thought-it-would-be-it-wasnt-revolutionary-either/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}