{"Type": "", "Time": "2021-06-18", "Headline": "Inside Hong Kong's Apple Daily, China's besieged liberal media icon, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.HONG KONG (REUTERS) - Journalists at Apple Daily, a feisty Hong Kong newspaper, had been bracing for some kind of a crackdown.The splashy Chinese-language tabloid - which mixes celebrity gossip, investigations of the powerful and pro-democracy editorials - has increasingly been under the scrutiny of the authorities since the arrest last August of its owner Jimmy Lai, who remains in jail for joining unauthorised rallies.Still, Thursday's (June 17) early-morning raid by 500 police officers was a shock, not only to Apple Daily staff but also to journalists throughout the city and, more broadly, people concerned about eroding press freedom in the former British colony.Officers sealed off the block around the building housing the Apple Daily newsroom and printing press, emptied the newsroom and rifled through computers and desks.They arrested five executives, including the two top editors, on suspicion of \"colluding with foreign forces\". Scores of police milled about and swept the emptied newsroom for half a day, live feeds from expelled staff showed from outside.The raid, seizure of journalistic material and arrests of senior journalists, for alleged violations of a year-old security law imposed by Beijing, is being widely seen as the most direct attack on Hong Kong's freewheeling media since Beijing regained control of the city in 1997.Now staff fear the 26-year-old paper could be closed, said two senior editors and Mr Mark Simon, Lai's right-hand man, who has fled abroad.Persistent rumours that the authorities would try to \"shut down\" Apple before July 1, when Chinese President Xi Jinping leads celebrations for the Communist Party's centenary, seem more likely now, Mr Simon told Reuters.\"I'm starting to think that,\" he said by phone from the United States.The newsroom began bracing for a crackdown after Hong Kong's police chief warned in April that media outlets that endanger national security through \"fake news\" would be investigated, said four Apple Daily reporters, ranging from junior to senior.Morale suffered, and a handful of staff quit. Town hall meetings were held to reassure staff, and contingency plans laid.Most staff received cards with lawyer contacts and assurances the company would back everyone legally. News materials were firewalled or sent abroad to protect information and sources.\nEmployees of Apple Daily working at their desks in the newsroom in Hong Kong, China, on June 17, 2021. PHOTO: EPA-EFE\nOn the business side, with the company struggling financially and facing uncertainties over its building lease, non-core media businesses such as a charity fund run by Lai were moved to separate offices, Mr Simon and another senior staff member said.Apple Daily's advocacy of democratic rights and freedoms has made it a thorn in Beijing's side since Lai, a self-made textiles tycoon known for a hip clothing chain, started it in 1995. It shook up the region's Chinese-language media landscape and became a democratic icon on the margins of communist China.Hong Kong's security chief, Mr John Lee, said those arrested were part of a \"conspiracy\" to make use of \"journalistic work\" to bring Western sanctions on Hong Kong. He added that the authorities respected media freedoms, but skirted a question on whether Apple would be shut down.However, some Hong Kong insiders predict more moves.\"In China's mind, anything could endanger national interests, so they tighten everything,\" said a government official who deals with media issues. \"And until everything is settled, they won't relax the process.\"Last year's security law was Beijing's first major move to put Hong Kong on an authoritarian path. It punishes anything Beijing deems as subversion, secessionism, terrorism and collusion with foreign forces with up to life in prison.\"It will deepen jitters and uncertainties about whether Hong Kong is still a free city if the paper vanishes,\" Mr Chris Yeung, head of the Hong Kong Journalists' Association, told Reuters.Mr Ryan Law, who became Apple Daily's editor in chief in 2018, a year before the city was roiled by anti-Beijing protests, has said publicly he would not quit despite the risks.Hours before his arrest, the bespectacled, mildly spoken editor and a deputy wrote in a letter to readers: \"We want to be a newspaper for the people of Hong Kong.\"\nApple Daily editor-in-chief Ryan Law being escorted by police to a waiting vehicle outside the newspaper's office in Hong Kong on June 17, 2021. PHOTO: AFP\nIf anything, the paper's influence has been even broader. It has served as a beacon of media freedoms in the Chinese-speaking world, read by dissidents and a more liberal Chinese diaspora - repeatedly challenging Beijing's rising authoritarianism.On June 4, when the authorities banned the annual candlelight vigil in downtown Victoria Park to commemorate the deadly 1989 Tiananmen Square crackdown in Beijing, Apple Daily's front page the next day read: \"You can close Victoria Park. But not lock people's hearts.\"Some observers say the media crackdown could extend beyond Apple, given China's unrelenting drive to wrest control over the city after protests in 2019.\"This is the first time a media organisation has been raided over the newspaper's output, though police won't clarify if it's over articles, opinion pieces or editorials,\" said Mr Tom Grundy, editor in chief of independent online media outlet Hong Kong Free Press.\"The rules are unclear by design, as the security law is intended to make the media self-censor,\" he told Reuters.But despite the raid, there were some signs of defiance at Apple Daily.The paper said it would print half a million copies of its newspaper on Friday, more than five times the usual daily print run, in anticipation of strong public support for its plight.\"I will not quit at this moment,\" said a reporter who asked not to be identified. \"I think as a journalist, I can't do anything to respond except to keep reporting.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/inside-hong-kongs-apple-daily-chinas-besieged-liberal-media-icon", "Source": "google"}