{"Type": "", "Time": "2021-06-17", "Headline": "How the centuries-old shipwrecks in Singapore waters were discovered, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Two historical shipwrecks have been excavated from Singapore's waters. Ceramic pieces dating back to the 14th century have been salvaged. Here are details of their discovery and their significance to the island city's maritime heritage.A Singapore-registered barge carrying two bulk loader cranes encountered bad weather while on its way to Kuantan and ran aground at Pedra Branca on Dec 30, 2014.The two cranes were at risk of toppling onto Pedra Branca's famous Horsburgh Lighthouse, which was built in 1851.To prevent this from happening, dynamite was attached to the two cranes, and they were blown up while two boats pulled them away from the lighthouse, scattering metal into the sea.Commercial divers were hired to clear the area of these scraps, said Dr Michael Flecker, a visiting fellow at the ISEAS - Yusof Ishak Institute's (ISEAS) archaeology unit.It was while diving to retrieve the scraps in 2015 that Mr Ahmad Qamarulhazman, a diver, stumbled upon a few old ceramic plates, and informed his manager Mr Ramdzan Salim about them.Mr Ramdzan said he was sceptical of the find, given how close they were to the rocky seabed. Nevertheless, he asked Mr Ahmad to identify the area, and returned there when their tasks were finished, only to find more plates.\nDr Michael Flecker preparing for a dive. ST PHOTO: GIN TAY\nAt around the same time, a 10-week-long archaeological dig was being carried out at a site in Empress Place.The divers, while following media coverage of the findings, realised that some plates retrieved near Pedra Branca looked very similar to artefacts retrieved in Empress Place, and decided to hand over the plates to the institute for further research and safekeeping.The rest is history. Upon ISEAS' confirmation that the plates were high quality celadon ceramics dated to the 14th century, the National Heritage Board partnered the institute to conduct a survey at the Pedra Branca site, discovering a shipwreck in 2016.Mr Ramdzan said on Wednesday that he had a hunch that the finds were significant as he had previously participated in a privately-funded expeditions to recover centuries-old porcelains.Asked if it crossed his mind to sell the artefacts he stumbled upon, he said getting the plates valued for sale would have been too time-consuming. Furthermore, he added that public education about Singapore's history was the first thing on his mind, and handing over the plates was the right thing to do.Mr Ramdzan joined the ISEAS team on the initial survey in 2016, and subsequently participated as a volunteer on the excavations, further contributing to a project that was kick-started by his civic-minded decision to hand over the plates to the relevant bodies.\nThe Yuan dynasty blue-and-white porcelain haul from this wreck is believed to be the largest such haul ever found from a shipwreck. Only three other wrecks with similar blue and white porcelains have been found, in smaller quantities. PHOTO: ISEAS - YUSOF ISHAK INSTITUTE\n\nLongquan celadon dishes, which have a green glaze, were recovered from the wreck. Similar plates have been found in mainland Singapore. ST PHOTO: GIN TAY\n• Research has dated the ceramics, which formed the bulk of the items salvaged from this wreck, to the 14th and possibly 15th century.• Direct parallels were drawn between these finds, and those from the excavations at Empress Place and Fort Canning Park in the past, making the shipwreck highly archaeologically and historically significant.• Findings will help to shed light on the maritime trading history of Singapore, and how life was like here during the 14th-century Temasek period.\nA range of artefacts found, which includes (clockwise from top left) a glass bottle stopper, a betelnut cutter, copper-alloy beads, agate medallions, a bronze mortar, glass beads, a copper-alloy bracelet and a gold tag with Armenian script. PHOTO: ISEAS - YUSOF ISHAK INSTITUTE\n• Following the end of excavation works for the first shipwreck, NHB and ISEAS conducted a survey around Pedra Branca and uncovered a second shipwreck dating to the late 18th century. Efforts were then made to excavate this shipwreck between 2019 and 2021.• Cargo likely from an India-built merchant vessel, the Shah Munchah, with remnants of the ship’s hull. The vessel sank in 1796 while on a voyage from China to India.• Diverse finds from this ship include both ceramics and non-ceramic objects.\nMultiple figurines were found, including those of (from left) a Chinese couple, a dog, and a Qingbai figurine of a horse with a rider wearing a scholar’s headgear. PHOTOS: ISEAS - YUSOF ISHAK INSTITUTE\n• Four anchors - as long as 5m and weighing 2.5 tonnes - and nine cannon were recovered from the site. The cannon were typically mounted on ships employed by the East India Company in the 18th and early 19th centuries, and used for defence as well as signalling.• Findings will contribute to research on maritime trading activities around Singapore’s waters in the 18th century.\nA cannon is lifted off the seabed using a craned vessel. PHOTO: ISEAS - YUSOF ISHAK INSTITUTE\n• Instruments like sonars are used to locate objects protruding from the seabed, while magnetometers are used to find iron objects.• A modern ship, the MV Yu Seung Ho, sank near the site of the second historic wreck in 1979, rendering the magnetometer useless for this survey as metal signatures were unusually high.• Divers went with old-school visual surveys to help find the second historic wreck.• The site is mapped, including its size and the seabed material, so researchers know what excavation equipment to use.• Environmental conditions are determined to choose the right vessel and diving technique for the excavation.\nA diver searching for artefacts on the seabed near a shipwreck that was discovered off Pedra Branca. PHOTO: ISEAS - YUSOF ISHAK INSTITUTE\n• A grid is set up on the seabed, and aligned with the ship’s keel if one still remains. No hull was found for the first wreck, while just remnants of the second vessel’s hull remained.• Dredging devices, which act like underwater vacuums, are used to unearth artefacts.• Recording is done through various means like photos, videos and sketches.• Collected artefacts are logged according to their grid numbers, while the precise location within the grid is recorded for unique pieces.• Important pieces are packed in bubble wrap, while others are placed in boxes and taken to the storage facility.\nA diver sorting various artefacts that were collected from the shipwrecks. The items are logged according to their grid numbers, and important pieces are packed in bubble wrap. PHOTO: ISEAS - YUSOF ISHAK INSTITUTE\n• Ceramics and glass are desalinated and stabilised by leaching out salts through a simple process of replacing the water they are soaked in.• Metals are placed in a chemical solution.• Organic materials are reinforced if possible.\nRetrieved artefacts have to go through conservation treatment after they are collected. PHOTO: ISEAS - YUSOF ISHAK INSTITUTE\n• Ceramics are divided into types, like blue and white, or greenware, and also by the kilns they came from if possible.• Artefact information is put into a database, and this is linked to the grid square it was found in, allowing for easy counting.• Distribution - how much of each type of artefact was found in different areas over the wreck - is studied.• Cataloguing is the final stage, where all the types and quantities of artefacts are listed.• Using distribution information, how the ship was wrecked can be analysed, much like detective work.• Artefacts are identified and dated, which is especially important for items that are no longer being used today.• Findings are compared with existing literature. Chinese and Indian texts may shed light on the identity of the first shipwreck, while multiple sources like company records and newspaper reports will help identify the second shipwreck.• New revelations may be discovered. For instance, unexpected items like a tambourine and shakers were found in the second shipwreck.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/how-the-centuries-old-shipwrecks-in-singapore-waters-were-discovered", "Source": "google"}