{"Type": "", "Time": "2021-06-17", "Headline": "North Korea gives US$300,000 for Myanmar in first financial donation since 2005, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SEOUL (REUTERS) - North Korea has provided US$300,000 (S$401,300) to a United Nations-led humanitarian aid initiative for Myanmar, marking its first donation to other countries since 2005.The UN Office for the Coordination of Humanitarian Affairs' financial tracking service showed that North Korea paid the contribution on May 24 to the Myanmar Humanitarian Fund.The fund calls for some US$276 million to help Myanmar, where hundreds of people have died since the military ousted the elected government of Ms Aung San Suu Kyi in February and began a bloody crackdown on pro-democracy protests, adding to the country's struggle with the coronavirus pandemic.North Korea last offered financial aid to the UN in 2005, when it gave US$150,000 for Indonesia, India, Thailand, Malaysia, Maldives and Sri Lanka - all of which were hit by a devastating tsunami in December 2004.North Korea has longstanding relations with Myanmar, and UN monitors have said that Pyongyang supplies weapons to the South-east Asian nation. It has said it is investigating missile cooperation between the two countries.South Korea has also provided US$600,000 to the UN efforts to support Myanmar but has suspended defence exchanges and banned exports of arms and other strategic items to the South-east Asian country.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/north-korea-gives-us300000-for-myanmar-in-first-financial-aid-since-2005", "Source": "google"}