{"Type": "", "Time": "2021-06-17", "Headline": "Those engaging in racist acts in school will be counselled and disciplined: MOE, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Students and staff who experience racism in schools should bring it up to their institutions immediately for investigations to be conducted, and those engaging in racist acts will be counselled and disciplined, the Ministry of Education (MOE) said on Thursday (June 17).The ministry was responding to The Straits Times' queries about recent allegations of racism on social media platforms like Instagram and Facebook, where users from minority communities recounted incidents of alleged racism in public schools, including racial bullying by former classmates and discrimination by teachers.A spokesman for the MOE said that any form of racism is unacceptable and has no place in local schools.She added that the ministry also expects educators to maintain high standards on this matter.\"We expect all educators to conduct themselves to the highest standards of their profession, given their position of influence over their students, and we will not hesitate to take the appropriate disciplinary actions against offenders,\" the spokesman said.\"Our schools aim to provide a supportive and safe environment where students and staff, regardless of their race and religion, can build strong and positive relationships, voice their concerns, and seek help from their teachers and peers.\"The ministry said schools here provide a common space for students to learn the values of respect and harmony, regardless of race, language or religion.The spokesman added: \"Within the classroom, topics on multiculturalism and the importance of racial harmony are taught in subjects like Character and Citizenship Education, history and social studies.\"These values are practised and reinforced beyond the classroom as students interact with one another during student development experiences like CCA and cohort camps.\"The MOE also said that teachers are provided with resources and training to establish a caring and enabling environment in school by fostering strong teacher-student and peer relationships.All schools will have a peer support structure in place by the end of this year, where students can support one another and are taught to speak up for peers when necessary, the ministry added.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/those-engaging-in-racist-acts-in-school-will-be-counselled-and-disciplined-moe", "Source": "google"}