{"Type": "", "Time": "2021-06-18", "Headline": "Joe Biden signs bill making Juneteenth a federal holiday – as it happened | US news | The Guardian", "Text": "\nMaanvi Singh (now) and \nJoan E Greve in Washington (earlier)\n\n        \n            Thu 17 Jun 2021 20.15 EDT\n\n\n\n            First published on Thu 17 Jun 2021 09.22 EDT\n\n\n\n8.01pm EDT\n20:01\n\nJoan E GreveUpdated\n            at 8.15pm EDT\n\n\n7.16pm EDT\n19:16\n\nMartin PengellyA Republican congressman “ran as quickly as he could, like a coward” when a police officer injured in the attack on Congress on 6 January saw him and tried to shake his hand, the officer said.“I was very cordial,” Michael Fanone told CNN on Wednesday of his interaction with Andrew Clyde, in a Capitol elevator earlier that day.Fanone, of the DC metropolitan police, was assaulted and injured after he rushed to help defend the Capitol from supporters of Donald Trump who rioted in service of his attempt to overturn his election defeat.Fanone returned this week with a colleague from the US Capitol police, in an attempt to speak to Republicans including Clyde who voted against awarding the congressional gold medal to officers who defended the building.When he saw the Georgia representative, Fanone said, he “extended my hand to shake his hand. He just stared at me. I asked if he was going to shake my hand, and he told me that he didn’t who know I was. So I introduced myself.“I said that I was Officer Michael Fanone. That I was a DC Metropolitan police officer who fought on 6 January to defend the Capitol and, as a result, I suffered a traumatic brain injury as well as a heart attack after having been tased numerous times at the base of my skull, as well as being severely beaten.“At that point, the congressman turned away from me.”Fanone said Clyde “pulled out his cellphone and started thumbing through the apps”, apparently trying to record the encounter. Once the elevator doors opened, Fanone said, the congressman “ran as quickly as he could, like a coward”.Clyde has not so far provided comment.Read more: \n\n6.38pm EDT\n18:38\n\nThe US embassy in Kabul has entered a lockdown due to a surge in coronavirus cases. “Military hospital ICU resources are at full capacity, forcing our health units to create temporary, on-compound Covid-19 wards to care for oxygen-dependent patients. 95% of our cases are individuals who are unvaccinated or not fully vaccinated,” the embassy said in a statement.All embassy personnel will be confined to their quarters, except for when they need to get food or exercise.  Afghanistan has seen a 2,400% rise in its infection rate over the past month, according to the International Federation of Red Cross and Red Crescent Societies. Hospitals and medical centers have been overwhelmed, and are short on supplies. Updated\n            at 6.44pm EDT\n\n\n5.50pm EDT\n17:50\n\nHallie GoldenThe last time Fochik Hashtali* spoke with her close friend Poe Jackson, he was telling her about his plans to start a mental health group for transgender people in Slab City, a section of southern California known for its community of squatters.It was a Saturday evening in April and the 21-year-old, who identified as Two Spirit, a term typically used to distinguish members of the Native LGBTQ+ community, had just moved to the area, according to Hashtali.After a childhood in Tennessee spent dealing with poverty and bullying, he had traveled to the encampment in the hopes of being accepted for who he was, Hashtali explained. Jackson, a Wyandot descendent, told Hashtali that he wanted to help people heal, “do art, calm down, talk about trauma healthily”.One month later, law enforcement recovered Jackson’s body from the Coachella Canal, near Slab City, and ruled his death a homicide.“I couldn’t believe it,” said Hashtali.“I was like a train wreck. I cried myself to sleep that night”.Violence against the Native LGBTQ+ and Two-Spirit community is prevalent. It stems from heteropatriarchal violence and racism coming together to put the community at an elevated risk. And yet it remains largely overlooked.The Sovereign Bodies Institute and the California Rural Indian Health Board, released a report this month highlighting the issue in California, which has more people of Native American or Alaska Native heritage than any other state in the US, according to the most recent census.The report found that of the 18 respondents who identified as Native LGBTQ2, 60% experienced domestic violence and 40% experienced child abuse. But perhaps most alarming was that almost all had experienced sexual assault and nearly 90% had experienced two or more forms of violence.“We know that Native people are targeted for violence because of racial stereotypes, jurisdictional complexities that in a general culture of lawlessness is created when law enforcement don’t respond meaningfully to crimes against Native people,” said Annita Lucchesi, a Cheyenne descendant and the founding executive director of the Sovereign Bodies Institute.“On top of that, law enforcement agencies especially can be a good ol’ boys club and can be very hyper-masculine, and are not necessarily spaces that are going to be welcoming or safe or supportive to folks in different gender and sexual identities,” she added.Read more: Updated\n            at 5.50pm EDT\n\n\n5.13pm EDT\n17:13\n\nVictoria BekiempisThe Earth is trapping nearly twice as much heat as it did in 2005, according to new research, described as an “unprecedented” increase amid the climate crisis.Scientists from Nasa, the US space agency, and the National Oceanic and Atmospheric Administration (Noaa), reported in a new study that Earth’s “energy imbalance approximately doubled” from 2005 to 2019. The increase was described as “alarming”.“Energy imbalance” refers to the difference between how much of the Sun’s “radiative energy” is absorbed by Earth’s atmosphere and surface, compared to how much “thermal infrared radiation” bounces back into space.“A positive energy imbalance means the Earth system is gaining energy, causing the planet to heat up,” Nasa said in a statement about this study.Scientists determined there was an energy imbalance by comparing data from satellite sensors – which track how much energy enters and exits Earth’s system – and data from ocean floats.This system of data-gathering floats, which stretches across the globe, allows for “an accurate estimate of the rate at which the world’s oceans are heating up”.Because about 90% of excess energy from an imbalance winds up in the ocean, the satellite sensors’ data should correspond with temperature changes in oceans.“The two very independent ways of looking at changes in Earth’s energy imbalance are in really, really good agreement, and they’re both showing this very large trend, which gives us a lot of confidence that what we’re seeing is a real phenomenon and not just an instrumental artifact,” said Norman Loeb, lead study author and a Nasa researcher.“The trends we found were quite alarming in a sense.”Read more:\n\n5.00pm EDT\n17:00\n\nThat’s it from me today. My west coast colleague, Maanvi Singh, will take over the blog for the next few hours.Here’s where the day stands so far:Maanvi will have more coming up, so stay tuned.Updated\n            at 5.08pm EDT\n\n\n4.40pm EDT\n16:40\n\nJoe Biden celebrated that Democrats and Republicans came together to advance the Juneteenth legislation this week.The Senate passed the bill unanimously by voice vote, while the House approved the proposal in a vote of 415 to 14. (All 14 “no” votes came from Republicans.)Republican Senator John Cornyn, one of the co-sponsors of the legislation, even stood behind Biden as he signed the bill into law.Onstage with Pres. Biden as he signs legislation designating Juneteenth a federal holiday: cosponsors Tina Smith, Ed Markey, Raphael Warnock, John Cornyn, Whip John Clyburn, Rep Barbara Lee, Rep Danny Davis, CBC Chair Joyce Beatty, Rep Sheila Jackson Lee, & activist Opal Lee. pic.twitter.com/DtFSgh6xRR\n\n4.23pm EDT\n16:23\n\nNow that Joe Biden has signed the Juneteenth bill, 19 June officially becomes a federal holiday just two days before America commemorates the end of slavery in the country.The US Office of Personnel Management confirmed earlier today that federal employees will get tomorrow off to observe the holiday because it falls on a Saturday this year.Today @POTUS will sign the Juneteenth National Independence Day Act, establishing June 19th as a federal holiday. As the 19th falls on a Saturday, most federal employees will observe the holiday tomorrow, June 18th.Updated\n            at 4.42pm EDT\n\n\n4.12pm EDT\n16:12\n\nJoe Biden was applauded at the White House as he signed the Juneteenth bill into law, officially making 19 June the 12th US federal holiday.The president handed out the pens he used to sign the bill to some of the lawmakers and activists who worked diligently for national recognition of Juneteenth, which commemorates the end of slavery in America.The first pen went to Opal Lee, the 94-year-old activist who has been pushing for years to make Juneteenth a federal holiday.Updated\n            at 4.43pm EDT\n\n\n4.09pm EDT\n16:09\n\nJoe Biden has now signed the bill to make Juneteenth, which commemorates the end of slavery in America, a federal holiday.“Today, we consecrate Juneteenth for what it ought to be, what it must be – a national holiday,” Biden said before signing the bill.\"Great nations don't ignore their most painful moments … We come to terms with the mistakes we made. And remembering those moments, we begin to heal and grow stronger.\"— President Biden before signing legislation to make Juneteenth a national holiday pic.twitter.com/44TI4I1rXGThe president emphasized the need for America to recognize and reckon with its history, even when that history is shameful.“Great nations don’t ignore their most painful moments,” Biden said. “Great nations don’t walk away. We come to terms with the mistakes we made. And remembering those moments, we begin to heal and grow stronger.” Just before signing the bill, Biden added, “I’ve only been president for several months, but I think this will go down for me as one of the greatest honors I will have had as president.”Updated\n            at 4.43pm EDT\n\n\n4.01pm EDT\n16:01\n\nKamala Harris reflected on the historic nature of the Juneteenth legislation and the presence of Black lawmakers who worked diligently to advance the bill.Harris, who is the first Black woman to serve as vice-president, told those at the White House for the bill-signing, “We are gathered here in a house built by enslaved people. We are footsteps away from where President Abraham Lincoln signed the Emancipation Proclamation.“And we are here to witness President Joe Biden establish Juneteenth as a national holiday. We have come far, and we have far to go, but today is a day of celebration.”VP Harris: \"We are gathered here in a house built by enslaved people. We are footsteps away from where President Abraham Lincoln signed the Emancipation Proclamation. And we are here to witness President Joe Biden establish Juneteenth as a national holiday. We have come far\" pic.twitter.com/XO5uU265UV", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/us-news/live/2021/jun/17/us-juneteenth-federal-holiday-congress-joe-biden-us-politics-latest-updates", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}