{"Type": "", "Time": "2021-06-17", "Headline": "\nCOVID-19 origins probe should shift to U.S., says China disease expert - The Hindu\n", "Text": "\nChinese Foreign Ministry spokesperson Zhao Lijian. File photo\n  | Photo Credit: \nAP\n  senior Chinese epidemiologist said the United States should be the priority inthe next phase of investigations into the origin of COVID-19 after a study showed the disease could have been circulating there as early as December 2019, state media said on Thursday.The study, published this week by the U.S. National Institutes for Health (NIH), showed that at least seven people in five U.S. states were infected with SARS-CoV-2, the virus that causes COVID-19, weeks before the United States reported its first official cases.A China-World Health Organization (WHO) joint study published in March said COVID-19 most likely originated in the country's wildlife trade, with the virus passing into humans from bats via an intermediary species.But Beijing has promoted the theory that COVID-19 entered China from overseas via contaminated frozen food, while a number of foreign politicians are also calling for more investigations into the possibility it leaked from a laboratory.Zeng Guang, chief epidemiologist with the Chinese Center for Disease Control and Prevention, told state-owned tabloid the Global Times that attention should shift to the United States, which was slow to test people in the early stages of the outbreak, and is also the home of many biological laboratories.\"All bio-weapons related subjects that the country has should be subject to scrutiny,\" he was quoted as saying.Commenting on the U.S. study on Wednesday, Foreign Ministry spokesman Zhao Lijian said it was now \"obvious\" the COVID-19 outbreak had \"multiple origins\" and that other countries should co-operate with the WHO.The origin of the pandemic has become a source of political tension between China and the United States, with much of the recent focus on the Wuhan Institute of Virology (WIV), located in Wuhan where the outbreak was first identified in late 2019.China has been criticised for its lack of transparency when it comes to disclosing data about early cases as well as the viruses studied at WIV.A report by a U.S. government national laboratory concluded that it was plausible that the virus had leaked from the Wuhan lab, the Wall Street Journal reported earlier this month.A previous study has raised the possibility that SARS-CoV-2 could have been circulating in Europe as early as September, but experts said this didn't necessarily mean it did not originate in China, where many SARS-like coronaviruses have been found in the wild.\n\n\n\n\n Our code of editorial valuesPlease enter a valid email address.\nPrintable version | Jun 17, 2021 9:08:54 PM | https://www.thehindu.com/news/international/covid-19-origins-probe-should-shift-to-us-says-china-disease-expert/article34837056.ece\n\n© THG PUBLISHING PVT LTD.\n\nA video on the protests in Budapest against the building of a Fudan University campus in the city\n\nDiplomatic Affairs Editor Suhasini Haidar discusses what led to the country's current vaccine crisis\n", "Section": "", "Writers": "", "URL": "https://www.thehindu.com/news/international/covid-19-origins-probe-should-shift-to-us-says-china-disease-expert/article34837056.ece", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}