{"Type": "", "Time": "2021-06-18", "Headline": "Israel launches new airstrikes on Gaza in response to incendiary balloons | Israel | The Guardian", "Text": "Military says it is prepared for all scenarios including ‘resumption of hostilities’Last modified on Thu 17 Jun 2021 19.41 EDTIsrael has launched airstrikes on the Gaza Strip for a second time since a shaky ceasefire ended last month’s 11-day war.The strikes late on Thursday came after activists mobilised by Gaza’s militant Hamas rulers launched incendiary balloons into Israel for a third day running. The balloons are basic devices intended to set fire to farmland and bush surrounding the Gaza enclave.There were no immediate reports of casualties from the strikes, which could be heard from Gaza City. Israel also carried out airstrikes early on Wednesday, targeting what it is said were Hamas facilities, without killing or wounding anyone.The military said fighter jets struck Hamas “military compounds and a rocket launch site” late on Thursday in response to the balloons. It said its forces were preparing for a “variety of scenarios including a resumption of hostilities.”Rocket sirens went off in Israeli communities near Gaza shortly after the airstrikes. The military later said they were triggered by “incoming fire, not rockets”.Surveillance camera footage obtained by Associated Press showed what appeared to be heavy machine-gun fire into the air from Gaza, a possible attempt by Palestinian militants to shoot down aircraft. Other footage showed projectiles being fired from Gaza, but it was unclear what kind or where they landed.Tensions have remained high since a cease-fire halted the conflict on 21 May, even as Egyptian mediators have met with Israeli and Hamas officials to try and shore up the informal truce.The conflict killed 260 Palestinians including some fighters, according to Gaza authorities. In Israel, 13 people were killed, including a soldier, by rockets fired from Gaza, the police and army said.This week’s airstrikes on Gaza were the first under Israel’s new government headed by Naftali Bennett, whose ideologically disparate coalition on Sunday ousted long-serving prime minister Benjamin Netanyahu.Earlier on Thursday, Israeli police used stun grenades and a water cannon spraying skunk water to disperse Palestinian protesters from Damascus Gate in east Jerusalem, the centre of weeks of protests and clashes in the run-up to the Gaza war.After the crowds were dispersed, Palestinians could be seen throwing rocks and water bottles at ultra-Orthodox Jews walking in the area.Calls had circulated for protesters to gather at Damascus Gate in response to a rally held there by Jewish ultranationalists on Tuesday in which dozens of Israelis had chanted “Death to Arabs”. The police had forcibly cleared the square and provided security for that rally, part of a parade to celebrate Israel’s conquest of east Jerusalem.In a separate incident, a Palestinian teenager died Thursday after being shot by Israeli troops in the occupied West Bank during a protest against a settlement outpost, the fourth demonstrator to be killed since the outpost was established last month.The Israeli military said Wednesday that a soldier stationed near the wildcat outpost in the West Bank saw a group of Palestinians approaching, and that one “hurled a suspicious object at him, which exploded adjacent to the soldier.” The army said that the soldier fired in the air, then shot the Palestinian who threw the object.The Palestinian health ministry said on Thursday that Ahmad Shamsa, 15, died of a gunshot wound sustained a day earlier.Settlers established the outpost, which they refer to as Eviatar, near the northern West Bank town of Nablus last month and say it is now home to dozens of families. Palestinians say it is built on private land and fear it will grow and merge with other large settlements nearby.Associated Press and Agence France-Presse contributed to this report", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/world/2021/jun/18/israel-launches-new-airstrikes-gaza-incendiary-balloons", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}