{"Type": "Sport", "Time": "2021-06-18", "Headline": "Football: Denmark's Eriksen to get heart starter implant after collapse on pitch", "Text": "COPENHAGEN: Denmark's Christian Eriksen will get a heart starter device implanted after his collapse during Denmark's Euro 2020 opener on Saturday (Jun 12), the team's national team doctor said in a statement on Thursday.\"After Christian has been through different heart examinations it has been decided that he should have an ICD (heart starter),\" doctor Morten Boesen said.He added that such a device is necessary after a cardiac attack due to rhythm disturbances.Gunnar Gislason, head of research at the Danish Heart Foundation and a professor of cardiology, told Reuters that a return to elite sport after the insertion of an ICD is possible.\"It really depends on the condition you are treating, what kind of heart disease you are suffering from, that's very individual, (but) there are examples of top athletes that have come back to the field and restart normal activity,\" he said.The operation to insert an ICD takes one to two hours and is done under local anaesthetic, Gislason explained, with patients usually kept in an extra day to calibrate the unit and ensure there are no issues with its operation.\"It's like a monitor, it monitors the rhythm of the heart. For most people, they will never have to use it, but for those who maybe have a serious cardiac arrhythmia or cardiac arrest, the ICD can detect it and respond to it,\" Gislason said.Daley Blind, a former team mate of Eriksen's at Ajax Amsterdam, had an ICD fitted after collapsing in a friendly against Hertha Berlin in 2020 and was part of the Netherlands side that faced Ukraine less than 24 hours after Eriksen's collapse.After the game Blind spoke of his distress at seeing his friend fall to the ground, saying \"it made me sleep badly and also really think about not playing, it was a big mental hurdle to overcome, but I'm glad I did.\"Blind's career could have ended following his own collapse, but doctors inserted an ICD and he was cleared to return to football.\"It (the ICD) has two main functions. It can try to override the fast heart rhythm and in that way take control of the rhythm of the heart and then slowly go down and restore the normal heart rhythm,\" Gislason explained.\"If it doesn't succeed with that, it will give a shock, like a normal defibrillator, and it will try to regenerate a normal heart rhythm in that way, so it's a life-saving device for those who have a serious cardiac arrhythmia or cardiac arrest.\"Danish fans at Radhuspladsen in Copenhagen on Thursday were unanimous in their desire to see Eriksen back on the field.\"Christian Eriksen has to play - he's a national symbol, a legend, so of course I want him to play,\" Anton Olesen told Reuters ahead of Denmark's second Group B game against BelgiumIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Denmark,Christian Eriksen", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/football-denmark-s-eriksen-to-get-heart-starter-implant-after-15033472", "Source": "google"}