{"Type": "", "Time": "2021-06-17", "Headline": "Centuries-old shipwrecks found off Singapore", "Text": "Two centuries-old shipwrecks packed with ceramics and other artefacts have been found off Singapore in a rare discovery that will shed light on the city-state's maritime heritage, archaeologists said Wednesday.The prosperous island nation has long been a key trading hub on global shipping routes connecting the Indian Ocean and the South China Sea.The wrecks were found off Pedra Branca, a rocky outcrop east of Singapore, according to the National Heritage Board and think tank the ISEAS-Yusof Ishak Institute, which worked together on the project.The first wreck, discovered after divers accidentally came across ceramic plates in 2015, was carrying Chinese ceramics that possibly date back to the 14th century, when Singapore was known as Temasek.Some of the items were similar to artefacts found in archaeological digs on land, which showed that Singapore was a trading hub well before the arrival of British colonisers in 1819.Undersea excavations on the first wreck led to the discovery of the second, which is likely to be the Shah Munchah, a merchant vessel built in India that sank in 1796 while sailing from China to India.Items recovered from the second wreck ranged from Chinese ceramics to glass and agate objects, as well anchors and cannons, the heritage board and think tank said.The survey and recovery of artefacts from the two wrecks was completed this year.Such cannons were typically mounted on merchant ships used by the East India Company --- the trading behemoth through which the British empire expanded in Asia -- in the 18th and 19th centuries, they added.The vessel discovered in 2015 was the first ancient shipwreck to be found in Singapore's waters.It was carrying \"more Yuan dynasty blue-and-white porcelain than any other documented shipwreck in the world,\" said Michael Flecker, a visiting fellow at the ISEAS-Yusof Ishak Institute's archaeology unit.\"Many of the pieces are rare, and one is believed to be unique.\"The Yuan dynasty existed in what is now China in the 13th and 14th centuries.Much of the Chinese cargo in the second wreck was destined for eventual shipping to Britain, said Flecker.mba/sr/qanFormer Taiwanese president Ma Ying-jeou has called on the government to listen to public opinion and allow civilian groups which have different political leanings to the ruling Democratic Progressive Party to import much-needed Covid-19 vaccines. Taiwan, which is battling a surge in cases, has struggled to secure vaccines although it has signed deals to buy 10 million doses from AstraZeneca, 5 million from Moderna and more than 4.7 million doses via the Covax Facility, which is supported by theChina and other nations were attempting to “seize control” of strategically important international organisations so they could be “weaponised”, a new report by the UK parliament’s influential Foreign Affairs Committee said. The report, published Thursday, accused China in particular of “bullying” states to back their position or their candidates for top jobs, using measures including financial leverage “to shift policies away from the cooperation the organisations were created to promote”. TheMeet the PayPal business debit card. Use it everywhere Mastercard® is accepted.If you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Browsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.The PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saNew $89 Portable Air Cooler Everyone In The U.S. Is Talking AboutA reporter with a pro-Beijing newspaper in Hong Kong accused of making a false statement when accessing a government car registry has been let off the hook after prosecutors agreed to drop the charge on condition of a binding-over order. The prosecution’s decision stood in marked contrast to the justice department’s handling of a case last year involving an RTHK contributor accused of the same act, prompting Principal Magistrate Ivy Chui Yee-mei to question the difference in approach at ThursdayBeijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityThe scientific community should find ways to overcome political divides and push for more collaboration in space exploration, as well as solve global problems by making use of China’s new space station, a Hong Kong-based space expert says. Professor Quentin Parker, head of the Laboratory for Space Research at the University of Hong Kong, made the remarks ahead of China’s first crewed space flight in nearly five years, with three astronauts expected to travel to its new Tiangong space station forLastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Washington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HouseThe US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Hong Kong immigration officials will renew the visas of all of Cathay Pacific’s expatriate pilots, but its large contingent of foreign cabin crew will be denied extensions permitting them to remain based in the city, the airline has said. The decision leaves Cathay’s foreign cabin crew at risk of losing their jobs, with the airline saying it would offer the same voluntary redundancy package to affected staff that it offered to others in late April. In its memo on Thursday, Cathay expressed regreEvery PC user must read this in 2021 - Do it now.China’s efforts to carve out global market share for its narrow body C919 passenger plane face a fresh hurdle after the United States and the European Union (EU) agreed to a truce in their near 17-year conflict over aircraft subsidies, analysts say. The US and EU announced on Tuesday a five-year suspension of tariffs and plan to establish a working group to address “non-market practices” in other countries, most notably China. China has spent tens of billions of dollars to develop the C919 jet,The freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.Israel's ultra-Orthodox parties were once viewed as political kingmakers, but now they have been pushed into opposition by a \"change\" government they fear will put secular values before theirs.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).For Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.Los Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.Chinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiNew research has identified TEN favorite stocks for the upcoming yearIf you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.The field of candidates in Iran's presidential election thinned out Wednesday, two days before the vote in which a victory by ultraconservative cleric Ebrahim Raisi is widely seen as a foregone conclusion.The strategic partnership sees EMERGE working with Mediacorp's Bloomr.SG network to \"develop the knowledge and skills of up-and-coming\" content creators in esports.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/centuries-old-shipwrecks-found-off-093907017.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}