{"Type": "", "Time": "2021-06-17", "Headline": "Powell Surprise Marks Start of Fed's Treacherous Retreat - Bloomberg", "Text": "Market conditions make this as good a time as any to signal the descent from a mountain of monetary support.He’ll be coming down the mountain.Photographer: Samuel Corum/Getty ImagesTo get John Authers' newsletter delivered directly to your inbox, sign up here.The best investors are opportunists. We all know that. The same applies to central bankers.I’ve spent the last week puzzling over how bond yields have managed to come down so far amid evidence that the recovery is bubbling along nicely. I have no idea what conclusions Jerome Powell and his colleagues came to about this, but they evidently decided that this gave them a great opportunity to start the long and potentially treacherous retreat from the pandemic crisis measures put in place more than a year ago. The instant market response suggests the Fed got what it wanted; a sharp change in expectations that doesn’t — yet — take financial conditions to any dangerous place.Market ConditionsHow easy were conditions? Entering the meeting, for the first time on record, even junk bonds were yielding less than inflation:The same is true of dividend yields on real estate investment trusts. REITs and the increasingly inappropriately named high-yield bond sector both offer classic ways to earn more in return for taking some extra risk — and neither any longer offers a yield that matches the current rate of inflation. Powell didn’t talk about macro-prudential issues on Wednesday, and he wasn’t pressed on them, but a chart like this must be good evidence that conditions are dangerous:As for Treasury bonds, the menacing rise in yields earlier this year had been negated over the last two months. Looking at Treasury inflation-protected securities, or TIPS, gives the best handle on how loose conditions had become. This is what had happened to five- and 10-year inflation-linked yields since the beginning of last year:There was a pretty violent reaction to Powell’s words in afternoon trading. This brought the five-year real yield to its highest of the year. But as this is still minus 1.51%, it looks like a decent opportunity to tighten. Ten-year yields, which also jolted violently upward, are still well below their peak in March. There’s an argument that the bond market already had one tantrum to start the year. If so, it helped prepare everyone for the next step up in yields, and Powell took an opportunity to change the messaging when people were ready, even if they weren’t expecting it.The Instant ReactionThe meeting provoked the fourth-greatest negative reaction on the five-year Treasury in 80 Federal Open Market Committee meetings since 2011, according to Mitsubishi UFJ Financial Group Inc.:Putting this in context, George Goncalves, head of U.S. macro strategy for MUFG, said:Heading into this meeting I did not even entertain a hawkish scenario, as it felt so remote given the past year of nonstop easing. Geez was I wrong… the other three bigger sell-offs were the June 2013 Bernanke taper slip (which added to the tantrum selling that summer), the March 2014 Yellen comment that hikes would start 6 months after tapering ends and the Dec-2016 post Trump reflation fears 2nd Fed hike. All are tough acts to follow.This is a bona fide shock, even though it comes after the market had set itself up for one. The response from stocks wasn’t as negative. The S&P 500 closed 0.3% down from its level at 2 p.m. when the Fed statement was published. That was exactly in line with the average on FOMC days while Powell has been at the helm, according to this fascinating chart from Bespoke Investment Group:The Powell Fed has powered quite a rally in equities, but that hasn’t always been obvious immediately. The Fed chairman who most reliably spurred stock markets higher was Ben Bernanke — quite a remarkable achievement as he was at the helm through 2007 and 2008. So the two key points are that a) the negative impact on stocks wasn’t that serious, but b) the way the stock market moves in the two hours after an FOMC meeting isn’t terribly significant for the longer term.The Wider ImpactOne of the clearest impacts of a change in direction is on the dollar. If the Fed is more prepared to tighten than previously thought, that should strengthen the currency. This was the best day in more than a year for Bloomberg’s dollar index, which shows its performance against a basket of 10 other currencies:George Saravelos, the influential foreign exchange strategist for Deutsche Bank AG in London, advised investors to close the position he had previously recommended of being long in the euro against the dollar. He said: A key element of our dollar negative view was a persistently dovish Fed that remained purposefully behind the curve and intentionally depressed interest rate volatility. The FOMC meeting today did not meet that bar. The Fed now projects two rate hikes for 2023, the language on inflation shifted to more explicitly acknowledging upside risks, and commentary on the labour market - an excuse to sound dovish - sounded optimistic.Saravelos also suggested that the “transitory” inflation narrative (a word that scarcely appeared Wednesday) had been a form of calendar-based guidance, by saying that the Fed would ignore any bad inflation numbers in 2021, while they were still affected by comparisons to the plague year. With plenty of room for U.S. real rates to rise, that is bullish for the dollar. With the Fed now more likely to move in response to data, that should also mean higher volatility — which is also generally good for the dollar, as it is regarded as a haven in times of uncertainty.A stronger dollar might create problems for emerging markets, whose currencies sold off quite sharply. Emerging markets wobbled close to disaster in the aftermath of the 2013 taper tantrum. This time, taper talk may be safer because their currencies have been strengthening from an all-time low:But this brings the crucial question of whether we can avoid a repeat of the taper tantrum. That happened when Bernanke said the time would come to reduce the Fed’s asset purchases. The real 10-year yield rocked higher, having been barely above its low set the year before when he spoke.If the sharp rise in real yields that started this year really was the post-pandemic version of the tantrum, then everyone has got off lightly. In the following chart, I aligned the beginning of this year — when the tantrum began to take hold — with May 2013, when Bernanke made his fateful comments. With the exception of the brief and dramatic head fake when the bond market broke down in March last year, the 12 months leading up to the two incidents looks very similar, with real yields declining, and then wobbling at a low for months.But the increase in 2013 was vastly greater than anything we have seen so far. Indeed, even after Wednesday’s market reaction, the real 10-year yield remains lower than its trough from 2012 and 2013. It’s possible that the last few months have seen the bond market try to come to terms with a likely bout of inflation and the Fed’s probable response, creating an opportunity for the central bank to begin its retreat; but there is also an argument that we ain’t seen nothin’ yet.There is one other factor to take into account. U.S. GDP growth for 2013 was 2.6%, rising to 2.9% the following year. (Remarkably, and sadly, this remains the best calendar year for growth since the crisis). The Fed’s prediction for this year is 7%, to be followed by 3.3% in 2022. That provides quite a strong tail wind for yields, as does the risk of persistent inflation.Market conditions may well make this as good a time as any to start the descent. Extraordinary low yields mean the Fed has to embark on the journey soon. But risks of a tantrum remain.What He Said….Now, what exactly has the Fed done, and why has it elicited such a response? Yesterday, I warned there was a risk that a shift by two or three Fed governors in their predictions for rates by the end of 2023 could be given exaggerated importance. I didn’t get what was about to happen. There was a major shift in predictions for 2023, which plainly changed the balance on the committee. The market reaction might overstate its importance, but it needs to be taken seriously.This is easiest to illustrate by putting the 2023 dot plots from March and June side by side. In the chart below, March appears on the left. Each horizontal line represents a 25-basis-point increment. Dots on the lowest level indicate that interest rates will be between 0% and 0.25% by the end of 2023; any dots on the top line would predict rates between 1.75% and 2%:From this we can see that there is little unanimity in the committee on where rates will be 30 months from now. But the strong consensus that they would stay negligible until then has decisively broken. In the wake of the strongest inflation reading in almost three decades, this seems only reasonable. To ram home the point, Powell told journalists, in as many words, that this meeting should be treated as the one in which the FOMC had “talked about talking about tapering.” That means that it cannot announce a taper with immediate effect next month, but he does have the right to announce plans or criteria for doing so at that point.There isn’t as much need for minute textual analysis as there usually is on FOMC days. While emphasizing the inequality of unemployment, and how it was particularly falling on minorities, Powell was generally more upbeat on the prospects for improvement, while admitting to at least some doubts that the current high inflation would be wholly transitory. It wasn’t a pivot, but the shift on the road toward removing policy accommodation has started. Many, myself included, were surprised. That shows up clearly in market reactions. You could say that Powell chose to rip off the Band-Aid, when the patient was safely numbed by a massive dose of anesthetics (in the form of low rates). That he was probably right to embark on the journey now, and not delay, comes through from the comments by investors.Perhaps my favorite response came from Christopher Smart, chief global strategist at Barings LLC: As good as Chair Jay Powell is at keeping a straight face, it would be hard even for him to credibly deliver the same message he has had since the depth of the crisis given the reality that has unfolded around him.Powell stressed that the data is messy and that we are living through unprecedented times, economically. But imagine the alternative to the current outlook. If the Fed isn’t raising rates by late 2023 amid massive fiscal support and growth rates we haven’t seen in decades, then the recovery is seriously off track, the current data flows are completely wrong and the principles of economics we were taught in school are entirely misguided.That about says it. I’m a little ashamed to have been surprised. This was as good a chance as Powell had to get markets ready for the fact that plan a) must be to retreat from the infeasibly generous policies currently in place. The reaction so far is nothing too scary. But descending a mountain is always more dangerous than climbing it. Now the retreat has started, we have to accept the risks of accidents along the way (whether a taper tantrum, some hedge funds caught on the wrong side of a trade, a broader stocks selloff, or problems for emerging markets). The public health crisis looks as though it’s almost over, while a financial crisis so far has been avoided. The trickiest stage has now arrived. Good luck everyone. After I suggested some Renaissance motets by Josquin Desprez yesterday, I’ve had some messages asking about my musical taste. I  need different music for different moods and needs. Sometimes, I like sublime choral polyphony. Today, however, when I was expecting a snoozefest of an FOMC meeting, I didn’t feel like listening to Josquin. Here are some of the sweet ditties that helped me through the last few hours, for when you have a similarly trying afternoon: Leave Them All Behind, by Ride; Good Times Bad Times and Whole Lotta Love by Led Zeppelin; Fly Away by Lenny Kravitz; Ace of Spades by Motorhead; I Will Follow by U2; Alternative Ulster by Stiff Little Fingers; Going Undergound by The Jam; Spellbound by Siouxsie and the Banshees; Smells Like Teen Spirit by Nirvana; and This Is The One by the Stone Roses. I should also mention The Headmaster Ritual by The Smiths, which I should have included last week for its prominent bass line.   This column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners.To contact the author of this story:John Authers at jauthers@bloomberg.netTo contact the editor responsible for this story:Matthew Brooker at mbrooker1@bloomberg.net", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/opinion/articles/2021-06-17/powell-surprise-marks-start-of-fed-s-treacherous-retreat", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}