{"Type": "", "Time": "2021-06-17", "Headline": "Lady Loki explained: who is the character revealed in Loki episode 2? | TechRadar", "Text": "TechRadar is supported by its audience. When you purchase through links on our site, we may earn an affiliate commission. Learn more\nBy\nTom Power\n16 June 2021\nMajor spoilers follow for Loki episode 2 on Disney PlusSpoilers follow for Loki episodes 1 and 2.Loki on Disney Plus isn’t hanging around with its big character reveals. Episode 2 of Marvel’s latest TV show has only just been released but, unlike WandaVision or Falcon and the Winter Soldier, we aren’t being made to wait for surprise character introductions. We already knew that Loki (Tom Hiddleston) would run into another Loki ‘time variant’. Agent Mobius (Owen Wilson) stated as much in episode 1’s final scene – but we didn’t expect the identity of this other Loki ‘time variant’ to be revealed so soon.We imagine you have questions about this character, so we’re here to help. Below, we’ll dive into their comic book history and which actor portrays them in the series. We also look at what their introduction may mean for the show moving forward and why this character may not actually be who we think it is.We’re entering major spoiler territory for Loki episode 2 from this point on. If you haven’t watched it all the way through yet, turn back now. After tracking down the ‘variant’ to a world-ending event in 2050, Loki, Mobius and a TVA squad split up to cover more ground and locate them.Loki pairs up with Hunter B-15 (Wunmi Mosaku) and the duo soon encounter a single male, who is inexplicably shopping for plants as a massive storm rages outside.When Hunter B-15 moves closer to interrogate him further, however, the male grabs B-15’s arm and seemingly transfers his consciousness into her.Yep, the person hiding inside the man (who transfers themselves into Hunter B-15) is none other than the Loki ‘variant’.The two versions of Loki verbally lock horns (all the while the Loki ‘variant’ continues to transfer themselves into other human vessels, to keep things interesting) before their plan is revealed.After stealing enough of the TVA’s time reset charges – the devices that destroy offshoot branches from the sacred timeline – the Loki ‘variant’ plans to activate them all at once. Creating a massive surge in Nexus events, multiple timelines will branch off from the sacred timeline, cause reality to break down and presumably lead to a new multiversal war, as alluded to in episode 1.Before setting their scheme in motion, though, the Loki ‘variant’ finally reveals who they are – Lady Loki. Yes, you read that right: a female version of Loki.Lady Loki’s reset charges activate, they travel to different dimensions in time and cause multiple branches to branch off from the sacred timeline. Lady Loki leaves through her own time travel doorway and, despite Mobius’ last-ditch attempts to stop him, Loki follows his namesake through the portal, presumably to get to the bottom of who they really are.Sophia Di Martino. The British actress, who has appeared in TV shows including Silent Witness, was rumored to be playing Lady Loki in Marvel’s latest series, and now we have confirmation that she is.As Loki’s TV show was being filmed, leaked on-set images appeared to show Di Martino in a very Loki-like costume. At the time, we speculated that this was who Di Martino would be in the series, and we’re glad to see we were right. Lady Loki is a fairly new addition to Marvel Comics. Created for a 2008 Thor comic issue run by J. Michael Stracynski, Lady Loki is, well, Loki reborn in female form.Lady Loki emerged following Marvel Comics’ version of Ragnarok, and went on to be the primary version of Loki through several other comic storylines including Dark Reign, New Avengers and Original Sin.As it turns out, Lady Loki hadn’t replaced the male Loki that comic readers had known since his first appearance in October 1962’s Journey into Mystery #85 comic. Lady Loki is Loki and, instead of being one of his many tricks, Lady Loki is one of many of the character’s personae.This, in turn, led to the revelation that Loki is genderfluid. Lady Loki, then, retains the personality, mischievous ways, abilities and other traits that Loki has – the only difference is that this iteration of the character is female instead of male.It’s a part of the character that has been adopted in the MCU, too. As episode 1’s end titles sequence (and the official Loki Twitter account) revealed, the TVA has a file on Loki that confirms the character is genderfluid.Given episode 2’s events, we can safely assume that Loki will follow Lady Loki across multiple realities (as we’ve seen in the trailers) to discover the reason behind their universe-ending plan.Our guess is that the TVA betrayed Lady Loki and she’s exacting revenge by destroying the so-called sacred timeline.After all, there’s something shady about the TVA. Maybe they offered Lady Loki a similar deal to the one that Mobius gave Loki (an audience with the Time Keepers) and then reneged on that agreement once they had used Lady Loki for whatever they needed.If that is the case – and this is purely speculation on our part – we could see a tug of war, between Lady Loki and the TVA, play out for Loki’s loyalty.Loki will be aware that, if he crosses the TVA, he’ll lose the opportunity to potentially speak with the Time Keepers. There’s also the fact that the TVA will delete him from existence so, theoretically, it’s in his best interests to remain loyal to them.However, Loki is a schemer – so Lady Loki, by definition, should be, too. The latter could conceivably persuade Hiddleston’s Loki to join her cause instead, enlist his help in causing multiversal mayhem and they could rule the Marvel Cinematic Multiverse (MCM) together in some way.Loki’s trailer appeared to show the pair having a (potentially pleasant) chat on an unknown planet. Of course, we don’t know when this conversation will take place in Loki’s TV show but, for all intents and purposes, it seems to be pretty civil. If it is, this could be when Loki joins forces with Lady Loki to take on the TVA.Alternatively, it may be that Di Martino's character isn't, in fact, Lady Loki at all.According to episode 2's end credits, Di Martino is playing a character called Sylvie – and this individual is completely different from Lady Loki in Marvel comics.How do we know Di Martino's character is called Sylvie? Take a look at the Castellana dubbed voice actors' roster right at the end of episode 2. You'll see someone else (Elisa Beuter) voicing Di Martino's character, who is referred to as Sylvie:Hang on, how do we know Beuter is the voice actor dub for Di Martino? Take a look at the German language dub image below, and you'll see Sonja Spuhl voices a character called 'the variant'. This has to be the same character as Sylvie, as both characters are second only to Loki in their cast order importance:If Di Martino's character is called Sylvie, there's only one Marvel comic character that this can be referencing: Sylvie Lushton, aka Enchantress.In the comics, Sylvie is an average teenage girl living in Oklahoma until the Asgardians move their Asgard home to the same state. Not long after, Sylvie wakes up with magical powers and adopts the pseudonym Enchantress – a character who is as much of an anti-hero/villain as Loki.As it turns out, Sylvie obtains her powers from Loki, including sorcery, teleportation and telekinesis. Judging by the first two episodes of Loki, we've seen Di Martino's character use similar abilities to possess people and, well make her hands glow green.It's highly plausible, then, that this is Enchantress and not Lady Loki as we first suspected. As far as we're aware, Enchantress doesn't wear a crown with two horns (a la Loki) in the comics, but Di Martino is sporting such a head accessory in Loki episode 2. This certainly muddies the waters as to who Di Martino is actually playing. Whatever happens, or whoever Di Martino is portraying, it’ll be interesting to see how the rest of Loki’s TV series plays out. There are bound to be more twists along the way and we can’t wait to see what occurs.Sign up to get breaking news, reviews, opinion, analysis and more, plus the hottest tech deals!Thank you for signing up to TechRadar. You will receive a verification email shortly.There was a problem. Please refresh the page and try again.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\nFuture Publishing Australia ABN: 96 734 906 323 | PO Box 1077, Mount St,\nNorth Sydney\nNSW 2059. ", "Section": "", "Writers": "", "URL": "https://www.techradar.com/sg/news/lady-loki-explained-who-is-the-character-revealed-in-loki-episode-2", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}