{"Type": "Singapore", "Time": "2021-06-18", "Headline": "Integrated Shield Plans to cover hospitalisation for COVID-19 vaccines brought in under special access route", "Text": "SINGAPORE: All seven insurers offering Integrated Shield Plans are extending their coverage of hospitalisation resulting from COVID-19 vaccine complications to include vaccines brought in under the special access route, such as the Sinovac jab.This will apply to policyholders who receive COVID-19 vaccines that are approved by the World Health Organization (WHO) under its emergency use listing and administered in Singapore under the special access route, said the Life Insurance Association, Singapore (LIA Singapore).The additional coverage will be provided until Dec 31, said the association on Thursday (Jun 17).It added that it will work with insurers for any consideration of extensions to the duration of coverage, alongside monitoring the evolving COVID-19 situation.Currently,only the Sinovac vaccineis administered under the special access route, which allows private healthcare institutions to bring in unregistered COVID-19 vaccines.Vaccines brought in under the special access route must be on the WHO's emergency use listing. The listing also includes shots by Johnson & Johnson, AstraZeneca and Sinopharm.Hospitalisation for complications arising from the Pfizer-BioNTech and Moderna vaccines, which have been approved by Singapore's Health Sciences Authority and are part of the country's national inoculation programme, isalready covered under Integrated Shield Plans. Both are messenger RNA (mRNA) vaccines.\"We understand that some Singaporeans may wish to receive vaccination under (the special access route) and hope that our member insurers' proactive commitment in extending inpatient hospitalisation benefits for complications can provide assurance that such (Integrated Shield Plan) policyholders will be covered,\" said LIA Singapore president Khor Hock Seng.The Sinovac jab, an inactivated virus vaccine, is free for those who were previously rejected from taking the mRNA vaccines due to severe allergies or allergic reactions to the first dose. Others who prefer the Sinovac vaccine for non-medical reasons pay an administrative fee to the private healthcare providers.Those who take the Sinovac vaccine are not covered under the Vaccine Injury Financial Assistance Programme for COVID-19 Vaccination.Integrated Shield Plans are made up of two components – MediShield Life run by the Central Provident Fund Board and an additional private insurance coverage component run by insurance companies. The latter covers hospitalisation in A- and B1-type wards in public hospitals as well as private hospitals.Insurers offering Integrated Shield Plans are: AIA, Aviva, AXA, Great Eastern Life, NTUC Income, Prudential and Raffles Health Insurance.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,insurance", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/covid-19-vaccine-integrated-shield-plan-insurance-sinovac-sar-15034364", "Source": "google"}