{"Type": "", "Time": "2021-06-17", "Headline": "What Real Madrid must look for in Ramos replacement – Yobo | Goal.com", "Text": "Nigerian football great Joseph Yobo has advised Real Madrid to target a centre-back with a ‘strong character’ and ‘strong personality’ as a replacement for Sergio Ramos.Ramos joined  Los Blancos  from Sevilla in 2005 and went ahead to play over 670 games for the Santiago Bernabeu giants.As the 2021-22 season draws closer, the 34-time La Liga kings are expected to bolster their backline with another world-class centre-back.Nonetheless, the Super Eagles assistant coach has provided his recommendations on what the Spanish top-flight side must consider while thinking of replacing their prized asset.“They have [Raphael] Varane who is very good, but you need somebody to complement him,” Yobo told  Goal. “One of the criteria to consider before bringing a new defender is that such player must be a good footballer.“Also, getting someone with a strong personality, strong character and presence on that field matters a lot for Real Madrid.“As a defender, Ramos was charismatic, scores a lot of goals and the advantage he has brought to that team was immense and unquantifiable.“That is the calibre of replacement they should be looking at – which is never going to be easy and tough luck for whoever is coming to fill those shoes.”Meanwhile, Ramos revealed that he wanted to accept the club’s offer of a one-year extension but was told that he had ran out of time.\"The club made me a one-year offer with a salary reduction. I have to say that there was no economic problem. I wanted two years and peace of mind for me and my family,” he told the media.\"During the last talks, I accepted the one-year offer, but I was informed that it was no longer possible, that it had an expiration date and that I had not heard about it.\"The conditions have changed several times, on their part and on ours. \"It got to a point where we had to make a decision, but they never told me that the offer had an expiry date. It's understandable but it surprised me, that the offer had expired.\"The Spain international leaves behind an awe-inspiring legacy in Madrid, having won five La Liga titles, two Copas del Reys, four Supercopas de Espana, four Champions Leagues, three Uefa Super Cups and four Club World Cups.", "Section": "", "Writers": "", "URL": "https://www.goal.com/en-sg/news/what-real-madrid-must-look-for-in-ramos-replacement-yobo/1gt0ws33aiqem1xejnrs3it4o1", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}