{"Type": "", "Time": "2021-06-18", "Headline": "Serial flasher back in jail for targeting 9-year-old girl five months after his release, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A serial flasher who was released from prison last October reoffended about four months later, in February this year.He exposed himself at a sheltered walkway of City Hall Square shopping mall in Coleman Street.The following month, Budiman Shah Mohd Noorel Azman spotted a nine-year-old girl at a bus stop along Newton Road and flashed his private parts at her.The 36-year-old Singaporean was on Wednesday (June 16) sentenced to 11 months and 20 days' jail after he pleaded guilty to one count of sexually exposing himself.Three other similar charges were considered during sentencing, including for the February offence.Deputy Public Prosecutor Goh Qi Shuen said that the recalcitrant offender was earlier sentenced to 19 months' jail in 2019 after he pleaded guilty to three counts of insulting a woman's modesty.At the time, his victims included three minors, including an eight-year-old girl. He served his sentence and was released last year.Budiman's latest offences saw him first target a woman on the morning of March 29 this year. He spotted his victim at a bus stop across the road as he was walking towards Newton MRT station at around 7.30am.He then walked towards her and pulled down his tights to expose his genitals.The DPP said: \"He deliberately stood in a position where he thought she would look towards when flagging down a bus.\"However, as he did not observe any reaction from her, he did not derive the sexual gratification he was seeking and felt dissatisfied.\"After that, he crossed the road again and walked towards Newton MRT station.He then spotted the nine-year-old girl and her mother walking towards another bus stop.Feeling sexually aroused, he pulled down his tights again and exposed himself near an advertisement board at this second bus stop.DPP Goh said: \"The accused saw that the (girl) had turned and looked in his direction. However, the accused did not observe any reaction from her and felt dissatisfied.\"He then walked towards the notice boards of the second bus stop, before returning to his original spot, with his genitals still exposed all this while.\"Budiman was walking away after pulling up his tights when the girl told her mother about what she had seen.The 31-year-old woman ran after him while recording a video and he fled the scene. She alerted the police soon after.For exposing himself to a child below 14 years old, Budiman could have been jailed for up to two years and fined or caned.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/serial-flasher-back-in-jail-for-targeting-9-year-old-girl-five-months-after", "Source": "google"}