{"Type": "", "Time": "2021-06-17", "Headline": "'Oh sh*t, I'm only 29 years old!' - Eriksen's first words after cardiac arrest revealed | Goal.com", "Text": "The first words of Christian Eriksen after he saw his life saved by medics during Denmark's clash with Finland at Euro 2020 have been revealed, with the Inter star telling doctors on the back of suffering cardiac arrest: \"Oh sh*t, I'm only 29 years old.\"The Danish playmaker collapsed in Copenhagen on Saturday and had to be resuscitated on the field after quick thinking from his team-mates and doctors.He is now on the road to recovery, as he remains in hospital, but suffered a serious and unexpected health scare as a professional sportsman that was seemingly in peak physical condition.German doctor Jens Kleinefeld, who helped deliver the shock that restarted Eriksen's heart, has told Bild on bringing the Dane back: \"I was sitting in the stands on the opposite side when Eriksen collapsed. I didn't think anything of it at first. But then I saw the Danish team doctor acting relatively frantically, I realised it was not a normal injury.\"I messaged the sideline team and they ran onto the field. They had the defibrillator with them. I then told my colleague in the stands that we had to get onto the pitch.\"The Danish team doctor initially had difficulty fully grasping the situation. When you start reanimation, you have to do it as quickly as possible. But the team doctors mainly treat all kinds of injuries, so it's more difficult for them to recognise cardiac death directly.\"We have already seen that when they tried to pull the tongue out of the throat. That is nonsense, of course and doesn't save a life. A minimal hyperextension of the head is quite sufficient.\"Within the first two minutes, the shock should be delivered. With Eriksen, it took two or three minutes. That's when the chance of survival is very high. If the shock is delivered within the first two minutes, then the chance of survival is almost 90 per cent. The chance of survival drops 10 per cent per minute. We had to hurry.\"After two minutes, I saw that the shock was successful. Then it took another 20 or 30 seconds for Eriksen's consciousness to return.\"He opened his eyes and spoke to me. I asked him in English: Are you back? He said: 'Yes, I am here'. And then he said: 'Oh sh*t, I'm only 29 years old'.\"I told him that everything was fine now and there was no more danger. He immediately understood everything and was able to put his arm on his chest. This was a great example on how to save lives.\"I see myself as a lifesaver. Especially with the training beforehand. To me, it was just a normal operation. I just tuned everything out. It was a beautiful moment when Eriksen opened his eyes again.\"  The former Tottenham star has sent a message to well wishers from his hospital bed and will be an interested observer when Denmark return to action on Thursday against Belgium.He has posted on social media: \"Big thanks for your sweet and amazing greetings and messages from all around the world. It means a lot to me and my family. \"I'm fine - under the circumstances. I still have to go through some examinations at the hospital, but I feel okay.\"Now, I will cheer on the boys on the Denmark team in the next matches. Play for all of Denmark.\"It remains to be seen whether Eriksen will resume a competitive football career, but he will - like Netherlands defender Daley Blind - be fitted with an implantable cardioverter defibrillator (ICD).Denmark team doctor Morten Boesen has said: \"After Christian has been through different heart examinations it has been decided that he should have an ICD.\"This device is necessary after cardiac attack due to rhythm disturbances.\"Christian has accepted the solution and the plan has moreover been confirmed by specialists nationally and internationally who all recommend the same treatment.\"We encourage everybody to give Christian and his family peace and privacy [in] the following time.\"", "Section": "", "Writers": "", "URL": "https://www.goal.com/en-sg/news/oh-sht-im-only-29-years-old-eriksens-first-words-after/wh4ytbd6x7wc1qza9kse2jruw", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}