{"Type": "", "Time": "2021-06-18", "Headline": "Biden sees pushback on China but ready to see Xi, says aide, United States News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.WASHINGTON (AFP) - A top aide said on Thursday (June 17) that US President Joe Biden's first foreign trip showed Group of Seven (G-7) and Nato unity in pushing back on Beijing but that Biden was also ready to meet his counterpart Xi Jinping.Jake Sullivan, the national security adviser, said Biden showed an alternative to China by leading the G-7 in a new infrastructure initiative and that a Nato summit for the first time succeeded in \"truly taking the security challenge posed by China seriously.\"He also pointed to the resolution of the longstanding EU-US aviation feud as a message that the West is united \"against China's predatory practices.\"\"The bottom line is that Joe Biden confidently and skilfully donned the mantle of leader of the free world on this trip,\" Sullivan told reporters.\"The previous president had ceded that mantle and this president has now emphatically reclaimed it,\" Sullivan said, referring to Donald Trump, who frequently clashed with US allies.The summits have \"laid the groundwork for proving out the case that democracies can deliver for their own people and for people around the world,\" Sullivan said.His remarks came after expected criticism from Trump's Republican Party, which accused Biden of not being forceful enough.The Biden administration, keeping the substance if not the tone of Trump's hawkish approach, has identified China as the pre-eminent global challenge due to its increasingly assertive policies both at home and abroad.But Sullivan said that Biden would welcome a chance to speak further to Xi.The two had a lengthy phone call in February but in-person interaction has been limited to a tense meeting in March between Sullivan and Secretary of State Antony Blinken and top Chinese officials in Alaska.After meeting another frequent US adversary, Russian President Vladimir Putin, in Geneva on Wednesday, Biden said there was no substitute for in-person talks.Biden's view \"also applies to China and President Xi Jinping. He will look for opportunities to engage with President Xi going forward,\" Sullivan said.He said there were no plans scheduled to meet Xi but noted that both presidents were likely to take part in a summit in October in Italy of the Group of 20 major economies.\"Soon enough we will sit down to work out the right modality for the two presidents to engage,\" Sullivan said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/united-states/biden-sees-pushback-on-china-but-ready-to-see-xi-says-aide", "Source": "google"}