{"Type": "", "Time": "2021-06-18", "Headline": "Jakarta expedites vaccination drive as Covid-19 cases spike, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.JAKARTA (JAKARTA POST/ASIA NEWS NETWORK) - Indonesian President Joko Widodo has ordered the Jakarta administration to fast-track the Covid-19 vaccination drive so that Indonesia's capital can reach herd immunity by August, as cases in the city continue to rise exponentially following the Idul Fitri holiday last month.This was met with confidence from Governor Anies Baswedan, who expected millions of Jakartans to receive the vaccines by mid-August.But health experts are sceptical, saying it is an \"unrealistic\" target.In his instruction on Monday (June 14), the President said he wanted Jakarta to vaccinate 100,000 people a day starting next week. \"It's an ambitious target but we have no other options but to do it,\" Mr Widodo said after attending a mass vaccination event in North Jakarta, along with Mr Anies and Health Minister Budi Gunadi Sadikin.Herd immunity occurs when a large portion of a population becomes immune to an infectious disease, making the spread of disease from person to person unlikely. Experts estimate that at least 70 per cent of the population should be inoculated to reach herd immunity against the coronavirus.Mr Widodo said Jakarta had a very high level of mobility and social interactions so the speed of vaccine rollout would \"determine how fast Covi-19 will spread\" in the city.Jakarta has seen an alarming resurgence of coronavirus cases in the past weeks, with officials and experts saying that the capital is now in a \"critical phase\" and could see a higher spike than the last wave of infections in January.The city's health facilities are now at risk of collapsing, with the hospital bed occupancy rate increasing from 45 to 75 percent in just a week. Jakarta remains the biggest contributor to daily cases in Indonesia, which recorded 12,624 cases on Thursday, with around 4,144 cases coming from the capital city.It was among the highest daily case figures ever reported by the city, second only to 4,213 cases reported on Feb 7.Mr Anies said he would ask for help from community leaders across the city to accelerate vaccination programs \"so that by Aug 17, when Indonesia commemorates independence day, Jakarta can announce that we have reached herd immunity\", kompas.com reported.Jakarta seeks to vaccinate 7.5 million of its 10 million residents to reach citywide herd immunity. Some 98 per cent of the city's 3 million priority recipients, who are health workers, the elderly and essential workers, have received the first jab.However, only about 62 per cent have been fully inoculated so far. Jakarta is among the provinces with the highest vaccine coverage in the country.Deputy governor Ahmad Riza Patria previously claimed the city had the ability to roll out around 70,000 shots per day in its 511 health facilities.Due to its high vaccine coverage, Jakarta became the first and the only region so far that has moved on to vaccinating the wider public, starting last week, while continuing inoculating the remaining 100,000 people of the 3 million priority recipients until the end of this month.If the city could roll out 100,000 shots per day, as targeted by Mr Widodo, the remaining 4.5 million residents could all receive their first jabs in just 45 days, without considering whether or not the city has enough health resources to administer the vaccine.But vaccine supply in Jakarta is still limited, with the city having only received 7.2 million doses as of Tuesday, according to Bambang Heriyanto, corporate secretary at state-owned pharmaceutical company Bio Farma, which is involved in both government and private inoculation schemes.The capital needs to secure at least 15 million doses to inoculate 7.5 million people. It would also be difficult for the city administration to administer both the first and the second doses to 4.5 million people before August, considering the dosing interval of AstraZeneca vaccine - one of the two vaccine brands used by the city - is three months. Around 1.6 million of Jakarta's current vaccine supply came from AstraZeneca.Vaccine disparity also persists between Jakarta and its satellite cities, from where more than a million workers commute to Indonesia's capital every day. In neighbouring Tangerang city, for example, only around 152,000 of its total population of 2.2 million had been inoculated as of last week.Epidemiologist Dicky Budiman said the target was unrealistic, suspecting the government of not looking enough into vaccine hesitancy, let alone more transmissible new virus variants that have been detected in Jakarta and might affect the effectiveness of the vaccines.\"There are people who still refuse inoculation for various reasons. Although on paper we might be able to vaccinate 8 million people in Jakarta, in reality not all of them want to get the shots,\" Dr Dicky told The Jakarta Post.In a February survey by the Jakarta-based Centre for Strategic and International Studies (CSIS), 42.5 per cent of respondents in Jakarta said they either strongly or moderately distrusted the efficacy of Covid-19 vaccines.Dr Dicky said the government could not rely only on vaccination to reach herd immunity. The virus reproduction number also needs to be brought down to prevent further infections while the government also needs to ensure that the vaccines are effective to prevent virus transmission among the population.\"It would be hard to bring down the virus reproduction number with new Covid-19 variants rampaging the country. Meanwhile, as of now, there have not been any studies that can determine how effective the vaccines we use are in preventing transmission,\" he said.Masdalina Pane of the Indonesian Epidemiologists Association (PAEI) warned against using all health resources in the capital to fast-track vaccine programs and potentially make other Covid-19 responses less effective.\"The amount of tracers in Jakarta is still very low. If all health workers focused only on vaccination, Jakarta would not have enough people to trace new cases,\" she said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/jakarta-expedites-vaccination-drive-as-covid-19-cases-spike", "Source": "google"}