{"Type": "", "Time": "2021-06-17", "Headline": "Indonesian man repeatedly entered S'pore with fake passport", "Text": "SINGAPORE — A businessman wanted by the authorities in Indonesia for graft repeatedly travelled to Singapore between 2017 and 2018 using a bogus passport bearing another person's name, a court heard.Adelin Lis was finally arrested at Changi Airport while trying to leave the country using the fake passport in May 2018.At the State Courts last Wednesday (9 June), the 63-year-old Indonesian fugitive was fined $14,000, having earlier in April pleaded guilty to four out of 15 charges under the Immigration Act.The remaining counts were considered in sentencing as part of his plea bargain.Adelin paid the fine in two tranches last week and on Wednesday (16 June).According to prosecution documents made available to Yahoo News Singapore by the Attorney-General's Chambers on Thursday, Adelin obtained Singapore permanent residency in December 2002. But he did not renew his re-entry permit as a permanent resident after it expired in December 2007 and so his PR status lapsed.While he was still a Singapore PR, the businessman made 14 trips to Singapore, entering and departing the country a total of 28 times via Changi Airport between April 2005 and September 2006. He used his real passport on each trip.According to a report in the Jakarta Post, Adelin was sentenced to 10 years' jail by the Indonesian Supreme Court in August 2008 for corruption and illegal logging in North Sumatra. He has been on the wanted list of the North Sumatra Prosecutor's Office since July 2012, the Jakarta Post report dated 23 July 2019 said.According to the court documents by Singapore prosecutors, Adelin was arrested by immigration officers at Changi Airport's Terminal 3 departure hall on 8 May 2018. He was trying to leave the country with an Indonesian passport bearing the name of \"Hendro Leonardi\". The passport also stated Hendro's age to be three years younger than Adelin.Investigations revealed that the fugitive obtained the passport in 2008 and used it to successfully travel to and from Singapore several times between July 2017 and 2018.He entered Singapore on 20 July 2017 via Seletar Airport, and again on 26 October 2017, 11 February 2018 and 16 May 2018 via Changi Airport.Each time he arrived, he obtained a 30-day Visit Pass by falsely declaring in his Disembarkation Form that he had never used a passport under a different name to enter the country. He departed Singapore on 24 July 2017, 2 November 2017 and 20 February 2018 via Changi Airport.But while trying to leave the country via Terminal 3 on 28 May 2018, Adelin's ruse fell apart and he was arrested.Court documents did not state how his cover was blown and his real identity established.For each of Adelin's four proceeded charges of making a false statement to obtain an entry pass, he could have been fined up to $4,000 and/or jailed up to a year.The penalty for producing a false document to an immigration officer is a fine of up to $6,000 and/or a jail term of up to two years.The punishment for entering Singapore without a valid pass which has been lawfully issued is a jail term of up to six months with at least three strokes of the cane for male offenders below 50. Those found unsuitable for caning face a fine of up to $6,000 in lieu of caning.Yahoo News Singapore has reached out to the Immigration and Checkpoints Authority on Adelin's status and whether he remains in Singapore or if he has been deported.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:Man jailed for molesting two male victims and supermarket theftWoman hit waitress' face with glass jug, causing permanent scarOf 27 new COVID cases in Singapore, 20 in communityAirbnb owner filmed woman in home toilet with pinhole camera24 providers licensed by MOH to provide Sinovac vaccineNgee Ann Poly lecturer who made racist remarks in video to be firedGlobal stocks were mixed on Thursday as traders digested the Federal Reserve's move to bring forward its forecasts for hiking interest rates as the economy recovers.Beijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityNew $89 Portable Air Cooler Everyone In The U.S. Is Talking AboutThe PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saChinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Every PC user must read this in 2021 - Do it now.Browsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.The strategic partnership sees EMERGE working with Mediacorp's Bloomr.SG network to \"develop the knowledge and skills of up-and-coming\" content creators in esports.Italy became the first team to reach the knockout stage of Euro 2020 as midfielder Manuel Locatelli scored twice in a 3-0 win over Switzerland in Rome on Wednesday, while Wales moved to the brink of joining them by beating Turkey.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.China and other nations were attempting to “seize control” of strategically important international organisations so they could be “weaponised”, a new report by the UK parliament’s influential Foreign Affairs Committee said. The report, published Thursday, accused China in particular of “bullying” states to back their position or their candidates for top jobs, using measures including financial leverage “to shift policies away from the cooperation the organisations were created to promote”. TheHong Kong police have for the first time determined the publication of certain newspaper articles to be a national security crime as they arrested the editor-in-chief, publisher and three other executives of Apple Daily whom they held accountable for more than 30 reports calling for foreign sanctions. The force on Thursday cited the publication of the articles – understood to be mostly commentaries and opinion pieces, including several written by the tabloid’s jailed founder and opposition activJapan said on Thursday it will make a vaccine passport available from next month for Japanese travellers, as governments around the world experiment with ways to relaunch tourism and business trips.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.Washington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HousePrime Minister Boris Johnson warned Wednesday he will take \"necessary steps\" to unilaterally alter Britain's post-Brexit trade terms unless the EU changes the way it is implementing them in Northern Ireland.Protect yourself from mosquitoes the moment you turn it on. These are selling fast, here is how it works.China’s economy is getting more globally competitive as a result of its success in managing the coronavirus pandemic, while Hong Kong’s has been dragged down by a deteriorating labour market and a decline in international investment, Switzerland’s IMD business school said in a report released on Thursday. The Chinese economy came in at 16th in the 2021 IMD World Competitiveness Rankings, up from 20th last year, the biggest jump among Asian economies. Hong Kong was ranked at seventh, down from NoThe freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.The Kremlin was guarded about future dialogue with Washington on Thursday, a day after the first face-to-face meeting between Russian President Vladimir Putin and US counterpart Joe Biden.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Just a few weeks ago, ONE Championship announced the signing of Jhanlo Sangiao, the prodigal son of Team Lakay head coach Mark Sangiao. This week, the martial arts organization picked up another rising star from the fabled stable – Jeremy “The Juggernaut” Pacatiw. “I know this is God’s plan. This is the perfect time for … Continue reading \"ONE Championship Signs Second Team Lakay Athlete In Two-Week Span\"Enjoy The Good Life® with Standard Chartered credit cards. Here’s a roundup of the best deals in town when you swipe, tap or click checkout with your Standard Chartered card. With Standard Chartered, you’ll find a card for every need. A fuss-free cashback card with […] The post Standard Chartered Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.Hong Kong police rounded up 79 people in a series of raids that shut down two underground casinos and an unlicensed pub in the span of two hours on Tuesday night. In one raid on a Ko Shing Street flat in Sai Ying Pun, officers found a baccarat table and two large televisions used to play online card games, seizing HK$215,000 (US$27,697) in cash, HK$410,000 in chips and five account books. Sixteen men and six women, aged 31 to 74, were inside the premises when officers from the Western special du", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/wanted-indonesian-fugitive-repeatedly-entered-singapore-fake-passport-141151029.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}