{"Type": "", "Time": "2021-06-17", "Headline": "The New BTS x McDonald's Meal Comes With a Supersize Amount of Merch | GQ", "Text": "To revisit this article, visit My Profile, thenView saved stories.By Cam WolfThe response to Travis Scott’s McDonald’s meal—featuring a brisk resale economy and ingredient shortages at some McD's restaurants—felt seismic. But the chain’s latest partnership, with world-dominating South Korean supergroup BTS (call it BTS x McDonald's) is designed to make the previous fanfare look like small, French-fried potatoes. The partnership, which launched May 26, has been frying-oil hot. In Indonesia, McDonald’s franchises were forced to just stop taking orders and pack things up for the day because demand for the meal was so overwhelming. Pieces of the special-edition purple packaging alone are reselling for multiples of the meal’s price, while some fans are working hard to preserve the bags and sauce lids in pristine condition.The meal includes 10-piece nuggets, fries, a Coke, and sweet chili and Cajun sauces “inspired” by those from the Golden Arches in South Korea, according to McDonald’s. “We wanted people to taste the special sauces that were available only in South Korea,” group member RM said via email.But the fruits of the team-up go beyond the food. Like previous McDonald’s collaborations, BTS’s also includes a grip of unconventional merch. Travis Scott’s drop included a McNugget body pillow, for instance. In addition to tees and tote bags, BTS is offering pajama pants, slides, and cushions to arrange on your bed and/or couch, all of which released Wednesday night.This drop is divided into two sections: competing “Melting” and “Saucy” collections. The former is inspired by the band’s recent single “Butter,” which means merch featuring hunks of butter oozing across McNuggets, fries, and soda cups. Your dietician probably won’t be happy, but the combination is BTS-approved. When I asked the group if food has just been on the brain lately, band member Jung Kook said, “Food has always been on our minds. Our favorite foods these days are the BTS Meal and butter.” Time to rethink the stodgy old food pyramid! The Saucy collection, meanwhile, features anthropomorphic burgers, ice cream cones, and fries hand-drawn by BTS members. The cute little critters appear alone and together across totes, tees, keychains, and those decorative pillows. (Both collections are available now on WeVerse.)The mammoth response to the meal is hardly a surprise to the members of BTS, who see it as merely more proof of their top-of-the-world status. “We’re thrilled and happy to see so many people enjoying it so much,” Jimin said. “It’s just another example of our connection with people around the world.” When asked what he made of the reaction thus far, J-Hope said, “I recommend having the BTS Meal for dinner today!”Since 1957, GQ has inspired men to look sharper and live smarter with its unparalleled coverage of style, culture, and beyond. From award-winning writing and photography to binge-ready videos to electric live events, GQ meets millions of modern men where they live, creating the moments that create conversations.More From GQConnect© 2021 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. GQ may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices", "Section": "", "Writers": "", "URL": "https://www.gq.com/gallery/bts-mcdonalds-merch", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}