{"Type": "Asia", "Time": "2021-06-18", "Headline": "Malaysia rulers say no need for state of emergency beyond Aug 1; call for political temperature to be cooled down", "Text": "KUALA LUMPUR: The rulers of Malaysia said there is no need to extend a state of emergency beyond Aug 1, while calling for the political temperature to be cooled down.Keeper of the Rulers' Seal Syed Danial Syed Ahmad said in a statement on Wednesday (Jun 16) that the rulers have noted the high number of daily COVID-19 cases, although a state of emergency has been proclaimed.The economic and financial situation of the country was worrying and the political atmosphere is unstable, according to the statement.\"The unity among the people is increasingly cracked,\" the statement read, adding that people were suffering from job loss and income loss.The Malay rulers reached an agreement that, among others, people's lives and livelihoods must be prioritised, it said.\"The political temperature that is increasingly rising must be cooled down.\"It is important to have a stable government that can command confidence and support of the majority of the people.\"There is no need to place the country under a state of emergency after Aug 1, 2021,\" the statement read.On Wednesday afternoon, King Al-Sultan Abdullah Ri’ayatuddin Al-Mustafa Billah Shah chaired a special rulers' conference at Istana Negara, after granting audiences to key political leaders since last week.In a statement issued after the meeting, the king saidparliamentary sittings should reconvene as soon as possibleso that the emergency ordinances and the national recovery plan can be debated by members of parliament.The kingfirst declared a state of emergency on Jan 12to curb the spread of COVID-19. The emergency was scheduled to last until Aug 1 or earlier depending on the state of coronavirus infections.Federal parliamentary sessions and state legislative assemblies have not sat since then, and no elections were held during this period.The suspension of parliament was seen as a move that helped Prime Minister Muhyiddin Yassin avoid an immediate challenge to his razor-thin majority.Mr Muhyiddin was appointed to the post following a power tussle in Putrajaya last year. He has since faced leadership challenges not just from the opposition, but also from allies in his Perikatan Nasional government.Opposition politicians have been criticising the government's handling of the pandemic and called for parliament to sit. A spike in COVID-19 cases has forced the government to implement a total lockdown since Jun 1.According to the Wednesday statement, the Malay rulers were of the opinion that legislature assemblies in their respective states should also convene as soon as possible.\"The assembly methods and procedures currently practised in a few countries, which were proven to be able to curb the spread of the COVID-19 virus, should be introduced and accepted in this country,\" the statement said.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Malaysia,COVID-19,state of emergency", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/malaysia-rulers-no-extend-emergency-aug-1-politics-cool-down-15027024", "Source": "google"}