{"Type": "", "Time": "2021-06-18", "Headline": "COVID quarantines confusing, inconsistent: Singapore residents", "Text": "SINGAPORE — Inconsistent and sometimes conflicting information given by officials enforcing quarantine orders (QOs) has left some Singapore residents alarmed at the lack of clear communication and apparent gaps in procedures. Two women who were recently quarantined – one of them alongside her family and helper – told Yahoo News Singapore that they found their recent experiences confusing and frustrating. Multiple online comments by others who have served quarantine also suggest that the women's experiences are not unique. \"The whole thing felt a shambles,\" said Elaine (not her real name), a 35-year-old employment pass holder with a background in healthcare. \"Everyone in this new world is working as hard as they possibly can. But they (personnel overseeing quarantine orders) need better leadership and better communication.\"After going for a family staycation at a hotel from 7-9 May with her husband and two children aged one and four, Elaine was notified via text on 14 May of possible exposure to a COVID case at the hotel pool. The family and their helper were then issued a seven-day quarantine order by Certis officers.Over multiple calls with Certis officers about whether the family home was suitable for quarantine and when their swab tests were taking place, the overall impression Elaine had was of a \"disorganised\" effort. \"The next day, someone turned up with a quarantine order and armbands (which we had to wear). They installed these little black boxes, which work in tandem with the RFID in the armbands,\" recalled Elaine. \"We said we already had the Home app, where you can log your temperature three times a day and it tracks your location. It felt like we were criminals.\"Elaine and her two children were eventually conveyed to a hospital for swab tests, but not her husband. Certis officers were \"unhelpful\" when she called the local security company and asked why. \"When we called MOH (Ministry of Health), they were much more helpful and sent a nurse around to do swab tests.\"She added, \"Literally no one told us what would happen if we tested positive. We were really worried that the kids might be taken away from us if they were positive.\"After multiple calls, Elaine obtained negative results for herself and her boys, while the results for her husband and helper came two to three days later. On 15 May, a day before the QO was to end, a nurse was sent to their home, after Elaine had made multiple calls to MOH to clarify her family's quarantine status, to conduct swab tests. Her one-year-old son was not tested for a second time as the nurse said it was not necessary. \"They told us we would be fine as long as we didn’t get a positive,\" said Elaine, who was informed of her four-year-old son's negative test results on 17 May. However, the next day, there was a knock at the door in the morning. \"My helper was given a document by a Certis officer, and she felt she had to sign it. They didn’t tell her what it was for. It was an extension of my one-year-old boy's QO. I called MOH, and they couldn’t give me any info,\" said Elaine, who noted that the family had been to multiple places since the end of their quarantine. Her husband took their younger son to get tested, where he was told that the extension was likely due to the fact that the boy had not been tested when the family was let out of quarantine. The boy was eventually cleared.\"The lack of communication is very frustrating. It really impacts your anxiety levels,\" said Elaine. A 37-year-old lawyer who only wished to be known as Ms Wang also endured a \"frustrating and confusing\" experience after being issued a QO from 18-25 May, following her possible exposure to COVID-19. Having confined herself to her room, the mother of two was informed that Certis officers would assess her home for quarantine suitability but no one turned up. At the end of the QO, having received a negative swab result on 21 May, she interacted with her family members.On 26 May, she received an SMS telling her to go for a swab test and that she had been issued another QO from 20-29 May. After numerous calls to the Certis hotline, Ms Wang was told that her QO would be rescinded if she were to get a negative swab result.The following day, despite her HealthHub app displaying a negative result, a Certis officer came to issue her the new QO. She was then told by two other officers over the phone that the negative result was invalid as her quarantine had been extended and she needed another swab. After multiple calls, her QO was finally rescinded in the evening.\"You basically have to keep calling until you find someone helpful,\" said Ms Wang, who was in a \"state of anxiety\" for fear of possibly infecting her family members. \"The communication is abysmal. I understand that they need to do this, but they need to manage the process properly. These are people’s lives.\"Alluding to Prime Minister Lee Hsien Loong's remarks last month that the government will take a more aggressive approach to testing and quarantine, she added, \"The current process already seems overstretched. I think it would be so easy to improve this just by being clear. If you tell people what to expect, there won’t be so much anxiety.\"As neither woman wanted to be identified, their detailed accounts and personal details could not be shared with the MOH.Yahoo News Singapore asked MOH about the volume and nature of complaints it has received regarding the serving and enforcement of QOs during Phase 2 (Heightened Alert), which lasted from 16 May to 13 June. In light of PM Lee's remarks on more aggressive testing and quarantine, the ministry was also asked if it is confident that it has sufficient resources to test and quarantine potentially thousands more.In response, an MOH spokesperson said that extensive contact tracing, including leveraging on TraceTogether and SafeEntry records, is a key strategy to cast a wide net to isolate and ring-fence any possible emerging transmissions in the community.The spokesperson noted that \"wider rings\" are being drawn around cases to combat the more transmissible strains, while more people are now using TraceTogether and SafeEntry, which provides MOH with more data for contact tracing and quarantine. \"This has led to a higher number of persons under quarantine (PUQs), resulting in delays in the testing and conveyance to quarantine facilities,\" said the ministry. \"We seek the public’s understanding and patience. We will continue to improve our operating processes and improve communications between the various agencies involved in managing the quarantine process.\"Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeRelated stories:COVID swab test personnel not trained to deal with special needs people: Rahayu Mahzam9 of 14 new COVID cases in Singapore linked to Bukit Merah View Market clusterA fifth of asymptomatic Covid patients develop long Covid: studyIsraeli jets launched air strikes on Gaza overnight Thursday to Friday after militants in the Palestinian territory again set off incendiary balloons into southern Israel, the army and AFP journalists said.Rafael Nadal and Naomi Osaka, with 24 Grand Slam titles between them, both withdrew from Wimbledon on Thursday with the Spanish star also pulling out of the Tokyo Olympics in a bid \"to prolong my career\".Every PC user must read this in 2021 - Do it now.The World Bank rejected a request from El Salvador for assistance in its bid to adopt bitcoin as a currency, a spokesperson for the Washington-based development lender said Thursday.A reporter with a pro-Beijing newspaper in Hong Kong accused of making a false statement when accessing a government car registry has been let off the hook after prosecutors agreed to drop the charge on condition of a binding-over order. The prosecution’s decision stood in marked contrast to the justice department’s handling of a case last year involving an RTHK contributor accused of the same act, prompting Principal Magistrate Ivy Chui Yee-mei to question the difference in approach at ThursdayBeijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityMeet the PayPal business debit card. Use it everywhere Mastercard® is accepted.North Korean leader Kim Jong Un has said his country needs to prepare for \"both dialogue and confrontation\" with the United States under President Joe Biden, state media reported Friday.The PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saBrowsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Global stocks were mixed on Thursday as traders digested the Federal Reserve's move to bring forward its forecasts for hiking interest rates as the economy recovers.The first astronauts arrived at China's new space station on Thursday in the country's longest crewed mission to date, a landmark step in establishing Beijing as a major space power.Washington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HouseGuided by MIT faculty, gain practical knowledge to embrace blockchain as a business tool.Hong Kong immigration officials will renew the visas of all of Cathay Pacific’s expatriate pilots, but its large contingent of foreign cabin crew will be denied extensions permitting them to remain based in the city, the airline has said. The decision leaves Cathay’s foreign cabin crew at risk of losing their jobs, with the airline saying it would offer the same voluntary redundancy package to affected staff that it offered to others in late April. In its memo on Thursday, Cathay expressed regreIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Former Taiwanese president Ma Ying-jeou has called on the government to listen to public opinion and allow civilian groups which have different political leanings to the ruling Democratic Progressive Party to import much-needed Covid-19 vaccines. Taiwan, which is battling a surge in cases, has struggled to secure vaccines although it has signed deals to buy 10 million doses from AstraZeneca, 5 million from Moderna and more than 4.7 million doses via the Covax Facility, which is supported by theNew research has identified TEN favorite stocks for the upcoming yearChina’s output of integrated circuits (IC) in May reached an all-time, single-month high as the country pulled out all stops to produce chips amid a severe global shortage of semiconductors, according to data released by the central government on Wednesday. China’s IC output in May surged 37.6 per cent from a year ago to 29.9 billion units, the National Bureau of Statistics data showed. Separately, the nation’s automobile output for last month slid by 5 per cent year on year, according to the buThe Kremlin was guarded about future dialogue with Washington on Thursday, a day after the first face-to-face meeting between Russian President Vladimir Putin and US counterpart Joe Biden.Chinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiMore than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Japan said on Thursday it will make a vaccine passport available from next month for Japanese travellers, as governments around the world experiment with ways to relaunch tourism and business trips.A US journalist detained in Myanmar since May appeared Thursday in a special court, his employers said, where he faces charges under a law that criminalises encouraging dissent against the military.Lim Chung Chun, may be the co-founder and CEO of homegrown wealth management firm iFAST Corporation, but he is still an investor at heart and a research analyst at his core. Learn more about his journey and his investment philosophy here.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/covid-quarantine-procedures-confusing-inconsistent-singapore-100905061.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}