{"Type": "", "Time": "2021-06-17", "Headline": "Football: Yarmolenko inspires Ukraine to 2-1 win over North Macedonia, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BUCHAREST (REUTERS) - Andriy Yarmolenko grabbed a goal and an assist as Ukraine beat North Macedonia 2-1 on Thursday (June 17) to boost their chances of reaching the European Championship knockout stages and leave their opponents’ hopes hanging by a thread.Yarmolenko put Ukraine ahead from a corner in the 29th minute, popping up at the back post to beat Stole Dimitrievski with a side-footed finish after latching on to Oleksandr Karavaev’s flick.Ukraine’s captain helped double the lead five minutes later, receiving the ball wide on the right and finding Roman Yaremchuk, who timed his run to perfection to stay onside before bending a low shot past Dimitrievski at the near post.Goran Pandev raised North Macedonia’s hopes when he got in behind the defence and calmly chipped the ball over the keeper to score, but their joy was short-lived when the linesman’s offside flag went up for the 37-year-old.Two missed penaltiesDimitrievski produced a fine save early in the second half to deny Ruslan Malinovskiy when the midfielder curled a free kick destined for the top corner, sticking a palm out and deflecting it onto the crossbar.Ezgjan Alioski dragged North Macedonia back into the match from a 57th-minute penalty after Karavaev fouled Goran Pandev. Georgiy Bushchan saved the spot kick but the ball rebounded straight back to Alioski who fired home his second attempt.Ukraine had numerous opportunities to restore their two-goal cushion with Dimitrievski, who made seven saves in the match, standing strong to deny them as his defence floundered.Ukraine were even awarded a late penalty after Daniel Avramovski was adjudged to have handled the ball following a video assistant referee (VAR) intervention but Dimitrievski made another fine save to keep out Malinovskiy’s spot kick.The defeat leaves North Macedonia, who lost 3-1 to Austria in their first game, bottom of Group C with no points, and needing to beat the Netherlands in their final match on Monday if they are to have a chance of extending their stay.Ukraine have three points after two games and play Austria on Monday. The Netherlands and Austria – both also on three points after opening wins – meet for their second game later on Thursday.The defeat means North Macedonia, who lost 3-1 to Austria in their first game in Group C, need Austria to beat Netherlands later on Thursday if they are extend their stay at their first major tournament.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-yarmolenko-inspires-ukraine-to-2-1-win-over-north-macedonia", "Source": "google"}