{"Type": "", "Time": "2021-06-18", "Headline": "The eternal captain: 'Legend' doesn't do justice to Ramos' legacy at Real Madrid | Goal.com", "Text": "Sergio Ramos may be leaving Real Madrid, but what he has achieved at Santiago Bernabeu is written indelibly into the club’s history.One of the game’s biggest personalities, brimming with ego but boasting the quality to back it up, Ramos will end an era in white on Thursday.Whatever explanation Ramos gives at his goodbye press conference, however twisted and taut the relationship between the defender and president Florentino Perez became at times, it does not sour his legend at the club. Neither does the 35-year-old’s last year on the sidelines, even though this quiet farewell is not a fitting end to a blockbuster career in the Spanish capital. And while the legend tag is often overused, for Ramos it may not even go far enough.The Andalusian played for Real Madrid for 16 seasons, in a total of 671 games, scoring a remarkable 101 goals and lifting 22 trophies. Only Paco Gento (23) has more, winning those in the 1950s and 60s. The six European cups he won cannot be compared to the four Ramos has lifted, which were achieved under far greater competition in the modern era.Since the European Cup became the Champions League in 1992, no side had managed to win it for two seasons in a row, until Ramos captained Madrid to three consecutive trophies, between 2016-2018.And yet, perhaps his greatest individual effort was in their 2014 triumph.  It was Ramos’ header in the 93rd minute that forced the Champions League final with rivals Atletico Madrid into extra time, sparking Real’s comeback to win their desperately craved tenth European Cup - La Decima. Madrid had waited over a decade for it, and Ramos was the man who made it possible.That is why the numbers do not do him justice, as impressive as they are. Plainly, they show his value to Madrid over the past 16 years, but they cannot tell the underlying story.The story of denying their neighbours the chance to lift the trophy for the first time. The constant battles with Barcelona, Ramos’ part in the Clasico rivalry, the countless inspirational messages to supporters, bleeding white, not red, for the club.“Ramos is what I call a personality leader,” former - and current - Real Madrid coach Carlo Ancelotti wrote in his book 'Quiet Leadership'. “A leader with strong character, who is never scared, never worried, and always positive.”Ramos’ wild chaos, his visceral style of defending, will be missed. That is what he brings as captain and what numbers cannot hope to tell - though some will point to his career tally of 26 red cards to at least shine some light on his combative nature.He fought his way into the centre of defence after playing as right back in his early years at the club, but once he earned his place, he was impossible to shift.A fine defender and yet a better leader, Ramos’ story will not be told in clean sheets but in moments and in feeling, in Panenka penalties and last-ditch sliding tackles. In that goal against Atletico but also the two headers in four minutes against Bayern Munich in the semi-final second leg in 2014, that took Madrid to their first Champions League final for 12 years.After that, it has been hard to keep them out of it.  There will be plenty of Real Madrid fans not old enough to remember the team without Ramos in it, and several more who simply cannot, despite their age.It was September 2005 when Ramos made his debut for Madrid, as a substitute under coach Wanderley Luxemburgo, replacing Francisco Pavon in a 3-2 defeat by Celta Vigo at the Bernabeu. There were high hopes for him then, having arrived for €27 million from Sevilla, but he has surpassed every expectation by a distance.It was in 2010 that he cemented his place in the heart of the defence, as Pepe struggled with a knee problem. Half a decade later, and he had already cemented legend status, before the treble of Champions League wins had even begun.That summer, Ramos toyed with leaving, potentially joining Manchester United, although he eventually used their interest to eke more money from Madrid. The mood turned against him in the capital, but only very briefly. Going to war with Perez does not upset a fanbase who have often chanted for the president to resign.It is just as well for Madrid he did not, playing a vital role alongside Raphael Varane under Zinedine Zidane. Ramos has played under 12 different coaches, 13 if you count Zidane in his second spell as well.He played with the same aggression throughout his career, as Mohamed Salah bore witness to in the 2018 Champions League final, with Ramos’ unorthodox challenge forcing the Liverpool star from the pitch, smoothing Madrid’s path towards another trophy.  “He is our captain, our leader. We want him here forever,” said Zidane before Christmas. But the coach is gone, and now Ramos follows.Yes, purely as a defender, there have been a few better. As for sheer talent, Cristiano Ronaldo is above him, Alfredo di Stefano too, as well as Zidane. But as a 21st century Real Madrid icon, there are none grander than their eternal captain.While Ronaldo belongs not only to Los Blancos but also to Manchester United, Ramos is 110 per cent Madrid’s, despite his Sevilla roots - and no matter what the next chapter has in store.", "Section": "", "Writers": "", "URL": "https://www.goal.com/en-sg/news/eternal-captain-legend-ramos-legacy-real-madrid/obnbb7keiyfl1nin010fniq15", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}