{"Type": "", "Time": "2021-06-17", "Headline": "Eateries bracing for dine-in ban extension after recent spike in cases, Latest Singapore News - The New Paper", "Text": "They were cautiously optimistic that there would be a semblance of normality come Monday.But with the recent increase in Covid-19 community cases, restaurant owners and hawkers are bracing themselves for an extension of the current ban on dining in.This comes after Finance Minister Lawrence Wong, who co-chairs the multi-ministry task force tackling the pandemic here, said on Facebook yesterday that the it is \"evaluating the timing and scope of the next stage of reopening\".He said it was unfortunate Singapore now has \"new cases breaking out and a major new cluster in Bukit Merah\".\"Given these developments, we are evaluating the timing and scope of the next stage of reopening,\" he added.The task force is monitoring the situation closely with public health experts and will provide updates soon.While he would not be surprised if the no dine in rule is extended, Mr Roy Tan, owner of Daisy's Dream Kitchen at Temasek Club, told The New Paper that such a move would be a huge strain on his business. He was not sure if he could keep his staff if an extension exceeded a month.Calling it his \"biggest fear\", Mr Tan said: \"We have been together so long that it would feel like kicking out a family member.\"When phase two (heightened alert) kicked in on May 16, his restaurant saw a 60 per cent drop in revenue, but with promotions such as weekly meal subscriptions, he was able to cut losses to about 40 per cent.Mr Shawn Lim, executive director of Penang Culture, which has five outlets, shared a similar concern about delivery services, where competition among restaurants is strong.He said: \"We saw only a slight increase in delivery orders in the past month, not as drastic as during the circuit breaker period last year.\"But he added: \"We understand that these are necessary measures by the Government to keep Singapore safe, and safety should come first so that we can have a sustainable economy rather than a disruptive one.\"Hawkers are also facing a similar situation.Mr Lim Kar Heng, 53, who works at Yummy Rojak at Adam Road Food Centre, said he has taken a pay cut as sales halved after dining in was banned.\"There is no choice, business is affected and it is hard for everyone,\" he said.He added that while the owner estimated that sales could return to a sustainable 65 per cent when dining in resumes, he may need to take a further pay cut or even find another job if the restrictions remain.Mr Lu Li Le, 41, who owns a Hokkien fried prawn noodle stall in the same food centre, said sales have dropped 40 per cent since the heightened alert period began.With the help from the Government, including rental relief, he said the business can still be sustainable if the restrictions are extended.He said: \"If the situation stabilises, we can still operate, we will survive. Hopefully it will not get so bad that we have to shut down completely.\"Get The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/eateries-bracing-dine-ban-extension-after-recent-spike-cases", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}