{"Type": "", "Time": "2021-06-18", "Headline": "Ant Inching Closer to IPO as Valuation Drops 60%, Bernstein Says - Bloomberg", "Text": "Ant Group Co. could list its shares by the end of this year though the Chinese fintech giant faces a 60% slash in valuation, according to a report from Sanford C. Bernstein & Co.The firm controlled by billionaire Jack Ma could be worth about $120 billion upon listing due to slower revenue growth, Bernstein analysts led by Kevin Kwek wrote in a June 17 report. Ant may also have to inject 30 billion yuan ($4.7 billion) to 40 billion yuan of capital into its new consumer finance unit to support credit growth, the analysts said.The revised estimate is a far cry from valuations that ran as high as $320 billion before the company was forced to scrap its record initial public offering in November. China’s crackdown forced Ant to withdraw the $35 billion IPO just days before its planned listing in Hong Kong and Shanghai. Bloomberg Intelligence has lowered its valuation to a range of $29 billion to $115 billion.Despite the hit in worth, the company is making progress overhauling its business and becoming compliant with regulatory requirements, Bernstein said. The company received approval to start its consumer finance unit, paving the way for the planned IPO.Read more about Ant’s new consumer finance unitThe consumer finance unit could see its take rate -- revenue as percentage of average loan balance -- increase by 0.5 percentage points to 3.5% by 2025, as the company issues more credit using its own capital and generates more interest income, Singapore-based Kwek wrote.The consumer finance unit will need to provide 30% of funding for all co-loans, based on rules released earlier this year. At 10 times leverage of its registered capital, that means its total amount of joint loans will be capped at 266 billion yuan, he said.Ant’s money market fund Yu’ebao may also have to scale down, shrinking 25% to 1.5 trillion yuan by 2025, curbing revenue growth, Kwek said.", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-17/ant-inching-closer-to-ipo-as-valuation-drops-60-bernstein-says", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}