{"Type": "", "Time": "2021-06-17", "Headline": "Myanmar rebel group to probe alleged killing of 25 labourers, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.YANGON • A Myanmar ethnic political group that has been fighting the army in the east of the country has pledged to investigate allegations by the junta that its forces killed 25 construction workers after abducting a group of 47 people last month.Ethnic conflicts in Myanmar's borderlands have flared since a military coup on Feb 1, and this week, media controlled by the junta reported that fighters belonging to the Karen National Defence Organisation (KNDO) had committed the atrocity.The Karen National Union, the political wing of the KNDO militia, issued its response to the allegations in a letter dated Wednesday. \"The Karen National Union (KNU) follows the Geneva Convention, which doesn't accept killing civilians during armed fighting,\" it said, adding that it \"will be forming a team to conduct an investigation to reveal the truth and will announce the result\".The KNU and its armed wing have been fighting for greater autonomy for the Karen people since 1947, and is among groups that have opposed the military takeover.The state-run Global New Light of Myanmar newspaper and army-controlled Myawaddy Television this week showed pictures of what seemed to be 25 dead bodies laid in a forest clearing. They said the men had been working on the Uhu Creek Bridge in Myawaddy district near the border with Thailand, and were abducted from the construction site on May 31 along with 10 children and six women.The Global New Light of Myanmar reported that seven bodies were found on June 11, one burned and the others with hands tied behind their backs. It said the other 18 bodies were found on June 12.REUTERSThe Karen National Union (KNU) follows the Geneva Convention, which doesn't accept killing civilians during armed fighting.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/myanmar-rebel-group-to-probe-alleged-killing-of-25-labourers", "Source": "google"}