{"Type": "", "Time": "2021-06-18", "Headline": "China says fly-by near Taiwan was in response to collusion, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BEIJING/TAIPEI • China does not tolerate foreign forces intervening in Taiwan issues and has to make strong responses to such acts of \"collusion\", the government said yesterday, after the island reported the largest incursion to date of Chinese aircraft.Taipei said 28 Chinese air force aircraft, including fighters and nuclear-capable bombers, entered the island's air defence identification zone (ADIZ) on Tuesday.The incident came after leaders of the Group of Seven (G-7) rich countries issued a joint statement on Sunday scolding China for a series of issues, and underscored the importance of peace and stability across the Taiwan Strait, comments which China condemned as \"slander\".Asked yesterday whether the military activity was related to the G-7 statement, Mr Ma Xiaoguang, spokesman for China's Taiwan Affairs Office, said Taiwan's government was to blame for tensions. Beijing believes the island's government is working with foreign countries to seek formal independence.\"We will never tolerate attempts to seek independence or wanton intervention in the Taiwan issue by foreign forces, so we need to make a strong response to these acts of collusion,\" Mr Ma said.Democratically-ruled Taiwan has complained over the past few months of repeated missions by China's air force near the island, concentrated in the south-western part of its air defence zone near the Taiwan-controlled Pratas Islands.This time, not only did the Chinese aircraft fly in an area close to the Pratas Islands, but the bombers and some of the fighters flew around the southern part of Taiwan near the bottom tip of the island, according to Taiwan's defence ministry.The fly-by happened on the same day that the US Navy said a carrier group led by the USS Ronald Reagan had entered the South China Sea. China, which claims almost all of the disputed waterway, frequently objects to US military missions there.\"The Ronald Reagan Strike group did not interact with any Chinese military aircraft,\" Carrier Strike Group 5 spokesman Lieutenant-Commander Joe Keiley said in an e-mailed statement in response to questions on whether the Chinese aircraft had approached them.A senior official familiar with Taiwan's security planning told Reuters that officials believed Beijing was sending a message to Washington as the carrier group sailed through the Bashi Channel, which separates Taiwan from the Philippines and leads into the South China Sea.\"It's strategic intimidation of the US military. They wanted the United States to notice their capability and for them to restrain their behaviour.\"It's strategic intimidation of the US military. They wanted the United States to notice their capability and for them to restrain their behaviour.Taiwan needs in particular to pay attention to the fact that China's military has started conducting drills in Taiwan's southeastern ADIZ, the official added.This \"to a certain degree was targeting our deployments in the east and increasing air defence pressure around our ADIZ\".Taiwan's east coast is home to two major air bases with hangers dug out of the side of mountains to provide protection in the event of a Chinese assault.REUTERSJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/china-says-fly-by-near-taiwan-was-in-response-to-collusion", "Source": "google"}