{"Type": "", "Time": "2021-06-18", "Headline": "Loki episode 2 recap: compelling detective drama with a time travel twist | TechRadar", "Text": "TechRadar is supported by its audience. When you purchase through links on our site, we may earn an affiliate commission. Learn more\nBy\nRichard Edwards\n16 June 2021\nHuge spoilers ahead- Episode 2 (of 6), 'The Variant'\n- Written by Elissa Karasik\n- Directed by Kate Herron\n★★★★★Spoilers for the first two episodes of Loki follow. Watch them first before reading this.Superheroes may be the dominant force in popular culture right now, but their current screen success is a mere flash in the pan next to the longevity of the detective drama. By merging the two genres in spectacular, wise-cracking fashion, however, Loki episode 2 may have found one of the most potent forces in the universe.Where last week’s debut episode, ‘Glorious Purpose’, spent much of its runtime establishing the monochrome world of the Time Variance Authority and how it fits into the Marvel Cinematic Universe, ‘The Variant’ plays out like a fully-fledged police procedural. The idea of law-enforcement authorities hiring a criminal mastermind as an unlikely consultant has been used everywhere from Hannibal to Lucifer, and while it’s a plot device that can occasionally slip into cliché, it’s an irresistible proposition when it works. Particularly when the two bickering leads work together as well as they do in the Loki TV show.Loki and Mobius may come from different worlds, with totally opposing views on life, the universe and pretty much everything, but the MCU is a better place when they’re together. Did you hear the one about the god of mischief and the TVA agent? The answer is frequently hilarious and played to perfection, with Tom Hiddleston’s Shakespearean delivery finding its perfect foil in Owen Wilson’s laidback Texan drawl.Crucially, you’re never quite sure which of the duo has the upper hand. Anyone who can send a flamboyant god of mischief out into the world in a drab, standard-issue TVA jacket with “Variant” emblazoned across the back in big orange letters – “Very subtle… Well done,” says Loki – clearly wields a degree of control Thor’s brother has never encountered before. Indeed, Mobius already knows exactly how to get under the Asgardian’s skin with his taunts about the fugitive Loki Variant being the superior model.And yet, every time you think Mobius has clipped Loki’s wings, the god of mischief will push back with a clever delaying tactic, a spot of casual backstabbing (it’s a speciality), or outright deceit – a drinking game inviting you to down a shot every time Loki tells a lie would be downright danger to your health.While Mobius often gives the impression he sees past Loki’s scheming, there are plenty of times his prisoner/partner gets the better of him. The question is, who needs the other more? Mobius’s tease of a possible face-to-face meeting with the Time-Keepers (aka the “three magic lizards”) has clearly piqued Loki’s interest – they’re his best route back to his timeline, after all – but is the reward big enough to persuade Loki to bury his face in a TVA case file? Is Loki’s less by-the-numbers approach to the mystery, an unconventional way of thinking that leads him to realize that the rogue Variant is using apocalyptic events to hide from the Time Variance Authority, the more valuable commodity? Even Mobius has to admit that Loki is “very clever”.There’s also the growing sense that there’s a grudging respect developing between the pair, and maybe even some common ground. Mobius’s faith in the “glorious purpose” of the TVA has remarkable parallels with Loki’s belief that residents of Asgard are deities – though, as far as we’re aware, Loki is yet to express any interest in jet skis.The biggest reason this episode works so well, however, is that you could put Loki and Mobius in the most mundane of environments and they’d still be engaging company. That this particular case takes them to assorted destinations in space and time – from Ancient Rome to 2050 Alabama – only serves to make show more infectious.Especially when the Loki/Mobius bickerfest isn’t really the main event. The entire episode is built around the hunt for the mysterious rogue Loki, and the slow-build to a very big reveal is a masterclass in direction. ‘The Variant’ makes no secret of the fact the hooded figure we saw at the end of ‘Glorious Purpose’ is the other Loki, but has loads of fun with the tease. From possessing Hunter C-20 to take down an army of Minutemen (soundtracked by Bonnie Tyler’s ‘Holding Out for a Hero’) to watching CCTV screens in a giant future supermarket, Loki 2.0 is a constant, malevolent presence.And even when they step into the spotlight, they maintain a taste for the theatrical by taking over the bodies of Hunter B-15 and other unfortunate souls, before spurning Loki Prime’s offers of an alliance and revealing an unexpected female face. “This isn’t about you,” she tells male Loki, as she unleashes an audacious plot to “bomb the Sacred Timeline” – it’s a big enough deal to get Ravonna Renslayer out of her trinket-packed office.With two Lokis now on the loose in the space-time continuum, all bets are off – chaos is, after all, what Loki (or Lokis) tend to do best. Head back in time with our recap of Loki: episode 1.Verdict: Up there with the very best episodes of WandaVision and The Falcon and the Winter Soldier, ‘The Variant’ is loads of fun from start to finish – a triumph of writing, acting and direction. Although the premiere episode suggested that Loki may have been reformed when he learned his fate in the Sacred Timeline, he’s back at his hilarious, double-crossing best here – particularly when he’s sparring with the similarly brilliant Agent Mobius. But the big news is the arrival of a female Loki who – on the evidence of her brilliantly implemented evil scheme – may actually be the superior version of the trickster god, as Mobius suggests.After an episode that does a brilliant impression of a cop show, the fact that two Lokis are now on the run hints that – entirely appropriately for the character – the show may be about to shapeshift into something entirely different again. The Fugitive across the space-time continuum? Sign us up…New episodes of Loki debut on Disney Plus every Wednesday.Sign up to get breaking news, reviews, opinion, analysis and more, plus the hottest tech deals!Thank you for signing up to TechRadar. You will receive a verification email shortly.There was a problem. Please refresh the page and try again.TechRadar is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.©\nFuture Publishing Australia ABN: 96 734 906 323 | PO Box 1077, Mount St,\nNorth Sydney\nNSW 2059. ", "Section": "", "Writers": "", "URL": "https://www.techradar.com/sg/news/loki-episode-2-recap-compelling-detective-drama-with-a-time-travel-twist", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}