{"Type": "", "Time": "2021-06-18", "Headline": "S&P 500 Trims Losses as Tech Bulls Feast on Falling Bond Yields By Investing.com", "Text": "Please try another searchBy Yasin EbrahimInvesting.com – The S&P 500 cut losses Thursday, as tech stocks moved atop the investing menu after U.S. bond yields reversed their jump a day earlier when the Federal Reserve delivered a hawkish surprise.The S&P 500 fell 0.04%. The Dow Jones Industrial Average was down 0.63%, or 217 points, and the Nasdaq Composite was up 0.33%.The move in lower in Treasury yields suggests that we're on a path to lower growth at a time when the Fed's view that inflation is transitory gains in popularity, creating the perfect cocktail for tech as investors look to quench their thirst for growth.The fall in 10-year break-evens is giving tech \"somewhat of a green light if indeed the Fed is correct on inflation being 'transitory,' just as the long end of the curve implies a low-growth environment ahead (effectively making growth scarce),\" Janney Montgomery Scott said.Others, however, suggests the move in lower yields is short term, and offer a more simple explanation: falling supply.\"The supply side of treasuries has come down,\" said Aptus Capital Advisors portfolio manager David Wagner said in an interview with Investing.com on Thursday​. During the pandemic, the limit on the debt ceiling - how much money the U.S. government can borrow -  was lifted, but it is set to be reimposed on July 31.Ahead of the deadline, the government is using the cash on its balance sheet, or Treasury General Account, rather than tapping the market for funds through the sale of bonds. Against this lower supply, the Fed continues to buy bonds, pushing prices higher, and yields lower.\"They're (the government) is not issuing as much treasuries as before, yet the Fed is still purchasing $80 billion worth of treasuries, every single month, and they're still seeing an increased demand from Europe,\" Wagner added. \"When demand rises and supply declines, you're going to see yields compress, and that's what has been happening right now.\"Tech, however, is focused on present and isn't taking much note on whether the move in rates will be transitory, and is enjoying the appetite for the growth stocks.Google-parent Alphabet (NASDAQ:GOOGL), Microsoft (NASDAQ:MSFT), Apple (NASDAQ:AAPL),  Amazon.com (NASDAQ:AMZN) and Facebook (NASDAQ:FB) were more than 1% higher.The semiconductor stocks also bolstered the wider tech sector, with Nvidia (NASDAQ:NVDA), Micron (NASDAQ:MU) and Qualcomm (NASDAQ:QCOM) sharply higher.Cyclicals, meanwhile, struggled as rotation from the value to growth appears to be in vogue once again.Financials were dragged lower by banks as lower yields hurt net interest margin.JPMorgan (NYSE:JPM), Goldman Sachs (NYSE:GS), and Bank of America Corp (NYSE:BAC) were down more than 3%.Lower interest rates hurt the return on interest that banks earn from their loan products, or net interest margin – the difference between the interest income generated by banks and the amount of interest paid out to their depositors.When rates do move higher, however, cyclicals – those sectors of the market that move in tandem with the economy - will be the place to be.  \"At the beginning portion of this year, the type of securities that outperformed when you had a high velocity increase in real rates was the high beta cyclical names. Whether the market goes up or down, I think that there's a longer runway for stock appreciation in the more cyclical areas of the market rather than the defensives,\" Wagner said. By Eric M. Johnson SEATTLE (Reuters) - Boeing (NYSE:BA) Co was readying the largest member of its 737 MAX family for its maiden flight on Friday, a person familiar with the matter... By Aditi Shah NEW DELHI (Reuters) - Foreign automakers' hopes of a booming Indian car market are fading fast as a brutal second wave of COVID-19 infections and limited government... HONG KONG (Reuters) - Hong Kong pro-democracy tabloid Apple (NASDAQ:AAPL) Daily increased its Friday press run after 500 police officers raided its newsroom the previous day and...Add a CommentWe encourage you to use comments to engage with users, share your perspective and ask questions of authors and each other. However, in order to maintain the high level of discourse we’ve all come to value and expect, please keep the following criteria in mind: Perpetrators of spam or abuse will be deleted from the site and prohibited from future registration at Investing.com’s discretion.Are you sure you want to block %USER_NAME%?By doing so, you and %USER_NAME% will not be able to see\nany of each other's Investing.com's posts.%USER_NAME% was successfully added to your Block ListSince you’ve just unblocked this person, you must wait 48 hours before renewing the block.I feel that this comment is:Thank You!Trade With A Regulated Broker", "Section": "", "Writers": "", "URL": "https://www.investing.com/news/stock-market-news/sp-500-trims-losses-as-tech-bulls-feast-on-falling-bond-yields-2535443", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}