{"Type": "", "Time": "2021-06-18", "Headline": "Youth unemployment rate climbed higher last year amid Covid-19: MOM report, Jobs News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The youth unemployment rate climbed higher last year amid the Covid-19 pandemic, compared with previous downturns, the Ministry of Manpower said on Thursday (June 17), as part of its labour market report for the first quarter.The annual average resident youth unemployment rate hit 10.6 per cent, higher than the 8.8 per cent in the 2009 global financial crisis and the 9.3 per cent in 2003 with the Sars pandemic.MOM said: \"This could reflect greater difficulties among youth trying to secure part-time or temporary employment in the retail and food and beverage industries.\"It added that these sectors were more severely hit by the pandemic, compared with previous recessions.Youth are defined as those aged 15 to 24.About four in 10 youth in employment are in temporary jobs or contract work, the report said. They are mostly students who work on the side.Unemployment rate among youth is also consistently higher than other age groups, reflecting the job search of fresh graduates entering the labour market, for instance, the report said.There is also a higher churn among this age group as they explore various options to find a suitable job. Those who are studying might also frequently move between temporary or part-time jobs.MOM noted that youth unemployment is mostly transitional and short term.The youth long-term unemployment rate last year was still comparable to previous crises. It stood at 1.1 per cent in 2020, similar to the 1.3 per cent recorded in 2003 and the 1 per cent in 2009.Singapore's youth long-term unemployment rate is also one of the lowest when compared with other economies such as France, Britain and Hong Kong, the report showed.The report also studied the proportion of young people who are not in employment, education or training. This reflects the difficulty among youth in finding a job, and their likelihood of being idle economically.The prevalence of youth in such a situation rose to 5.3 per cent last year, compared with 4.5 per cent in 2019.But the report added that this figure remains low, relative to international counterparts.MOM said: \"Taken together with Singapore's good international standing in terms of low unemployment and long-term unemployment rates, the favourable labour market outcomes of our youths attest to our quality education and training system.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/jobs/youth-unemployment-rate-climbed-higher-last-year-amid-covid-19-mom-report", "Source": "google"}