{"Type": "", "Time": "2021-06-18", "Headline": "Obamacare survives third US Supreme Court challenge | Courts News | Al Jazeera", "Text": "Latest Republican bid to overturn the Affordable Care Act fails, preserving health care for millions of Americans.The United States Supreme Court has dismissed a challenge to the Obama-era healthcare law, preserving insurance coverage for millions of Americans.The justices left the entire law intact in a ruling on Thursday which found that the state of Texas, other Republican-led states and two individuals had no right to bring their lawsuit in federal court.The law’s key provisions include protections for people with pre-existing health conditions, a range of no-cost preventive services and the expansion of the Medicaid programme that insures lower-income people, including those who work in jobs that do not pay much or provide health insurance.Also left in place is the law’s now-toothless requirement that people have health insurance or pay a penalty. The US Congress rendered that provision irrelevant in 2017 when it reduced the penalty to zero.US President Barack Obama speaking about the Affordable Care Act during a visit to Miami Dade College in Miami, Florida [File: Kevin Lamarque/Reuters]“Today’s U.S. Supreme Court decision is a major victory for all Americans benefitting from this groundbreaking and life-changing law,” President Joe Biden said in a statement.“Today’s decision affirms that the Affordable Care Act is stronger than ever, delivers for the American people, and gets us closer to fulfilling our moral obligation to ensure that, here in America, health care is a right and not a privilege.”A big win for the American people. There’s no better day than today to sign up for quality, affordable health care at https://t.co/gRX1fGFEzj.With millions of people relying on the Affordable Care Act for coverage, it remains, as ever, a BFD. And it’s here to stay. https://t.co/5GPl9aR8uB— President Biden (@POTUS) June 17, 2021“This ruling reaffirms what we have long known to be true: the Affordable Care Act is here to stay,” former President Barack Obama, who signed the act into law in 2010, said in a statement.“Now we need to build on the Affordable Care Act and continue to strengthen and expand it,” he added.The 7-2 ruling authored by liberal Justice Stephen Breyer did not decide broader legal questions raised in the case about whether a key provision in the law, which is formally called the Affordable Care Act, was unconstitutional and, if so, whether the rest of the statute should be struck down.The provision, called the “individual mandate”, required Americans to obtain health insurance or pay a financial penalty.It marked the third time the court has preserved Obamacare since its 2010 enactment.Biden’s administration in February urged the Supreme Court to uphold Obamacare, reversing the position taken by the government under former President Donald Trump, who left office in January.The ruling came in a lawsuit by Texas and 17 other Republican-governed states and later joined by Trump’s administration. A coalition of 20 states including Democratic-governed California and New York and the Democratic-controlled House of Representatives intervened in the case to try to preserve Obamacare after Trump refused to defend the law.“For a third time, the court bailed out Congress to save the Affordable Care Act from legal consequences, each time creating more questions than answers,” Robert Henneke, an attorney at the Texas Public Policy Foundation which represented individuals who oppose the health insurance mandate, said in a statement.The two dissenting justices were conservatives Samuel Alito and Neil Gorsuch.Republicans fiercely opposed Obamacare when it was proposed, failed to repeal it when they controlled both chambers of Congress and have been unsuccessful in getting courts to invalidate the law, which was Democratic former President Barack Obama’s signature domestic policy achievement. The Trump administration did take steps to hobble the law.The Supreme Court has a 6-3 conservative majority bolstered by the October confirmation in a Republican-led Senate of Trump’s third appointee, Amy Coney Barrett, but the Republican Obamacare challengers still came away disappointed. The Supreme Court in 2012 and 2015 also fended off previous Republican challenges to Obamacare.A demonstrator holding a sign in front of the US Supreme Court during arguments about the Affordable Care Act on Tuesday [File: Alex Brandon/AP Photo]Biden has pledged to expand healthcare access and buttress Obamacare. Biden and other Democrats had criticised Republican efforts to strike down the law at a time when the US was grappling with a deadly coronavirus pandemic.If Obamacare had been struck down, up to 20 million Americans stood to lose their medical insurance and insurers could have once again refused to cover people with pre-existing medical conditions. Obamacare expanded the Medicaid state-federal healthcare programme and created marketplaces for private insurance.In 2017, Trump signed a Republican-backed tax law that eliminated the financial penalty under the individual mandate, which gave rise to the Republican lawsuit. The tax law meant the individual mandate could no longer be interpreted as a tax provision and was therefore unlawful, the Republican challengers argued.The Supreme Court previously upheld Obamacare by deeming the financial penalty under the individual mandate a tax permissible under the Constitution’s language empowering Congress to levy taxes.‘Qualified immunity’, which shields police officers from some lawsuits, is under increasing scrutiny.Unanimous decision holds that tribal officers have some power to search non-Indigenous people on Native reservations.The unanimous ruling says those in the US on humanitarian grounds but entered illegally cannot apply for residency.Follow Al Jazeera English:", "Section": "", "Writers": "", "URL": "https://www.aljazeera.com/news/2021/6/17/obamacare-survives-third-us-supreme-court-challenge", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}