{"Type": "", "Time": "2021-06-18", "Headline": "Malaysia aims to vaccinate half the population of four key economic hubs by Sept, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.KUALA LUMPUR - Malaysia aims to vaccinate by September half of the eligible population in the country's four main economic hubs in its race to boost national inoculation rates.The government aims to get a 50 per cent Covid-19 vaccination rate in Kuala Lumpur and Selangor by July, and the same rate for Johor and Penang by September, said national coordinating minister for immunisation Khairy Jamaluddin on Thursday (June 17).\"When the third wave of the Covid-19 infections happened in Malaysia, I was instructed by the Cabinet and the Prime Minister to accelerate the vaccination exercise. That means, rather than spacing things out and completing things in December, we try to achieve the targets as quickly as possible,\" he told an online forum.But he cautioned that achieving herd immunity is no longer the government's main goal in taming the coronavirus as the disease is expected to become endemic.Mr Khairy also said the government may authorise the combined use of AstraZeneca and Pfizer-BioNTech Covid-19 shots on Malaysians if the data supports higher efficacy.The aim to inoculate the residents in the four key economic engines comes about as Malaysia's economy has been badly hit by the pandemic, which has forced the country to impose three national lockdowns.The federal territory of KL and Selangor state typically contribute nearly 40 per cent to Malaysia's annual economic output. Johor and Penang together contribute at least 15 per cent to the national gross domestic product (GDP).The painfully slow vaccination roll-out has prompted the state governments of Selangor and Penang to push their own programmes.Selangor has the second-lowest vaccination rate nationally, with 11.6 per cent of its population receiving at least one vaccine dose, according to figures from Malaysia's Covid-19 Immunisation Task Force (CITF).This compares with the national average of 11.1 per cent of residents with at least a single dose on Wednesday. Malaysia's vaccination programme targets those 18 years old and above.Kuala Lumpur has the highest rate of inoculation at 46.38 per cent, CITF said. Penang and Johor are currently at 13.39 per cent and 12.52 per cent, respectively.Selangor's ruler, Sultan Sharafuddin Idris Shah, last week expressed his surprise that Malaysia's most populous state had only received 615,210 doses of Covid-19 vaccines, highly disproportionate to its population of 6.5 million.\"His Highness would also like to remind that Selangor is the nation's biggest GDP contributor and hence should be given due priority,\" the ruler said in a statement on June 8.Mr Khairy noted that while the government's target is to vaccinate 80 per cent of the population by the year-end, he has stopped chasing \"herd immunity\" as a main goal. \"I've stopped using that term,\" he said.\"I've advised the Prime Minister to be careful in using the term 'herd immunity' simply because my view as the coordinating minister, looking at the data and the science, is that this very well may be endemic and we may see Covid-19 in a less threatening form, but it will stay with us for quite some time.\"Presenting a slide from Our World in Data compiled by Oxford University during the virtual forum, Mr Khairy contended that Malaysia is \"doing pretty well\" in its inoculation rate compared with its bigger neighbours.\"As you can see, benchmarked against our neighbours Indonesia, Thailand, Philippines, Vietnam, and I am taking our bigger neighbours there, because I don't run a country which is the size of a postage stamp, so you see that Malaysia is doing pretty well.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/malaysia-to-vaccinate-faster-in-four-key-hubs-says-covid-19-may-become-endemic", "Source": "google"}