{"Type": "Business", "Time": "2021-06-18", "Headline": "Cathay Pacific working with Airbus on single-pilot system for long-haul flights", "Text": "PARIS: Cathay Pacific is working with Airbus to introduce \"reduced crew\" long-haul flights with a sole pilot in the cockpit much of the time, industry sources told Reuters.The programme, known within Airbus as Project Connect, aims to certify its A350 jet for single-pilot operations during high-altitude cruise, starting in 2025 on Cathay passenger flights, the sources said.High hurdles remain on the path to international acceptance. Once cleared, longer flights would become possible with a pair of pilots alternating rest breaks, instead of the three or four currently needed to maintain at least two in the cockpit.That promises savings for airlines, amid uncertainty over the post-pandemic economics of intercontinental flying. But it is likely to encounter resistance from pilots already hit by mass layoffs, and safety concerns about aircraft automation.Lufthansa has also worked on the single-pilot programme but currently has no plans to use it, a spokesman for the German carrier told Reuters.Cathay Pacific Airways confirmed its involvement but said that no decision had been made on eventual deployment.\"While we are engaging with Airbus in the development of the concept of reduced crew operations, we have not committed in any way to being the launch customer,\" the Hong Kong carrier said.Commercial implementation would first require extensive testing, regulatory approval and pilot training with \"absolutely no compromise on safety\", Cathay said.\"The appropriateness and effectiveness of any such roll-out as well as (the) overall cost-benefit analysis (will) ultimately depend on how the pandemic plays out.\"It added: \"Having said that, we will continue to engage with Airbus and to support development of the concept.\"Airbus has previously disclosed plans to add single-pilot capability to the A350, but the airlines' participation had not been reported. Work has resumed after the COVID-19 crisis paused the programme, chief test pilot Christophe Cail said.\"We've proven over decades we can enhance safety by putting the latest technology in aircraft,\" Cail told Reuters, declining to identify project partners. \"As for any design evolution, we are working with airlines.\"VITAL SIGNSSafe deployment will require constant monitoring of the solo pilot's alertness and vital signs by on-board systems, the European Union Aviation Safety Agency (EASA) has said.If the flight encounters a problem or the pilot flying is incapacitated, the resting co-pilot can be summoned within minutes. Both remain in the cockpit for take-off and landing.\"Typically on long-haul flights, when you're at cruise altitude, there's very little happening in the cockpit,\" EASA chief Patrick Ky told a German press briefing in January.\"It makes sense to say, okay, instead of having two in the cockpit, we can have one in the cockpit, the other one taking a rest, provided we're implementing technical solutions which make sure that if the single one falls asleep or has any problem, there won't be any unsafe conditions.\"Pilot groups have voiced alarm.\"We struggle to understand the rationale,\" said Otjan de Bruijn, head of the European Cockpit Association representing EU pilots.Invoking the 737 MAX crisis, which exposed Boeing's inappropriate links to United States regulators, De Bruijn said the programme's cost-cutting approach \"could lead to higher risks\".Single-pilot operations, currently limited to planes with up to nine passengers, would need backing from United Nations aviation body ICAO and countries whose airspace they cross. China's support is key to any Cathay deployment.EASA plans consultations this year and certification work in 2022, while acknowledging \"significant risk\" to the 2025 launch date, a spokesman said.In a closed-door industry briefing this year, the agency suggested that reduced-crew flights would begin with a single operator, according to notes of the meeting reviewed by Reuters.EMERGENCY DESCENTAirbus has designed an A350 autopilot upgrade and flight warning system changes to help a lone pilot manage failures, sources close to the project said. Use of a specially designed unisex toilet would be possible during the shift, in coordination with air traffic control.The mid-sized plane is suitable because of its \"emergency descent\" feature that quickly reduces altitude without pilot input in the event of cabin depressurisation.Proponents suggest single-pilot operations may be accepted by a flying public used to crew leaving the cockpit for bathroom breaks. They also point to higher error rates from human pilots than automated systems.Both arguments miss the point, according to a source close to Lufthansa - who said that the airline's executives were advised last year that the programme could not meet safety goals.Flying solo for hours is a \"completely different story\", the source said, citing the 2009 AF447 disaster as an example of malfunctions occurring in cruise. The Air France A330's co-pilots lost control after its speed sensors failed over the Atlantic, while the captain was resting.\"Airbus would have had to make sure every situation can be handled autonomously without any pilot input for 15 minutes,\" the source said. \"And that couldn't be guaranteed.\"Lufthansa has not withdrawn from Project Connect and remains involved as an adviser, its spokesman said.While the airline has no plans to deploy single-pilot operations, he added, \"the suggestion that Lufthansa was an essential part of the project and then pulled back is not true\".Single-pilot capability would add an A350 sales argument, experts say, and rival Boeing lacks an equivalent model with sufficient automation.Filippo Tomasello, a former EASA official, said the payroll and accommodation savings for long-haul crew would not be lost on airlines.\"COVID may end up accelerating this evolution because it's putting tremendous economic pressure on aviation,\" Tomasello predicted.\"If EASA certifies this solution, airlines will use it.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "aviation,travel,Airbus,Cathay Pacific", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/business/cathay-pacific-working-with-airbus-on-single-pilot-system-15033386", "Source": "google"}