{"Type": "", "Time": "2021-06-17", "Headline": "You had one job: Akamai's Prolexic Denial-of-Service protection system fingered after users in Australia denied, er, services • The Register", "Text": "A wide range of internet-connected services in Australia, including banking systems, are experiencing an outage – and it looks like a hiccup at Akamai was at the heart of the problem.Reports of issues with news sites, gaming services, and – more critically – banking systems began to spread on Australian social media early Thursday afternoon local time. Uptime-tracking service Downdetector concurred, showing a massive spike in issues at Commonwealth Bank, Westpac, Bankwest, St.George Bank, Bank Australia, Bank of Melbourne, and others.\"We're aware some of you are experiencing difficulties accessing our services and we're urgently investigating,\" Commonwealth Bank told customers. \"We apologise and thanks for your patience, we’ll provide an update soon.\"The root cause of the outage is still unknown but fingers soon began pointing to Akamai Technologies, a multinational cloud service company which provides – among other things – a system for defending against Distributed Denial-of-Service (DDoS) attacks.Akamai told The Reg this morning: \"We are aware of the issue and actively working to restore services as soon as possible.\"Its defence system, dubbed Prolexic, may be to blame: local Aussie outlet ITnews has posted a support chat session in which an Akamai agent advised a customer to \"kindly turn off/route off [the] Prolexic solution\" in order to resolve the issue.While fault tracking indicates that services are beginning to return to normal, users still appear to be experiencing difficulties connecting to banking systems. \"I've been stuck at Coles for two hours now,\" one bank user complained. \"Could I get a Zinger Stacker Box coupon for the wait? Cheers.\"\"Services are still down,\" said another, a full hour after Commonwealth Bank had stated it was \"starting to see services return to normal\". \"Can't use the app. Can't login online. Come on CBA, I've been trying all afternoon, for the last three hours, to check my account.\" ®Neo4j has secured another $325m in a funding round and said it was ready to demo a distributed graph database with a trillion relationships, sharded across 1,000 servers, returning queries in a matter of milliseconds.New investors DTCP – formerly Deutsche Telekom Capital Partners – and Lightrock join existing investors One Peak Partners, Creandum, and Greenbridge Partners.The latest injection of funds – which is said to value Neo4j at $2bn – adds to earlier rounds including $10.6m in 2011, $11m in 2012, $20m in 2015, $36m in 2016, and $80m in 2018.A UK government taskforce chaired by the architect of the disastrous £700m \"one dole-to-rule-them-all\" Universal Credit IT project, Sir Iain Duncan Smith MP, has published a wish list of regulatory proposals it wants to see adopted by a post-Brexit administration.Included are wholesale reforms of data laws, the development of a \"smart\" energy grid, new rules governing drones and e-scooters, digital health and the partial return of imperial measures.Also sitting on the three-person taskforce were Theresa Villiers MP and George Freeman MP.Tim Cook has claimed that proposed reforms to the App Store are \"not in the best interests of the user\" and would \"destroy the security of the iPhone.\"Cook was speaking remotely at the Brut. America conference, where he was interviewed by the company's CEO Guillaume Lacroix.Microsoft demonstrated its deep and meaningful affection for all things penguin overnight by borking packages.microsoft.com and leaving some Linux fans bereft of the company's wares.For some of the hardcore, an absence of Microsoft software on their fiercely open-source setups might not be such a bad thing. For others, however, getting a 404 from an apt-get is a major workflow blocker.The issue looks, at first glance, to be related to the Ubuntu paths as users struggled with the likes of Microsoft's OpenJDK and its flagship .NET platform.Google's cloud arm has hooked up with AMD, tapping up its latest EPYC processors for a new family of virtual machines, Tau VMs, aimed at scale-out applications - but the company isn't keen on tying itself down to just one chip-slinger.\"The name 'Tau' also stands for the golden ratio,\" Sachin Gupta, VP and GM of Compute at Google Cloud, told The Register in an interview. \"This is like the balance that you need in the design, with the latest CPU technology from our partner AMD, in order to achieve the best outcome.\"We've taken the latest generation of the CPU and put it into a server that's optimised for performance, rather than for some of the other things and other flexibilities like we have for large-scale databases. Working with key customers like Snap and Twitter, we talked to understand what are the things that we should shift in the server design, in the machine itself, to optimise for this kind of scale-out architecture,\" Gupta added.Opayo, the payment processor formerly known as Sage Pay, has not been having a great Thursday, as an unknown systems failure took its systems offline - preventing customers from accepting any payments.The biz is no small beans: it provides payment processing for companies including Europcar, Krispy Kreme, easyJet, Bunches, Office Shoes, Murco Petroleum, and even provides the technology behind the BBC's Children In Need donation app.The trouble started in the early hours, with Opayo's status reports on the glitch beginning at 04:20 UTC. Initially, the issue appeared to be limited to the company's Live Payment Gateway - a bad part of the system to go down right before shops begin to open - but it soon spread.A team of researchers have detailed a range of techniques which they suggest could one day lead to a genuine cloak of invisibility - although, thanks to Toyota's involvement, they're looking to start by making the windscreen pillars disappear from your next car.\"We are always looking for ways to keep drivers and passengers safe while driving,\" explained author Debasish Banerjee of the work, which was led by the Toyota Research Institute of North America in partnership with South Korea's Inha University and the University of Michigan. \"We started exploring whether we could make the light go around the pillar so it appeared transparent.\"While the stanchions framing a car's windscreen provide a key aspect of its structural integrity, they're annoyingly located right where you would want to look in order to see other road users. Removing them would weaken the car, so Toyota's looking into the next best thing: rendering them invisible.Computer scientists have built prototype software capable of not only detecting fake images forged by neural networks but also estimating the properties of the model used to generate these so-called deepfakes.The project is a collaboration between academics at Michigan State University (MSU) in America and Facebook AI Research (FAIR), the aim being to make a tool that can tackle campaigns of coordinated disinformation and the like.Typical machine-learning models trained to sniff out deepfakes work by predicting whether, say, a given image was electronically manipulated. The MSU-FAIR system, however, goes deeper, and can suggest the architecture of the neural network used to create the images, which could be useful for grouping together images and attributing them to a particular disinformation campaign. In other words, you could take 100,000 images and, using the MSU-FAIR code, determine 2,000 of them were created by someone with a model of type A, and 3,000 were created by another group using model type B, etc.Looking for a design and coding tool for React? A new effort, Utopia, was released in alpha this week.Facebook-sponsored React is the most popular JavaScript framework for building user interfaces – the StackOverflow 2020 survey reported usage by 35.9 per cent of developers, ahead of Angular at 25.1 per cent – and is also used by other projects such as React Native, for desktop and mobile applications, and as the basis for other frameworks such as the Next.js server-side rendering framework and the Gatsby static site generator.The usual way to design with JavaScript and HTML/CSS is to write some code and then run it to see what it looks like. There are also visual designers but it is hard to get the flexibility and control of pure code combined with the speed of a graphical design tool. Utopia, just released in Alpha, claims \"full two-way synchronisation,\" meaning that the design and the code update each other instantly.A report into the Office for Product Safety and Standards (OPSS) has highlighted “gaps in regulators' powers”, with major risks found in oversight of online marketplaces, “smart” Internet of Things devices — and, oddly, artificial intelligence.Also worrying are Brexit related regulatory issues such as an upcoming deadline for mandatory use of the UK Conformity Assessed mark, the “equivalent” replacement to the European CE mark, as well as difficulties monitoring goods coming into UK ports.The OPSS was founded in 2018. Its establishment followed an outcry over major national safety issues, not least the fatal fire in June 2017 at Grenfell Tower, when 71 people died in a 27-storey public housing block in the heart of the wealthy London suburb of North Kensington.Stob Exterior: model shot. The Enterprise is seen parked above the equator of a planet. As usual, it is at a peculiar, inward-shifting angle relative to its background. It gives the impression that, far from being captured by gravitational pull, it can only sustain its orbit by continually bearing hard to the left, as though the modelmakers were unaware of the comparative scale of planets and spaceships.The Register - Independent news and views for the tech community. Part of Situation PublishingBiting the hand that feeds IT © 1998–2021", "Section": "", "Writers": "", "URL": "https://www.theregister.com/2021/06/17/akamai_prolexic_australia_outage/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}