{"Type": "World", "Time": "2021-06-18", "Headline": "Low probability of China trying to seize Taiwan in near term: Top US general", "Text": "WASHINGTON: The top US general said on Thursday (Jun 17)  there was a low probability that China would try to take over Taiwan militarily in the near-term as Beijing has some way to go to develop the capabilities needed.While there has been increasing concern in Taiwan and among some US lawmakers about Chinese military activity near the island, like flying jets in Taiwan's air defence identification zone (ADIZ), US military officials have told Reuters that such moves are not overly concerning.Chairman of the Joint Chiefs of Staff General Mark Milley told lawmakers that while Taiwan was still a core national interest of China, \"There's little intent right now, or motivation, to do it militarily.\"\"There's no reason to do it militarily, and they know that. So, I think the probability is probably low, in the immediate, near-term future,\" Milley said during a Congressional hearing.\"My assessment in terms of capability, I think China has a ways to go to develop the actual, no-kidding capability to conduct military operations to seize through military means the entire island of Taiwan, if they wanted to do that,\" he added.The United States is Taiwan's strongest international backer and main source of arms, which angers China.Beijing says the democratically ruled island is part of \"one China\" and routinely denounces foreign involvement as an interference in its internal affairs.Democratic and Republican members of the US House of Representatives will introduce legislation this week seeking to boost US support for Taiwan, part of an effort in Congress to take a hard line in dealings with China.NATO leaders, encouraged by US President Joe Biden, warned at a summit on Monday that China presents “systemic challenges,”taking a more forceful stance towards Beijing.Earlier this week,twenty-eight Chinese air force aircraft, including fighters and nuclear-capable bombers, entered Taiwan’s ADIZ, the largest reported incursion to date.Like most countries, the United States has no formal diplomatic ties with Taiwan.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Beijing,US,probability,China,Taiwan", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/low-probability-of-china-trying-to-seize-taiwan-in-near-term-15036068", "Source": "google"}