{"Type": "", "Time": "2021-06-18", "Headline": "Eriksen to be fitted with heart-starting device after cardiac attack | Goal.com", "Text": "Christian Eriksen will be fitted with an ICD - a heart defibrillator - after he suffered a cardiac incident in the match against Finland, Denmark have confirmed.The Inter star fell to the pitch unconscious on the second match day of Euro 2020 and had to be resuscitated before then being transported to hospital.Now, after a series of tests carried out by medical specialists, it has been announced that Eriksen will have a potentially life-saving implant installed.National team doctor Morten Boesen has been in contact with the cardiac specialist at Rigshospitalet and Eriksen, and this is the latest status: “After Christian has been through different heart examinations it has been decided that he should have an ICD (heart starter). This device is necessary after a cardiac attack due to rhythm disturbances.“Christian has accepted the solution and the plan has moreover been confirmed by specialists nationally and internationally who all recommend the same treatment.“We encourage everybody to give Christian and his family peace and privacy the following time.”Yes. Taking to social media on Tuesday, the attacking midfielder wrote: \"Big thanks for your sweet and amazing greetings and messages from all around the world. It means a lot to me and my family. \"I'm fine - under the circumstances. I still have to go through some examinations at the hospital, but I feel okay.\"Now, I will cheer on the boys on the Denmark team in the next matches. Play for all of Denmark.\"It is not yet known whether Eriksen will be able to play football again.It is not unheard of, though, as the example of German forward Daniel Engelbrecht showed.Engelbrecht collapsed on the pitch while playing for Stuttgart Kickers in July 2013, having suffered from a heart attack.He was then fitted with a defibrillator and returned to the pitch in November of 2014 after 17 months of recovery.However, Engelbrecht suffered from more heart issues down the line and hung up his boots in 2018 to concentrate on a career in coaching.In terms of players still in the game, Ajax and Netherlands star Daley Blind continues to play at the highest level after having an ICD implanted in December 2019.", "Section": "", "Writers": "", "URL": "https://www.goal.com/en-sg/news/eriksen-to-be-fitted-with-heart-starting-device-after/8gpsaa4oercd14k28sho5sy5n", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}