{"Type": "", "Time": "2021-06-18", "Headline": "US envoy for North Korea to visit South Korea for three-way meet: Media, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SEOUL (REUTERS) - The newly appointed US envoy for North Korea, Sung Kim, will make his first visit to neighbouring South Korea this week for a possible three-way meeting with counterparts from Seoul and Tokyo, the Kyodo news agency said on Wednesday (June 16).The visit, from Saturday (June 19) to June 24, comes after President Joe Biden and South Korean President Moon Jae-in held their first summit in May, injecting fresh urgency into efforts to engage the North in talks on its nuclear weapons.Kyodo said arrangements were being made for the visit during which the officials of the three nations would discuss the future direction of the Biden administration's attempts to open dialogue with North Korea in pursuit of denuclearisation.Takehiro Funakoshi, director-general of the Japanese foreign ministry's Asian and Oceanian Affairs Bureau, will participate, as will Noh Kyu-duk, the South Korean foreign ministry's special representative for Korean peninsula peace and security affairs.Sung Kim, appointed by Biden last month, is a Korean-American diplomat who had the same role under President Barack Obama, and helped set up former President Donald Trump's summits with the North's leader, Kim Jong Un.Kim Jong Un has said his country's economy improved this year but urged measures to tackle the \"tense\" food situation caused by the coronavirus pandemic and typhoons last year.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/us-envoy-for-north-korea-to-visit-south-korea-for-three-way-meet-media", "Source": "google"}