{"Type": "", "Time": "2021-06-17", "Headline": "Yarmolenko guides Ukraine to nervy win over North Macedonia - Sports - The Jakarta Post", "Text": "Please Update your browser\n          Your browser is out of date, and may not be compatible with our website. A list of the most popular web browsers can be found below.\n          Just click on the icons to get to the download page.Log in with your social accountAndriy Yarmolenko scored one goal and set up Roman Yaremchuk for another as Ukraine defeated North Macedonia 2-1 to boost their last-16 hopes at Euro 2020 on Thursday.The West Ham forward grabbed the opener on 29 minutes in Bucharest and then teed up Yaremchuk with a brilliant first-time pass to double the lead five minutes later.Ezgjan Alioski pulled a goal back for North Macedonia just before the hour as he converted the rebound from his missed penalty, while Ukraine midfielder Ruslan Malinovskyi also saw a late spot-kick saved.Andriy Shevchenko's side are now level on three points with Austria and the Netherlands in Group C after Ukraine ended a six-match losing run in the competition.\"During the second half, the balance changed, the team played very good first half,\" said Shevchenko.\"One of our mistakes caused a penalty, nerves appeared, we had to score, we had great chances.\"We also have to praised the opponents, North Macedonia have character, they used our mistakes.\"Major tournament newcomers North Macedonia have lost their first two games and will be eliminated if the Dutch avoid defeat to Austria in Amsterdam, where victory for either side will secure a spot in the knockout phase.\"We played two different halves, on their goals, we had to be more cautious,\" said North Macedonia coach Igor Angelovski. \"We're defeated but we're not out.\"Ukraine's 3-2 loss to the Netherlands last weekend saw them match the longest losing run in tournament history, a record shared with Yugoslavia, but they reignited their last-16 bid with a deserved victory over the Macedonians.Yarmolenko edged closer to Shevchenko's all-time leading mark of 48 Ukraine goals, striking for the third game in a row as he slotted in from point-blank range after Oleksandr Karavaev's clever flick at a corner.Yaremchuk had been guilty of wasting an excellent early chance when clean through on goal, but the Gent striker made no mistake when Yarmolenko's terrific pass put him in the clear, squeezing the ball between Stole Dimitrievski and his near post.The North Macedonia goalkeeper reacted superbly to hold a deflected drive from Karavaev, moments after veteran captain Goran Pandev had an effort disallowed for offside at the other end.\"VAR decisions were on the Ukrainians' side, unfortunately the centimetres were for Ukraine,\" added Angelovski. \"Their goal was accepted for centimetres, ours wasn't.\"Dimitrievski clawed away Malinovskyi's free-kick early in the second half, keeping the Macedonians in the game after Georgiy Bushchan turned behind well from Arijan Ajemi.North Macedonia, who shocked Germany in World Cup qualifying in March, got back into the game seconds after Bushchan's magnificent save tipped a curling effort from Aleksandar Trajkovski onto the crossbar.Karavaev fouled Pandev as the two chased the rebound, and although Bushchan palmed away Alioski's spot-kick, the Leeds player slammed in the follow-up to give the Macedonians renewed optimism.Bushchan parried another long-range drive from Trajkovski as Ukraine held on to win despite wasting two great chances in the closing stages.Substitute Viktor Tsygankov poked wide after a flowing move, and Malinovskyi's penalty was turned away by Dimitrievski after a VAR review detected a handball by Daniel Avramovski.© 2016 - 2021 PT. Bina Media Tenggara", "Section": "", "Writers": "", "URL": "http://www.thejakartapost.com/news/2021/06/18/yarmolenko-guides-ukraine-to-nervy-win-over-north-macedonia.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}