{"Type": "", "Time": "2021-06-17", "Headline": "Japan pledges 'safe and secure' Olympics in economic blueprint - draft - Japan Today", "Text": "\nJapanToday\nHigashi-Azabu IS bldg, 4F\n\t\t\t\t\t1-8-1 Higashi-Azabu\n\t\t\t\t\tMinato-ku\n\t\t\t\t\tTokyo 106-0044\n\t\t\t\t\tJapan\n\t\t\t\t\tTel: +81 3 5561 7755\n\t\t\t\t\tFax: +81 3 5561 7756\nEmail: editor@japantoday.com\n©2021 GPlusMedia Inc.\nJapan's government will include a pledge to achieve a \"safe and secure\" Tokyo Olympic Games in its economic blueprint due out on Friday, according to a final draft seen by Reuters on Wednesday.An earlier draft blueprint only called for making the Olympics leave \"various legacies\" behind, while the final version appeared to stress the government's resolve to go ahead with the Games.The final draft came days after Prime Minister Yoshihide Suga said he had won support at a G7 summit meeting in Britain for holding the Olympics despite public concern that the sports extravaganza could worsen the spread of coronavirus infections.\"We will realize the safe and secure Games while creating various legacies,\" the draft said.The government will also clarify its resolve to complete its vaccination program by the end of November, according to the draft which is due to be approved by the cabinet on Friday.It said the government would do the utmost to curb infections, while firmly backing businesses, jobs and people's livelihood by conducting flexible macroeconomic policy.\"We will ensure economic recovery by deploying all policy tools while tapping external demand, with the resolve never to push Japan back into deflation,\" the draft read, citing green, digital, local regions and childcare as key areas of investment.It called for doubling outstanding foreign direct investment in Japan to 80 trillion yen ($727.80 billion) by 2030.\"We will strive to make the size of the economy 600 trillion yen and achieve the aim of fiscal reform.\"To achieve fiscal reform, the draft kept the government's pledge to achieve a primary budget surplus by fiscal year-end in March 2026 while reassessing the target by the end of this fiscal year taking into account coronavirus fallouts.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberPrime Minister Yoshihide Suga said he had won support at a G7 summit meeting in Britain for holding the Olympics despite public concern that the sports extravaganza could worsen the spread of coronavirus infections.well, if the G7 say so, it must be alright.in the old days 'bread and circuses' were a sop, now they're compulsory....    （⌒▽⌒）What happened to the calls for a motion of “No Confidence” that were supposed to be floored today, Wednesday, before the Diet closes their current session?“the final version stresses the govt's resolve with the Games….came days after PM Suga said he won G7 support, despite public concern that the [Games] could worsen the spread of infections.” -\nYep, we believe you. Foreigners living here aren’t as gullible as the locals, the JOC doesn’t get itOh, that’s right, they shot it down;“the main opposition Constitutional Democratic Party & three others submitted a no-confidence motion against PM Suga's cabinet for not extending the regular session, \n…but it was voted down by members of the ruling LDP, Komeito and other [allies]. and once again, quietly slithered into the shadows.“After reading the small print, it was discovered that the precise wording read We will keep the members of the IOC safe and make certain that they secure their broadcasting money. The plebs can do whatever they need to get by”Well, they've already failed on that by allowing it to go on.Any \"promise, pledge, effort, etc...\"Made now or before were made null and void the instant the IOC leaders said this:Barring ArmageddonThe Olympics will happen.If Armageddon is the level needed to stop the Olympics then in reality any promises made with regard to safety are pure lip service.Economic blueprint for something that starts next month.Gosh, Japan, your spontaneity is intoxicating!Will there be also 'safe and secure' Olympics mascot or \"cute character\"? Now that we have a blueprint, which is totaly necessary.. The games haven't even started yet, but the whole extravaganza around it is consuming more and more money, and at an ever-increasing rate. Where the Brazilians or the Chinese wasted money building stadiums that were never used after Olympics (or just few times), we waste horrendous ammounts of money on meetings, reports, blueprints, mascots and other nonsense.Yeah, foreigners are so savvy.  What an arrogant remark.  As if the so-called locals are unawares.The only legacy, will be one of disaster and ignorance, the sense of ignoring the mandate of the people, who decried and opposed the Olympics being held during a pandemic.Who cares what the other leaders said - they don't have to deal with the mess if everything goes south.  They probably won't even let their citizens get on the plane and go home unless they're in the clear first.Anyone for tennis at the Olympics ? No Nadal, No Federer, No Williams, No Osaka, Djokovic unlikely. Baseball maybe ? No Cuba, No Taiwan, No Australia. Us is a 4th rate team.In cycling, more and more cancellations, among them the reigning world champion.Golfers, pulling out.No LeBron in basketball. but record medal harvest for Japan more and more likely so success assured.Use your Facebook account to login or register with JapanToday. By doing so, you will also receive an email inviting you to receive our news alerts.100% online and fully accredited, level 7 qualification for Board directors. Over six months, develop the skills to become a confident and truly effective board memberA mix of what's trending on our other sites\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t\n\t\t\t\t\tGaijinPot Blog\t\t\t\t", "Section": "", "Writers": "", "URL": "https://japantoday.com/category/tokyo-2020-olympics/update-2-japan-vows-%27safe-and-secure%27-olympics-in-economic-blueprint-draft", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}