{"Type": "", "Time": "2021-06-17", "Headline": "Jimmy Kimmel makes Marjorie Taylor Greene look like Hitler | The Independent", "Text": "Stunt comes following lawmaker’s apology for comments regarding the HolocaustFind your bookmarks in your Independent Premium section, under my profileJimmy Kimmel made controversial Georiga lawmaker Marjorie Taylor Greene look like Hitler amid criticism of her apology for comments she made about the Holocaust.The QAnon-curious lawmaker apologised on Monday for having previously compared Covid mask mandates to the Holocaust, saying there is “no comparison” between the two.“There are words that I have said and remarks that I have made that I know are offensive and for that I want to apologise,” she said.However, Kimmel made it clear that he wasn’t buying the freshman congresswoman’s apology on Jimmy Kimmel Live on Tuesday night.The host played a clip of the apology during which he had imposed a Hitler mustache onto her before calling her “the sorriest excuse for a congresswoman we ever had”.Six million Jewish people were killed during the Holocaust at the hands of the German dictator and his regime.Ms Taylor Greene walked back her comments, which she had previously doubled down on, after visiting the US Holocaust Memorial Museum in Washington DC.“It’s amazing what a little education can do,” Kimmel continued. “She now knows as much about the Holocaust as every sixth grader in Washington DC.”“But the important thing here is that Marjorie Taylor Greene said she’s sorry,” he added. “And she is sorry. She might be the sorriest excuse for a congresswoman we ever had.”Elsewhere on Tuesday, Trevor Noah called Ms Taylor Greene a “Georgia congresswoman and your crazy aunt’s even crazier friend.”“I mean, for real, though, are we going to get a press conference every time Marjorie Taylor Greene learns about something? Because she doesn’t know about a lot of things,” he said.Ms Greene has frequently made headlines since she was elected to Congress last year, from her campaign against mask mandates to alleged hateful social media posts.The Independent has contacted Ms Taylor Greene for comment.Join thought-provoking conversations, follow other Independent readers and see their repliesJimmy Kimmel mocked Marjorie Taylor Greene on TuesdayYouTube/Jimmy Kimmel LiveWant to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.Log inNew to The Independent?Want an ad-free experience?Subscribe to Independent Premium.", "Section": "", "Writers": "", "URL": "https://www.independent.co.uk/arts-entertainment/tv/kimmel-live-marjorie-taylor-greene-holocaust-b1867061.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}