{"Type": "", "Time": "2021-06-18", "Headline": "Minister Lawrence Wong says Govt is “evaluating timing and scope” of Singapore’s next stage of reopening, amid recent COVID-19 outbreak - The Online Citizen Asia", "Text": "The Government is “evaluating the timing and scope” of the next stage of Singapore’s reopening, following the recent developments in the COVID-19 community cases, said Finance Minister and multi-ministry taskforce (MTF) co-chair Lawrence Wong on Wednesday (16 June).Mr Wong posted a video on his Facebook page earlier today, noting that the MTF is “studying the situation carefully” with public health experts and will provide further updates soon.“We are now at stage 1 of our reopening. Stage 2 is scheduled next Monday. Unfortunately we now have new cases breaking out and a major new cluster in Bukit Merah,” he wrote in the post.In the video accompanying his post, Mr Wong highlighted “a very large cluster in Bukit Merah”, where the cases are breaking out “not only at the market and the hawker centre but also all around the vicinity”.“And day by day we are seeing the number of cases, the cryptic cases in the community are likely to be rising too,” he added.Mr Wong was referring to the COVID-19 cluster linked to Bukit Merah View Market and Food Centre which currently consisted of 25 cases.Following these developments, Mr Wong noted that the MTF is “evaluating the timing and scope” of the country’s second stage of reopening.“I want to assure all of you that we are doing our very best to control the infection and we want to ensure that we do not have another flare-up before we reach sufficiently high levels of vaccination in our community,” he added.Meanwhile, Mr Wong also demonstrated the use of an antigen rapid test kit in his video, which has now been made available at all major pharmacies.“The process is fast, simple and very easy to use. All of us must get used to the idea of regular testing as part of our routine, like taking our temperatures,” he noted.It was earlier announced last Thursday that Singapore will re-enter Phase 3 (Heightened Alert) with the relaxing of various social distancing measures from 13 June. However, activities such as dining-in at eateries, however, were not be allowed to resume and a tentative date of 21 June was stated.Given Mr Wong’s latest statement, it is questionable if the deferred resumption can be carried out on 21 June as planned. © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/16/minister-lawrence-wong-says-govt-is-evaluating-timing-and-scope-of-singapores-next-stage-of-reopening-amid-recent-covid-19-outbreak/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}