{"Type": "", "Time": "2021-06-18", "Headline": "Opinion | Obamacare is part of America now. Republicans must stop undermining it. - The Washington Post", "Text": "THE SUPREME COURT rejected on Thursday the latest major legal challenge to the Affordable Care Act, also known as Obamacare. This should have been no shock; the most desperate of the three big Obamacare cases the court has considered, the suit was based on flimsy arguments that even many arch-critics of the ACA admitted were bogus. The biggest surprise was that two justices, Samuel A. Alito Jr. and Neil M. Gorsuch, dissented from the 7-to-2 decision, telegraphing an eagerness to rip up the law on even the thinnest legal pretext. But it is worth pausing to note and appreciate this: The rest of the justices showed once again that the court is an institution in which thoughtfulness and restraint often rule, even in big cases. The court is not the wholly political, ends-driven monster that some activists and politicians insist it is.If anti-Obamacare zealots’ first two failures at the court did not persuade them to give up hope that the justices would suddenly eviscerate the ACA, this one should. No one is going to swoop in to eliminate a key piece of the health-care system, particularly now that it has cleared the growing pains the program experienced as it phased in. So many of the horrors that many Republicans predicted the law would produce have not come to pass. Some 23 million people rely on the law for health coverage. The law has filled an important gap during the covid-19 pandemic: One million people signed up for coverage in a special enrollment period President Biden opened earlier this year. The ACA drastically slashed the uninsured rate in the United States, a trend that began to reverse when President Donald Trump did what he could to pick apart the law by executive order.Rather than continuing their crusade to undermine a successful policy, a decade-long effort in which many Republican leaders have denied health-care coverage to as many vulnerable people as they could, it is past time for Republicans to help make it work better. About 2 million low-income people could get coverage immediately if states such as Georgia, Florida and Texas would expand their Medicaid programs as the law envisioned. When put to a popular vote, Medicaid expansion has passed even in the deepest-red of states. With the federal government picking up so much of the Medicaid expansion tab, only pig-headed intransigence explains the holdout states’ continuing refusal.A willingness to accept the ACA as settled law would set the stage for Congress to make improvements. Reinsurance programs could add more stability to Obamacare markets. Health-care costs need to be restrained before they gobble up ever-increasing portions of national income. A reform that Democrats pushed through in their covid-19 relief bill — shoring up Obamacare’s subsidy system so that no one pays more than 8.5 percent of their income on premiums, and many pay far less — is scheduled to expire after 2022 but should be permanent.The country has embraced the principle that the government should ensure that all Americans have access to good health-care coverage. Republicans should finally cooperate in good faith to make that a reality.Read more:Megan McArdle: Obamacare wasn’t as bad as critics thought it would be. It wasn’t revolutionary, either.Catherine Rampell: Obamacare lives! Now, Democrats should do right by those who fell through its cracks.Video: ‘I hate that question’: 7 experts try to answer who has the world’s best health-care systemPaul Waldman: The Supreme Court confirms it: Time for the GOP to give up on destroying the ACAThe most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/opinions/obamacare-is-part-of-america-now-republicans-must-stop-undermining-it/2021/06/17/120a8f26-cf99-11eb-a7f1-52b8870bef7c_story.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}