{"Type": "", "Time": "2021-06-17", "Headline": "Marjorie Taylor Greene leads conspiracy-heavy attack on Fauci", "Text": "WASHINGTON — One after another, some of the most conservative members of the House of Representatives took to the stage at the U.S. Capitol on Tuesday to denounce Dr. Anthony Fauci, the top medical adviser to President Biden, and to air other pandemic-related grievances.Rep. Marjorie Taylor Greene, R-Ga., who was introducing a bill to reduce Fauci’s salary to $0 and have him account for his handling of the coronavirus pandemic, led the attacks. The proposed legislation, called the Fire Fauci Act, stands no chance of passage in a House controlled by Democrats.Nevertheless, the highly vituperative affair — replete with reminders that Fauci was an “unelected bureaucrat” — was indicative of how the bespectacled, Brooklyn-born immunologist continues to be at the center of every ongoing debate related to the coronavirus, including the economic costs of lockdowns (low, says a new study, though there are, of course, social and psychic costs to isolation) and the efficacy of wearing masks (exceptionally high, the discomfort of masking aside).Bitter recriminations over the handling of the pandemic continue to fill the national discourse, even as that pandemic ends. Conservatives believe that restrictions were onerous and unnecessary, while liberals and progressives have criticized former President Donald Trump’s response. Trump frequently undermined and threatened Fauci, eventually making Dr. Scott Atlas, a controversial Stanford-affiliated physician, his top coronavirus adviser.Even as the pandemic ebbs in the United States, the attacks against Fauci have intensified. Critics have used his emails, released recently under a Freedom of Information Act request, to buttress their claims. Those show that he was uncertain about the efficacy of masks in the early stages of the pandemic. So were many others at a time early on when how the virus spread was poorly understood. One email Fauci received in January 2020 did raise the possibility of a lab escape, but there is no evidence he concealed critical information about the origins of the virus. Such information has been exceptionally difficult to come by for investigators outside China.“Please cover his emails,” Greene said. “Get the truth out.” The emails were extensively covered by the Washington Post and other outlets, but conservatives who have been suspicious of Fauci and the scientific establishment from the start insist that the messages merit more investigation.Taylor and her co-sponsors on the anti-Fauci bill (Republican Reps. Thomas Massie of Kentucky; Andy Biggs and Paul Gosar of Arizona; Mary Miller of Illinois; Buddy Carter of Georgia; Bob Good of Virginia; Matt Gaetz and Greg Steube of Florida; and Mo Brooks of Alabama) claim that Fauci knowingly funded research at the Wuhan Institute of Virology that made the virus more lethal. Although that laboratory did receive National Institutes of Health funding through a New York-based organization called the EcoHealth Alliance, both Fauci and NIH Director Francis Collins have explicitly said that Chinese grant recipients were prevented from using U.S. funds for so-called gain-of-function research, which makes a pathogen either more transmissible or more potent to see how it might then behave.Conservatives are unconvinced. Now that Fauci is associated with Biden, not Trump, their attacks are seemingly intended to imply that the new administration is incapable of holding China to account. Biden has, in fact, called for a more complete investigation of how the coronavirus originated.“Were we all victims of a bioweapon?” wondered Greene, a onetime adherent of the QAnon conspiracy theory who has also mused about “Jewish space lasers” and more recently dismissed evolution. She demanded “reparations” from the Chinese government, which has sought to distance itself from any responsibility for the origins of the virus, going so far as to call for investigations of bioweapons at American facilities. Yet scientists have become increasingly emboldened in arguing that the lab escape theory needs a harder look, with greater cooperation from China. The notion that China unleashed a bioweapon on the world, however, is not considered a credible hypothesis.Trump was sometimes irritated with Fauci’s media appearances, and by the high degree of trustworthiness he was afforded by the public. Those grievances plainly persist. “Dr. Fauci leveraged his position as a leading figure in the White House to become a celebrity,” charged Rep. Biggs.Greene and others spoke standing beside a placard that said: “Fauci lied. People died.” The words were accompanied by a photo of a masked Fauci, who is head of the National Institute of Allergy and Infectious Diseases. He has been in the federal government for 40 years and has served seven consecutive presidents, including Trump.Firing him would be difficult, since Fauci is a senior public servant, not an appointed official. Nor are congressional Democrats, or the president, bound to take personnel advice from the most radical members of the opposition party, some of whom called into question Biden’s legitimate victory in last November’s election.Among the participants in Tuesday’s anti-Fauci fusillade was Rep. Brooks, who last week was sued by Rep. Eric Swalwell, D-Calif., for his alleged role in inciting pro-Trump rioters on Jan. 6. In response to a question from Yahoo News, Brooks angrily denied that the anti-China rhetoric on display Tuesday could be fueling attacks against Asian Americans. He noted that Chinese Americans “are not necessarily members of the Chinese Communist Party.”The purpose of Tuesday’s rally was largely symbolic, more significant in what it says about how conservatives plan to litigate the pandemic in the coming months, ahead of the 2022 midterm elections. Even as life returns to normal in many parts of the country, there remain uncertainties about the upcoming school year, about how long white-collar workers will continue to work from home and just how much effort should go into investigating the origins of the coronavirus, not to mention how to prevent the next pandemic.“Let’s not divide people with politics,” said Greene, who less than 24 hours earlier had called a press conference to apologize for having compared pandemic restrictions to the horrific treatment of Jews by Nazis during World War II. A skilled cultural warrior with little interest in seeking legislative solutions, Greene understands that the pandemic remains a motivating issue for both sides of the nation’s gaping political divide.Fauci has been living under heightened security for months. That is likely to continue as long as he remains at the center of conservatives’ ire. Last month the National Review ran a cover story on what it deemed “the unforced errors of America’s political doctor,” mockingly depicting him as a would-be saint. And the anti-vaccine activist Robert F. Kennedy Jr. is set to release a book highly critical of Fauci in September. As of Monday evening, that book was among the bestselling on Amazon. ____Read more from Yahoo News:Airline travel horror stories mount as Americans pack the not-so-friendly skiesCalifornia and much of the American West face mega-drought brought on by climate changeYahoo News/YouGov poll: U.S. COVID worries fall to lowest level ever ahead of Memorial DayWill face masks be a regular part of life post-pandemic?China and other nations were attempting to “seize control” of strategically important international organisations so they could be “weaponised”, a new report by the UK parliament’s influential Foreign Affairs Committee said. The report, published Thursday, accused China in particular of “bullying” states to back their position or their candidates for top jobs, using measures including financial leverage “to shift policies away from the cooperation the organisations were created to promote”. TheGlobal stocks were mixed on Thursday as traders digested the Federal Reserve's move to bring forward its forecasts for hiking interest rates as the economy recovers.New $89 Portable Air Cooler Everyone In The U.S. Is Talking AboutThe PLA’s largest sortie into Taiwan’s air defence identification zone marked another step forward by the Chinese military because it was the first of its kind on the eastern side of the island, according to military analysts. That side is the furthest from mainland China and hosts two major airbases that could play a key role in any invasion and are sheltered by the mountain ranges in the centre of the island. Derek Grossman, a senior defence analyst at the Rand Corporation, a US think tank, saIf you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Browsing property ads? From exaggerated headlines like \"Over 90% units sold!\" to too-good-to-be-true prices under market value, here are 6 things to look out for when shopping for a new home.Every PC user must read this in 2021 - Do it now.Chinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiBeijing said on Wednesday it did not fear the relationship between the United States and the European Union after the two sides announced they would set up a body to write economic rules and take other steps to face rising competition from China. A statement by the Chinese diplomatic mission at the EU said China was standing up and was not afraid of threats, saying the EU-US summit had gone far beyond the “norm of developing bilateral relations … It is filled with an outdated cold war mentalityThe strategic partnership sees EMERGE working with Mediacorp's Bloomr.SG network to \"develop the knowledge and skills of up-and-coming\" content creators in esports.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Italy became the first team to reach the knockout stage of Euro 2020 as midfielder Manuel Locatelli scored twice in a 3-0 win over Switzerland in Rome on Wednesday, while Wales moved to the brink of joining them by beating Turkey.Japan said on Thursday it will make a vaccine passport available from next month for Japanese travellers, as governments around the world experiment with ways to relaunch tourism and business trips.Hong Kong police have for the first time determined the publication of certain newspaper articles to be a national security crime as they arrested the editor-in-chief, publisher and three other executives of Apple Daily whom they held accountable for more than 30 reports calling for foreign sanctions. The force on Thursday cited the publication of the articles – understood to be mostly commentaries and opinion pieces, including several written by the tabloid’s jailed founder and opposition activThere’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.Washington will use its leverage in the United Nations to counter China’s harmful influence, stem Beijing’s strategic grip over UN agencies and build an alliance to investigate the source of Covid-19 and address human rights abuses in Xinjiang, a senior US official told Congress on Wednesday. “They exert enormous influence in the United Nations, and it’s malign … influence that promotes an authoritarian approach to multilateralism,” US ambassador to the UN Linda Thomas-Greenfield told the HouseThe freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.Protect yourself from mosquitoes the moment you turn it on. These are selling fast, here is how it works.Prime Minister Boris Johnson warned Wednesday he will take \"necessary steps\" to unilaterally alter Britain's post-Brexit trade terms unless the EU changes the way it is implementing them in Northern Ireland.China’s economy is getting more globally competitive as a result of its success in managing the coronavirus pandemic, while Hong Kong’s has been dragged down by a deteriorating labour market and a decline in international investment, Switzerland’s IMD business school said in a report released on Thursday. The Chinese economy came in at 16th in the 2021 IMD World Competitiveness Rankings, up from 20th last year, the biggest jump among Asian economies. Hong Kong was ranked at seventh, down from NoThe Kremlin was guarded about future dialogue with Washington on Thursday, a day after the first face-to-face meeting between Russian President Vladimir Putin and US counterpart Joe Biden.This new car cloth can easily remove all the car scratches and dents from your car.Just a few weeks ago, ONE Championship announced the signing of Jhanlo Sangiao, the prodigal son of Team Lakay head coach Mark Sangiao. This week, the martial arts organization picked up another rising star from the fabled stable – Jeremy “The Juggernaut” Pacatiw. “I know this is God’s plan. This is the perfect time for … Continue reading \"ONE Championship Signs Second Team Lakay Athlete In Two-Week Span\"Enjoy The Good Life® with Standard Chartered credit cards. Here’s a roundup of the best deals in town when you swipe, tap or click checkout with your Standard Chartered card. With Standard Chartered, you’ll find a card for every need. A fuss-free cashback card with […] The post Standard Chartered Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.Philippine inflation may remain above 4% this year, complicating government efforts to salvage the economy from the havoc wrought by the pandemic.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/marjorie-taylor-greene-leads-conspiracy-heavy-attack-on-fauci-223635624.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}