{"Type": "", "Time": "2021-06-17", "Headline": "World’s press condemns arrest of Apple Daily editor-in-chief | The Star", "Text": "\n                    Thursday, 17 Jun 2021\n                Ryan Law, second from right, Apple Daily's chief editor, is arrested by police officers in Hong Kong Thursday, June 17, 2021. Hong Kong police on Thursday morning arrested the chief editor and four other senior executives of Apple Daily under the national security law on suspicion of collusion with a foreign country to endanger national security, according to local media reports. Local media, including the South China Morning Post and Apple Daily, reported Thursday that national security police arrested Apple Daily's chief editor Ryan Law. (AP Photo)THE World Association of Newspapers and News Publishers (WAN-IFRA), together with the World Editors Forum (WEF), have condemned the arrest of Apple Daily editor-in-chief Ryan Law and four of its directors as Hong Kong’s national security police continue to target the media company and its outspoken pro-democracy owner, Jimmy Lai.Lai is currently serving a 20-month jail term for alleged foreign collusion and involvement in mass protests that swept Hong Kong in 2019.Along with Law, Apple Daily announced that chief executive officer Cheung Kim-hung, chief operating officer Chow Tat-kuen, deputy chief editor Chan Puiman, and chief executive editor Cheung Chi-wai had been arrested at their homes at around 7am Thursday, 17th June.Under the pretext of having violated the controversial national security law, hundreds of police officers took coordinated action against the five senior executives.The national security department said they had been arrested “based on suspicion of collusion with a foreign country, or with external elements to endanger national security,” via some 30 unspecified articles dating from 2019 which police said called – amongst other things – for sanctions to be imposed on Hong Kong and mainland China.The Hong Kong authorities have consistently stated the sweeping powers contained in the national security law, enacted in June 2020, would not be used retroactively.According to media reports, Hong Kong security chief, John Lee, also accused those arrested of engaging in criminal behaviour and using “journalistic work as a tool to endanger national security.” He issued an explicit warning that sent a chilling effect throughout the Hong Kong media: “Normal journalists are different from these people... Please keep a distance from them.”The pro-democracy tabloid has been a consistent target of recent efforts to clamp down on a free press since the implementation of the deeply unpopular national security law. Today’s newsroom raid is the publication’s second in a year, and with the issuing of an unprecedented warrant allowing the seizure of journalistic materials, it marks a significant escalation of the government’s attempts to control media and the public discourse.Police also froze HK$18mil (US$2.3mil/RM9.52mil) in assets of Apple Daily Limited, Apple Daily Printing Limited and AD Internet Limited. Parent company, Next Digital, announced the suspension of trading in its shares before markets opened on Thursday.WAN-IFRA and WEF call for the immediate release of the Apple Daily staff and the unfreezing of the company’s assets. Furthermore, it calls on the Hong Kong authorities to recognise that journalism is not a crime and that journalists should not be criminalised simply for doing their jobs.“The national security law is being deliberately misused to suppress critical opinion and target those who dissent,” said WAN-IFRA’s executive director for press freedom, Andrew Heslop.“Any pretence that China would honour the governance agreement guaranteeing Hong Kong’s special status, particularly in relation to the protection of basic human rights, has well and truly disappeared. Instead, the authorities are spreading fear and censuring media exercising their right to press freedom. China’s attempts to impose authoritarian rule over Hong Kong’s media cannot and will not go unopposed.”The World Association of Newspapers and News Publishers (WAN-IFRA)\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/opinion/letters/2021/06/17/worlds-press-condemns-arrest-of-apple-daily-editor-in-chief", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}