{"Type": "", "Time": "2021-06-17", "Headline": "Unplayable Pogba serves bittersweet reminder of his Ballon d'Or potential as France beat Germany at Euro 2020 | Goal.com", "Text": "France 1-0 Germany: Match StatisticsIt's taken as something of a given that if France win Euro 2020, this year's Ballon d'Or will go to either N'Golo Kante or Kylian Mbappe, and the reasoning is sound. Both men, after all, are coming off the back of extraordinary club campaigns.Yet watching France beat Germany in their Group F opener on Tuesday night, it was hard not to wonder why Paul Pogba isn't in the mix. Not because he deserves to be because of his form in 2021 to date, but because he should be given his extraordinary talent. It's now seven years since Gianluigi Buffon tipped up his then-Juventus team-mate as a future Ballon d'Or winner: \"He is one of those players that leaves you open-mouthed.\"He still is, too – he proved that again at Allianz Arena – yet nobody could claim Pogba has been anything close to the best player in world football this year. The incredibly frustrating thing about Pogba is that dominant displays like the one he produced in France's 1-0 win in Munich still feel like the exception rather than the rule. Manchester United fans could be forgiven for wondering where on earth this version of Pogba was during last month's Europa League final loss to Villarreal, but then, the 28-year-old has long been a very different player for club and country. Roy Keane and Patrick Vieira, two of the greatest midfielders of the modern era, later debated why this is the case on ITV but Pogba himself has never made any secret of the fact that he feels better utilised in the international arena than at Old Trafford.  \"In Manchester, I have the freedom to go into the box, but the priority is to play, to defend,\" Pogba told L'Equipe. \"In the France team, we play a 4-2-3-1 too and I'm a little more involved in the transition, in the construction. I have more freedom than in Manchester to get into the box, to make runs forward.\"Against Germany, Pogba appeared to be everywhere, breaking up play with ferocious force, picking out passes under intense pressure and generally bossing the game with his awesome mix of power and precision. Of course, it's easier to dictate the play when you have N'Golo Kante alongside you, and the Chelsea man had another excellent game – but this was Pogba at his very best, turning in one of those ridiculously composed performances in which he reminds everyone of his full repertoire of skills.From a defensive perspective, he regained possession more than any other player (12 times), while no player won more headers or made more interceptions (three apiece).Offensively, it was he who played the outrageous outside-of-the-boot pass out to Lucas Hernandez that led to Mats Hummels' own goal. Unsurprisingly, he was also involved in the build-up to France's two disallowed goals, from Kylian Mbappe and Karim Benzema.He was utterly unplayable at times and it was no coincidence that he was the most fouled player on the pitch, too. At one point, it even seemed that Germany defender Antonio Rudiger tried to take a bite out of him in a desperate bid to rattle Pogba.There was no chance of that, though. This was the Pogba that used to take Buffon's breath away at Juventus: excelling in the right role and surrounded by top talent.There was never any doubt, then, that he would be named man of the match. Whether he will ever be crowned the best player in the world, though, remains unclear. Can United ever really offer him the same freedom as France?", "Section": "", "Writers": "", "URL": "https://www.goal.com/en-ug/news/pogba-ballon-dor-france-germany-euro-2020/1cezi5tvtjv8j1kgs2ps467qpf", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}