{"Type": "", "Time": "2021-06-17", "Headline": "Ngee Ann Poly to sack lecturer in racist remark incident for serious misconduct, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Ngee Ann Polytechnic (NP) is in the process of sacking senior lecturer Tan Boon Lee for serious misconduct.This comes after a video posted on June 6 of Mr Tan making racist remarks to an interracial couple in Orchard Road went viral online. This was followed by an Instagram post on June 9 by NP alumna Nurul Fatimah Iskandar, who alleged that Mr Tan made Islamophobic comments in a class in 2017.NP said it made the decision after completing its internal investigations into both incidents. It has charged Mr Tan – a lecturer at the School of Engineering – with a serious breach of its staff code of conduct, and “is proceeding to terminate his service”.\"Our staff members are expected to respect cultural, ethnic and religious differences in our society. They must uphold secularity and impartiality at all times... The disciplinary action meted out against the staff in question reflects our commitment to provide a safe, inclusive and respectful environment for our campus community,\" said NP in a statement on Thursday (June 17).Police investigations into both incidents are ongoing.In her Instagram post, Ms Nurul, now 22 and a student at the National University of Singapore, said she had reported Mr Tan’s insensitive comments to NP at the time. NP said it has been unable to locate any records of her feedback after searching its various feedback channels and checking with Ms Nurul on her NP mailbox archives.“In our conversation with her, she indicated that she could not recall whether she had e-mailed her feedback on the incident or raised it during a post-course focus group discussion (FGD) in 2017,” it added. FGDs are typically held at the end of every semester to seek students’ feedback on courses and lecturers.“Nonetheless, we are committed to preventing a similar incident from occurring again, and will ensure that students are made aware of the appropriate channels for them to provide feedback in a safe manner,” it said.“We will also advise our staff on how to manage and report feedback that they may receive outside of these channels, as appropriate.”NP also apologised for the distress that Mr Tan’s comments caused Ms Nurul, and said it has offered her counselling support. Last Thursday, Ms Nurul told The Straits Times that Mr Tan had used lesson time to initiate an offensive discussion about Islam.“He opened websites about Islam and explained why he didn’t agree with certain Quranic verses. He then singled me out, and tried to start a debate on the topic. It didn’t help that I was the only Muslim student in class and I sat in the front row,” she said.\nNP alumna Nurul Fatimah Iskandar alleged that Mr Tan made Islamophobic comments in a class in 2017. PHOTO: NURUL FATIMAH ISKANDAR\nNP said that it will make all feedback channels for students more accessible and visible on its website, and publicise them on its campus digital screens. These channels include a whistle-blowing e-mail address for students – tellnp@np.edu.sg, a general inquiry AskNP e-mail address, course experience dialogues and student surveys.\nSince she put up the post about the incident on Instagram, Ms Nurul said more accounts about Mr Tan from other students have come to her attention. PHOTOS: NURUL FATIMAH BINTI ISKANDAR/INSTAGRAM\n“In addition, students can share their feedback with their staff advisers at any time. We would like to assure students that all feedback will be taken seriously and handled in confidence,” the polytechnic said. NP added that it would be reviewing its internal feedback monitoring processes to identify and resolve gaps.“We also remind all staff to strictly adhere to the staff code of conduct and create a safe learning environment for all in NP,” it said. Responding to NP’s statement, Ms Nurul said: “It reads like a typical signal that all necessary actions have been taken and that the case has been closed.”She added: “My intention was never to fight against one lecturer or one institution. There are so many more changes that need to be made to our education system in order to safeguard and protect our students.” Singaporeans have to keep conversations about racism going and continue to speak out and speak up for minorities, she added.“I sincerely hope that the energy we created over the past week does not die down. This is not a trend or a hot topic... this is a social issue that is fundamental to who we are as Singaporeans,” she said. ST has contacted Mr Tan for comment. Mr Dave Parkash, 26, who filmed Mr Tan making racist remarks at him and his girlfriend, Ms Jacqueline Ho, 27, declined to comment on Mr Tan’s dismissal when contacted by ST. Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/ngee-ann-poly-to-fire-lecturer-who-made-racist-remarks-to-mixed-race-couple", "Source": "google"}