{"Type": "", "Time": "2021-06-17", "Headline": "Crowdfunding campaign launched for legal fees in labour dispute against SBS Transit; goal set for S$90,000 - The Online Citizen Asia", "Text": "As permission was granted on 10 June for the lawsuit by bus drivers against SBS Transit to be heard in the High Court, the group of 13 drivers has recently started a crowdfunding campaign to help cover legal fees for the case which has been represented on a pro-bono basis thus far.One of the drivers, Chua Qwong Meng, started the campaign on behalf of the 13 drivers on GoGetFunding, with a target of S$90,000.“We are trying to raise $90,000 to help with the High Court trial which might head up to the Court of Appeal,” said Mr Chua on the campaign site, adding that “there is too much at stake to stop here now”.He explained that several of the drivers’ employment contracts had been terminated since the COVID-19 outbreak in Singapore became more severe. This made it difficult for the group to keep up with the instalments of legal fees to their lawyer, M Ravi.Fortunately, Mr Ravi stayed on as their lawyer on a pro-bono basis.In a Facebook post on 10 June, Mr Ravi explained the same thing, expressing that it has not been easy for him and his team.He explained his decision to act for the drivers on a pro-bono basis as they were “not able to keep up with their installment payments” for the “small fee” he had charged them. This is on top of the other pro-bono cases he and his team have already taken on.On GoGetFunding, Mr Chua wrote: “After careful thinking, discussing with the other bus drivers and with the support of my family and friends, we have decided to crowdfund to help us with the continuance of this case in the High Court and even further to the Court of Appeal if needed.”Stressing the importance of seeing the case through for the rights of all workers in Singapore, he added: “We cannot expect our lawyer and his team at K. K. Cheng Law LLC to continue bearing all the costs of this suit especially with regard to the numerous extraneous filing and disbursement fees.“Whilst we are certain that Mr Ravi will give us highly discounted fees for the trial, we want to thank him, and his team at K. K. Cheng Law LLC but we cannot expect them to continue this journey with us not being paid.“We the 13 drivers are fighting for fairness so we must also be fair to our legal team too.”Mr Chua went on to emphasise the group’s belief that this case presents an opportunity for a review of the Employment Act to ensure that it protects all workers and is fair.“This suit will not just be about myself but also about the other 12 bus drivers’ suits which is pending the outcome of my suit,” he remarked, adding that it will also affect other workers.The other 12 drivers involved in the case are Mr Lee Chye Chong, Mr Chian Poh Seng, Mr Fung Chean Seng, Mr Tan Ting Hock Robin, Mr Thiyagu Balan, Mr GAn Kim Kiam, Mr Huzainal Hussein, Mr Lim You Onn, Mr Chiew Yi Yee, Mr Meerah Mohamed Halideen, Mr Razak Hasim, and Mr Mohamad Sani Din.On 11 March, Mr Ravi revealed that he had filed an application for the suits to be transferred from the Magistrate Court to the High Court “as there are several important questions of law of public interest relating to provisions in the Employment Act which will affect their cases and potentially all 6000 SBS drivers”.He stated that the suits will be a test for the rights of all employees in Singapore.After hearing from both sides – SBS Transit is represented by team of lawyers led by Senior Counsel Davinder Singh – Justice Audrey Lim found that the certain questions of law raised in the suits affect not only the 13 SBS Transit bus drivers, but also “a larger class of employees including those in the public transport sector who may potentially fall within the definition of employees” under Part III of the Criminal Law (Temporary Provisions) Act (CLA).Justice Lim also addressed Mr Chua’s action of urging his case to be made a ‘test case’. While the State Courts Act (SCA) does not provide a definition of a ‘test case’, the judge noted that both SBS Transit and the drivers accept the definitions in Black’s Law Dictionary, which state that a ‘test case’ is:1. A lawsuit brought to establish an important legal principle or right. Such an action is frequently brought by the parties’ mutual consent on agreed facts – when that is so, a test case is also sometimes termed amicable action or amicable suit; or2. An action selected from several suits that are based on the same facts and evidence, raise the same question of law, and have a common plaintiff or a common defendant. Sometimes, when all parties agree, the court orders a consolidation and all parties are bound by the decision in the test case. – Also termed test action.In the present case, the action brought by the SBS Transit drivers to transfer the suit falls within the definition of a “test case”, as it fits the second definition stated above, said Justice Lim.She also rejected SBS Transit’s submission that a test case should, on top of the second definition above, include case management “or other concerns which would make the matter unsuitable for determination by the State Courts”.On 3 Mar last year, five bus drivers argued that by failing to compensate its bus drivers at the basic hourly rate of pay for their waiting time between shifts, SBS Transit had breached an implied term stated in their service agreement.The lawsuit arose after the two parties had failed to reach a settlement in their final mediation session between the first tranche of suits as reported in Feb last year.In a statement of claim filed in the State Courts that month, the bus drivers alleged that the company has breached several provisions under the EA — the statutory legislation upon which the terms and conditions pertaining to their working hours and overtime were based on.The bus drivers claimed that SBS Transit had failed to compensate them at the basic hourly rate of pay “for the period between 4 a.m. to 5 a.m. on the morning and split shifts” in which the drivers are “engaged to be waiting”, and “between 9 a.m. and 1 p.m. on the split shift”.SBS Transit, they added, had also failed to abide by Clause 24(9) of the Service Agreement by not compensating them the agreed allowance of $18 for work done on the night shift.The company, they alleged, had also breached Section 36(1) of the EA by failing to provide on a roster a weekly rest day.In addition, the company had violated Section 37(3)(b) and Section 37(3)(c) of the EA by not paying them “the statutorily prescribed rate” of a sum at the basic rate of pay for two days’ worth of work, the bus drivers argued.By imposing a “Built-In Overtime” that resulted in the bus drivers working for longer than the statutorily prescribed daily work period of eight hours as well as 44 hours per week, SBS Transit had also breached Section 38(1) of the EA, according to the bus drivers.Other breaches under the EA allegedly made by SBS Transit, as claimed by the bus drivers, include compensating them at the normal hourly rate of pay — instead of the statutorily prescribed rate of an extra day’s salary at the basic rate of pay for one day’s work, in addition to the gross rate of pay for that day — for work done on public holidays.The five additional bus drivers bring the total number of bus drivers currently taking legal action against SBS Transit to 13. © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/17/bus-drivers-launch-crowdfunding-campaign-for-legal-fees-in-suit-against-sbs-transit-goal-set-for-s90000/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}