{"Type": "", "Time": "2021-06-18", "Headline": "If the Peoples' Association can't really represent all people, is it obsolete? - The Online Citizen Asia", "Text": "Ever since Ms Sarah Bagharib called the Peoples’ Association (PA) out for using her wedding photographs without her permission in its Hari Raya Aidilfitri display at an HDB estate in Tiong Bahru, it has generated a firestorm of debate. This alongside a number of disturbing videos that have surfaced, depicting blatantly racist behaviour has led a number of politicians from both the Peoples’ Action Party (PAP) front and the opposition fronts to opine.Perhaps bowing to public pressure, the PA has issued an apology of sorts to Ms Sarah. I say “an apology of sorts” because while the word “apologise” has been used, it is an apology that is loaded with caveats and reservations.I accept that neither the PA nor the third-party vendor may have been intentionally racist — this begs the question: Can something be racist without a racist intent?This is a nuanced question without a simple answer. It is however important to acknowledge that when managing people’s emotions and feelings, there is never a simple answer and we must not let our desire to be efficient cloud our empathy.First things first, I think it is probably fair to say that Singapore is systemically set up to cater for the majority Chinese race. From advertisements on TV to speaking only Chinese in certain restaurants, the subtext is that the minorities must adapt. One might say this makes logical sense but I would urge you to pause there. Many of our minority fellow citizens are not new immigrants. They like us (the majority race) were born and bred here, the descendants of immigrants. For some of our Malay brothers and sisters, they have been geographically here way before we were!Secondly, while all of these policies that have placed efficiency above all else may not have had a racist intention, it nevertheless could result in racism.  Let me give you an example.On every administration form ranging from local job applications to joining a gym, they ask what race you are. When the practice started, it may have just been a question of simple efficiency. Listing your race upfront makes it easy to gather data etc. But the shadow of this approach is that it gives an opportunity for those who may harbour racist intentions to exclude races they do not like. So, this is an example of non-racist intentions giving birth to racist effects.By simply focussing on intent, we are missing the forest for the trees. This isn’t a blame game — it is about the acknowledgement that some practices have had racist effects (regardless of intent) and we must do better because the damage is real!The PA has bristled at accusations that it could be racist, preferring to hide behind the term “culturally insensitive”. But calling a spade a spade, isn’t cultural insensitivity a part of racism, albeit on a lower scale?“These are accusations we reject. While the error was culturally insensitive, it was certainly not racist. It is not right to raise the allegation of racism, without basis, to stoke emotions and sentiments”.From the PA’s perspective, they are part of a structure that is very much dominated and run in a way that caters systematically to the benefit of the majority Chinese race. While they run events that ostensibly celebrate minority culture, it seems to be done more as a box-ticking exercise. In other words, it is done on autopilot without much thought.This is the crux of the issue with the usage of Ms Sarah’s photographs. It was lazy because the PA has fallen into the trap of stereotyping and generalising minorities. Hari Raya equals Malay. Malay costume equals Hari Raya. It may not be intentional racism, but it still has racist effects. This is especially so if the lived experience of the minorities in Singapore is one where this sorts of casual and careless racism plague their daily existence.So, is it really right for the PA to dismiss this as an “isolated incident”? Is it also not itself making an accusation that Ms Sarah is stoking sentiments when it does not want to be accused of being racist? Pot calling kettle black!This is the terminology that can have a gaslighting effect. Many have also dismissed the video of Mr Dave Parkash being chastised by a senior lecturer from Ngee Ann Polytechnic as an “isolated incident”. But is it really? People all over social media have shared their own experiences of being minorities in Singapore and it is clearly not “an isolated incident”. Is highlighting incidences of racism, however inadvertently “stoking emotions or sentiments”? Is the PA saying that minorities should just suck it up?While the PA may not have made this exact mistake before, can it categorically say that it has not been guilty of racial stereotype and other incidences of racist effects without intent?For the PA to call it simply an “oversight” is just not good enough. It isn’t an oversight. It is a lack of regard and that is what they should be apologising for. It is fine to state that it had not intended to be racist but despite that, the lack of care did result in a racist outcome. Apologise for the outcome and pledge to do better. End of story.The PA has claimed that it finds Ms Sarah’s public call for messages or suggestions that they would like to have relayed to the organisation in their meeting an “odd” one.I appreciate the PA’s point of view if it misguidedly views this as an “isolated incident”. But you see, if you truly listen to the lived experience of minorities, this is not at all an isolated incident. Minorities do not often have a platform because we don’t allow them one. Every time something is raised, we silence them with the hammer of “this is an isolated incident”. Is it really that surprising that Ms Sarah is trying to give voice to the many minorities who have not been given a voice?Yes it “has gone far beyond the Radin Mas incident” but it needs to and the PA is a good start. After all, isn’t it called the PEOPLES’ ASSOCIATION? If it cannot represent the people, then maybe it is obsolete.Let’s not miss a golden opportunity to have a much-needed discussion.To simply issue a surface apology without deep reflection hoping that the matter will die down is just not good enough because this issue isn’t just about the use of photographs without permission. It is a reflection of our society’s ignorance. If we accept the PA’s apology as it stands, we are saying that it is OK for the majority race to remain ignorant. © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/16/if-the-peoples-association-cant-really-represent-all-people-is-it-obsolete/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}