{"Type": "", "Time": "2021-06-18", "Headline": "Kim Jong-un admits North Korea facing a 'tense' food shortage - BBC News", "Text": "North Korean leader Kim Jong-un has formally acknowledged that his country is facing food shortages. Addressing a meeting of senior leaders, Mr Kim said: \"The people's food situation is now getting tense\". He said the agricultural sector had failed to meet its grain targets due to typhoons last year, which caused flooding.There are reports that food prices have spiked, with NK News reporting that a kilogram of bananas costs $45 (£32).North Korea has closed its borders to contain the spread of Covid-19. Trade with China has plummeted as a result. North Korea relies on China for food, fertiliser and fuel. North Korea is also struggling under international sanctions, imposed because of its nuclear programmes. The authoritarian leader of the single-party state talked about the food situation at the ruling Workers' Party central committee which started this week in the capital Pyongyang.During the meeting, Mr Kim said that national industrial output had grown by a quarter compared to the same period last year.Officials were expected to discuss relations with the US and South Korea during the event but no details have been released yet.In April, Mr Kim made a a rare admission of looming hardship, calling on officials to \"wage another, more difficult 'Arduous March' in order to relieve our people of the difficulty, even a little\".The Arduous March is a term used by North Korea officials to refer to the country's struggle during the 1990s famine, when the fall of the Soviet Union left North Korea without crucial aid. The total number of North Koreans who starved to death at the time is not known, but estimates range up to three million.It is highly unusual for Kim Jong-un to publicly acknowledge a food shortage. But this is a North Korean leader who has already admitted that his economic plan has failed. The problem for Mr Kim is that when he took over from his father, he promised his people a more prosperous future. He said they would have meat on their tables and access to electricity. This has not happened. Now he's having to prime the population for more hard work. He is trying to tie this into the global pandemic, and state media reported that he pointed out to party officials that the situation across the world is getting \"worse and worse\". With so little access to outside information, he can paint a picture of things being bad everywhere - not just in sealed off North Korea. He also described efforts to beat Covid-19 as a \"protracted war\". That signals that border closures are not easing any time soon. That is the concern of many aid organisations. The sealed border has prevented some food and medicine getting through. Most NGOs have had to leave the country, unable to get staff and supplies in or out.Pyongyang has always called for \"self-reliance\". It has closed itself off, just as it may need assistance and it is unlikely to ask for help. If it continues to push away all offers of international assistance, as ever, it may be the people who pay the price. N Korea's Kim warns of crisis amid famine threatThe South Koreans enslaved in the North's minesNorth Korea's missile and nuclear programmeNorth Korea claims 'new' missiles testedHow Trump offered Kim a ride on Air Force OneUS Supreme Court rejects big challenge to ObamacareThe justices' 7-2 ruling preserves medical insurance for millions of low-income Americans.Iran presidential vote marred by disqualificationsBiden signs bill creating Juneteenth holidayOnce the future, US now captive to its pastWhy US millennials are quitting big cities. VideoWhy US millennials are quitting big citiesWhat's the big deal about In The Heights?Ethiopia election: A sham or democratic rebirth?Quiz of the week: What was on the G7 menu?Asia's Covid stars struggle with exit strategiesBBC Future: The forgotten tricks of 'letterlocking'Alarming Covid surge cools Russia’s football feverThe islanders up in arms on this Indian archipelagoFootball phrases15 sayings from around the worldUS couple who waved guns at protesters plead guilty1Victoria’s Secret hires Megan Rapinoe in rebrand2US Supreme Court rejects big challenge to Obamacare3Once the future, US now captive to its past4Women sue Pornhub alleging lack of consent5Two US executions halted over lack of firing squad6David Guetta sells his songs for a nine-figure sum7Osaka will not play at Wimbledon8Iran presidential vote marred by disqualifications9Outrage in Italy after cable car crash video aired10© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "Section": "", "Writers": "", "URL": "https://www.bbc.com/news/world-asia-57507456", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}