{"Type": "", "Time": "2021-06-18", "Headline": "Singapore loses its top spot in global competitiveness study, now ranks 5th, Economy News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Singapore has tumbled from its top spot as the world's most competitive economy to fifth place, but remains Asia's top performing economy.The Republic ranked first in the past two years of the Institute for Management Development (IMD) World Competitiveness Ranking, whose latest list was released on Thursday (June 17).IMD is based in Switzerland and Singapore.Switzerland topped the league table, followed by Sweden, Denmark and the Netherlands.IMD said: \"Singapore managed to top the economic performance factor, one of four factors in the ranking, but fell to ninth in global business efficiency and 11th in global infrastructure.\"It ran into problems with job losses, lack of productivity and the economic impact of the pandemic. Similar to other countries that declined, Singapore experienced a shrinkage in its economic activity, in particular, a sharp decline in employment growth, and a sizeable worsening in public finances due to an increase in both government deficit and public debt.\"But Singapore did well with international trade and technological infrastructure, ranking first in both, IMD said.It also ranked highly in international investment and business legislation.IMD said Singapore's physical geography worked against it in the 2021 rankings.\"Geography has played a pivotal role for some economies and while Singapore has done everything correctly, its physical geography has caused it to work harder than other economies and therefore it fell in the rankings.\"Minister for Trade and Industry Gan Kim Yong said: “IMD’s ranking shows that we are facing increased global competition and Singapore cannot afford to stand still or take our economic competitiveness for granted. We must continually strive to provide an environment where businesses can thrive and create good jobs for our people. We must also remain an open and connected hub for global businesses and talent.\"Singapore businesses must be able to seek out new opportunities and transform. Workers have to constantly upskill to remain relevant. The Government will review IMD’s report and enhance our competitiveness.\"The IMD World Competitiveness Ranking ranks 64 economies, by measuring economic well-being through statistical data and survey responses from executives.IMD said: \"The report finds that top-performing economies are characterised by varying degrees of investment in innovation, diversified economic activities and supportive public policy.\"Strength in these areas prior to the pandemic allowed these economies to address the economic implications of the crisis more effectively.\"Among Asian economies, China made the biggest leap up the ranks to 16th place, IMD said.Mr Arturo Bris, director of the World Competitiveness Centre, which produces the ranking, said: \"China, by continuing reducing poverty and boosting infrastructure and education, strengthens the possibility of advancing in the rankings.\"Malaysia, ranked 25th, was also one of the economies that rose in competitiveness, thanks to improvements in the business efficiency of its private sector and relatively healthy public finances despite the disruption brought by Covid-19, IMD said.Meanwhile, Hong Kong ranked seventh because of slight declines in economic performance, business efficiency and infrastructure, but remained in the top spot in government efficiency.The Philippines also fell in the ranking to 52nd, driven by a deterioration in several indicators related to the domestic economy, the job market, public finances and the productivity of firms in the private sector.Overall, the report found that innovation is the bedrock of long-term performance, with education and other factors driving both a productive workforce and research.Singapore, Switzerland and the Nordic economies do well in this aspect, it said.Digitally advanced economies that have seamlessly transitioned to work-from-home arrangements have also thrived compared with their peers, it added, with Singapore leading in this area.IMD said: \"The global trends seen in the rankings show the importance of innovation, digitalisation of the economy, welfare benefits and social cohesion.\"Competitive economies succeeded in transitioning to a remote work routine while also allowing remote learning. Addressing unemployment has been fundamental.\"  Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/economy/singapore-loses-its-top-spot-in-global-competitiveness-study-now-ranks-5th", "Source": "google"}