{"Type": "", "Time": "2021-06-18", "Headline": "Malaysia: Law Minister Takiyuddin says King did not specify when Parliament should reconvene - stoking netizens' anger as His Majesty decreed \"as soon as possible\" - The Online Citizen Asia", "Text": "KUALA LUMPUR, MALAYSIA — De facto law minister Takiyuddin Hassan has come under fire from members of the public for stating that the King did not specify when Parliament should reconvene, after His Majesty had called for sittings to resume “as soon as possible”.Comptroller of the Royal Household, Ahmad Fadil Shamsuddin, in a statement from the National Palace on Wednesday (16 June), said that Al-Sultan Abdullah Ri’ayatuddin Al-Mustafa Billah Shah recognises Parliament’s role as “an important platform” for elected representatives to discuss various issues of public importance, including the COVID-19 in the country.“His Majesty is of the opinion that having a stable and solid Government that can effectively manage the COVID-19 pandemic and rehabilitate the nation’s economy is imperative,” the statement read.Allowing Parliament to reconvene will enable Members of Parliament (MPs) to discuss pressing matters such as the Government’s spending allocation for the purpose of assisting the people, especially those who are currently facing economic hardship as a result of the pandemic and the restrictions imposed because of it.“After deliberating on the views of political leaders as well as those of the Independent Commission on the Emergency 2021 and experts from Government agencies, His Majesty expressed the view that Parliament sittings must be held as soon as possible,” said the Comptroller.This is to enable MPs to debate the Emergency Ordinances and the National Recovery Plan, he said.The Palace’s announcement came after Al-Sultan Abdullah chaired a special meeting with the Council of Rulers on Wednesday.Takiyuddin in a discussion with Bicara Harakah the same day, however, said: “His Majesty did not specify any particular date … He said it should be held as soon as possible. So the Prime Minister can announce, for example, that Parliament will reopen in September or October.”Takiyuddin also said that the number of people to be admitted into the Parliament physical space has to be taken into consideration when deliberating on the reopening of the House.“You need to take into account the number of people who will be present. A closed area like the Dewan Rakyat could accommodate 222 MPs. But what about the government officers on duty, the heralds for the Speaker, Deputy Speaker, and Secretary to the Dewan Rakyat?” He questioned.Takiyuddin added that members of the public present outside the halls and Parliament staff must also be taken into view when considering whether to allow Parliament to reconvene at this stage.“We have been informed that every time Parliament convenes, there are at least 1,000 people on the grounds,” he said, noting that such is why only a hybrid Parliament configuration would be feasible at this point.“This way, we will determine who will attend the sittings as well as the number of MPs attending, among other (criteria). In tandem with Parliamentary rules, the minimum quorum needed for the Dewan Rakyat and Dewan Negara would be 26 MPs and 10 Senators, respectively,” said Takiyuddin.Legal issues, however, may pose barriers to even a hybrid Parliament configuration.“The Standing Orders state that attendance by MPs must be physical, and those not in attendance physically cannot vote,” said Takiyuddin. For a hybrid Parliament to be materialised, said Takiyuddin, amendments must be made to the Standing Orders.“So this hybrid Parliament needs to be studied and prepared for. But I wish to stress that the government remains committed to the democratic process involving Parliament.“The Prime Minister has stated that the Government will reconvene Parliament once it is confident that standard operating procedures can be met. It is not that we do not wish to reopen Parliament, but it will be done in accordance with the new norms,” Takiyuddin said.Many commenters criticised Takiyuddin’s remarks in the livestream, asking why the minister appears to be challenging the royal opinion and “shifting the goalposts” by stating that “as soon as possible” could mean some time in September.The “goalposts” remark was made in reference to Takiyuddin’s response to the Dewan Rakyat’s Deputy Speaker, Azalina Othman Said’s statement on the Cabinet’s role in advising the King regarding the Emergency.The Government, she said, should not “shift the goalposts” just as the Emergency period approaches the finish line.“No one is shifting the goalposts, what’s being done is adjusting the Rules of the Game to help the Referee make the right judgement. ‘To achieve goals does not mean to change the goal post’,” said Takiyuddin in a tweet on 12 June.Tiada siapa yang alih tiang gol, yang dibuat adalah betulkan Peraturan Permainan supaya membantu Referee buat pengadilan yang betul. “To achieve goals does not mean to change the goal post”. pic.twitter.com/7WGmrNmNGP— Takiyuddin Haji Hassan (@takiyuddin61) June 12, 2021One commenter urged Takiyuddin: “What are you waiting for dato, issue a memo for (Parliament) sitting tonight. Let the sittings commence next week..”“The King asked for Parliament to reconvene immediately to enable the Emergency to be discussed and debated by Members of Parliament. That has to be prioritised. Do not speak nonsense,” said another.“This government has failed to the point of forcing His Majesty to call a meeting with the Malay Rulers and other parties to discuss the nation’s future,” one commenter said.“Ministers have received two doses of (the COVID-19) vaccine.. The King has already given his decree.. So don’t give stupid excuses to avoid reopening Parliament,” said one commenter.“Who are you to question (the King’s decree). Enough, reopen Parliament. Put your Pfizer jab to good use,” another chimed in.One commenter questioned the need for a hybrid parliament — one comprising physical and virtual sittings — saying that many others do not have the option to work online.“Just go. Thousands of factory workers come (to work as usual). Seems ok,” they said.“What is there to be proud of with receiving many ventilators during the Emergency when cases are spiking simultaneously? Repeated MCOs… Many committing suicide due to extreme distress in life (during this period). They did not die because of COVID,” said one commenter.During the total lockdown, most economic sectors remain closed, except for essential services such as supermarkets and pharmacies. As a result, many people whose professions do not offer the option to work from home are placed on unpaid leave or are even laid off.Last week, the King had a succession of physical meetings with political leaders such as UMNO president Ahmad Zahid Hamidi and leaders from the Pakatan Harapan coalition.Ahmad Zahid said on 11 June that he had mooted the prospect during his hour-long audience with Sultan Abdullah “to ensure the country’s democratic system is defended”.“It was obvious that even without the emergency, the government could previously handle matters related to fighting the COVID-19 pandemic,” he added.While calling for an end to the Emergency, the Bagan Datuk MP also proposed the resumption of Parliament sittings.“UMNO believes that Parliament is an important official platform to voice the people’s concerns (on matters such) such as loan moratoriums, i-Sinar and i-Lestari 2.0 and other forms of assistance for everyone,” he said.Ahmad Zahid is one of several politicians who have openly spoken up against the state of Emergency and the suspension of Parliament, the latter of which is enabled by the former.Parti Keadilan Rakyat president Anwar Ibrahim in January filed a suit against Muhyiddin and the federal government, on the grounds that the latter had allegedly advised the nation’s King to suspend Parliament sittings during the state of Emergency.Malay Mail reported that in a separate statement filed in court, Anwar had argued that the suspension of Parliament under Emergency powers blocks Parliament’s freedom to ensure transparent debates, government accountability, and proper checks and balances on the executive branch of the government in making and enacting laws during the pandemic.Anwar was also one of the politicians who have met with the King this week. He was granted an audience with Sultan Abdullah with Parti Amanah Negara president Mohamad Sabu and Democratic Action Party (DAP) secretary-general Lim Guan Eng — all component parties of the Pakatan Harapan coalition.Former prime minister Mahathir Mohamad, whose Parti Pejuang Tanah Air political party has yet to be registered, also had a meeting with the King, during which he proposed the setting up of a National Operations Council (Mageran) in the present circumstances.Mageran was set up after the 13 May racial riots in 1969 to restore the rule of law and order in the country.Several political leaders have since challenged Dr Mahathir’s proposal to establish Mageran.Ahmad Zahid told reporters that the idea of Mageran should have been brought forth at the start of the Emergency period.He added that he did not discuss the Mageran issue with the King.“I feel it is something normal outside the scope of the existing situation because the Emergency is supposed to cover it but it has been used to achieve other purposes,” said Ahmad Zahid.In a joint statement, Anwar, Mohamad Sabu, and Lim said that their objection is grounded in their belief that for a Parliamentary democracy to truly function, the Emergency must be lifted and Parliament must be allowed to reconvene.“The solution to the people’s problems in relation to COVID-19, the economy and even politics requires a democracy that functions well, and the best avenue to hear out their grievances and to find solutions to them is Parliament,” they said.Prime Minister Muhyiddin Yassin earlier in March defended the Emergency Proclamation, stating that it is not a tool for him to cling on to his position but a pre-emptive move in managing the COVID-19 situation in the country.The Emergency would be lifted earlier than its scheduled end on 1 August if the government is able to control the pandemic situation in the country, he added.“If the independent special committee says [the Emergency] can be put to an end earlier, I will just follow that. We also do not want to be under restriction by such regulations forever,” said Muhyiddin. © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/17/malaysia-law-minister-takiyuddin-says-king-did-not-specify-when-parliament-should-reconvene-stoking-netizens-anger-as-his-majesty-decreed-as-soon-as-possible/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}