{"Type": "", "Time": "2021-06-17", "Headline": "BTS x McDonald's Merch Drop 2 Closer Look & How to Buy | HYPEBEAST", "Text": "K-Pop boyband sensation BTS has collaborated with McDonald’s once again, this time around releasing a capsule collection of merchandise.The collection follows on from the duo’s inaugural drop which comprised of merchandise and an exclusive meal, which led to the limited-edition packaging being resold on eBay and being enshrined by fans. The hysteria shows no signs of going anywhere thanks to this just-revealed second drop of merch, which was designed by the septet (Jin, Suga, J-Hope, RM, Jimin, V, and Jungkook) with McDonald’s.Throughout the collection, you’ll spot numerous references to their latest single, “Butter,” which was a huge success for the boy band as the song broke BTS’ own previous record for the highest amount of YouTube plays in 24 hours. Naturally, buttery objects and the word “Butter” now find themselves spread all over T-shirts (along with the word “Melty”), as well as bucket hats, tote bags, and more.\nSeunghoon Jeong/Hypebeast\nSeunghoon Jeong/Hypebeast\nSeunghoon Jeong/Hypebeast\nSeunghoon Jeong/Hypebeast\nSome clever dual-branding has also been developed for pieces such as the zip sweater, which combines the McDonald’s fries holder with the butter branding and a zipper that’s stamped with both of the collaborators’ monikers. For something a little less overtly branded, opt for BTS x McDonald’s socks, but if you’re a die-hard fan, there’s always the option to pair these white tube socks with the yellow slides.\nThe BTS and McDonald’s collaboration can be seen in HYPEBEAST’s exclusive editorial shoot above, and the whole collection is available to purchase on the Weverse Shop at 7 p.m. ET on June 17.\nFor more musical link-ups, Billie Eilish has a Jordan collaboration on the way.\n\n\n                                                                                                    Gain access to exclusive interviews with industry creatives, think pieces, trend forecasts, guides and more.\n                        We charge advertisers instead of our readers. If you enjoy our content, please add us to your adblocker's whitelist. We'd really appreciated it.\n                    \nLearn More ›\n", "Section": "", "Writers": "", "URL": "https://hypebeast.com/2021/6/bts-mcdonalds-merch-collection-drop-2-closer-look-where-how-to-buy-kpop", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}