{"Type": "World", "Time": "2021-06-17", "Headline": "Putin and Biden will not be friends but see path together", "Text": "GENEVA: There was no talk of gazing into Vladimir Putin's \"soul\" and the Russian president didn't try to gaslight a rookie US leader.Instead, Putin's first summit with the fifth US president of his tenure, Joe Biden, was about mutual respect - and themeeting in Genevacould, both of them said, lead to a more predictable, if still tense, relationship.In contrast to his predecessors, Biden made no suggestion he expected to reset the relationship and he has already piled pressure on Russia over concerns including alleged election meddling, attacks by cybercriminals against the Colonial Pipeline and other US infrastructure and over the poisoning and jailing of dissident Alexei Navalny.But after earlier remarks that included calling Putin \"a killer\", Biden on the eve of the summit described the Russian leader as \"a worthy adversary\" and at a news conference afterward said that they would see where they had common interests.Putin, who at his 2018 summit with Donald Trump in Helsinki was widely seen as dominating the reality television star turned president, called Biden \"a very experienced politician\" who was able to speak in rare detail in the \"very constructive\" more than three hours of talks.\"Biden generally is someone who wants constructive relations. He doesn't consider Putin a friend,\" said Ian Bremmer, president of the Eurasia Group political risk firm.Similar to his view of Chinese President Xi Jinping, Biden \"doesn't trust them but he does expect Russia will act in its interest and the two countries have some interests that overlap and where we should work together,\" Bremmer said.Bremmer said the test of the relationship will come afterward.\"I want to see that in the next three months we have materially fewer ransomware incidents and nothing of the scale that we had against Colonial Pipeline that comes from Russia. That's absolutely critical.\"GROUNDWORK FOR FUTUREPutin made no promises at his news conference on cybercrime, appearing to deny Russian involvement, but Biden, signalling that he sent a warning, said that Putin\"knows there are consequences\"for Russian actions.The leaders said they would return ambassadors to each other's capitals and that diplomats would work on the release of prisoners.\"I'm not sure how much better it could have gone but it could have gone much worse. This could have been name-calling, posturing, lecturing, talking past each other,\" said Yuval Weber, a Russia expert at the Wilson Center's Kennan Institute and professor at Texas A&M's Bush School of Government and Public Service in Washington.Unlike in the Cold War, when US and Soviet leaders would come together to sign accords on major issues such as nuclear weapons, Biden and Putin never expected breakthroughs in Geneva, Weber said.\"What they were looking for was whether they can get along well enough in person to keep the conversation going,\" Weber said.Weber said that Putin was \"notoriously a very thin-skinned person\" who was likely unsettled by Biden's initial comments on him.By calling Putin a \"worthy adversary\" and speaking of Russia as a powerful nation, Biden is following a strategy of \"saying things that Putin can then latch onto,\" Weber said.US PARTISAN DIVIDEFormer president Barack Obama infuriated Putin by calling Russia, which backs separatists in Ukraine, a \"regional power\" acting \"not out of strength but weakness\".But Obama, like previous presidents, took office hoping to restore relations with Russia. George W. Bush famously said after meeting Putin in 2001 that he could \"get a sense of his soul.\"Trump broke the mould by voicing admiration for Putin. After his 2018 summit in Helsinki, Putin drew criticism even within his own Republican Party when he appeared to take at face value Putin's denial of election interference - even as Putin also openly said he wanted Trump to be president.Republicans quickly attacked Biden over the Geneva summit, saying he should have been more confrontational.\"Summits are about delivering results,\" said Jim Risch, the top Republican on the Senate Foreign Relations Committee. \"To learn there was no tangible progress made with Russia on any issue is both unfortunate and disappointing.\"But Senator Bob Menendez, the Democrat who heads the committee, praised Biden for \"bluntly speaking truth\" to Putin.\"This was a necessary reality check for Putin and a welcome departure from the past four years of Trump's coddling of the Kremlin,\" Menendez said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Vladimir Putin,Yuval Weber,Joe Biden,news and politics,summit,Russia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/putin-and-biden-won-t-be-friends-but-see-path-together-15030372", "Source": "google"}