{"Type": "", "Time": "2021-06-17", "Headline": "Cristiano Ronaldo Coca-Cola Incident at Euros Shows Limit of Sports Influencers - Bloomberg", "Text": "Star footballer Cristiano Ronaldo’s Coca-Cola incident should be a wake-up call to consumer groups.Give the fans what they want.It’s the flipside of the rise of sports influencers.When Cristiano Ronaldo shrugged off some Coca-Cola at a Monday press conference for the UEFA European Football Championship, it coincided with a sell-off in shares of The Coca-Cola Company. The incident shows how individual star power, amplified by huge social media followings, can upend partnerships that companies have struck with teams and events. Coca-Cola is one of the official sponsors of UEFA Euro 2020 (the games were postponed from last year), alongside brewer Heineken NV, as well as Just Eat Takeaway.com NV, Qatar Airways QCSC, Bytedance Ltd’s Tiktok and Chinese electronics group Vivo. Data provider SportBusiness estimates that sponsors pay about 30 million euros ($36 million) to align themselves with the tournament.Even though the company doesn’t sponsor the footballer himself, it was directly affected by his actions. The Portuguese captain — and all-time top scorer in European Championship history — pushed a couple of Coca-Cola bottles away from himself and held up some water before declaring “agua.” It was as though he was encouraging people to drink the latter instead, and that was enough to make investors nervous about the soda maker’s prospects.For the past five to 10 years, companies have pivoted away from teams and toward individuals, such as Ronaldo, who has a deal with Nike Inc. Coca-Cola was prudent in spending its marketing bucks on a global event with multiple games and players as opposed to any one star — this should have spread its risks. But the sheer clout of influencers today means that companies even on their periphery can’t escape the perils that come with them.If there’s any one person to blame for this, it’s Kim Kardashian. The reality star and entrepreneur helped spawn the influencer industry, where sports figures, pop stars and those with a flair for fashion or cosmetics rack up of millions of fans who are keen to buy what they wear or use.Ronaldo is the world's most followed footballerSource: InstagramAdidas AG is a case in point. It has cut back on the number of sports teams it sponsors, instead focusing its marketing spend on the likes of individual star players, such as Paul Pogba and Lionel Messi. In its broader sportwear and lifestyle business, it has a longstanding partnership with rapper Kanye West and most recently added Beyonce’s Ivy Park sports fashion range to its stable.Rival Nike has a long history of courting top individual sportspeople, most famously on the basketball court through its partnership with Michael Jordan. Today it counts LeBron James in the sport, as well as Serena Williams and  Naomi Osaka in tennis. Although it’s recently picked up some team apparel sponsorship deals, according to Bloomberg Intelligence’s Poonam Goyal, Nike has remained committed to its celebrity ambassadors to connect with consumers and boost its visibility.The most obvious risks to this approach are that the stars misbehave or decamp to another sponsor. That happened most recently when gymnastics star  Simone Biles left Nike for Gap Inc.’s athleisure division Athleta. But celebrities’ influence and social media reach — Ronaldo has 300 million followers — extend well beyond the companies that endorse them. They have implications for groups that simply come into their orbit too.Sponsors do tolerate individual players’ preferences. For example, some object to being associated with alcohol and gambling. Paul Pogba, who is a practicing Muslim, on Tuesday removed a bottle of Heineken from the press conference held after he was named Man of the Match following France’s win against Germany. (It was non-alcoholic but this may not have been obvious to the player.) Heineken shares rose 1.4% on Wednesday.  But Ronaldo’s snub seems to fall into a different category, even though the player is known for a strict diet and fitness regime that has kept him playing at the age of 36, the twilight zone for most football careers. That’s a worrying sign for consumer goods groups.National football associations generally make players adhere to certain requirements, such as attending press conferences and wearing the correct kit. But there are no rules that govern this particular scenario with Coca-Cola. The Portuguese football association that Ronaldo belongs to will probably be reminded of its players’ responsibilities. But disciplinary action looks unlikely. Even so, what would a fine do to a rich and powerful soccer player, aside from inflame the situation further?While social media has ripped up the rulebook on corporate sponsorships, and companies must navigate the new world of Instagram and TikTok, Coca-Cola can hope that at least one thing has endured: There is no such thing as bad publicity.This column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners.To contact the author of this story:Andrea Felsted at afelsted@bloomberg.netTo contact the editor responsible for this story:Nicole Torres at ntorres51@bloomberg.net", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/opinion/articles/2021-06-17/cristiano-ronaldo-coca-cola-incident-at-euros-shows-limit-of-sports-influencers", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}