{"Type": "", "Time": "2021-06-17", "Headline": "Pogba plays down Ruediger’s ‘nibbling’ incident, Latest Football News - The New Paper", "Text": "France midfielder Paul Pogba said Antonio Ruediger \"nibbled\" at his back during the world champions' win over Germany in their Euro 2020 opener yesterday morning (Singapore time), but sought to play down the incident after the game.Television replays showed German defender Ruediger putting his mouth on Pogba's shoulder just before half-time at the Allianz Arena in Munich.Pogba cried out immediately and complained to Spanish referee Carlos del Cerro Grande, who did not punish the German.\"I think he nibbled at me a little bit, but we've known each other for a long time. Toni and I are friends. It was nothing big. We hugged after the game and it's over,\" Pogba said.The Manchester United midfielder said it was \"better\" that no punishment was meted out to the Chelsea centre-back.  \"I don't want him to be suspended because of that,\" said the 28-year-old, adding that he was glad there was no \"yellow or red card for such an incident\".Pogba, the Star of the Match, delivered several moments of quality as the link between midfield and the attacking trident of Antoine Griezmann, Kylian Mbappe and Karim Benzema.It was his sublime pass in the 20th minute that unlocked Germany's defence, allowing left-back Lucas Hernandez to drive in a cross that Mats Hummels turned into his own net.\"Pogba was absolutely immense tonight,\" France's Euro 2000 winner Robert Pires told Uefa's website. \"We know all about his technique. He's back to his best, physically.\"France coach Didier Deschamps was happy with his team's commitment, but said they must improve on their 40 per cent possession.While it was not a five-star display, Les Bleus won with something to spare as both Benzema and Mbappe had goals ruled out for offside.As France's much-vaunted attack gets all the attention, former United skipper Roy Keane believes their defence should get some praise too.\"We spent all night talking about France's attacking players, but again another clean sheet,\" Keane told ITV Sport.\"That's a defence that can win them the title. They are brilliant at the back.\" - AFP, REUTERSGet The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/sports/football/pogba-plays-down-ruedigers-nibbling-incident", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}