{"Type": "", "Time": "2021-06-17", "Headline": "Analysis: Ronaldo and Pogba's snub of Coke and Heineken raise questions on sponsorship authenticity", "Text": "Coca-Cola and Heineken, sponsors of UEFA EURO 2020, were recently snubbed by football players Cristiano Ronaldo and Paul Pogba after the players slid the bottles away from themselves during two separate press conferences. Multiple media outlets including CBS News, Reuters, NBC News and The Washington Post reported that Cristiano Ronaldo moved two bottles of Coke away from him as he sat down for a press conference on 15 June. He then held up a bottle of water and said: “Agua (water).”According to CBS News and The Washington Post, Coca-Cola’s market value dipped by US$4 billion by the end of the press conference and its shares have also dipped 1.6% to US$55.22. Shares dropped by another 0.6% to US$55.08 on 16 June, CBS News added. That same day, Pogba also removed a bottle of Heineken’s non-alcoholic 0.0 beer when he settled down for a press conference. The French footballer is known to be a practising Muslim. In response, Heineken told MARKETING-INTERACTIVE: \"We fully respect everyone’s decision when it comes to their beverage of choice.\"In 2019, Coca-Cola came on board as the official non-alcoholic beverage sponsor for UEFA EURO 2020. The brand has enjoyed a long partnership with UEFA, having first signed up to sponsor UEFA European football’s premier national team tournament in 1988, UEFA said in a press statement previously.  Meanwhile, Heineken also signed a sponsorship agreement in 2019 to become the official beer partner of UEFA EURO 2020. According to UEFA, the sponsorship deal includes exclusive pouring rights at stadiums, fan zones and fan villages during the tournament, LED pitch boarding exposure, digital rights, Man of the Match presentations, match screenings and ticket giveaways. Heineken will also activate global TV and digital integrated marketing campaigns using its global football ambassador, Thierry Henry. MARKETING-INTERACTIVE has reached out to Coca-Cola and UEFA for comment.These two incidents highlight the importance of authenticity in brand sponsorship. In this case, Jay Milliken, Prophet’s senior partner, said Coca-Cola and Heineken are pushing the boundaries of authenticity with their sponsorship. While both brands have authentic links to viewers of the tournament, Milliken said they “badly missed the mark” at being authentic in the setting of a post-match interview.“For Coca-Cola and Ronaldo, it is no surprise that a world-class athlete and avowed fitness fanatic would react negatively to bottles of soda placed in front of him insinuating that Coca-Cola would be his post-match beverage. For Heineken, Paul Pogba removed a bottle of beer due to his religious beliefs. The person at fault in the Pogba situation is whoever thought it would be a good idea to place that bottle in front of him,” he said. For Heineken, in particular, the brand already had its logo on the press conference backdrop. Hence, Milliken said there was no authentic need for its product to be put in front of athletes.Alcohol and soda brands can both establish credibility for fans and viewers. But I don't think they show up as credible or authentic in a post-match interview setting. \"I'm sure many people watching the games were drinking alcohol and soda,\" he added. Using McDonald’s as an example, Milliken said while the brand used to sponsor the Olympics, viewers never saw the brand place a Big Mac in front of a gold medal winner.Agreeing with Milliken is another industry player who commented on the condition of anonymity. He told MARKETING-INTERACTIVE that at the end of the day, water and not any other beverage is what should have been on the table. In this case, \"Coca-Cola got what it deserved\", the industry player said since it was hoping to get a free ad out of the press conference should Ronaldo have popped open the bottle.In the case of Heineken, it is common for alcohol brands to come on board as sponsors for professional sports events, such as Carling Brewery with the English Premier League, Diageo with the National Football League in the US, and Hennessy with the NBA. While there is no issue with alcohol or spirits brands becoming sponsors, the industry player explained that the beverage is never served during a press conference and viewers seldom see an athlete chugging down booze. He added that a brand may sponsor a league but the player(s) concerned may not be endorsees or comfortable with the product. While players generally do not object against a brand, the industry player said when a brand \"ambushes them with a stunt like this\", players have the right to do so. He added:I feel it is sneaky because the brand is attempting to get free ads out of it.To prevent similar snubs from happening, the anonymous industry player said football players need to be aware that the brand’s product is being served and give them an alternative option. Either that or the organisers have to contractually enforce the brand’s presence with the player. “It is very possible the organiser made promises without the players knowing it. Coca-Cola, for example, could be set on the table as an option besides water but it should not have been the only choice,” he added.Influence of renowned individuals on the financial marketThe dip in Coca-Cola's market value showcases the influence that individuals, whether global athletes or CEOs, now have on brands, share prices, social issues or even financial markets, Duncan Pointer, MD, APEC of digital sports agency Mailman Group said. While this is not the first time athletes have snubbed brands - NBA player Kawhi Leonard removed a Gatorade bottle from the table during a press conference at last year's All-Star Weekend - Pointer said this is probably the first time the industry has seen such an immediate impact on a company's share price.\"In the case of Ronaldo with Coca-Cola, will this have a lasting impact on the brand and its future sales? That’s highly unlikely assuming this is a one-off incident, but what this shows is that brands need to be more considerate in how their products are incorporated into sponsorship packages that include players,\" he explained.Agreeing with him was Peter de Krester, CEO of GO Communications, who said brands today have to be much smarter in how they activate product placement. Gone are the days of simply placing a product in front of someone and expect it to resonate generically with any one person.Personal brands carry equal if not higher weightage with sports stars now considering how much importance they place on their own image and reputations.Ultimately, de Krester said this showcases how delicate brand reputation can become on a large platform. \"Brands should be mindful it can always go both ways if not managed correctly. Both are large heritage brands and we’ve already seen major repercussions to market share following these actions,\" he added.Ensuring a successful brand sponsorshipBesides ensuring there is an authentic link between the brand and the sponsorship, Prophet's Milliken said brands need to establish clear sponsorship goals and actively measure progress. They should also ensure that the brand's marketing is consistently integrated into the sponsorship. Nonetheless, he admits that sports sponsorships do hold some unique risks given that all high-profile professional athletes have their own sponsorship deals which sometimes can conflict with event or team sponsorship deals. A well-known example would be the 1992 Barcelona Olympics when the USA Dream Team won the basketball gold medal. Michael Jordan strategically covered the Reebok logo on his team uniform with the American flag so as not to be photographed wearing a Nike competitor.Photo courtesy: 123RF and Heineken's FacebookRelated articles:Coca-Cola to hold marketing spend for regions slow to recover#MarketingExcellenceAwards MY 2020 highlight: How Coca-Cola MY cracked open happiness for football fansCoca-Cola's Chinese New Year campaign will warm your heartCoca-Cola to axe 200 brands, continues to evaluate spend with third-party agenciesCoca-Cola rides K-pop wave with global BTS campaign starting in Indonesia", "Section": "", "Writers": "", "URL": "https://www.marketing-interactive.com/analysis-ronaldo-and-pogbas-snub-of-coke-and-heineken-raise-questions-on-sponsorship-authenticity", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}