{"Type": "", "Time": "2021-06-17", "Headline": "Bukit Merah View food centre cluster: 14 staff and 5 visitors test positive for Covid-19, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A total of 14 staff and vendors at the 115 Bukit Merah View Market and Hawker Centre have tested positive for the coronavirus so far, while five visitors to it and nearby shops have also returned positive results for Covid-19.This comes after more than 3,700 people who work in or visited the area have been tested, in both mandatory and voluntary tests.A total of 1,017 test results are still pending, while the rest are negative, the Ministry of Health (MOH) said in response to media queries on Wednesday (June 16).MOH gave the breakdown of the results as follow:- Of the 239 staff who work at 115 Bukit Merah View Market and Hawker Centre since May 25, there have been 14 who have tested positive so far. They have all been in quarantine since June 12.- All 144 owners, tenants and staff of shops and commercial units at 116 Bukit Merah View who were tested have been found negative for Covid-19.- Of the 3,387 visitors to 115 and 116 Bukit Merah View who have stepped forward for the free testing offered by the authorities, five have tested positive, 2,365 have returned negative results, and 1,017 are awaiting results.Bukit Merah View Market and Hawker Centre is closed until June 26 for cleaning. It was originally slated to reopen on Wednesday after a four-day closure.As at Wednesday, 39 people have been linked to the cluster at Bukit Merah View Market and Hawker Centre. Tanjong Pagar GRC MP Joan Pereira said on Wednesday that volunteers of Project Care, a community organisation, will continue to engage hawkers and stallholders to check on their well-being and assure them that they will receive help.Volunteers will also continue to deliver cooked food to the elderly through contactless means, by buying hot meals from 116 Bukit Merah View's food and beverage outlets for them.Through doing so, they will make sure that the seniors are doing fine, she added.\"We have continued to engage our hawkers and stallholders to check on their well-being and assure them we will help them with their various needs,\" Ms Pereira wrote on Facebook.\"They would like me to convey their appreciation to the community for your concern and get-well wishes.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/bukit-merah-view-cluster-testing-at-block-125a-bukit-merah-view-concludes-5-positive-cases", "Source": "google"}