{"Type": "", "Time": "2021-06-17", "Headline": "It used to feel that life hung in the balance during US-Russia summits. No longer | Martin Kettle | The Guardian", "Text": "A transformed global context and the rise of China put any decisions made at Biden’s meeting with Putin into perspectiveLast modified on Thu 17 Jun 2021 05.13 EDTJoe Biden’s meeting with Vladimir Putin in Geneva looked like a summit, sounded like a summit, and in some genuine senses really was a summit. But it was not an east-west superpower summit in the 20th-century sense. It was a bilateral meeting between the leaders of two important countries whose relations are possibly more difficult today than they were in the cold war. Yet life on Earth did not seem to hang in the balance yesterday, as it sometimes could do back then.Throughout its history Russia has often been simultaneously strong and weak, at home and abroad. Now, in a century marked by growing Chinese power and the deep polarisation of its domestic politics, something similar can be said of the United States, too. Relative decline has not made either country less suspicious of the other. Perhaps the most significant thing about their meeting was therefore that it occurred at all. But these two countries no longer bestride the globe.Biden’s first presidential swing through Europe has been choreographed to vindicate his claim that the US is back on the world stage after the chaos of Donald Trump. That claim needs to be interrogated carefully. Biden’s foreign policy team is full of experience. The administration is committed to alliances in ways Trump was not. Even so, the lessons of Geneva, and of the G7 and Nato meetings that preceded it, are that the US is back, but necessarily in a different way and in a different world.The immediate evidence for this is that both the G7 and the Nato meetings focused as much on China as on Russia. In Cornwall the G7 attacked both countries: China for its internal repression and for the unexplained origins of the Covid pandemic; Russia for its use of biological and cyber weapons. In Brussels the next day, Nato leaders did the same: China was portrayed as an expansionist power whose increased military ambitions require an alliance response, while Russia’s Ukraine policy, weapons buildup and hacking were described as aggressive threats.There are important nuances in all this. Some European countries, jealous to guard their trade links with China and fearful of how the US may vote in 2024, are reluctant to join Biden’s stronger critique. The G7 therefore failed to agree on an aid package to counter Beijing’s massive and well-established overseas Belt and Road initiative, or a vaccine aid programme that would address the scale of Asian and African need. Nato’s communique also distinguished carefully between the Chinese “challenge” and the Russian “threat”.The shift of focus to China, driven by the US under both Biden and Trump, is nevertheless a big strategic event. The reorientation of Nato, in particular, is remarkable. But it throws into relief the massive question of whether the western nations possess either the will or resources to carry it through. The signs of division this week will have been noted in Beijing. The west may will the ends, but it does not yet will the means. Biden’s visit to Europe was greeted with immense relief, but its practical effects have yet to be tested.Any temptation to suppose the international order has simply hit the resume button after an unwelcome four-year pause should therefore be resisted. Nevertheless, a US-Russia summit in Geneva still has the capacity to resonate. It was in the lakeside Swiss city, after all, where the two sides came together in 1955 in a tentative effort to ease the cold war. It was there that 1982’s “walk in the woods” produced hopes of an end to the nuclear arms race. And it was in Geneva where, three years later, the Reagan-Gorbachev talks helped quicken a process that would lead to the peaceful collapse of the Soviet Union. That, however, was all more than 30 years ago.Yesterday’s Biden-Putin meeting offered surface continuity with aspects of that past, but crucially not the content. The US and Russia remain major powers, but each is diminished and must operate in the new global context. China’s rise is not the only factor in this. The stagnation of European prosperity, the growing dynamism of Asia and the potential of Africa matter, too. This is also the era of the climate crisis and the daily deployment of cyberweapons, not just of the potentially world-ending nuclear Armageddon that dominated post-1945 international relations.That certainly did not mean there was nothing for the US and Russia to discuss yesterday, or that the summit was unimportant. But the task facing the two is difficult in new ways. The US and Russia are fighting a permanent, mostly low-level conflict. Biden is right to explore the viability of more settled relations. Putin was right to emerge from his Covid-secure cocoon to explore whether Biden takes Russia seriously and is willing to do business with Moscow.None of this is likely to happen soon, though. The best that can be hoped is for a gradually emerging process and some protocols. However, once the Geneva spotlight is dimmed there are, at least in theory, possible bargains that can be explored on cyber, on climate and even potentially on geopolitical issues such as Russia’s near-abroad and the Middle East, just as there still are on arms. These are complex and interwoven issues. They require immense amounts of patient talk, with measured approaches to building necessary degrees of trust, not least with cautious allies. That is in short supply already, as this week showed. The difficulty of some of the compromises that could be involved suggest this may not change any time soon.Martin Kettle is a Guardian columnist", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/commentisfree/2021/jun/17/us-russia-summit-china-biden-putin", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}