{"Type": "", "Time": "2021-06-17", "Headline": "Malaysian king says Parliament must resume despite emergency - The Washington Post", "Text": "KUALA LUMPUR, Malaysia — Malaysia’s king said Wednesday that Parliament, which has been suspended under a coronavirus emergency since January, must resume as soon as possible, but stopped short of saying the emergency should end.The monarch’s comments contrasted with those of Prime Minister Muhyiddin Yassin, who said a day earlier that Parliament can only reopen if new coronavirus infections fall below 2,000 per day and 40% of the population is fully vaccinated. He predicted that could be in September or October.King Sultan Abdullah Sultan Ahmad Shah said he believes Parliament “needs to resume as soon as possible” after consulting with various political leaders, an independent committee advising him on the emergency, and various experts.He said in a statement issued by the palace that lawmakers should be able to discuss the government’s spending allocations to help citizens in distress and efforts to bolster economic recovery.Sultan Abdullah approved Muhyiddin’s emergency plan in early January. The plan was slammed by critics as a political ruse to help the embattled prime minister stay in power amid challenges to his leadership.The emergency, which is due to end Aug. 1, suspends Parliament but includes no other measures. Muhyiddin’s government remains in control and has extraordinary powers to introduce laws without parliamentary approval.It is unclear if Muhyiddin’s comments Tuesday were an indication that he plans to seek an extension of the emergency. If he does, the king’s remarks Wednesday mean the monarch is unlikely to approve it.The palace statement came after the king met Wednesday with the Conference of Rulers, comprising nine ethnic Malay state rulers. In a blow to Muhyiddin, they issued a separate strongly worded statement saying the emergency hasn’t helped curb the pandemic and needn’t be extended beyond Aug. 1.The rulers supported growing calls for Parliament to resume swiftly, saying the government must be accountable to the people in terms of its spending and that efforts to fight the pandemic must not be seen as having a hidden political agenda.Muhyiddin took power in March 2020 after instigating the collapse of Mahathir’s reformist alliance that won 2018 elections and joining with the opposition to form a Malay-centric government. But his government is shaky with a razor-thin majority in Parliament. Muhyiddin faces challenges from within his coalition and from the opposition, but support for his leadership cannot be tested with Parliament suspended.Critics noted daily infections surged to more than 9,000 last month, nearly five times as much as when the emergency was imposed, forcing the government to impose a large-scale lockdown since June that banned social and business activities. New infections still exceed 5,000 a day, with the country’s confirmed total breaching 673,000 and deaths exceeding 4,100.The Malay rulers play a largely ceremonial role but have been vocal in politics recently. They are highly regarded by the country’s Malay majority as the guardians of Islam and Malay tradition.The king and state rulers said vaccinations are key and urged the government to reduce bureaucracy and accelerate efforts to achieve its aim of inoculating up to 80% of the country’s 33 million people. Just over 10% of the population has now been vaccinated.The king had already said in February that Parliament can convene despite the emergency order, but Muhyiddin’s government argued it wasn’t safe because there are many older lawmakers.The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/politics/malaysian-king-says-parliament-must-resume-despite-emergency/2021/06/16/50b98558-cea2-11eb-a224-bd59bd22197c_story.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}