{"Type": "", "Time": "2021-06-17", "Headline": "Eriksen backs team for must-win game, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.COPENHAGEN • Denmark can take heart that Christian Eriksen is recovering and will be cheering them on as they try to salvage their Euro 2020 campaign against Belgium in Copenhagen today.Kasper Hjulmand's side know that their qualification from Group B will be in jeopardy if they get the same treatment that the Belgians dished out to Russia in a 3-0 win on Saturday, and they need to bounce back from their traumatic 1-0 defeat by Finland.Eriksen told the world on Tuesday that he was \"fine - under the circumstances\" following his sickening mid-match cardiac arrest and said he will be right behind the teammates who rallied to his side as medics rushed to save his life.Hjulmand said in a press conference that the 29-year-old midfielder was in daily contact with the rest of the team and was trying to gee up his friends before they face the world's top-ranked team.\"We can focus more and more on football and prepare for the game,\" he said, but admitted that some players might still be rattled.\"We will prepare ourselves as well as possible, but it will be emotional for sure. But we should use these emotions for the match, and get ready to fight.\"He did not want to go into details about who would replace Eriksen in the line-up.\"No one can replace Christian. No one. It's not possible... He is the heart of the team,\" the coach said.\"We will do something else, we'll do something different but we will definitely have a strong team on the pitch.\"The match will be played at the Parken Stadium, where Denmark will have the backing of 25,000 fans after the Scandinavian nation relaxed coronavirus restrictions.The 16,000 home fans present for the Finland match created a wall of noise in the first half as Denmark piled on the pressure, and will be in even fuller voice to cheer on their team today.Some have taken to spray-painting murals in honour of their missing star around Copenhagen.No one can replace Christian. No one. It's not possible... He is the heart of the team.Denmark will need all the support they can get against Eriksen's Inter Milan teammate Romelu Lukaku, whose ominous double in Belgium's win over the Russians showed why at the age of just 28 he is by some distance Belgium's record scorer with 62 goals.Belgium top Group B on goal difference ahead of Russia and can seal their passage to the knockout stage with a game to spare.Roberto Martinez's side have been further boosted by the news that Borussia Dortmund midfielder Alex Witsel is available after recovering from an Achilles tendon injury which had kept him out of action since January.Witsel began running only about a month ago but Belgium's physiotherapist Lieven Maesschalck, who guided the player's recovery, said \"he isn't scared\" about his return. \"He is ready to play even if the risk of a relapse isn't zero,\" said Maesschalck on Tuesday.The news comes after playmaker Kevin de Bruyne trained with the squad for the first time on Monday, sparking hopes he could too play a role against the Danes.The Manchester City playmaker missed the Russia match after having surgery for nose and eye socket fractures suffered in last month's Champions League final.Meanwhile, Eden Hazard, who had done little training with the squad after an injury-filled season at Real Madrid, played 20 minutes against Russia and Martinez wants his captain to be involved today.\"I was very happy with his appearance and think it was a massive step forward. He is playing again with freedom and intuition,\" the Belgium coach said. \"Now it will be important that he shows this over 90 minutes. Against Denmark, he will have to see more action.\"AGENCE FRANCE-PRESSESingtel TV Ch141 & StarHub LiveNow app, 11.50pmJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/eriksen-backs-team-for-must-win-game", "Source": "google"}