{"Type": "", "Time": "2021-06-16", "Headline": "Marine archaeologist's 24-year wait to survey wreck site in S'pore pays off, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - In 1992, maritime archaeologist Michael Flecker applied for a licence to survey the waters around Pedra Branca, an act he described at a public lecture in 2018 as \"a little ahead of my time\".He was 24 years early.In 2016, Dr Flecker would lead a team to survey waters around the island and their efforts would uncover two historical wrecks by 2019 - the first one containing artefacts dating to the 14th century.At the 2018 public lecture, organised by the Singapore Maritime Heritage Interest Group and the Marine Offshore Oil and Gas Association, Dr Flecker described how the local authorities then \"didn't know quite what to do with an application from a private company\", for him to carry out a survey around Pedra Branca, located about 24 nautical miles east of Singapore.  Ongoing negotiations between Singapore and Malaysia during that period over which country had sovereignty over Pedra Branca meant that Dr Flecker's application was put to the side.In the meantime, the Australian added more than 20 archaeological projects to his resume, including the Tang shipwreck near Belitung in Indonesia, whose artefacts are now displayed at the Asian Civilisations Museum.The 58-year-old also earned a PhD in maritime archaeology from the National University of Singapore, and had from 2015 joined the ISEAS - Yusof Ishak Institute as a visiting fellow.Having lived in Singapore for almost four decades and participated in more than 30 overseas archaeological projects in the time, Dr Flecker told The Straits Times how he felt about finally conducting an excavation in Singapore waters. He said: \"It's way beyond any other. There are others - the Belitung wreck is a highlight of course.\"But I've been living in Singapore for nearly 37 years now, so it's fantastic to be able to work on some groundbreaking project which is directly related to Singapore's early heyday - the Temasek period.\"\"There are just some places in South-east Asia and the South China Sea where you can see a rig or rock out in the middle of nowhere, and it's just something that would be worth you spending a lot of time and effort looking because the probability of a wreck being there is very high,\" he said.History has proven Pedra Branca's danger to vessels, he said in his 2018 lecture, listing examples, including the 1796 wreck of the India built merchant vessel, Shah Munchah, which he would find the following year.In 1596, Dutch merchant John Huyghen van Linschoten wrote about the rocky island as \"where ships that come and go from China do oftentimes pass in great danger and some are left upon it\".Hydrographer James Horsburgh, whom the 1851-built lighthouse on Pedra Branca is named after, wrote in 1809 about the Shah Munchah's demise, reporting that the vessel was \"totally lost, by the tide horsing her upon the rock\", while changing course.Dr Flecker said: \"Before she could do that, she was just piled onto the rocks by the current. And the current out there is vicious.\"Having waited more than two decades to study the infamous site, Dr Flecker and his team have left no stone unturned in their surveys since 2016.He told ST that his team had conducted a thorough survey in the shallow waters surrounding the island, spanning as far as 500m away from the island, and that it is unlikely more wrecks in those areas would be found.\"We've covered all the areas of the highest wrecking potential, so we've essentially looked everywhere a vessel could strike,\" he said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/marine-archaeologists-24-year-wait-to-survey-wreck-site-in-spore-pays-off", "Source": "google"}