{"Type": "Asia", "Time": "2021-06-16", "Headline": "US nominee vows closer Taiwan ties but no new framework", "Text": "WASHINGTON: The nominee to be the top US diplomat for East Asia promised on Tuesday (Jun 15) that President Joe Biden would keep building relations with Taiwan, but balked at backing an overhaul of delicate arrangements on the issue with China.Daniel Kritenbrink, a career diplomat tapped to be the assistant secretary of state for East Asian and Pacific affairs, told his Senate confirmation hearing that the relationship with Taiwan was \"stronger than it's ever been\" since 1979, when Washington switched recognition to Beijing.\"It's also incumbent upon us to further develop our robust relationship with Taiwan in every sector,\" Kritenbrink said in response to questions from senators who advocated more US support for the island democracy.Beijing claims Taiwan and has been ramping up pressure, including with a record 28 aircraft incursions reported Tuesday, months after it clamped down on freedoms in Hong Kong.The tensions have fuelled calls by some US analysts and lawmakers to shed a longstanding policy of \"strategic ambiguity\" - not specifying how the United States would respond to a military conflict on the Taiwan Strait - in favor of an explicit, robust promise of defending the self-governing island.Asked if he supported a change, Kritenbrink said that existing US policy including the agreement only to recognise Beijing has \"ensured cross-strait stability and Taiwan's security for these many decades.\"\"As the threat from the PRC grows, as Beijing's aggressive and bullying behavior vis-a-vis Taiwan grows, I think that our response has to be calibrated as well,\" he said, referring to the People's Republic of China.\"But I am confident that the framework that we have, and meeting those obligations in the Taiwan Relations Act, gives us the tools to do so.\"The Taiwan Relations Act, passed by Congress when the United States shifted recognition, requires the United States to provide Taipei with weapons for its self-defense.Biden has moved ahead with former president Donald Trump's more outspoken approach on Taiwan, including pushing for its inclusion in international bodies.The Biden administration said Thursday it was resuming trade talks with Taiwan that had been on hiatus since Barack Obama's administration.The Senate last week separately passed a major package on investment in innovation whose provisions include lifting a ban on displays of Taiwan's flag and the wearing of Taiwanese uniforms during meetings in Washington.Kritenbrink, who appeared likely to be confirmed, is a career diplomat who speaks Chinese and Japanese.In his latest position, as ambassador to Vietnam, he became an unlikely internet sensation by releasing his own rap video for the Tet holiday.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Beijing,Daniel Kritenbrink,framework,Taiwan,news and politics,US", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/us-nominee-vows-closer-taiwan-ties-but-no-new-framework-15021374", "Source": "google"}