{"Type": "", "Time": "2021-06-16", "Headline": "10 more cases linked to Bukit Merah View cluster, Latest Singapore News - The New Paper", "Text": "The Covid-19 cluster at 115 Bukit Merah View Market and Food Centre grew to 16 people yesterday, with 10 new cases linked to it.The new cases, announced by the Ministry of Health (MOH) last night, included a 94-year-old Singaporean man who regularly goes to Telok Blangah Parcview's Active Global Active Ageing Hub. The retiree developed a runny nose on June 6 and fever six days later on June 12 but did not seek medical attention. As he is the family member of another case, he was quarantined on June 13. He tested positive that same day.A 21-year-old Singaporean woman, who works as an IT engineer at IBM in Changi Business Park, is another new case.A family member of two other Covid-19 cases and a household contact of a third, she developed a runny nose and fever on June 12 but also did not seek medical attention.She was quarantined on June 13 and reported her symptoms on the same day. She also tested positive that day.The other eight new cases in the cluster included a hawker at Telok Blangah Drive Food Centre, an unemployed woman and several workers and assistants at the market and food centre as well as a 17-year-old student at ITE College Central, who had not been to school since May 16.A household contact of the unemployed woman, the student developed a fever and cough on June 11 and visited a general practitioner the next day, where he underwent an antigen rapid test (ART) and a polymerase chain reaction (PCR) test.His ART result was negative, but on June 13, his PCR test result was positive.Details about eight other cases in the community were also released last night, among them an unlinked one involving a 79-year-old Singaporean employed by AO ServicePro as a cleaner at 375 and 376 Clementi Avenue 4.The man developed a runny nose on June 12 and diarrhoea and vomiting on June 13, and went to see a general practitioner on the same day. He tested positive that day.A 16-year-old student from Anglo Chinese School (Independent), who was last in school on May 18, was among the remaining seven cases.The Singaporean student is asymptomatic and was quarantined on June 11 as he is a family member and household contact of a previous Covid-19 case. He tested positive on June 13.The other six community cases were part of the cluster linked to an engineer at Ecoxplore, who was confirmed to be infected on June 12.One linked case in the dormitories was also reported yesterday. The 26-year-old Indian national works as an electrician at GT ENGRG and lives in Westlite Juniper dormitory in Mandai. He was a close contact of the engineer at Ecoxplore. - THE STRAITS TIMES25 New cases34 Deaths17 Community, linked138 In hospital1 Community, unlinked62301 Total cases6 Imported61879 Total recoveredGet The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/10-more-cases-linked-bukit-merah-view-cluster", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}