{"Type": "World", "Time": "2021-06-16", "Headline": "France arrests conspiracy theorist after Malaysia stay", "Text": "PARIS: French police on Wednesday (Jun 16) arrested a leading figure in conspiracy circles over the kidnapping of an eight-year-old girl in April, as he returned to the country on a flight from Singapore after living in Malaysia.Remy Daillet, who was travelling on the Air France flight with his pregnant partner and three children, was immediately detained on arrival at Paris Charles de Gaulle airport, said an airport source, who asked not to be named.The kidnapped girl, identified as Mia, was taken in mid-April from the home in eastern France of her grandmother, who had custody of her, by several men employed by Mia's mother.Investigators believe the abduction may have been organised by extremist activists led by Daillet who believe that children in care are unfairly taken from their parents.He may now appear before a judge in northern Paris to be remanded in custody or could also be swiftly transferred to the eastern city of Nancy with a view to being interrogated and charged over the abduction by an investigating magistrate.Daillet, 54, and his family had been arrested at the end of May by the Malaysian authorities after their visas expired. Kuala Lumpur then began the process of deporting them to France.But the process was delayed on Sunday during a stop off in Singapore where Daillet's pregnant partner was hospitalised. His lawyers argued that she was unfit to travel.The Singapore Ministry of Home Affairs (MHA) told CNA on Wednesday that Daillet's partner, whom they named as Leonie Bardet, had complained of discomfort. She was then sent to a hospital on the advice of doctors at Changi Airport.MHA said that after being discharged, Bardet requested for herself and her three children to travel to France together with Daillet. The airline acceded to the request, MHA added.Ten individuals, including the mother, were indicted over the abduction following an intense five-day search that ended in Switzerland and seven of them are now under arrest.Mia's mother had lost custody of her daughter and was no longer allowed to see her alone or speak with her on the telephone.Daillet is known to police as a proponent of extremist conspiracy theories and a populist takeover of the state.After the abduction, Daillet posted a video in which he said that his organisation \"returns children kidnapped by the state to parents, at their request. There was absolutely no kidnapping\".In earlier videos, he has supported the idea of a coup d'etat and voiced opposition to taxes, vaccines, and 5G and masks.French prosecutors in April issued an international arrest warrant for Daillet, who had been living in Malaysia for several years. His detention over his residency status accelerated the deportation process.Daillet is a former regional leader of France's centrist MoDem party before he was excluded in 2010.Mia was returned to her grandmother's care.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Remy Daillet,Malaysia,France", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/france-arrests-conspiracy-theorist-daillet-after-malaysia-stay-15025982", "Source": "google"}