{"Type": "", "Time": "2021-06-16", "Headline": "Landlord who exposed himself to female tenant jailed, fined", "Text": "SINGAPORE — A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.Over about seven months, the victim would turn around to catch 56-year-old Chan Eng Hui in the buff while he made eye contact with her. Chan, who has been dealt with for previous incidents of indecent exposure in 2009 and 2010, was found guilty of four charges of insulting the modesty of a woman and two of using criminal force on her.The victim’s age and nationality was not revealed in court. She cannot be named to protect her identity.The victim moved into the flat on 1 April 2018, renting a bed space from him for $250 a month. She moved out in January 2019. Initially, the victim said she was on “talking terms” with Chan, but stopped talking to him after a female tenant informed her that Chan had appeared naked in her room.Between 10 and 12 May 2018 while both were in the flat, Chan held her hand and said “Go, go, let’s just go eat.”She rejected him and said “You can just talk and not get touchy”, before going into her room. She did not consent to the touch and felt annoyed by what she perceived to be a disrespectful act.In the same period, Chan grabbed her as she walked past a sofa in the living room, in an attempt to pull her in his direction. In response, the victim flung his hand away and told him not to get touchy before entering her room.From end-June to mid-July 2018, while both were in the flat at around 6.30am, the victim was walking out of the kitchen when she saw Chan standing inside the toilet naked with the door open. He was touching his private parts as he made eye contact with her.Even as the victim asked him what he was doing, Chan continued touching his private parts. Chan’s wife had been sleeping then.From the moment Chan began exposing himself to her, the victim would use weapons to protect herself and lock the door before sleeping.A few days later, in the evening, while the victim was washing something in the kitchen, she turned around to see Chan naked again, standing in front of the washing machine. After they made eye contact, Chan smiled and said he wanted to shower in the toilet. Furious, the victim scolded him. The same act happened between September and October, while the victim was at the kitchen wash basin, prompting the victim to throw a bowl towards him.Between 1 August and 20 September 2018, at around 6.30am, the victim was leaving the flat when she turned around to see Chan naked. The victim then shouted at him, “You pervert. You like… you enjoy letting people see, is it? Then you should let everyone take a look at you.”Two audio recordings recorded by the victim and submitted to court captured an exchange between Chan and the victim. In one recording, the victim says, “Why did you don’t wear your pant when you appeared behind me suddenly?” Chan is heard replying, “You have not agreed to me for so long. You see that fish, you think I can control myself. When you don’t give the fish to the cat, what do you think it will feel? I am a man, you think I am made of wood, is it? You don’t have feeling, but I am a man, I have feeling?”After 30 December 2018, Chan changed the lock of her bedroom door so that the victim was unable to lock the door. The woman would then use a chair to block the door.In his defence, Chan claimed that he was wearing his shorts at all times.The victim eventually reported the matter to the police on 23 December 2018. When asked why she did not do so earlier, she said that she worried it would be troublesome as she was working here, and was concerned that the incident would affect her work permit.In finding Chan guilty, District Judge Lau Qiuyu described him as “evasive” and his evidence “externally inconsistent”. While Chan initially argued that he was in a boyfriend-girlfriend relationship with the victim, he later claimed that they were just friends and he found acts of intimacy repulsive.DJ Lau added that she was unable to accept his claim that he did not intentionally expose himself to the woman. Chan had claimed that the exposure was accidental as the wind had blown open the toilet door while he was urinating. For another incident, Chan claimed that he had slipped on washing powder and that he hit himself, causing him to stroke his private parts in pain.When asked for his mitigation, Chan said he had nothing to say. He told the court that he was unable to pay the fine. He will serve two weeks' jail in default of the fine. Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:Of 25 new COVID cases in Singapore, 19 local including 1 dorm residentMan who smuggled 3 dogs and 3 cats from pet shop in JB jailed 24 weeksE-scooter, PAB riders must pass online theory test from 1 Jan 2022Polestar, the premium electric vehicle maker owned by China's Geely and Volvo Cars, will build its Polestar 3 electric SUV at Volvo's U.S. plant in South Carolina starting in the second half of 2022, the brand's chief executive said.  The Volvo plant in Ridgeville, South Carolina, near Charleston, currently builds the Volvo S60 sedan and will add the Volvo XC90 SUV in 2022, Polestar said on Wednesday.Top news and what to watch in the markets on Wednesday, June 16, 2021.Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.Sterling scored in Sunday's 1-0 win over Croatia as England began the Euros with a victory for the first time in nine attempts.  The Manchester City forward, who was at the weekend awarded an MBE for his services to racial equality in sport, said meditation helped him feel relaxed.  \"I'm doing a little bit of meds,\" Sterling told British media.Finding the 'perfect' summer dress is no mean feat.A Malaysian court Wednesday overturned an inquest verdict of \"misadventure\" in the death of a French-Irish teen who vanished in the jungle, replacing it with an \"open\" ruling in a victory for her family.Today's mortgage refi rates at 1.77% FIXED - No hidden points or fees! 1.97% APR. Cut your payment while rates are still low.McDonald’s had also “sweeten the experience” by offering the BTS Meal “at a special price of S$8.90”, which is said to be 10% off the usual delivery price.The Countess of Wessex said the grieving process will be longer because of coronavirus.Paris-based sales and co-production company Charades has closed deals for all major Western territories on “Belle,” the anticipated animation feature from Oscar-nominated Japanese filmmaker Mamoru Hosoda (“Mirai”) and Studio Chizu. Following GKids’s pick up for North American rights, Charades has unveiled a raft of sales to high-profile international distributors for “Belle,” including Anime Limited in […]Over 55? You may want to start packing your bags for senior apartments near you. Look for local senior apartments.Tributes have poured in for the movie starTreatments that target the reflex could ward off the spread of infections.Big engines might one day seem old fashioned at General Motors, as it boosts spending on electric and autonomous vehicles to $35 billion through 2025.That's according to Reuters sources. The move would mark a 30% jump over GM's most recent forecast, as it continues to pursue EV leadership.As part of that spending, the top U.S. automaker will build two additional battery plants in the country.In November, GM upped its spending plans from $20 billion, a figure that was announced in March before the global health crisis shuttered the auto industry.The expected announcement comes less than a month after rival Ford upped its EV spending by more than a third to over $30 billion by 2030.GM Chief Executive Mary Barra will meet Nancy Pelosi and other key Democrats on Wednesday (June 16), when they're expected to discuss EVs and vehicle emissions.Working with Washington is critical as President Joe Biden has proposed spending $174 billion to boost EVs and charging as part of his extensive infrastructure plan. GM declined to comment on the latest reports.Search for control scalp psoriasis. These treatments for scalp psoriasis are more affordable than everCristiano Ronaldo is a match-winner, France are better than Germany and Spain can pass the ball all day without scoring -- there really haven't many surprises after the first round of matches in Euro 2020.  It is perhaps inevitable that we aren't instantly surprised by much in international football these days.  Belgium are one of the tournament favourites and confirmed that with a confident 3-0 win in St Petersburg against Russia -- achieved without their key midfielder Kevin De Bruyne.Two centuries-old shipwrecks packed with ceramics and other artefacts have been found off Singapore in a rare discovery that will shed light on the city-state's maritime heritage, archaeologists said Wednesday.Post-Brexit trading arrangements for Northern Ireland are not a threat to the territorial integrity of the United Kingdom but simply a means of managing disruption from its exit from the European Union, Ireland's foreign minister said on Tuesday.  \"It's not about constitutional matters,\" he said in response to comments by Britain's Brexit minister David Frost at a parliamentary committee.Takes 2 minutes to get stated and se what rate you qualify for. Savings are astonishing! (1.97% APR)Exeter were handed a huge blow ahead of Saturday's Premiership semi-final against Sale Sharks after forwards Sam Skinner and Dave Ewers were given four-week bans by an independent disciplinary panel on Tuesday night. Skinner was sent off in the 53rd minute of last weekend's 20-19 win over Sale for a dangerous tackle, while Ewers was sin-binned for a high hit on Simon Hammersley in the 33rd minute of the same match. Both players contested the charges against them but they were upheld by the independent panel, the RFU said on Wednesday.Post-Brexit trading arrangements for Northern Ireland are not a threat to the territorial integrity of the United Kingdom but simply a means of managing disruption from its exit from the European Union, Ireland's foreign minister said on Tuesday.  \"It's not about constitutional matters,\" he said in response to comments by Britain's Brexit minister David Frost at a parliamentary committee.Most women aren't aware that abnormal bleeding can be a sign of cancer.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Fisherman Antonio Zapata told Reuters that even though hunts by orcas are relatively common where he and his crew operate, he had never before in his four decades at sea experienced anything similar.While sympathetic to the plight of the sea lions, whose predators circled meters away, thrashing their tails before moving in to grab at their prey, Zapata said his boat was already low in the water with a full haul of sardines.Mobile phone footage shows the water around the boat jammed with thrashing sea lions. Although the 10-man crew can be heard joking about their predicament, Zapata said they were genuinely concerned the boat would be damaged or they could end up in the water too.They tried to approach a nearby island in the hope the sea lions could take refuge there instead, but the whales blocked them from nearing the shore.The boat crept towards Talcahuano port, near the city of Concepcion in Bio Bio province. The whales drifted away, leaving the surviving sea lions to swim for cover.You can also save big on a whitening pen and refills.Reviving the 2015 Iran nuclear accord will have to await the formation of a new Iranian government, the head of the U.N. nuclear watchdog said in remarks published on Wednesday, adding a deal needed political will from all parties.  \"Everyone knows that, at this point, it will be necessary to wait for the new Iranian government,\" Rafael Grossi said in an interview with Italian daily La Repubblica, in reply to a question about what stage negotiations on the deal were at.  Grossi, director-general of the International Atomic Energy Agency (IAEA), appeared to be referring to Iran's presidential elections, due on Friday.", "Section": "", "Writers": "", "URL": "https://ph.news.yahoo.com/landlord-exposing-himself-female-tenant-jailed-fined-055722920.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}