{"Type": "", "Time": "2021-06-16", "Headline": "Covid-19 vaccines offer high protection against hospitalisation from Delta variant: UK study, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.LONDON (REUTERS) - Covid-19 vaccines made by Pfizer and AstraZeneca offer high protection of more than 90 per cent against hospitalisation from the Delta coronavirus variant, a new analysis by Public Health England (PHE) showed on Monday (June 14).British Prime Minister Boris Johnson announced on Monday a delay to the lifting of Covid-19 restrictions in England due to the spread of the highly transmissible Delta variant of concern, first identified in India, which is also associated with a higher risk of hospitalisation among the unvaccinated.PHE said that the Pfizer-BioNTech Covid-19 vaccine was 96 per cent effective against hospitalisation from the Delta variant after two doses, while Oxford-AstraZeneca's offered 92 per cent protection against hospitalisation by Delta.PHE said that those levels of protection were comparable to that against the Alpha variant, first identified in Kent, south-east England.The analysis adds to evidence that although the Delta variant reduces the effectiveness of vaccines against symptomatic infection, two doses of a Covid-19 vaccine still protect against severe disease.\"These hugely important findings confirm that the vaccines offer significant protection against hospitalisation from the Delta variant,\" said Ms Mary Ramsay, head of immunisation at PHE.The PHE findings follow a Scottish study which showed that two doses of a Covid-19 vaccine among people who tested positive cut their risk of hospitalisation by 70 per cent, although there were not enough hospital admissions reported to compare the vaccines.PHE said that while further work was being undertaken to establish the level of protection against mortality from the Delta variant, levels of protection against death were expected to be high.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/covid-19-vaccines-offer-high-protection-against-hospitalisation-from-delta-variant-uk", "Source": "google"}