{"Type": "", "Time": "2021-06-16", "Headline": "Japan will start vaccinating people under 65 at Tokyo and Osaka centres from June 17", "Text": "The two large-scale inoculation centres run by the Self-Defense Forces will open to younger people across JapanNHK has confirmed that Japan’s mass vaccination centres will open to residents aged 18 to 64 on June 17. The mass inoculation centres in Osaka and Tokyo were set up last month to accelerate the Covid-19 vaccine rollout for seniors and medical workers. They can inoculate up to 5,000 and 10,000 people per day respectively.The government is aiming to complete vaccination for all seniors aged 65 and older by the end of July, but with vaccine rollout gaining momentum, roughly 60 percent of the centres’ booking slots though June 27 remain open. To fill some of the vacancies, the two centres opened to police officers and other emergency workers on Monday – and will now expand eligibility to the general public from Thursday June 17.Reservations can be made online from midnight on June 16 or via telephone from 7am the same day. Phone services are available in English as well as Japanese. Residents of any prefecture are eligible for vaccination at either one of these large-scale centres in Tokyo and Osaka as long as they have received the vaccination coupon distributed by their local municipality. You can read up on the details, check available slots and reserve your vaccine through the Ministry of Defense website. Note that the mass vaccination centres operated by the Self-Defense Forces only offer the Moderna vaccine. This article was originally published on April 21 at 2.42pm and updated at 7.50pm.More from Time OutHere’s the tentative timeline of Japan’s Covid-19 vaccination programmeJapan is reportedly looking to implement vaccine passports this summerMint chocolate is trending in Tokyo right nowJapan considers placing Tokyo under quasi-emergency during the OlympicsTokyo is the fourth most livable city in the world in 2021Want to be the first to know what’s cool in Tokyo? Sign up to our newsletter for the latest updates from Tokyo and Japan.Share the storyLatest newsPopular on Time OutFollow usAbout usTime Out TokyoTime Out products", "Section": "", "Writers": "", "URL": "https://www.timeout.com/tokyo/news/japan-will-start-vaccinating-people-under-65-at-tokyo-and-osaka-centres-from-june-17-061521", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}