{"Type": "", "Time": "2021-06-16", "Headline": "The Delta variant is spreading. What does it mean for the US? | Coronavirus | The Guardian", "Text": "Covid-19 cases have fallen far below the winter peak, but the Delta variant has roughly doubled every two weeks in the USLast modified on Wed 16 Jun 2021 03.01 EDTScientists in the United States are anxiously watching the Delta variant of Covid-19, as it spreads through an unevenly vaccinated American public and an economy that is rapidly reopening.The Delta variant, first identified as B.1.617.2 in India, is believed to be more transmissible than both the original strain of Covid-19 and the Alpha strain, first identified in the United Kingdom.“We’ve moved [Delta] to the top of our list of variants to study,” said Andrew Pekosz, a professor in Johns Hopkins University’s molecular microbiology and immunology department, and an expert in how viruses interact with the respiratory system.“The data out of the UK showing how quickly the Delta variant became the dominant variant there is strong evidence that it is more transmissible than the Alpha variant, which we already thought was more transmissible than the original lineages,” said Pekosz.The Delta variant is spreading at an uncertain time in the US. Covid-19 cases have fallen far below the winter peak, from an average of more than 250,000 new diagnoses a day in January to about 14,000 a day in June. Fewer cases have coincided with fewer hospitalizations and deaths.This has led state after state to lift all social distancing guidelines, including in California, which gave the greenlight to large indoor gatherings such as sporting events. Now, social distancing and mask requirements are largely operating on the honor system.But, even as pandemic guidelines recede, Delta has roughly doubled every two weeks in the US, a pattern once followed by Alpha, the variant first discovered in the UK, which eventually came to represent the vast majority of new US infections. The Delta variant has also delayed the UK’s planned reopening.According to the CDC, at the end of May Alpha represented almost 70% of infections in the US. But in mid-March, it represented only 26% of cases. Similarly, Delta once represented only 2.5% of cases of Covid-19 by mid-May. But two weeks prior to that, it represented only 1.3% of cases. Again, two weeks before that in April, it represented just 0.6% of cases.The doubling of cases has led some, such as the former Food and Drug Administration (FDA) commissioner Dr Scott Gottlieb, to predict that Delta may represent as much as 10% of US cases by mid-June.The CDC officially elevated Delta to a “variant of concern” this week. A “variant of concern” designation puts Delta in the same category of increased surveillance as Alpha and Gamma (the variant first identified in Brazil).The most serious designation for new strains are considered variants of “high consequence”. This designation implies significantly reduced vaccine efficacy, testing failures and more severe disease. No variants circulating in the US meet this designation.Part of scientists’ concern with the Delta variant is that a more transmissible virus can make social distancing less successful. There are also concerns about severe localized outbreaks in an unevenly vaccinated nation. The US has fully vaccinated 43.9% of the population and 52.6% have received at least one dose, according to the CDC. However, those rates vary regionally.Large swaths of the south have fully vaccinated less than 35% of their populations, such as in Alabama, Louisiana and Tennessee. By contrast, much of the north-east has fully vaccinated more than 50% of its population, including in Vermont, Maine, Massachusetts, Rhode Island and New Hampshire.Vaccination rates also vary dramatically by age. In the south, less than 10% of adolescents are vaccinated, in spite of being eligible for weeks, said Dr Peter Hotez, a vaccine researcher and the dean of the National School of Tropical Medicine at Baylor College.“I’ve been saying [the] Delta variant could rip through the south this summer, in which case [it] could hit unvaccinated young people pretty hard,” Hotez said on Twitter. Those lower rates are, in part, tied to political polarization. Donald Trump’s followers listened as he blasted public health measures and workers during his tenure in the White House. Now, white evangelicals, Republicans and people in rural America – all disproportionately likely to identify with Trump – rank among the most likely to say they will “definitely not” get a vaccine.But lower vaccination rates in some states are also the result of weaker public health infrastructure. People who have put off vaccines, but who are not necessarily opposed to getting one, reported they would be more likely to get a shot if they had time off work, transportation or their state provided financial incentives, Kaiser Family Foundation found.Further, it remains unclear whether Delta will result in more serious disease. A recent Lancet study in Scotland found people were twice as likely to be hospitalized by what was believed to be the Delta variant compared to the Alpha variant.However, the CDC has not said Delta produced more serious outcomes, and Pekosz said he believed it was too early to say whether Delta resulted in more hospitalizations.What was reinforced by the Lancet study is that vaccines remain effective against Delta. The mRNA vaccine from Pfizer offered “very good” protection. A vaccine from AstraZeneca had “substantial but reduced” efficacy against Delta. AstraZeneca’s vaccine uses a different technology, called viral vector, to induce an immune response.In the time it takes more Americans to be fully vaccinated, roughly five to six weeks, the Delta variant “will be the majority of US cases,” Dr Cyrus Shahpar, an epidemiologist and Covid-19 data director at the White House, said on Twitter. It is, “important to start building protection now”.In turn, America’s uneven vaccination status illustrates another, long-term problem – unvaccinated people may put pressure on the virus to evolve again.People “who are vaccinated and people who are not vaccinated, the virus could be moving back and forth between those populations,” Pekosz said. In turn, the virus could be evolving to, “get around some of the immunity that is out there in the population”.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/world/2021/jun/16/delta-variant-coronavirus-us", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}