{"Type": "", "Time": "2021-06-16", "Headline": "How are individuals above 65, who are not receiving CPF payouts, surviving? - The Online Citizen Asia", "Text": "The topic on Central Provident Fund (CPF) payouts has been a hot issue among Singaporeans. Number of concerns that are always behind Singaporeans’ minds are the monthly payout sums as well as the need to work at an older age for survival as the monthly CPF payouts are insufficient for them.However, a recent article by The Straits Times (ST) revealed that despite the COVID-19 uncertainties, many people are pumping extra funds into their own or their loved ones’ CPF retirement savings, as the number reached nearly 40 percent higher in 2020, compared to the year earlier in 2019.In fact, a Ministry of Social and Family Development (MSF) spokesman was quoted saying that the reason why there is a drop in numbers of elders seeking help is due to more of the younger seniors are “financially able” and better prepared for retirement through the use of their CPF and personal savings.But according to what TOC understands in some cases, the children broke ties with the parents after being forced to pay a token sum (ie. $50) due to the poor financial standing of the children.If that’s not all, according to a study from the Lee Kuan Yew School of Public Policy (LKYSPP), an older Singaporean above 65 years old would need $1,379 a month in 2018 to meet his or her basic needs.The monthly payout from CPF if a CPF member at the age of 55, meets the Full Retirement Sum (FRS) in their account in 2020, is close to this figure, at an estimated amount of $1,390 – $1,490 at the age of 65.However, based on a report from Straits Times in March this year, it is revealed that around 400,000 people aged 55 to 70 who don’t even have enough in their CPF to hit the Basic Retirement Sum.And this is collaborated with figures revealed in Parliament back in 2019 where it was said that about 268,000 CPF members aged 65 and above who received retirement payouts from either the CPF LIFE or Retirement Sum Scheme in December 2018.Of those who received payouts, 74% had monthly payouts under $500. The average monthly payouts differs greatly across the generations; the average monthly payout for CPF members aged 65 to 69 is more than double that of members aged 80 to 87.According to data as of June 2018, there were 202,905 citizens who are aged 65-69. The number of CPF Members, 116,000, who received payouts in Dec 2018, seems to be rather low in comparison.Similarly there were 219,591 citizens aged 70-79, however, there were only 130,000 who are receiving CPF payouts. There were 86,475 citizens aged 80-89, which is at a far more troubling figure as it is said that only 19,000 from 80-87 receiving $220 monthly on average.So all in all, we are looking at a figure of 508,971 citizens of those aged 65-89 versus 265,000 receiving an average payout of no more than $450. This would mean about 243,971 citizens in 2018, aged 65-89 do not receive any payout from CPF.If we look at the data from CPF’s annual report in Dec 2019, the situation becomes much clearer.Figures from CPF shows that only for those aged 55, who have the FRS of $181,000, in 2020 will get a sum of $1,390 – $1,490 once they reach 65.So if we were to look at the data from CPF, there are 111,730 CPF members aged 50-55 who have less than $100,000 in their account. However, there are about 188,620 members, aged 50-55 who have less than $180,000 in their account in Dec 2019.If we were to take LKYSPP’s figure as what it takes to meet a person’s basic needs, then at least 177,750 members of this cohort who do not come close to the FRS will not be able to rely on their CPF payout for this purpose.Noting that the payout of CPF only starts at the age of 65, we also can safely say that at least 172,190 members aged 60-65 will face the same issue as they have less than $160,000 in their account. 11,540 members just have in between $160,000 and $180,000.So going back to the title of this post, how are seniors who receives less than $1,379 a month surviving in Singapore, not to mention those who are not receiving any CPF payouts.This might also explain why we see seniors in their 80s working as cleaners, as shown in the case of the 88-year-old cleaner who contacted COVID-19 while working at the Changi Airport. This along with the 70-80 year old individuals working at Bukit Merah View Hawker Centre who were also found to have contacted the virus.  © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/16/how-are-individuals-above-65-who-are-not-receiving-cpf-payouts-surviving/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}