{"Type": "", "Time": "2021-06-16", "Headline": "Coronavirus was likely present in US from December 2019: Study, United States News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.WASHINGTON (AFP) - A new antibody testing study published on Tuesday (June 15) has found further evidence that the coronavirus was present in the United States from at least December 2019, weeks before the first confirmed case was announced on Jan 21.The National Institutes of Health study analysed 24,000 stored blood samples contributed by volunteers across the country from Jan 2 to March 18, 2020.Antibodies against the Sars-CoV-2 virus were detected via two different serology tests in nine patient samples, according to the paper, which was published in the journal Clinical Infectious Diseases.The participants were outside the major hotspots of Seattle and New York City, thought to be the key entry points of the virus to the United States.The first positive samples came from participants in Illinois and Massachusetts on Jan 7 and 8, 2020, respectively, suggesting that the virus was present in those states in late December.\"Antibody testing of blood samples helps us better understand the spread of Sars-CoV-2 in the US in the early days of the US epidemic, when testing was restricted,\" said lead author Keri Althoff, an associate professor of epidemiology at the Johns Hopkins Bloomberg School of Public Health.The research builds on a similar investigation published by the Centres for Disease Control and Prevention last November that reached the same conclusion.But since there are uncertainties surrounding serology testing, further confirmation builds extra confidence in the finding.To help minimise the possibility of false positives, the team used two separate tests on each sample, searching for antibodies that bind to different parts of the virus.The types of antibodies they were looking for are called Immunoglobulin G, or IgG, which \"neutralise\" the virus' ability to invade cells and do not appear until two weeks after a person has been infected.It therefore follows that study participants with these samples were exposed to the virus at least several weeks earlier.Limitations include that the number of samples taken from many states was low - just a few dozen or hundred, The authors also do not know whether the participants became infected during travel, or within their own communities, and would like to see their work confirmed in further study.Finally, there is a possibility that the antibodies they detected were formed against infection to other coronaviruses, such as the four that cause common colds.But since other research has shown that \"cross-reactivity\" between these coronaviruses is low, the team estimated that the probability all nine samples were false positives was one in 100,000.The US death toll from Covid-19 surpassed 600,000 on Tuesday, according to figures from Johns Hopkins University.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/united-states/coronavirus-was-likely-present-in-us-from-december-2019-study", "Source": "google"}