{"Type": "", "Time": "2021-06-16", "Headline": "'His life's work captures the atmosphere of the changing times': PM Lee celebrates pioneer artist Lim Tze Peng at book, art exhibition launch, Singapore News - AsiaOne", "Text": "Some say that age is just a number. Singapore's oldest living pioneer artist, who turns 100 in September, is still painting.Prime Minister Lee Hsien Loong was the guest of honour at Soul of Ink: Lim Tze Peng at 100, a book and exhibition launch on the life and works of the centenarian artist on Tuesday (June 15) at The Arts House.In his speech, PM Lee touched on the artist's life story as a farmer, student, teacher and school principal. He highlighted Lim's artistic journey, from being self-taught to being awarded the Cultural Medallion in 2003 and the Meritorious Service Medal in 2016.\"From his streetscapes and kampong scenes in our early nation-building years to his iconic paintings of Chinatown and the Singapore River through the decades, they offer a vivid glimpse of the colour of everyday lives in Singapore.\"His life's work captures the atmosphere of the changing times,\" PM Lee said. [embed]https://www.facebook.com/leehsienloong/posts/4432571690138836[/embed]The book, authored by media veteran Woon Tai Ho, highlights the man behind his art. Meanwhile, the exhibition, which runs till June 30, showcases 20 recently completed artworks ranging from colourful ink paintings of Singapore to abstract calligraphy.The exhibition includes four paintings Lim started in the 1980s which he finished colouring in 2020: Morning at Arab Street, Crowded Bugis Street, Riverside and Tanjong Rhu Riverside. PM Lee also announced the National Arts Council will open the Cultural Medallion Gallery that will commemorate the works of Cultural Medallion winners including Lim Tze Peng, in a few months. \"These cultural icons and role models we call our own, will continue to inspire new generations of local artists and performers,\" he said. For more information on the book and exhibition, visit this website. alexanderkt@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/singapore/his-lifes-work-captures-atmosphere-changing-times-pm-lee-celebrates-pioneer-artist-lim-tze-peng", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}