{"Type": "", "Time": "2021-06-16", "Headline": "Blood, shattered glass at one store on first day of Ion Orchard's reopening after closure due to Covid-19, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - At least one retail worker at Ion Orchard was injured after a glass panel shattered on the first day of the mall's reopening on Wednesday (June 16).The man, who was wearing a staff lanyard from make-up brand Bobbi Brown, had cuts on his arms.Three Singapore Civil Defence Force (SCDF) officers were seen arriving at the scene at around 11.20am.Blood splatter on the floor could be seen among the shattered glass.Responding to queries from The Straits Times, a spokesman for Ion Orchard said a single glass panel at the Bobbi Brown store shattered at around 11am.“The incident occurred when the store was being opened for the day by its store assistant,” said the spokesman.The store assistant suffered some cuts and first-aid was immediately rendered by Ion staff. “We are in touch with the Bobbi Brown staff and the management, and will render additional support to them as necessary,” the spokesman added.A spokesman for SCDF said that it received a call for assistance at Ion Orchard at about 11.10am, and later took a person to the Singapore General Hospital.Before the incident, retail staff at Ion Orchard were seen busy tidying up their wares and preparing their storefronts in anticipation of shoppers returning after a four-day closure for deep cleaning and disinfection.The mall was ordered to close from last Saturday to Tuesday by the Ministry of Health, after a number of Covid-19 cases were linked to it.On Wednesday, the mall, which has 400 retailers, reopened its doors at 10am. At some stores, staff were seen dusting their display shelves and racks.But not all stores were ready to welcome customers by 11am. British luxury fashion house Burberry and Japanese department store Muji were among those that remained shuttered.In a circular to tenants on Wednesday, Ion Orchard said only shops whose staff have all been swabbed and tested negative are allowed to reopen.It added: \"You are expected to make the necessary arrangements to begin your operations and ensure the stores are manned accordingly.\"Still, about a dozen shoppers were seen at the mall, including Ms Liyana Laily, 29, who works in quality assurance.\nA view from inside Ion Orchard after it reopened on June 16, 2021. ST PHOTO: KEVIN LIM\n\nA view from inside Ion Orchard after it reopened on June 16, 2021. ST PHOTO: KEVIN LIM \nShe decided to pop by the mall as she was in the area. She was not aware that Ion Orchard had been closed for four days owing to Covid-19.\"But I'm not worried. Singapore has a certain standard of cleanliness and obviously they want business to come back, so they would put in effort to maintain that standard,\" she said.Another shopper who wanted to be known only as Mr Koda, 41, also dropped by the mall to buy a pair of shoes for his two-year-old son. He, too, was not concerned about the recent Covid-19 cases linked to the mall.\"If anything, this would be the cleanest place in Singapore after all that cleaning,\" said Mr Koda, who works in the energy sector.\"And Singapore does a good job of cleaning, so I'm not worried,\" he added.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/blood-shattered-glass-at-one-store-on-first-day-of-ion-orchards-reopening-after-closure", "Source": "google"}