{"Type": "", "Time": "2021-06-16", "Headline": "Landlord who exposed himself to female tenant jailed, fined", "Text": "SINGAPORE — A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.Over about seven months, the victim would turn around to catch 56-year-old Chan Eng Hui in the buff while he made eye contact with her. Chan, who has been dealt with for previous incidents of indecent exposure in 2009 and 2010, was found guilty of four charges of insulting the modesty of a woman and two of using criminal force on her.The victim’s age and nationality was not revealed in court. She cannot be named to protect her identity.The victim moved into the flat on 1 April 2018, renting a bed space from him for $250 a month. She moved out in January 2019. Initially, the victim said she was on “talking terms” with Chan, but stopped talking to him after a female tenant informed her that Chan had appeared naked in her room.Between 10 and 12 May 2018 while both were in the flat, Chan held her hand and said “Go, go, let’s just go eat.”She rejected him and said “You can just talk and not get touchy”, before going into her room. She did not consent to the touch and felt annoyed by what she perceived to be a disrespectful act.In the same period, Chan grabbed her as she walked past a sofa in the living room, in an attempt to pull her in his direction. In response, the victim flung his hand away and told him not to get touchy before entering her room.From end-June to mid-July 2018, while both were in the flat at around 6.30am, the victim was walking out of the kitchen when she saw Chan standing inside the toilet naked with the door open. He was touching his private parts as he made eye contact with her.Even as the victim asked him what he was doing, Chan continued touching his private parts. Chan’s wife had been sleeping then.From the moment Chan began exposing himself to her, the victim would use weapons to protect herself and lock the door before sleeping.A few days later, in the evening, while the victim was washing something in the kitchen, she turned around to see Chan naked again, standing in front of the washing machine. After they made eye contact, Chan smiled and said he wanted to shower in the toilet. Furious, the victim scolded him. The same act happened between September and October, while the victim was at the kitchen wash basin, prompting the victim to throw a bowl towards him.Between 1 August and 20 September 2018, at around 6.30am, the victim was leaving the flat when she turned around to see Chan naked. The victim then shouted at him, “You pervert. You like… you enjoy letting people see, is it? Then you should let everyone take a look at you.”Two audio recordings recorded by the victim and submitted to court captured an exchange between Chan and the victim. In one recording, the victim says, “Why did you don’t wear your pant when you appeared behind me suddenly?” Chan is heard replying, “You have not agreed to me for so long. You see that fish, you think I can control myself. When you don’t give the fish to the cat, what do you think it will feel? I am a man, you think I am made of wood, is it? You don’t have feeling, but I am a man, I have feeling?”After 30 December 2018, Chan changed the lock of her bedroom door so that the victim was unable to lock the door. The woman would then use a chair to block the door.In his defence, Chan claimed that he was wearing his shorts at all times.The victim eventually reported the matter to the police on 23 December 2018. When asked why she did not do so earlier, she said that she worried it would be troublesome as she was working here, and was concerned that the incident would affect her work permit.In finding Chan guilty, District Judge Lau Qiuyu described him as “evasive” and his evidence “externally inconsistent”. While Chan initially argued that he was in a boyfriend-girlfriend relationship with the victim, he later claimed that they were just friends and he found acts of intimacy repulsive.DJ Lau added that she was unable to accept his claim that he did not intentionally expose himself to the woman. Chan had claimed that the exposure was accidental as the wind had blown open the toilet door while he was urinating. For another incident, Chan claimed that he had slipped on washing powder and that he hit himself, causing him to stroke his private parts in pain.When asked for his mitigation, Chan said he had nothing to say. He told the court that he was unable to pay the fine. He will serve two weeks' jail in default of the fine. Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:Of 25 new COVID cases in Singapore, 19 local including 1 dorm residentMan who smuggled 3 dogs and 3 cats from pet shop in JB jailed 24 weeksE-scooter, PAB riders must pass online theory test from 1 Jan 2022Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neAlibaba Group was the victim of a months-long web-scraping operation by a marketing consultant that siphoned up sensitive data including usernames and phone numbers.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Sentosa isn’t expensive as you think it is. Here’s everything you need to know about the island’s entrance fees cost, car park rates, beach reservations and hacks on how to save. Thanks to COVID-19, plans to travel overseas for a well-deserved holiday is starting to […] The post Sentosa Island: Entrance Fee And Parking Rates appeared first on SingSaver Blog - We Compare, You Save.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Learn more about scalp psoriasis. Look for scalp psoriasis treatments.Turkish President Recep Tayyip Erdogan on Tuesday pledged support for Azerbaijan if the ex-Soviet country was attacked, as he made a visit to the disputed Nagorno-Karabakh region.The League of Legends: Wild Rift esports scene will be kicking into full gear this 19 June with the League of Legends: Wild Rift 2021 SEA Icon Series Summer Super Cup.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aResearch best security system. Protect yourself and your home with wireless alarm systems.It's useful to be ready with the names of a few companies you'll scoop up in case a crash occurs. The post 3 Stocks I Will Buy If the Market Crashes Tomorrow appeared first on The Smart Investor.The Russian skipper of a container ship that caught fire and burned for almost two weeks before sinking off Sri Lanka's coast has been arrested and is expected to be charged with marine pollution, police said Monday.Kevin Durant finished with 49 points while playing every minute of the game as the Brooklyn Nets rallied from a 17-point deficit to beat the Milwaukee Bucks 114-108 in game five of their NBA playoff series on Tuesday.Find furniture you love, at prices that fit your budget with flexible financing.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.If you’re wondering whether Ethereum is a good long term investment, keep reading.Sick of seeing others get rich in the stock market? Have you heard of Everlasting Stocks?A sinking fire-damaged container ship could take months to salvage because of rough monsoon seas, Sri Lanka said Tuesday, as authorities investigated whether the deaths of dozens of turtles and dolphins were caused by the disaster.Cristiano Ronaldo netted a double to become the European Championship's all-time leading scorer as Portugal struck three times late on to beat a stubborn Hungary 3-0 in their Euro 2020 opener at a packed Puskas Arena on Tuesday.The inflation outlook among Americans is at its highest level ever, while many are upbeat about their employment situation, a New York Federal Reserve survey released Monday said.The report covering May showed one-year inflation expectations jumped 0.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Japan has requested consolations with China at the World Trade Organization (WTO) over anti-dumping duties that have been placed on its stainless steel products since July 2019, the Geneva-based body confirmed on Tuesday. The request, which was circulated to WTO members on Tuesday after having been submitted on Friday, claims the measures imposed on steel billets, hot-rolled coils and hot-rolled plates appear to be inconsistent with various provisions under the General Agreement on Tariffs and T* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.With Afghan troops in retreat and soon to lose vital American air support, Taliban commanders are voicing exuberance about quickly seizing full control of the country and re-establishing their version of an Islamic state.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/landlord-exposing-himself-female-tenant-jailed-fined-055722920.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}