{"Type": "", "Time": "2021-06-16", "Headline": "Football: Pogba plays down Ruediger 'bite' at Euro 2020, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.MUNICH, GERMANY (AFP) - France midfielder Paul Pogba has played down Antonio Ruediger's apparent attempted bite on his back during the world champions' Euro 2020 win over Germany, with Uefa saying the defender would not face disciplinary action.Television replays showed Chelsea defender Ruediger putting his mouth on Pogba just before half-time in France's 1-0 win over Germany in Munich on Tuesday.Immediately after the incident, Pogba cried out and complained to Spanish referee Carlos del Cerro Grande, who did not punish the German, and the Manchester United star played it down after the game.\"I think he nibbled at me a little bit, but we've known each other for a long time. Toni and I are friends. It was nothing big. We hugged after the game and it's over,\" Pogba said.Pogba, the man of the match in Munich, said it was \"better\" that Ruediger escaped punishment.\"I don't want him to be suspended because of that,\" said the Frenchman, who played a key role in the build-up to Mats Hummels' ultimately decisive own goal.Pogba said he told the referee what happened but was glad there was no \"yellow or red card for such an incident\".In the build-up to the match, Champions League winner Ruediger had said the Germans would need to \"be a little dirty\" against the French.On Wednesday, the Chelsea centre-back admitted it \"looked bad\" but insisted it was not a bite.\"I'm not allowed to go like this with my mouth against his back, that goes without saying. It looks bad,\" Ruediger said in quotes released by his agent.\"After the final whistle, I spoke in a friendly way with Paul and both with me and afterwards in an interview he confirmed it wasn't a bite, as some had thought at first.\"Uefa said in a statement that after reviewing the television replays, it would open \"no disciplinary case\".Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-pogba-plays-down-ruediger-bite-at-euro-2020", "Source": "google"}