{"Type": "", "Time": "2021-06-16", "Headline": "Fisherman caught in whale’s mouth reveals he felt its tongue and mouth convulsing as he asks Matt Damon to play him in movie | The Independent", "Text": "Diver said he thought of his wife and kids while he was stuck inside the whale’s mouthFind your bookmarks in your Independent Premium section, under my profileA lobster diver who survived being engulfed by a whale recounted his wild life – in which he has survived a plane crash and found a dead body – during a Reddit “Ask Me Anything”.Users on the site spoke with Michael Packard, a fisherman who wound up inside the mouth of a humpback whale while diving for lobster last Friday. Mr Packard's son facilitated the discussion. Mr Packard said it was totally dark inside the creature's mouth, and said the whale used its head and tongue to dislodge him from its mouth. He insists the whale could not have swallowed him fully, even if it wanted to. However, he said he could have still died regardless, as he could have suffocated inside the mouth or drowned, as he momentarily lost his diving regulator. Mr Packard said he was trapped in the whale's mouth for between 30 and 40 seconds, and said he was “almost convinced I was going to die that day”. He said it is not unusual for him to run into whales while diving, but said in most cases the animals keep their distance. He was taken to the hospital, after the incident, and suffered soft tissue damage from the blunt force of the whale's mouth, which he said he could feel clamping down on his leg. Mr Packard recalled having numerous visits while he was at the hospital from doctors and nurses asking him about the whale experience, including one nurse who came in with a notepad and asked him for lottery numbers. During the chat, the diver revealed that being nearly eaten by a whale is only one in a line of exceptional experiences he's had. “A while back, I encountered the corpse of a missing person while diving,\" he said. \"That is definitely up there with the crazy stories.”He said the body he found was being sought by investigators as part of an active missing person case.The diver also revealed that he had survived a plane crash in Costa Rica.  In 2001, Mr Packard and seven others were in a small plane when it crashed in Costa Rica, killing three of the passengers. Doctors who treated the survivors – including Mr Packard, who had sustained injuries to his chest – said they would not have survived another night at their crash site due to the injuries they sustained. Noting the cinematic series of misadventures the diver has had, Reddit users asked him who he would want to play him in a movie about his life. Mr Packard said he would prefer Matt Damon, though his wife insists that Sean Penn take the role.Join thought-provoking conversations, follow other Independent readers and see their repliesScreengrabWant to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.Log inNew to The Independent?Want an ad-free experience?Subscribe to Independent Premium.", "Section": "", "Writers": "", "URL": "https://www.independent.co.uk/news/world/americas/fisherman-whale-mouth-tongue-matt-damon-b1865658.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}