{"Type": "", "Time": "2021-06-16", "Headline": "US lawmaker Marjorie Taylor Greene apologises for comparing Covid-19 masks to Holocaust, United States News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.WASHINGTON (REUTERS) - United States Republican Representative Marjorie Taylor Greene publicly apologised on Monday (June 14) for her remarks last month comparing Covid-19 mask requirements and vaccinations to the Nazi Holocaust that killed six million Jews.\"I have made a mistake and it's really bothered me for a couple weeks now,\" Ms Greene told a news conference. She added that \"there's nothing comparable\" to the Holocaust and \"I know the words I stated were hurtful and for that I am very sorry.\"The news conference came amid calls from some Democrats to censure Ms Greene for her Holocaust remarks. Her comments had also been denounced by Republican congressional leaders.She said she had visited the United States Holocaust Memorial Museum earlier on Monday. She also mentioned that when she was 19 years old, she visited the Auschwitz concentration camp in Poland where more than one million Jews were murdered by the Nazis.It was not the first time the 47-year-old congresswoman from Georgia, who arrived in Congress in January, had roiled the waters in Washington.In February, the Democratic-led House of Representatives stripped her of two high-profile committee assignments after her remarks that included support for violence against Democrats.Then, too, Ms Greene distanced herself from such statements, saying: \"These were words of the past and these things do not represent me.\"In response to reporters' questions on Monday, Ms Greene, an ardent supporter of former president Donald Trump, refused to distance herself from a comment he made in 2017, following violent protests involving white supremacists in Charlottesville, Virginia, in which he said there \"were very fine people on both sides\".Before arriving in Congress, Ms Greene voiced support for unfounded conspiracy theories, including the QAnon claim that elite Democrats are part of a cabal of Satan-worshipping paedophiles and cannibals, as well as an anti-Semitic claim suggesting a space laser was used to deliberately start a California wildfire.Ms Greene opened her news conference saying: \"I just always want to remind everyone I'm very much a normal person.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/united-states/us-lawmaker-marjorie-taylor-greene-apologises-for-comparing-covid-19-masks-to", "Source": "google"}