{"Type": "", "Time": "2021-06-16", "Headline": "Philippines' Duterte will not cooperate with ICC probe: spokesman", "Text": "Philippine President Rodrigo Duterte will \"never cooperate\" with an International Criminal Court probe into the country's deadly drug war, his spokesman said Tuesday, branding the process \"legally erroneous\".Outgoing ICC chief prosecutor Fatou Bensouda on Monday asked judges at the world's only permanent war crimes court to authorise an investigation into allegations that Philippine police unlawfully killed as many as tens of thousands of civilians between 2016 and 2019.Duterte was elected in 2016 on a campaign promise to get rid of the country's drug problem, and he openly ordered police to kill drug suspects if their lives were in danger.\"The president will never cooperate until the end of his term on June 30, 2022,\" Harry Roque told reporters, repeating a previous assertion that the ICC has no jurisdiction in the Philippines because it pulled out of the tribunal.The Philippines left the ICC in 2019 after the court launched a preliminary examination into the war on drugs. Bensouda said it could still investigate crimes committed while the country was a member.\"The available information indicates that members of the Philippine National Police, and others acting in concert with them, have unlawfully killed between several thousand and tens of thousands of civilians\" during the period under investigation, said Bensouda, in one of her last acts before stepping down this week.But Roque rejected her findings and said it was \"an insult to all Filipinos\" to suggest the country's justice system was not working.\"We will be compared to countries like Darfur, areas where there is no functioning government. It's not right,\" he said.\"If killings occurred, appropriate force and violence were observed.\"The crackdown is Duterte's signature policy initiative and he defends it fiercely, especially from critics such as Western leaders and institutions which he says do not care about the Philippines.More than 6,000 people have been killed in over 200,000 anti-drug operations conducted since July 2016, according to official data.Human rights groups estimate the number of dead could be several times higher.Many suspects have been put on \"drug watch lists\" by local officials and then visited by police at their homes -- a situation which often ends in a deadly shooting that officers claim was self-defence.Rights groups welcomed Bensouda's request, with Amnesty International describing the ICC investigation as a \"landmark step\".bur-amj/qanPremier League champions Manchester City will start the defence of their title away to Tottenham after the fixtures for the 2021-22 season were unveiled on Wednesday.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neCelebrated surgeon and author of the New York Times best seller \"The Plant Paradox\" reveals what many have suspected for a long time, and even worse.Alibaba Group was the victim of a months-long web-scraping operation by a marketing consultant that siphoned up sensitive data including usernames and phone numbers.It's useful to be ready with the names of a few companies you'll scoop up in case a crash occurs. The post 3 Stocks I Will Buy If the Market Crashes Tomorrow appeared first on The Smart Investor.Sentosa isn’t expensive as you think it is. Here’s everything you need to know about the island’s entrance fees cost, car park rates, beach reservations and hacks on how to save. Thanks to COVID-19, plans to travel overseas for a well-deserved holiday is starting to […] The post Sentosa Island: Entrance Fee And Parking Rates appeared first on SingSaver Blog - We Compare, You Save.Research best security system. Protect yourself and your home with wireless alarm systems.Kevin Durant finished with 49 points while playing every minute of the game as the Brooklyn Nets rallied from a 17-point deficit to beat the Milwaukee Bucks 114-108 in game five of their NBA playoff series on Tuesday.Turkish President Recep Tayyip Erdogan on Tuesday pledged support for Azerbaijan if the ex-Soviet country was attacked, as he made a visit to the disputed Nagorno-Karabakh region.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.This new car cloth can easily remove all the car scratches and dents from your car.If you’re wondering whether Ethereum is a good long term investment, keep reading.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aThe largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.Father's Day is coming up.  Show him that you care with a special unique gift.The League of Legends: Wild Rift esports scene will be kicking into full gear this 19 June with the League of Legends: Wild Rift 2021 SEA Icon Series Summer Super Cup.A sinking fire-damaged container ship could take months to salvage because of rough monsoon seas, Sri Lanka said Tuesday, as authorities investigated whether the deaths of dozens of turtles and dolphins were caused by the disaster.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Experts Agree: Your Driver Is Too Long and Its Head Is Too Big. Finally, There’s an Alternative. (Watch Now)US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.Cristiano Ronaldo netted a double to become the European Championship's all-time leading scorer as Portugal struck three times late on to beat a stubborn Hungary 3-0 in their Euro 2020 opener at a packed Puskas Arena on Tuesday.Learn more about scalp psoriasis. Look for scalp psoriasis treatments.The Russian skipper of a container ship that caught fire and burned for almost two weeks before sinking off Sri Lanka's coast has been arrested and is expected to be charged with marine pollution, police said Monday.The inflation outlook among Americans is at its highest level ever, while many are upbeat about their employment situation, a New York Federal Reserve survey released Monday said.The report covering May showed one-year inflation expectations jumped 0.The emergence of problems in a new-generation nuclear reactor in China threatens to undermine efforts by its French designer to sell it elsewhere, and could hurt Beijing's nuclear industry, analysts said.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/philippines-duterte-not-cooperate-icc-044041808.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}