{"Type": "", "Time": "2021-06-16", "Headline": "The strategy behind Marjorie Taylor Greene’s apology | The Independent", "Text": "The development no one saw comingFind your bookmarks in your Independent Premium section, under my profileFind your bookmarks in your Independent Premium section, under my profileCongress Greene HolocaustOn the surface, she did everything she was supposed to do. She made a stupid (very, very stupid) comment; she educated herself on the community she insulted; she apologized without a “sorry, but” in sight. “One of the best lessons that my father always taught me was when you make a mistake you should own it,” said Marjorie Taylor Greene, standing outside the Capitol early this week. “And I have made a mistake … so I definitely want to own it.” Greene had recently visited the Holocaust Museum in Washington DC, she explained, and had learned more about the context of her remarks a few weeks ago. At that time, she compared Speaker of the House Nancy Pelosi’s mask mandate to the Holocaust and the Democratic Party to the Nazis. “There is no comparison to the Holocaust,” she said on Monday, “…If we’re going to lead, we need to be able to lead in a way where if we’ve messed up it’s very important for us to say we’re sorry.” She had realized the importance of accountability after a conversation with her late father, she added. This is a development few of us expected. We know the far-right wing of the Republican Party and their usual approach to criticism: deflect, deflect, deflect. Went on a vacay while the rest of your state was in an energy crisis during a historic snowstorm? Blame it on the kids! Condemn direct action by Black Lives Matter but then watch MAGA supporters storm the Capitol? Blame it on Antifa! Lose an election? Blame it on nefarious vote-switching gangs and Joe Biden’s communist friendship with a dead dictator from Venezuela! Greene is a little different, though. She traffics in controversy: claiming that 9/11 might’ve been an inside job, for instance, or that school shootings might have been nefarious “false flag” operations populated with actors and staged by liberals. She tries them on for size. Then, when everything feels like it’s gotten a little out of hand – like when even some of her own colleagues voted to expel her from two House committees – she begins to backtrack.What all this allows Greene to do is position herself as a politician who listens, who doesn’t mind owning up to mistakes, who cares about accountability and responsibility. Whether or not it was responsible to pose absurd questions like whether being made to wear a gold star in Nazi Germany is the same as being asked to wear a face mask in a grocery store during a pandemic is immaterial. Instead, Greene gets to stand in front of cameras and talk about leadership in front of the most recognizable building in the world. In mopping up after the mess she created herself, she doesn’t just keep herself in the headlines (plenty of politicians manage that and fail to benefit); she builds a brand. The age of shameless, bombastic bluster is over. Greene knows she can’t get away with simply throwing out verbal grenades and hoping she does as much damage as possible. The 2020 election proved that even though many Americans are still seduced by Trumpian ideals, many now find the man unpalatable. There’s still a place for someone who talks the talk but doesn’t walk as much of the walk; someone who plays up the down-to-earth stuff rather than the cult leader stuff. So, like Chrissy Teigen apologizing for being a Twitter troll in her twenties, Greene saunters in and tells us that she’s sorry. She comes from a family line of people who hold themselves up to scrutiny and admit when they find themselves lacking, she tells us. She got it wrong. She can hold her head up high and look us in the eye and say: yes, that whole Holocaust/mask comparison was a little much, now I’ve seen the pictures. She’ll stand by the comparison of the Democrats to the Nazis, though.Join thought-provoking conversations, follow other Independent readers and see their repliesCongress Greene HolocaustCopyright 2021 The Associated Press. All rights reserved.Want to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.Log inNew to The Independent?Want an ad-free experience?Subscribe to Independent Premium.", "Section": "", "Writers": "", "URL": "https://www.independent.co.uk/voices/marjorie-taylor-greene-apology-holocaust-b1866414.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}