{"Type": "Asia", "Time": "2021-06-16", "Headline": "Philippines' Duterte will not cooperate with ICC probe: Spokesman", "Text": "MANILA: Philippine President Rodrigo Duterte will \"never cooperate\" with anInternational Criminal Court probeinto the country's deadly drug war, his spokesman said on Tuesday (Jun 15), branding the process \"legally erroneous\".Outgoing ICC chief prosecutor Fatou Bensouda on Monday asked judges at the world's only permanent war crimes court to authorise an investigation into allegations that Philippine police unlawfully killed as many as tens of thousands of civilians between 2016 and 2019.Duterte was elected in 2016 on a campaign promise to get rid of the country's drug problem, and he openly ordered police to kill drug suspects if their lives were in danger.\"The president will never cooperate until the end of his term on Jun 30, 2022,\" Harry Roque told reporters, repeating a previous assertion that the ICC has no jurisdiction in the Philippines because it pulled out of the tribunal.The Philippines left the ICC in 2019 after the court launched a preliminary examination into the war on drugs. Bensouda said it could still investigate crimes committed while the country was a member.\"The available information indicates that members of the Philippine National Police, and others acting in concert with them, have unlawfully killed between several thousand and tens of thousands of civilians\" during the period under investigation, said Bensouda, in one of her last acts before stepping down this week.But Roque rejected her findings and said it was \"an insult to all Filipinos\" to suggest the country's justice system was not working.\"We will be compared to countries like Darfur, areas where there is no functioning government. It's not right,\" he said.\"If killings occurred, appropriate force and violence were observed.\"The crackdown is Duterte's signature policy initiative and he defends it fiercely, especially from critics such as Western leaders and institutions which he says do not care about the Philippines.More than 6,000 people have been killed in over 200,000 anti-drug operations conducted since July 2016, according to official data.Human rights groups estimate the number of dead could be several times higher.Many suspects have been put on \"drug watch lists\" by local officials and then visited by police at their homes - a situation which often ends in a deadly shooting that officers claim was self-defence.Rights groups welcomed Bensouda's request, with Amnesty International describing the ICC investigation as a \"landmark step\".It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Philippines,Rodrigo Duterte,International Criminal Court", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/philippines-rodrigo-duterte-icc-probe-drug-war-cooperate-15017750", "Source": "google"}