{"Type": "World", "Time": "2021-06-16", "Headline": "Putin impersonator beats real president to Geneva", "Text": "GENEVA: A day before Russian President Vladimir Putin was due to arrive in Geneva for a historic summit with US President Joe Biden, a look-alike was spotted in the Swiss city at a protest calling for the release of Kremlin critic Alexei Navalny.Bare-chested and wearing army pants to mimic summer holiday shots of the real Russian president, protester Alexander Lyubuschin donned a Putin face mask and sat in on a bench of a sunny Geneva square, pretending to neck Vodka.Asked whether he expected a good result from the summit set to take place on Wednesday afternoon at a nearby lakeside villa, the impersonator responded: \"But of course. If not I will cut off all the gas and oil.\"On the bench beside him was a fake pistol and a mock-up bottle of the nerve agent Novichok, which German doctors said was used to poison Navalny last year in Siberia.The Kremlin denies allegations it ordered the poisoning.Nearby, a few dozen protesters shouted for Navalny's release from a Russian jail where he is serving a 2.5 year sentence.They chanted \"Russia without Putin\" next to a poster of Navalny signing a heart - a copy of a mural that appeared on a street in central Geneva a few days ago.A senior US official said Biden's administration would bring up human rights at the summit where nuclear arms and ransomware are also on the agenda, but did not specify whether that includes Navalny's case.Geneva hosts the UN's human rights council and is a hub for activism. Navalny's daughter last week accepted a \"moral courage\" award on behalf of her father at a virtual event organised by the Geneva Summit for Human Rights and Democracy.Maria Knyazeva, a protestor, said she hoped Biden would raise Navalny's case directly with Putin.\"I understand strategic issues have to be first but if Biden and other Western leaders will not stand up for human rights - who will?\" she said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Alexei Navalny,Vladimir Putin,fine art,impersonator,Geneva,Russia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/putin-impersonator-beats-real-president-to-geneva-15022632", "Source": "google"}