{"Type": "", "Time": "2021-06-16", "Headline": "China sends 28 warplanes near Taiwan in year's largest exercise, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.TAIPEI (BLOOMBERG) - China's air force sent 28 aircraft close to Taiwan, the largest sortie this year, further ratcheting up military pressure on the government in Taipei as it seeks to strengthen ties with the US.The People’s Liberation Army planes, including 14 J-16 and six J-11 fighters, were detected in Taiwan’s southwestern air defense identification zone Tuesday, Taiwan’s defence ministry said in a statement.Taipei’s military sent patrol aircraft, issued radio warnings and deployed air defense missile systems to monitor the activity.Chinese military aircraft have frequently entered the southwest part of Taiwan's ADIZ over the past year as the PLA has steadily picked up military activity around the democratically-ruled island.Washington and Beijing have been issuing warnings to each other regarding Taiwan since President Joe Biden took office in January, adding to tensions that increased steadily during the Trump administration.The most recent exchange emerged from the Group of Seven summit in the UK over the weekend as leaders, at Biden’s behest, expressed concerns over Taiwan as well as Xinjiang and Hong Kong.China responded by calling the US “very ill.” China considers Taiwan as a breakaway province and has repeatedly threatened to take control of the island by military force if necessary to prevent Taipei from making a move toward formal independence.The Chinese Defense Ministry said in April that the Liaoning aircraft carrier had carried out exercises near Taiwan and the navy would plan more drills.\"This big mission is a reminder that China has not renounced the use of force against Taiwan, and its size and composition broadcasts Beijing’s willingness to actively confront, with military might if necessary, anyone who opposes it,\" said Mr Drew Thompson, a former official overseeing military-to-military relations for the US defense secretary, who is now a visiting senior research fellow at the National University of Singapore’s Lee Kuan Yew School of Public Policy. Taiwan’s foreign ministry said in a statement Wednesday that peace and stability in the Strait are being “unilaterally, purposely sabotaged” and urged the Chinese government to end its military threat.The “blind adherence” that Taiwan’s Democratic Progressive Party shows for independence “is the root cause of tensions in cross-strait relations,” Mr Ma Xiaoguang, spokesman for the Beijing office that handles matters related to Taiwan, said at a regular press briefing.“We will never allow the DPP to regard our goodwill as an opportunity to seek independence, and will never allow anyone to separate Taiwan from China in any way,” Mr Ma added.The government of President Tsai Ing-wen views Taiwan as an already de facto sovereign nation.Earlier this month, a bipartisan US congressional delegation visited Taiwan prompting criticism from Chinese nationalists online. China’s top diplomat, Yang Jiechi, urged the US to tread carefully on issues relating to Taiwan last week in a call with Secretary of State Antony Blinken.So long as the PLA Air Force acts in accordance with international norms and agreements, the chances of an accident are small, Mr Thompson said. \"Should PLA planes operate in a reckless fashion – regardless of how justified Beijing feels about applying military pressure towards Taiwan or its neighbors – then the risk of an accident increases considerably,\" he said. Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/china-sends-28-warplanes-near-taiwan-in-years-largest-exercise", "Source": "google"}