{"Type": "", "Time": "2021-06-16", "Headline": "Biden had grins, hugs and ‘love’ for allies. But will not offer a morsel of bread to Putin. - The Washington Post", "Text": "President Biden walked arm and backslapping arm with French President Emmanuel Macron along the beach in Carbis Bay, England, during the G-7 summit in an extended trans-Atlantic, intergenerational display of comity. The two were not old pals catching up after more than a year of pandemic isolation, but they nonetheless were making up for lost time.The two walked across the sand in full view of cameras, chatting and laughing. Their clubby embrace went on and on. And noticeably, interminably on. It transformed from spontaneous and casual into a vociferous rebuke of the tone and philosophy of the previous administration. Instead of America standing alone, here it was shoulder to well-tailored shoulder in determined camaraderie.When the two allies sat to offer brief remarks on how they were getting along, Biden occasionally chuckled. He joked. He toyed with the aviator sunglasses he held in his hands. Was America back?This is what the media wanted to know, in part because this was Biden’s self-proclaimed narrative. It is his foreign policy mantra — his political love story about the fickle country that strayed from its true path but found its way home. The president deflected the question, suggesting that it be put to his French counterpart instead. Is America back? “Definitely,” said Macron.“We have to face a lot of challenges, a lot of crisis — climate change. And for all these issues, what we need is cooperation. And I think it’s great to have the U.S. president part of the club and very willing to cooperate,” Macron said. “And I think that what you — what you demonstrate is that leadership is partnership.”In the visual record of Biden’s interactions with his G-7 counterparts in Cornwall and the leaders of the NATO alliance in Brussels, during his official arrival in Geneva in advance of a meeting with Russian president Vladimir Putin, Biden telegraphed ease — even though none of the problems he must contend with are easy. In his public gestures and expressions, Biden painted a portrait of civility, good humor and control as he stood alongside America’s friends.There’s diplomacy in the details, in the aesthetic grace notes. And in the empty spaces.For his meeting with Putin on Wednesday, his administration has made it plain that there will be no side-by-side news conference. No mutual answering of questions. During their conversation, there will be no meal. No bread will be broken, but presumably there will, at least, be water.U.S. officials expect summit with Putin to last at least four hours, touch on nuclear arms, cyberattacks and human rightsSo much has changed in the vividly fraught relationship between America and its allies and its stubbornly credulous relationship with Russia these past four years. When Macron first met then-President Donald Trump, their long handshake might well have set a record. It was akin to an arm-wrestling match, as each man’s knuckles turned white and their jaws clenched. Their subsequent encounters included handshakes that were tests of endurance and brute strength, with at least one instance of the American yanking on the Frenchman’s hand as if he were prepared to wrestle him to the mat.But after an administration whose public stance was defined by anger and chest-thumping — and the actual shoving of other world leaders — Biden’s every “hello” is a course correction for the historical record. He and NATO Secretary General Jens Stoltenberg engaged in a shoulder-clasping tête-à-tête in Brussels while visiting the memorial to the Sept. 11, 2001, terrorist attacks. The president arrived in Geneva and returned the Swiss gesture of placing one’s hand over one’s heart in a warm and fuzzy welcome. And as some countries begin to see signs of a dissipating pandemic, the diplomatic handshake — so maligned, so germy and yet so deeply ingrained — has made a comeback, but without the palpable animosity of the Trump years.The Biden picture book from his trip abroad has been a paean to friendship. He met with Queen Elizabeth II and couldn’t help but publicly gush about the encounter. “I don’t think she’d be insulted, but she reminded me of my mother, the look of her and just the generosity,” he said. He called her gracious and offered her his elbow as they stepped down from their formal perch in front of the cameras. He may be 78, but she’s 95 and that’s just being polite rather than impolitic. And she looked tempted to accept his aid but sallied forth on her own.First lady Jill Biden made the administration’s message explicit with a jacket on which the word “love” was outlined in crystals on the back. “We’re bringing love from America,” she told reporters in Cornwall during the G-7 meeting. “This is a global conference and we are trying to bring unity across the globe and I think it’s needed right now, that people feel a sense of unity from all the countries and feel a sense hope after this year of the pandemic.”But mostly it was a striking jacket because its message contrasted sharply with the acerbic one delivered by former first lady Melania Trump not so long ago: “I Really Don’t Care. Do You?” The words were graffitied onto the back of an olive drab coat, with the crude lettering emphasizing the raw sentiment.Biden wore his suits well, which is no small thing. That, too, was a message of a sort. His shoulder lines were precise and his trousers broke just slightly over his shoes. His tie was properly knotted and when he was standing, his jacket was neatly buttoned. He dressed with classic care, which is to say he styled himself with a traditionalist’s respect for both those he was meeting and the folks he was representing.The visuals don’t tell the full story of policies and negotiations. But they do tell us something about the intent, and the tone — about the way in which one wants to be seen. Biden’s walk across the international stage has been both considered and considerate.He wrapped his allies in an embrace. And he promised not to give bread and comfort to his adversaries.The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/nation/2021/06/15/biden-had-grins-hugs-love-allies-will-not-offer-morsel-bread-putin/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}