{"Type": "World", "Time": "2021-06-16", "Headline": "New York governor lifts remaining COVID-19 restrictions, calls it a 'momentous day'", "Text": "NEW YORK: New York is lifting all state-mandated coronavirus restrictions after reporting that 70 per cent of the state's adults have received at least one dose of COVID-19 vaccine, Governor Andrew Cuomo announced on Tuesday (Jun 15).\"It is an important milestone, and we're going to keep pushing to do more,\" Cuomo told a news conference, adding that the state would continue to encourage more New Yorkers to get vaccinated.Restrictions across commercial and social settings will be lifted immediately. Cuomo said some limitations based on guidelines from the US Centers for Disease Control and Prevention would remain in place, with mitigation measures still required in public transit and healthcare settings.Cuomo, whose state was the epicentre of the U.S. COVID-19 public health crisis last year, also said individuals and businesses could still choose to adopt some precautions.The governor, who won praise in the early days of the pandemic for his televised news conferences but later became entangled in accusations of sexual misconduct, abuse of power and allegations of mishandling nursing homes during the crisis, made a triumphant entrance at the World Trade Center in New York City on Tuesday to mark what he called a \"momentous day.\"\"New York State has fully vaccinated a larger share of adults than any other big state in the country,\" he told a cheering crowd that included first responders and hospitality workers.On Tuesday night, fireworks all across the state will celebrate the milestone, Cuomo announced, and the Empire State Building and other state landmarks will be lit in blue and gold, New York's colours.Most U.S. states have moved to ease or lift coronavirus restrictions as the virus abates and vaccinations progress.New York joined California, where restrictions including physical distancing, mask requirements and capacity limits for restaurants, stores and other businesses that cater to consumers end on Tuesday.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,New York,coronavirus,medical health,Andrew Cuomo", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/new-york-governor-lifts-remaining-covid-19-restrictions--calls-it-a--momentous-day--15021232", "Source": "google"}