{"Type": "", "Time": "2021-06-16", "Headline": "Coronavirus Cases Today: India Reports 62,224 New Covid Cases, 2,542 Deaths", "Text": "Coronavirus: India is the second among the nations hit worst by the virus.With the fresh Covid cases, the country's tally of cases has climbed to over 2.96 crore, as per Union Health Ministry.The daily positivity rate further dropped to 3.22 per cent. It for the ninth straight day that India is seeing a positivity rate below 5 per cent.Maharashtra, the worst-hit state, on Tuesday reported 7,652 new COVID-19 cases, taking the state's tally to 59.24 lakh.After Maharashtra, Karnataka, Kerala, Tamil Nadu and Andhra Pradesh have the highest number of infections.Karnataka recorded a further dip new cases with 5,041 fresh infections. The state's positivity rate has fallen to 3.8 per cent. For the first time in two months, daily cases in Bengaluru was under 1,000.Neighbouring Kerala, which also saw a worrying rise in daily COVID-19 cases in the second wave of the pandemic, logged 12,246 fresh infections in the last 24 hours.  The death count rose to 11,508 with 166 more deaths. Tamil Nadu saw a slide in daily Covid case counts for the 25th straight day, with 11,805 new infections. 267 Covid patients died in the last 24 hours.Delhi logged 228 new coronavirus cases, which brought the total caseload to over 14.31 lakh. 12 people died due to COVID-19 in the last 24 hours - the lowest daily count in more than two months since April 3.Gurgaon, Delhi's neighbouring city in Haryana, reported 12 Covid cases on Tuesday, an all-time low according to its health department. The city reported one Covid death on the same day, while the active cases have come down to 332 bringing the positivity rate down to 0.4 per cent.The Union Health Ministry on Tuesday said anyone over the age of 18 can walk in to the nearest vaccination centre to get registered on the CoWIN digital platform and be inoculated against coronavirus.Track Latest News Live on NDTV.com and get news updates from India and around the world. Watch Live News:Follow Us:................................ Advertisement ................................", "Section": "", "Writers": "", "URL": "https://www.ndtv.com/india-news/coronavirus-cases-today-india-reports-62-224-new-covid-cases-2-542-deaths-2464882", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}