{"Type": "", "Time": "2021-06-16", "Headline": "Bukit Merah View Market COVID cluster grows to 39 cases", "Text": "SINGAPORE — The Ministry of Health (MOH) on Wednesday (16 June) confirmed 24 new COVID-19 cases in Singapore, taking the country's total case count to 62,339.Nineteen of them are local cases in the community. Of them, 13 – out of 16 linked cases – were added to the 115 Bukit Merah View market and food centre cluster. Including a previously unlinked case retroactively added to the cluster on Wednesday, the cluster now has 39 cases.Wednesday marks the 52nd consecutive day with local cases reported. The five imported cases are two Singaporeans – including a nine-year-old boy – who returned from India and the UK as well as three work permit holders who arrived from Indonesia, all of whom are foreign domestic workers.\"Amongst the new cases today, 10 are asymptomatic, and were detected from our proactive screening and surveillance, while 14 were symptomatic,\" said the MOH.The three unlinked cases in the community are:an 85-year-old Singaporean woman who is a retireea 47-year-old Indonesian woman who is a foreign domestic workera 32-year-old Indonesian woman who is a foreign domestic worker (visited 115 and 116 Bukit Merah View)Separately, an 84-year-old Singaporean woman who is a retiree is linked to the 32-year-old woman but is not considered part of an active cluster. She had also visited 115 and 116 Bukit Merah View.The ministry noted that the number of new cases in the community has increased from 71 in the week before to 77 in the past week. The number of unlinked cases in the community has also increased from six in the week before to 19 in the past week.Singapore currently has 46 active COVID-19 clusters.The cluster was first linked to a 74-year-old Singaporean man who works at a sundry store at the market and food centre. The fully-vaccinated man was confirmed to have COVID-19 on 9 June.Only one of the 13 new cases works at the food centre, while most of the others are family members and household contacts or close contacts of previous infections in the cluster:a 60-year-old Singaporean man who works as a stall vendor at the food centre (quarantined earlier, fully vaccinated)a 76-year-old Singaporean man who is a retiree and frequent visitor to 115 and 116 Bukit Merah View (quarantined earlier, fully vaccinated)a 71-year-old Singaporean woman who is a retiree (quarantined earlier, fully vaccinated)a 63-year-old Singaporean man who is a freelance worker and frequent visitor to 115 and 116 Bukit Merah View (quarantined earlier, fully vaccinated)a 38-year-old Singaporean woman who works as a stall assistant at Zhangde Primary School’s canteen (quarantined earlier, fully vaccinated)a 12-year-old Singaporean girl who is a student at CHIJ St Theresa’s Convent (quarantined earlier)a 33-year-old Singaporean woman who works in an administrative role at South Asia Construction and part-time at Telok Blangah Food Centre (quarantined earlier)a 15-year-old Singaporean girl who is a student at Gan Eng Seng School (quarantined earlier)a 69-year-old Singaporean woman who works as a stall helper at New Changi Eating House; sometimes helps out at a stall at the Bukit Merah food centrea 49-year-old Singaporean woman who works as a sales coordinator at Gold Lite (visited food centre, received first dose of vaccine)a 45-year-old Malaysia woman who works as a stall assistant at Tiong Bahru Yong Tao Hu at 56 Eng Hoon Streeta 64-year-old Singaporean man who is a taxi driver and frequent visitor to the food centrean 82-year-old Singaporean man who is a retiree and frequent visitor to the food centre (fully vaccinated)One case, announced to be unlinked on 14 June, has been retroactively added to the cluster. He is a 79-year-old Singaporean man who is employed by AO ServicePro as a cleaner at 375 and 376 Clementi Avenue 4. The man received his first dose of the COVID-19 vaccine on 5 June.Finance Minister and multi-ministry taskforce (MTF) co-chair Lawrence Wong in a Facebook video post on Wednesday raised the possibility of a delay in the next stage of Singapore's re-opening, due to the growing cluster at the food centre.With this in mind, Wong said the government is \"evaluating the timeline and the scope of our second stage of opening\" and, in consultation with public health experts, would announce its decision soon.The cluster is named after the case number of a 27-year-old male India national who works as an engineer at Ecoxplore and was confirmed to have COVID-19 on 12 June.The two new additions had been quarantined earlier:a 50-year-old Singaporean man who is employed as a part-time housekeeper at Eunike Living (fully vaccinated)a 26-year-old Malaysian woman who works as a waitress at Common Man StanWith 20 more patients discharged from hospitals or community isolation facilities on Wednesday, 61,931 cases – or 99.3 per cent of the total – have fully recovered from the infection.Most of the 146 hospitalised cases are stable or improving, while one of them is in critical condition in the intensive care unit.A total of 228 patients – with mild symptoms or are clinically well but still test positive – are isolated and cared for at community facilities.Apart from the 34 patients who have died from COVID-19 complications, 15 others who tested positive for the virus were determined to have died from unrelated causes, including three whose deaths were attributed to a heart attack and another four, whose deaths were attributed to coronary heart disease.Among the 116 confirmed cases reported from 10 to 16 June, 45 cases have tested positive for their serology tests, 62 have tested negative, and nine serology test results are pending.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:COVID quarantine procedures confusing, inconsistent: Singapore residentsMore Singapore residents identifying as having no religion: censusPopulation growth slowed, higher proportion of singles in Singapore: censusFor Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.If you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.Malaysian durians have topped fruit and vegetable presales at a big Chinese retail festival, showing the pulling power of the pungent delicacy.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.A Malaysian court Wednesday overturned an inquest verdict of \"misadventure\" in the death of a French-Irish schoolgirl who vanished in the jungle, replacing it with an \"open\" ruling in a victory for her family.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aEVOS Savage Girl started the finals strong by defeating DR Hellcats in the opener. However, the Filipina squad bounced back in the next game to force the series to a decider.With Afghan troops in retreat and soon to lose vital American air support, Taliban commanders are voicing exuberance about quickly seizing full control of the country and re-establishing their version of an Islamic state.US carrier Southwest Airlines was ramping operations back up Tuesday after canceling some 500 flights following a second major outage in 24 hours due to computer issues.European and US stock markets marked time on Wednesday as investors brace for fresh signals from the US Federal Reserve on its stimulus policy.Chinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiThe European Union and United States launched a trade and technology council that seeks to “write the rules of the road” on the global economy, in the face of growing competition from China. It was the latest salvo against Beijing on US President Joe Biden’s whistle-stop European tour, which had seen him succeed in rallying support among the G7, Nato and now EU for a much-vaunted transatlantic coalition to face down China’s rising influence. A joint EU-US statement said the council would focus oA minimalist can get away with less The post How Much Does It Cost To Furnish Your HDB Flat? appeared first on DollarsAndSense.sg.The newly-formed Amihan Esports Wild Rift squad went from unknown to become the dark horses that took down Team Secret at the Wild RIft PPGL Summer Playoffs.If you’re wondering whether Ethereum is a good long term investment, keep reading.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neThe emergence of problems in a new-generation nuclear reactor in China threatens to undermine efforts by its French designer to sell it elsewhere, and could hurt Beijing's nuclear industry, analysts said.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/of-24-new-covid-cases-in-singapore-19-in-community-075036089.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}