{"Type": "", "Time": "2021-06-16", "Headline": "Carousell buyer uses vulgarity while dealing with seller, asks why she can't be more 'flexible'", "Text": "Submitted by Stomper DorisThis story was submitted via Stomp App contribution.This story was submitted via Stomp App contribution.A Stomper was offended by the rudeness of a potential buyer she encountered on online marketplace Carousell.Stomper Doris shared that a man expressed interest for a Hello Kitty pouch she had listed and said he wanted to get it for his girlfriend.She said she clearly stated that she would charge $1.50 for normal mail delivery as she did not wish to meet up due to the current Covid-19 pandemic.\"The buyer asked if I drive and if I could deliver to Bukit Batok,\" she said.\"I stay in Sengkang.\"I said I can get delivery to send but he requested to pay cash on delivery.\"I said no, how do you expect me to ask a delivery guy to collect money on my behalf? Would I have to pay for another trip to get my money back?\"\"Since he would be receiving the item via mail or delivery, he needed to make payment in advance but he mentioned he was not able to PayNow as his girlfriend would find out.\"The item is supposed to be a surprise gift.\"I suggested he go to an ATM to transfer but he said he complained he would have to 'walk all the way to ATM to transfer'.\"I was seriously pissed off and asked him to ask his family member to help him transfer.\"I told him if he is not confident with normal mail, he can opt for tracking but still insisted on advanced payment and no cash on delivery.\"He then said 'WT*' and asked me why I can't be more flexible.\"How am I inflexible when I have suggested asking others to help transfer payment for him and also mentioning using a courier for delivery?\"Don't buy if you think it's not trustworthy and don't need to use the F-word.\"Such a loser...\"Click through the gallery above for the full conversation.Get more of Stomp's latest updates by following us on Facebook, WhatsApp, Twitter, Instagram and YouTube.View the discussion thread.View the discussion thread.Download the new STOMP app today.SPH Digital News | The Straits TimesAll rights reserved | Terms & Conditions | Data Protection Policy | Advertise with usSPH Digital News / STOMP / Copyright (c) 2019 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E.", "Section": "", "Writers": "", "URL": "https://stomp.straitstimes.com/singapore-seen/carousell-buyer-uses-vulgarity-while-dealing-with-seller-asks-why-she-cant-be-more", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}