{"Type": "", "Time": "2021-06-16", "Headline": "Israeli nationalists march in East Jerusalem, raising tensions with Palestinians", "Text": "Keep up to speed at a glance with the Top 10 daily storiesBy Stephen Farrell and Rami AyyubJERUSALEM (Reuters) -Thousands of Israeli far-right nationalists marched in a flag-waving procession through East Jerusalem on Tuesday, an event that reignited tensions with Palestinians and posed an early challenge to Israel's new government.Last month, Israeli-Palestinian confrontations in contested Jerusalem helped trigger 11 days of cross-border fighting between Israel and Gaza's ruling Hamas militant group.On Tuesday, Israeli police in riot gear and on horseback cordoned off areas leading to the walled Old City's flashpoint Damascus Gate, clearing the area to Palestinians before the marchers arrived.Dancing and singing \"the people of Israel live\", the crowd of mostly religious Jews, many carrying blue and white Israeli flags, filled the plaza in front of the gate, usually a popular social gathering spot for Palestinians.\"Take a good look at our flag. Live and suffer,\" one marcher, a megaphone in one hand and a cigar in the other, shouted in Hebrew at Palestinian merchants on the other side of police barriers erected on an East Jerusalem street.Israel, which occupied East Jerusalem in a 1967 war and later annexed it in a move that has not won international recognition, regards the entire city as its capital. Palestinians want East Jerusalem to be the capital of a future state that would include the West Bank and Gaza.Sitting on a bench outside the police cordon, Khalil Mitwani, a 50-year-old Palestinian, said of the marchers: \"They are making a big problem in Jerusalem. All the people here want peace - why make problems here?\"Hamas had warned of renewed hostilities over the march, testing the mettle of new Prime Minister Naftali Bennett's administration of right-wing, centrist, left-wing and Arab parties and prompting Israel to beef up its deployment of the Iron Dome anti-missile system.But as the marchers began to disperse after nightfall in Jerusalem, there was no sign of rocket fire from Gaza.Several hours before the event started, however, Palestinians in Gaza launched incendiary balloons which the Israeli fire brigade said caused at least 20 blazes in fields in Israeli communities near the fenced border with the enclave.Such incidents had stopped with the ceasefire that ended last month's hostilities, in which Gaza militants unleashed rocket barrages into Israel and Israel pounded the small, densely populated coastal enclave with air strikes.Israeli media reports said Bennett's administration would order retaliation for the resumption of the balloon launches, though not necessarily immediately.RE-ROUTINGAt least 27 Palestinians were injured in clashes in East Jerusalem with Israeli police firing stun grenades, the Palestine Red Crescent ambulance service said.But the violence was not as extensive as many had feared.In an apparent effort to avoid friction with Palestinians during the march, a police-charted route kept participants from going through the Damascus Gate, the main entry to the Muslim Quarter of the Old City and home to shrines sacred to Judaism, Islam and Christianity.The marchers took a more peripheral route instead to Judaism's sacred Western Wall, singing nationalist songs that echoed in alleyways where Palestinian merchants had shuttered their shops.Yair Lapid, Bennett's foreign minister and main partner in the governing coalition that ended Benjamin Netanyahu's 12-year run as prime minister, condemned chants of \"Death to the Arabs\" from some of the marchers.\"That's not Judaism, and that's not being Israeli, and it is certainly not what our flag symbolises,\" Lapid wrote on Twitter.Tuesday's march was originally scheduled for May 10 as part of \"Jerusalem Day\" festivities that celebrate Israel's capture of East Jerusalem in the 1967 Middle East war.At the last minute, that march was diverted away from the Damascus Gate and the Muslim Quarter, but the move was not enough to dissuade Hamas from firing rockets towards Jerusalem.(Reporting by Rami Ayyub and Stephen Farrell, Additional reporting by Dan Williams in Jerusalem and Nidal al-Mughrabi in Gaza, Editing by Jeffrey Heller, Timothy Heritage and Mark Heinrich)Premier League champions Manchester City will start the defence of their title away to Tottenham after the fixtures for the 2021-22 season were unveiled on Wednesday.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neMeet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Alibaba Group was the victim of a months-long web-scraping operation by a marketing consultant that siphoned up sensitive data including usernames and phone numbers.It's useful to be ready with the names of a few companies you'll scoop up in case a crash occurs. The post 3 Stocks I Will Buy If the Market Crashes Tomorrow appeared first on The Smart Investor.Sentosa isn’t expensive as you think it is. Here’s everything you need to know about the island’s entrance fees cost, car park rates, beach reservations and hacks on how to save. Thanks to COVID-19, plans to travel overseas for a well-deserved holiday is starting to […] The post Sentosa Island: Entrance Fee And Parking Rates appeared first on SingSaver Blog - We Compare, You Save.Learn more about scalp psoriasis. Look for scalp psoriasis treatments.Kevin Durant finished with 49 points while playing every minute of the game as the Brooklyn Nets rallied from a 17-point deficit to beat the Milwaukee Bucks 114-108 in game five of their NBA playoff series on Tuesday.Turkish President Recep Tayyip Erdogan on Tuesday pledged support for Azerbaijan if the ex-Soviet country was attacked, as he made a visit to the disputed Nagorno-Karabakh region.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Sick of seeing others get rich in the stock market? Have you heard of Everlasting Stocks?If you’re wondering whether Ethereum is a good long term investment, keep reading.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aThe largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.Find furniture you love, at prices that fit your budget with flexible financing.The League of Legends: Wild Rift esports scene will be kicking into full gear this 19 June with the League of Legends: Wild Rift 2021 SEA Icon Series Summer Super Cup.A sinking fire-damaged container ship could take months to salvage because of rough monsoon seas, Sri Lanka said Tuesday, as authorities investigated whether the deaths of dozens of turtles and dolphins were caused by the disaster.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.This new car cloth can easily remove all the car scratches and dents from your car.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.Cristiano Ronaldo netted a double to become the European Championship's all-time leading scorer as Portugal struck three times late on to beat a stubborn Hungary 3-0 in their Euro 2020 opener at a packed Puskas Arena on Tuesday.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).The Russian skipper of a container ship that caught fire and burned for almost two weeks before sinking off Sri Lanka's coast has been arrested and is expected to be charged with marine pollution, police said Monday.The inflation outlook among Americans is at its highest level ever, while many are upbeat about their employment situation, a New York Federal Reserve survey released Monday said.The report covering May showed one-year inflation expectations jumped 0.The emergence of problems in a new-generation nuclear reactor in China threatens to undermine efforts by its French designer to sell it elsewhere, and could hurt Beijing's nuclear industry, analysts said.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/israeli-nationalists-march-east-jerusalem-210721531.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}