{"Type": "", "Time": "2021-06-16", "Headline": "Dickson Yeo, man who spied for China, to remain behind bars", "Text": "SINGAPORE — Dickson Yeo, the Singaporean man who was jailed in the US for spying for China and was arrested by the Internal Security Department (ISD) upon his return to Singapore last year will be continue to be held in detention under the Internal Security Act.In a statement on Tuesday (15 June), the department said its investigations have established that Yeo \"worked for the intelligence apparatus of a foreign state and had carried out various taskings given to him by his foreign handlers in exchange for monetary gains\".From 2016 until his arrest in the US in 2019, Yeo was asked to source for information and provide reports on issues, including information relating to Singapore, and had approached various people in Singapore to try to get information for his reports, said the ISD.He also set up a front company in Singapore as a cover, not only for information-gathering activities but also for his foreign handlers to recruit others.\"He had also tried, but failed, to secure employment in the Singapore government sector to further his information-gathering activities,\" the department added.The ISD said its investigations are still ongoing and Yeo's continued detention is necessary \"to facilitate probes into the full extent of his activities\".\"The Singapore Government takes a very serious view of anyone who enters into a clandestine relationship with a foreign government and engages in activities at the behest of the foreign power that is inimical to our national security and interests, including bilateral relations,\" the department added.Yeo was a doctoral candidate at the National University of Singapore's Lee Kuan Yew School of Public Policy (LKYSPP) when he was recruited by Chinese intelligence officers after a 2015 trip to Beijing to give a presentation on the political situation in Southeast Asia.He was first arrested by American counterintelligence officers in November 2019. He pleaded guilty in July last year to one charge of operating illegally as a foreign agent, and admitted to working between 2015 and 2019 for Chinese intelligence “to spot and assess Americans with access to valuable non-public information, including US military and government employees with high-level security clearances”.A few days after he entered his plea, LKYSPP said it had terminated Yeo’s PhD candidature with immediate effect. Yeo had enrolled as a PhD student there in 2015 and was granted a leave of absence in 2019.In October last year, Yeo was jailed for 14 months in the US for passing to the Chinese government valuable, but unclassified, military and political information that he had duped a number of Americans into giving him. Prosecutors said that Yeo was motivated by monetary gain and a shared desire with China to weaken the global standing of the US. Among the information Yeo handed over to China were reports on a military aircraft program, US troop withdrawal in Afghanistan and on a US Cabinet member, who was not identified in court documents.“I take full responsibility for what I have done,” Yeo reportedly said during sentencing. “I am sympathetic to China’s position, but it was not my intention to harm anyone.”In a statement announcing his arrest upon his return to Singapore in December last year, Singapore's Ministry of Home Affairs said, “Singapore will not allow our nationals to be subverted or used by any foreign actors for activities prejudicial to our security and national interests.\"We will deal firmly with such individuals in accordance with our laws,” the ministry added.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeRelated story:Dickson Yeo, Singaporean who spied for China, arrested by ISDSingaporean pleads guilty in US to working for Chinese intelligenceSingapore man sentenced to prison for spying for China in USPremier League champions Manchester City will start the defence of their title away to Tottenham after the fixtures for the 2021-22 season were unveiled on Wednesday.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neMeet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Alibaba Group was the victim of a months-long web-scraping operation by a marketing consultant that siphoned up sensitive data including usernames and phone numbers.It's useful to be ready with the names of a few companies you'll scoop up in case a crash occurs. The post 3 Stocks I Will Buy If the Market Crashes Tomorrow appeared first on The Smart Investor.Sentosa isn’t expensive as you think it is. Here’s everything you need to know about the island’s entrance fees cost, car park rates, beach reservations and hacks on how to save. Thanks to COVID-19, plans to travel overseas for a well-deserved holiday is starting to […] The post Sentosa Island: Entrance Fee And Parking Rates appeared first on SingSaver Blog - We Compare, You Save.Learn more about scalp psoriasis. Look for scalp psoriasis treatments.Kevin Durant finished with 49 points while playing every minute of the game as the Brooklyn Nets rallied from a 17-point deficit to beat the Milwaukee Bucks 114-108 in game five of their NBA playoff series on Tuesday.Turkish President Recep Tayyip Erdogan on Tuesday pledged support for Azerbaijan if the ex-Soviet country was attacked, as he made a visit to the disputed Nagorno-Karabakh region.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Sick of seeing others get rich in the stock market? Have you heard of Everlasting Stocks?If you’re wondering whether Ethereum is a good long term investment, keep reading.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aThe largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.Find furniture you love, at prices that fit your budget with flexible financing.The League of Legends: Wild Rift esports scene will be kicking into full gear this 19 June with the League of Legends: Wild Rift 2021 SEA Icon Series Summer Super Cup.A sinking fire-damaged container ship could take months to salvage because of rough monsoon seas, Sri Lanka said Tuesday, as authorities investigated whether the deaths of dozens of turtles and dolphins were caused by the disaster.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.Cristiano Ronaldo netted a double to become the European Championship's all-time leading scorer as Portugal struck three times late on to beat a stubborn Hungary 3-0 in their Euro 2020 opener at a packed Puskas Arena on Tuesday.This new car cloth can easily remove all the car scratches and dents from your car.The Russian skipper of a container ship that caught fire and burned for almost two weeks before sinking off Sri Lanka's coast has been arrested and is expected to be charged with marine pollution, police said Monday.The inflation outlook among Americans is at its highest level ever, while many are upbeat about their employment situation, a New York Federal Reserve survey released Monday said.The report covering May showed one-year inflation expectations jumped 0.The emergence of problems in a new-generation nuclear reactor in China threatens to undermine efforts by its French designer to sell it elsewhere, and could hurt Beijing's nuclear industry, analysts said.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/dickson-yeo-singaporean-spied-china-remain-behind-bars-040547816.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}