{"Type": "", "Time": "2021-06-16", "Headline": "Japan Heads Into ‘Diversity’ Olympics Without Promised LGBTQ Law - Bloomberg", "Text": "Japan’s parliament ended its session without passing a promised law on LGBTQ understanding, failing to fulfill a ruling party pledge just as the country is set to host what is meant to be a “diversity” Olympics.A bill under which discrimination against LGBTQ individuals would be deemed unacceptable was dropped by Prime Minister Yoshihide Suga’s ruling party and officially died Wednesday when the current parliament session ended. On top of this, members of his Liberal Democratic Party were reported as making discriminatory remarks against sexual minorities during the discussion process, sparking protests outside the party’s Tokyo headquarters.The ruling party’s failure to act strikes a sour note five weeks ahead of the opening ceremony for an Olympics that organizers said would be based around the concept of “Unity in Diversity.” Missing this opportunity could see the issue kicked down the road, potentially making Japan less attractive to the skilled foreign workers the aging country needs.“The Olympic Charter clearly bans discrimination,” said Gon Matsunaka, head of Pride House Tokyo, a group that promotes LGBTQ understanding. “This is a breach of the contract with the International Olympic Committee.”Japan lags its peers in the Group of Seven countries in several areas of civil rights protections for lesbian, gay, bisexual, transgender and questioning and/or queer people. The LDP had pledged in the 2019 upper house election to swiftly pass a bill promoting “correct understanding” of LGBTQ issues but the Asahi newspaper and other media have said conservative elements in the party have blocked progress.“Since Japan is such a significant participant in the international business world, it is likely to become increasingly awkward for Japanese companies as well as the country’s political leadership if the country remains an outlier when LGBTQ equality has become more and more quotidian in that world,” said Jennifer Pizer, the law and policy director at Lambda Legal, which says it is the oldest and largest U.S. civil rights group for LGBTQ people and those living with HIV.LGBTQ issues caused controversy at the Sochi Winter Olympics in Russia in 2014, which took place in the shadow of the country introducing anti-gay legislation. Former U.S. President Barack Obama and some other world leaders stayed away from the opening ceremony after the introduction of the law.While Japan cannot be compared to Russia, where LGBTQ people are sometimes violently persecuted, “the Sochi example of public attention could serve as a helpful wake-up call for Japan’s leadership,” said Pizer. “The international spotlight will only grow brighter as the start of the games approaches.”Asked about the fate of bill on LGBTQ discrimination, Suga told parliament earlier this month he would work to fulfill promises to the public. He also agreed to a G-7 statement at the weekend pledging to tackle discrimination against LGBTQI+ populations.The Tokyo 2020 website says diversity and inclusion are essential to a successful games, and inclusion will see people accepted and respected regardless of gender and sexual orientation, among other factors.Nonetheless, the head of the organizing committee was forced to step down in February after making disparaging comments about women. Yoshiro Mori, a former prime minister, was replaced as Tokyo 2020 chief by Seiko Hashimoto, a female minister and former Olympic athlete.Unease over the LGBT law may stem from concern it could lead to recognition of same-sex marriage, Matsunaka said. A survey published by the Asahi newspaper in March found that 65% of respondents said same-sex marriage should be recognized, compared with 41% in a similar survey in 2015. A majority of all age groups supported the change, apart from the over-70s, the paper said.Japan moved a little closer to allowing such unions when a court on the northern island of Hokkaido in March ruled the lack of legal recognition for same-sex marriage violates the constitution. It was the first such judgment in favor of marriage equality but it fell short of making it legal.Public Outrage Over Sexist Comments Forces Changes at Tokyo 2020“Men in their 50s, 60s and 70s tend to be against same-sex marriage, and that is the gender and age of LDP lawmakers,” said Matsunaka. “Rather than reflecting the whole of Japanese society, the opinions of one group are preventing a change in the law. That shouldn’t be allowed.”", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-16/japan-heads-into-diversity-olympics-without-promised-lgbt-law", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}