{"Type": "", "Time": "2021-06-16", "Headline": "China calls US 'very ill' after Biden rallies G-7 against it, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BEIJING • China mocked US efforts to build a broader coalition to counter Beijing, calling Washington \"very ill indeed\" as the world's biggest economies continue to spar over everything from human rights to technology exports.Chinese Foreign Ministry spokesman Zhao Lijian yesterday hit back at US efforts to rally allied support during the summits of the Group of Seven (G-7) and the North Atlantic Treaty Organisation (Nato) in recent days.The comments represented Beijing's most pointed response since United States President Joe Biden began his first visit to Europe focused on efforts to answer China's challenge to the global order.\"The US is ill and very ill indeed,\" Mr Zhao said. \"The G-7 had better take its pulse and come up with a prescription.\"Earlier, China's mission to the European Union warned Nato that the country would not \"sit back\" in the face of any challenges.The Nato statement \"slandered\" China's peaceful development, misjudged the international situation and indicated a \"Cold War mentality\", China said in a response posted on the mission's website. China is always committed to peaceful development, it added.It also said Beijing does not pose a \"systemic challenge\" to any country, adding that Nato should not exaggerate China's military power.The statement also urged Nato to push forward with dialogue and cooperation, and said the bloc should work to safeguard international and regional stability.The comments from Beijing come after Nato secretary-general Jens Stoltenberg told reporters that the alliance is \"concerned by China's coercive policies, which stand in contrast to the fundamental values enshrined in the Washington Treaty\" on which the bloc rests.He cited the country's rapidly expanding nuclear arsenal, military cooperation with Russia and its use of disinformation.The communique released after the Nato meeting mentioned China 10 times, compared with just once after the last summit in 2019.The US is ill and very ill indeed. The G-7 had better take its pulse and come up with a prescription.Russia was named more than 60 times this year.The document also said that the bloc \"maintains a constructive dialogue with China where possible\".Washington has been seeking to build a united front on Beijing, though Mr Biden settled for a modest condemnation at the G-7 meeting over the weekend.Mr Biden had pushed for the group to confront China on topics such as alleged forced labour and human rights abuses, and on its Belt and Road Initiative plan.He said he also raised the issue of China refusing outside access to its laboratories to determine the origin of the Covid-19 outbreak.The G-7 communique calls for a \"timely, transparent, expert-led and science-based\" study led by the World Health Organisation into the disease's origins.Several leaders, including German Chancellor Angela Merkel, pushed back amid concern about turning the G-7 into an anti-China group, suggesting that any infrastructure programme the nations supported should be framed as a more positive, pro-environment effort.BLOOMBERG, REUTERSJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/china-calls-us-very-ill-after-biden-rallies-g-7-against-it", "Source": "google"}