{"Type": "", "Time": "2021-06-16", "Headline": "7 taken to hospital after fire at HDB flat in Ang Mo Kio Avenue 6, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A fire broke out in a flat on the seventh floor of Block 123 Ang Mo Kio Avenue 6 on Wednesday morning (June 16), said the Singapore Civil Defence Force (SCDF) in a Facebook post.Seven residents were taken to Singapore General Hospital, Khoo Teck Puat Hospital and National University Hospital for smoke inhalation and giddiness, said the SCDF.About 130 people from the fifth to ninth storeys of the affected block were also evacuated by the police and the SCDF as a precautionary measure.The SCDF said that it was alerted to the fire at about 9.40am.Upon arrival, firefighters wearing breathing apparatus sets proceeded to the unit where the fire was raging.\"An occupant from the burning unit was seen at the seventh-floor staircase landing and was safely evacuated by SCDF firefighters,\" said the SCDF on Facebook.The fire, which involved the contents of the unit, was extinguished with a water jet and two compressed air foam backpacks, the SCDF added.The Straits Times understands that the fire was contained within the flat.Staff and residents from the Awwa Senior Community Home (SCH), located at levels two to four of the same block, had self-evacuated prior to the SCDF's arrival.Mr Sairam Azad, deputy director of Awwa Health and Senior Care, told ST: \"During the evacuation, one of the residents from Awwa SCH was feeling unwell and was conveyed to the nearest hospital for observation.\"The resident is currently in stable condition, he added.Mr Sairam said that the home's operations were not affected by the fire, and that seniors were allowed to return to their units at around 11.45 am.The cause of the fire is under investigation.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/7-taken-to-hospital-after-fire-at-ang-mo-kio-flat", "Source": "google"}