{"Type": "", "Time": "2021-06-16", "Headline": "Thailand to fully reopen in 120 days to revive sagging economy | The Star", "Text": "\n                    Wednesday, 16 Jun 2021\n                \t\nCaption\nThis screengrab of a video released by the Royal Thai Government on June 16, 2021 shows Thailand's Prime Minister Prayut Chan-O-Cha in Bangkok making an announcement on plans to reopen Thailand. - AFPBANGKOK (Bloomberg): Thailand plans to fully reopen to foreign visitors in 120 days and give at least one dose of vaccine to the majority of residents by Oct 1 to revive the tourism-reliant nation’s economy, Prime Minister Prayut Chan-O-cha said.Some tourist destinations should be ready for fully vaccinated visitors without any quarantine requirement sooner than the wider reopening, with Phuket as the \"pilot, ” Prayut said in prepared comments for a national address on Wednesday (June 16).The country aims to vaccinate 10 million people a month from July and has ordered 105.5 million doses of vaccines, more than the country needs, he said.\"The time has now come for us to look ahead and set a date for when we can fully open our country and start receiving visitors because re-opening the country is one of the important ways to start reducing the enormous suffering of people who have lost their ability to earn an income, ” Prayut said.I am, therefore, setting a goal for us to be able to declare Thailand fully open within 120 days from today, and for tourism centres that are ready, to do so even faster.”Other highlights of Prayut’s address:> Places of work and business must be able to operate normally and without blanket restrictions> Domestic travel must be without blanket restrictions> Only exception to these guidelines will be if a truly serious situation develops or seems likely to develop> Orders for provincial governors to make preparations for reopening and accelerate vaccinations> To get to the target of opening the country in 120 days, government will pilot with Phuket to relax some restrictions and receive visitors using a \"sandbox” model> Thais traveling abroad who are fully vaccinated must also be able to return home without confinement in quarantinePrayut said the decision to set a deadline for reopening is fraught with \"some risks, ” and \"when we open the country, there will be an increase in infections, no matter how good our precautions.”\"But, I think, when we take into consideration the economic needs of people, the time has now come for us to take that calculated risk.”The government wants to revive the tourism sector that, pre-pandemic, contributed about one-fifth of the economic output.The past year of travel restrictions decimated jobs and businesses, and Thailand’s gross domestic product has contracted for five straight quarters, a trend that’s likely to continue in the April-June period given the raging outbreak.  \nTags / Keywords:\nThailand\n                                                                ,\n                                                                                                covid-19\n                                                                ,\n                                                                                                reopen\n                                                                ,\n                                                                                                Prayut\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/16/thailand-to-fully-reopen-in-120-days-to-revive-sagging-economy", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}