{"Type": "Asia", "Time": "2021-06-16", "Headline": "Thailand plans to reopen to international tourists in 120 days: PM Prayut", "Text": "BANGKOK: Thailand plans to reopen its borders to international tourists in 120 days, Prime Minister Prayut Chan-o-cha announced in a televised speech on Wednesday (Jun 16).“Now, it is time for us to look further into the future at reopening the country to welcome tourists back into Thailand again. This is a crucial means to ease hardship faced by people who have not been able to make a living for a long time,” Gen Prayut said.“Today, I would like to inform you that I plan for Thailand to reopen within 120 days from this day on.”The target set by the Thai prime minister would put the country's reopening sometime in the middle of October.The prime minister also called on key tourist destinations to reopen sooner if they are ready, adding that travellers who have been vaccinated against COVID-19 should be exempt from quarantine.“Tourists who have completed their vaccination should be able to travel to Thailand without any quarantine or restrictions that would cause inconvenience.\"As for Thais who travel overseas, if they have completed their vaccination already, they should be able to return to their country without any quarantine as well,” Gen Prayut said.In his televised speech, the prime minister also said Thailand is coordinating with six vaccine producers - Pfizer, Moderna, AstraZeneca, Sinovac and Sinopharm, and that it has secured 105.5 million doses of COVID-19 vaccines.“All of them will start to get delivered within this year,” he added.According to Gen Prayut, more than 10 million doses are expected to be administered monthly “if there are enough vaccines delivered each month”. By early October, he said, at least 50 million people in Thailand should already have received their first dose of a vaccine.Meanwhile, the Thai government will continue to procure more vaccines for next year, Gen Prayut added.\"I know fully well that my decision today comes with a risk because once we reopen our country, no matter how well we have prepared, it is possible to have more infections,\" he said.\"However, after assessing the situation and bringing into consideration our people's survival and livelihoods, it is time for us to take the risk together.\"Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Thailand,COVID-19,Prayut Chan-o-cha", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/thailand-reopen-international-tourists-120-days-covid-19-15026706", "Source": "google"}