{"Type": "", "Time": "2021-06-16", "Headline": "Recalcitrant offender jailed for stealing Budget 2020 grocery vouchers with wife, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A recalcitrant offender is back behind bars after he worked with his wife to steal Budget 2020 grocery vouchers worth $10,800 in total from 72 victims.In an unrelated case, Zulkeflei Mohamed Yatim, who has been in and out of jail since the 1990s for crimes including multiple drug-related offences and theft, also assaulted his 21-year-old stepson.The 42-year-old Singaporean was on Wednesday (June 16) sentenced to 84 weeks' jail after he pleaded guilty to 15 counts of theft involving vouchers worth $2,250. He also admitted to an assault charge.Another 58 charges, including those linked to the remaining vouchers, were considered during sentencing.His wife, Tanty Yohaida Samad, had earlier admitted to 15 counts of theft and was sentenced to 48 weeks' jail in April.The Budget 2020 grocery voucher scheme was rolled out last year to help less well-off Singaporeans with their household expenses amid the Covid-19 outbreak.Deputy Public Prosecutor Phoebe Tan said that as a result of the offences, the 72 vulnerable victims, who included senior citizens, were deprived of the vouchers. The couple have not made any restitution.They had used the vouchers to obtain items including multiple mobile phones, which they then sold for cash.Tanty was the mastermind and she had discussed her plans with her husband, who agreed to take part in the offences.On multiple occasions last October, the couple, who lived in Marsiling, went to letterboxes in the wee hours and looked for those with unsecured flaps.They then used a clothes hanger to fish out envelopes containing Budget 2020 grocery vouchers. Each envelope contained 15 $10 vouchers.On other occasions, Zulkeflei used a pair of pliers to break open letterboxes to obtain the vouchers while his wife acted as a lookout.Their offences came to light when the police received reports from at least 19 people about  missing vouchers.Separately, the court heard that Tanty had a personal protection order against Zulkeflei, which was issued on Feb 6 last year. Court documents do not reveal the reasons behind the order.On May 17 last year, she went to Zulkeflei's Marsiling flat with her son to collect some items as they had assumed her husband would not be home.The pair met Zulkeflei inside the unit and ran out when a dispute broke out.Zulkeflei chased the pair and repeatedly rained blows on his stepson. Tanty alerted the police when the attack ended.Her son went to Khoo Teck Puat Hospital where he was found with injuries including a bruised left cheek.Appearing in court via video link on Wednesday, Zulkeflei, who was unrepresented, said that he is remorseful.For each count of theft, an offender can be jailed for up to three years and fined.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/recalcitrant-offender-jailed-for-stealing-budget-2020-grocery-vouchers-with", "Source": "google"}