{"Type": "", "Time": "2021-06-16", "Headline": "Malaysian court to rule on challenge by French-Irish teen's family", "Text": "A Malaysian court will rule Wednesday on a challenge by the family of a French-Irish teenager over an inquest verdict that she died by misadventure after vanishing in the jungle.The body of Nora Quoirin, a 15-year-old with learning difficulties, was discovered after a huge hunt through the rainforest following her disappearance from a resort outside Kuala Lumpur in 2019.In January, a coroner handed down a ruling of misadventure, indicating her death during the family holiday was accidental rather than a crime, and said no one else was involved.But her London-based parents, who have dismissed authorities' claims their daughter wandered into the jungle alone at night, and believe she was abducted, said they were \"utterly disappointed\" by the verdict.They lodged a challenge and are seeking to have the ruling revised to an open verdict -- suggesting there are still questions to be answered about the case.Judge Azizul Azmi Adnan is expected to hand down his ruling at 5:00 pm (0900 GMT) at the High Court in Seremban, outside Kuala Lumpur, via video-link because of coronavirus curbs.Presenting the family's case at a hearing last week, lawyer Louise Azmi said an open verdict would be \"appropriate\".\"The last thing that (Nora) would do is to walk away from the security of her parents,\" she said.Malaysian police have stuck to their version of events -- that the teenager clambered out of a window of the family's holiday chalet and wandered off, and insist there was no sign of foul play.But her mother, Meabh, has said she believes someone could have placed her body in the spot where it was found, not far from the resort.The teenager disappeared a day after her family checked in to the Dusun Resort, triggering a 10-day hunt involving hundreds of rescuers, helicopters and sniffer dogs.An autopsy concluded she likely died of starvation and internal bleeding.The coroner said the teenager had been left disoriented by the long journey from Britain to Malaysia, likely leading her to wander off, and that there was no sign she was murdered or sexually assaulted.The teen had a condition known as holoprosencephaly, where the brain fails to develop normally. She had limited verbal communication and could only write a few words.bur-sr/hgFor Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.If you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Malaysian durians have topped fruit and vegetable presales at a big Chinese retail festival, showing the pulling power of the pungent delicacy.A Malaysian court Wednesday overturned an inquest verdict of \"misadventure\" in the death of a French-Irish schoolgirl who vanished in the jungle, replacing it with an \"open\" ruling in a victory for her family.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neThe US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.EVOS Savage Girl started the finals strong by defeating DR Hellcats in the opener. However, the Filipina squad bounced back in the next game to force the series to a decider.With Afghan troops in retreat and soon to lose vital American air support, Taliban commanders are voicing exuberance about quickly seizing full control of the country and re-establishing their version of an Islamic state.US carrier Southwest Airlines was ramping operations back up Tuesday after canceling some 500 flights following a second major outage in 24 hours due to computer issues.Chinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiThe European Union and United States launched a trade and technology council that seeks to “write the rules of the road” on the global economy, in the face of growing competition from China. It was the latest salvo against Beijing on US President Joe Biden’s whistle-stop European tour, which had seen him succeed in rallying support among the G7, Nato and now EU for a much-vaunted transatlantic coalition to face down China’s rising influence. A joint EU-US statement said the council would focus oEuropean and US stock markets marked time on Wednesday as investors brace for fresh signals from the US Federal Reserve on its stimulus policy.A minimalist can get away with less The post How Much Does It Cost To Furnish Your HDB Flat? appeared first on DollarsAndSense.sg.The freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.Royal Caribbean is pushing back the maiden voyage of a new ship by a month after eight crew members tested positive for Covid-19, the company's chief executive said.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aSmall is beautiful again in Hong Kong’s initial public offerings (IPOs) as retail investors reaped a windfall from some eye-catching market returns in the absence of blockbuster tech listings. Angelalign Technology is extending that stellar run. Shares of the Chinese maker of clear orthodontic braces soared in its trading bow on Wednesday, more than doubling the money for retail investors who turned its HK$2.91 billion (US$374 million) offering into the city’s best market debutant so far this qu", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/malaysian-court-rule-challenge-french-022814050.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}