{"Type": "", "Time": "2021-06-16", "Headline": "More Singapore residents identifying as having no religion", "Text": "SINGAPORE — While Singapore continues to be religiously diverse, more residents are identifying as having no religion, said the Department of Statistics (DOS) in a report released on Wednesday (16 June).Among Singapore citizens and permanent residents aged 15 and above in 2020, those with no religious affiliation made up 20 per cent, an increase from 17 per cent in 2010, said the DOS in the first statistical publication on its Census 2020 findings. Within the ethnic groups, 25.7 per cent of Chinese identified as having no religion, while 0.4 per cent of Malays and 2.2 per cent of Indians said the same in 2020. Meanwhile, 14.6 per cent of those from other ethnic groups said they had no religion.Among those who identified as having a religion, Buddhists were the largest group at 31.1 per cent, followed by Christians at 18.9 per cent and Muslims at 15.6 per cent. Taoists comprised 8.8 per cent, while Hindus made up 5 per cent, with those prescribing to other religions accounting for 0.6 per cent.The proportion of Muslims and Christians also grew between 2010 and 2020 while the proportion of Buddhist and Taoists dipped. Among the Chinese, 40.4 per cent identified as Buddhists, while 21.6 per cent were Christian, 11.6 per cent Taoist and 0.5 per cent Muslim. Among the Malays, 98.8 per cent identified as Muslim, while 0.1 per cent said they were Buddhists and 0.4 per cent had no religion.For Indians, 57.3 per cent identified as Hindu, while 23.4 per cent were Muslim, 12.6 per cent were Christian and 0.7 per cent were Buddhist. Another 3.9 per cent of Indians identified with some other religion and 2.2 per cent said they had no religion.The DOS report is aimed at providing broad trends and changes relating to the demographic characteristics, marriage and fertility, education, literacy, home language and religion of Singapore's resident population – referring to citizens and permanent residents – between 2010 and 2020. The census data was collated from 150,000 households.More findings from Census 2020 will be shared on Friday.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:Man who fled to Thailand to avoid drug charges cheated mask buyers in SingaporeAll 14 new COVID cases in Singapore in communityLandlord who kept exposing himself to female tenant jailed and finedDickson Yeo, S'porean who spied for China, to remain behind bars'Not possible to have fair hearing': Woman without mask at MBSBeijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neAlibaba Group was the victim of a months-long web-scraping operation by a marketing consultant that siphoned up sensitive data including usernames and phone numbers.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.It's useful to be ready with the names of a few companies you'll scoop up in case a crash occurs. The post 3 Stocks I Will Buy If the Market Crashes Tomorrow appeared first on The Smart Investor.A herd of elephants on a mammoth trek across China is taking an enforced break -- as they wait for a wayward youngster to catch-up.Getting the COVID-19 vaccine in Singapore is easy. According to the Ministry of Health (MOH), as of 17 May 2021, 3.4 million doses have been administered. Here's a guide on how to find a vaccination centre near you.Learn more about scalp psoriasis. Look for scalp psoriasis treatments.With Afghan troops in retreat and soon to lose vital American air support, Taliban commanders are voicing exuberance about quickly seizing full control of the country and re-establishing their version of an Islamic state.Japan has requested consolations with China at the World Trade Organization (WTO) over anti-dumping duties that have been placed on its stainless steel products since July 2019, the Geneva-based body confirmed on Tuesday. The request, which was circulated to WTO members on Tuesday after having been submitted on Friday, claims the measures imposed on steel billets, hot-rolled coils and hot-rolled plates appear to be inconsistent with various provisions under the General Agreement on Tariffs and T* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.Celebrated surgeon and author of the New York Times best seller \"The Plant Paradox\" reveals what many have suspected for a long time, and even worse.The Russian skipper of a container ship that caught fire and burned for almost two weeks before sinking off Sri Lanka's coast has been arrested and is expected to be charged with marine pollution, police said Monday.Cristiano Ronaldo netted a double to become the European Championship's all-time leading scorer as Portugal struck three times late on to beat a stubborn Hungary 3-0 in their Euro 2020 opener at a packed Puskas Arena on Tuesday.Turkish President Recep Tayyip Erdogan on Tuesday pledged support for Azerbaijan if the ex-Soviet country was attacked, as he made a visit to the disputed Nagorno-Karabakh region.This new car cloth can easily remove all the car scratches and dents from your car.Two experienced astronauts are among the first three-man crew for China’s first space station, with final preparations under way for their mission launch on Thursday. The Long March 2F rocket carrying them to the Tianhe module – the first part of the Tiangong space station – is expected to lift off at around 9.22am from the Jiuquan satellite launch centre in the Gobi Desert. Propellant refuelling for the rocket was under way on Wednesday morning, according to the China Manned Space Engineering OThe largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Sick of seeing others get rich in the stock market? Have you heard of Everlasting Stocks?Kevin Durant finished with 49 points while playing every minute of the game as the Brooklyn Nets rallied from a 17-point deficit to beat the Milwaukee Bucks 114-108 in game five of their NBA playoff series on Tuesday.If you’re wondering whether Ethereum is a good long term investment, keep reading.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aMore than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.A sinking fire-damaged container ship could take months to salvage because of rough monsoon seas, Sri Lanka said Tuesday, as authorities investigated whether the deaths of dozens of turtles and dolphins were caused by the disaster.EVOS Savage Girl started the finals strong by defeating DR Hellcats in the opener. However, the Filipina squad bounced back in the next game to force the series to a decider.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/more-singapore-residents-no-religion-census-064808058.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}