{"Type": "", "Time": "2021-06-16", "Headline": "Myopia rising among kids in S'pore as screen time goes up during the pandemic, Life News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Samantha (not her real name) did not have to change her glasses for two years. But with increased screen time during the pandemic, her myopia shot up from 300 to 400 degrees for both eyes in December last year.The 11-year-old was spending as many as 10 hours a day looking at screens, be it for online lessons or digital entertainment.Her parents were so busy working at home that they left her to her own devices, ophthalmologist Claudine Pang, founder and medical director of Asia Retina Eye Surgery Centre, tells The Straits Times.A year since the end of the circuit breaker, eye-care professionals here are seeing more kids who are starting to have myopia, or whose condition has worsened.Mr Ken Tong, Eyesight.Sg vision-care clinic's founder and chief executive officer, has observed a 30 to 40 per cent increase in children visiting his outlets in Potong Pasir and Tampines after the circuit breaker.Besides seeing more first-time spectacle wearers aged five and six, he notes that some of the myopic children needed to change their lenses in six months instead of the usual one year.Optometrist Jaycob Chin, branch manager at Videre Eyecare at Forum The Shopping Mall, has also noticed a rise in myopia among children since Covid-19.One contributing factor is greater screen time. \"The number of hours spent on digital devices has increased dramatically with the implementation of home-based learning,\" he says. \"Most children will soon receive their personal learning devices and we could see a spike in myopic cases in the near future.\"It is a trend found elsewhere too.A study of 123,535 children in China found that the prevalence of myopia in kids aged six to eight increased last year over the previous five years, following school closures due to the pandemic. The study was published in Jama Ophthalmology journal in January.Also known as shortsightedness or near-sightedness, myopia is a vision disorder where distant objects appear blurry.In Singapore, 80 per cent of 18-year-olds are myopic, says Associate Professor Audrey Chia, head of the paediatric ophthalmology and adult strabismus department at Singapore National Eye Centre (SNEC).Myopia can affect pre-schoolers, with 7 per cent of five-year-olds in Singapore having to wear glasses. This figure increases to 10 to 20 per cent in Primary 1 and 2 pupils; 30 to 40 per cent in Primary 3 and 4 pupils; and 60 per cent in Primary 6 pupils.Most young children do not have a concept of what blurred vision is, or that it is possible for their eyesight to be better, says Mr Chin.As such, their myopia may be diagnosed and treated only at a later age. This puts them at greater risk of developing higher degrees of myopia when they are older.Parents should look out for signs of myopia in their kids. These include holding a book very close to the eyes, moving closer to see an object, tilting the head or squinting the eyes.While parents should take their kids for regular eye checks, preferably once every six months, some are postponing such appointments during the pandemic, notes senior optometrist Chew Wai Kwong from Videre Eyecare at Centrepoint. The store has seen more myopic kids since the circuit breaker as well.Parents whose children are under eight years can consider taking them to a paediatric eye clinic for assessment and their spectacle prescription, says Prof Chia, who is also the co-clinical director of SNEC's Myopia Centre. Cycloplegic eye drops are often used in young children to obtain accurate prescriptions for their lenses.Ms Kathy Park, president of Essilor ophthalmics company for Asean and South Korea, says: \"The younger a child becomes myopic, the faster it will progress, and the higher the prescription may eventually become.\" Myopia often stabilises only at 18 or later, she adds.Dr Pang says it is important to slow down the progression of myopia as those with spectacle power above 500 degrees face a higher risk of developing sight-threatening complications later in life like cataract, glaucoma, retinal detachment.While kids spending more time indoors during the pandemic has likely contributed to their worsening eye sight, Prof Chia says this is a problem even before Covid-19.\"Even before and after the circuit breaker, children in Singapore are not really going out to play. This led to so many of them getting myopia in the first place.\"Dr Pang says that, ultimately, children should take the responsibility of caring for their eyes.In the case of her young patient Samantha, she went through and reinforced good eye-care habits with her. For instance, the computer or digital device screen should be placed at least one arm's length away from the eyes. Or take frequent visual breaks with the use of an alarm.\"Myopia control and education for the child is just as important as for the parents,\" says Dr Pang.While one may think myopia is no big deal as one can turn to Lasik or other refractive procedures, Ms Kathy Park, president of Essilor ophthalmics company for Asean and South Korea, says this is a misconception.\"Refractive surgery can correct myopia only by changing the front parts of the eyes, hence your eyes are still longer than normal. Your risks of myopia complications are the same as somebody with your degrees who has not gone through the surgery.\"Even though myopia cannot be reversed, there are many treatment options to prevent it from worsening. Here are some common ones.These are said to help ease eye fatigue caused by the blue light emitted by electronic devices.If your children are getting low to moderate exposure to digital devices, ophthalmologist Claudine Pang, founder and medical director of Asia Retina Eye Surgery Centre, recommends using blue light filtering modes or screen protectors on the device directly instead of in spectacle lenses.Kids need an adequate amount of blue light from sunlight for growth and to regulate their mood and body clock.\"Early studies have shown a deficiency in blue light exposure from the sun could contribute to the increase in myopia,\" she says.As the long-term effects of using blue light-blocking lenses on children's development are not well-known, she does not encourage using them.Ophthalmic lens companies, including Essilor, have launched lenses that are said to not just correct, but also to help control myopia progression.Based on a clinical trial which started in 2018, Ms Park says Essilor's Stellest lenses help slow myopia progression by 67 per cent on average when worn at least 12 hours a day. The trial is still ongoing.Professor Audrey Chia, head of the paediatric ophthalmology and adult strabismus department at Singapore National Eye Centre, says early reports about myopia control lenses are promising and they may work better in kids aged nine and above.Younger children and those with high myopia or astigmatic degrees were not part of the study, which looked at kids aged eight to 13.Prof Chia says parents can consider these lenses if their kids have progressive myopia, which means an increase of more than 50 to 100 degrees in their spectacle power a year.An established treatment option for myopia, atropine can be used alone or in combination with optical devices such as glasses or contact lenses, says Prof Chia.Dr Pang says the eye drops, which have been in the market for about 20 years, is suitable for children with progressive myopia. They come in different dosages and concentrations and need to be prescribed by an eye doctor.\"Normally, we monitor a child's myopia degree closely and start the eye drops when we notice a rapid increase in myopia,\" says Dr Pang.\"Parents who are more proactive may choose to start the eye drops at the first sign of myopia so that they may commence myopia control as early as they can.\"It is found to be effective in reducing myopia progression by 50 to 70 per cent. Some users may complain of glare from bright light, but this can be overcome by using transition lenses.As with all treatments, every child responds differently.\"It is important that parents know this to avoid disappointment, and also to know that good eye habits are important, even on treatment,\" says Prof Chia.\"For every 20 minutes spent using a screen, children should look away at an object that is at least 20 feet (6m) away for at least 20 seconds,\" says Ms Kathy Park, president of Essilor ophthalmics company for Asean and South Korea.Videre Eyecare's optometrist Jaycob Chin says kids should not be using smartphones when they are taking a break from their study on a laptop. This does not give their eyes the rest that they need.Children should play outdoors for at least two hours a day, says Ms Park.When they play outdoors, they are exposed to natural sunlight and can focus their eyes at further distances, which helps to relax the eye muscles.Ophthalmologist Claudine Pang, founder and medical director of Asia Retina Eye Surgery Centre, says it is important for kids to have sufficient sleep to prevent eye strain. Get them to turn in early before the urge to rub their eyes sets in.Schedule eye checks every six months to monitor if your child's eyesight has deteriorated. Try to stick to the appointments so that your child's myopia can be managed better.Experts suggest setting limits to screen time outside of online lessons.As a guide, the American Academy of Pediatrics advocates no screen time for kids under two years old; an hour a day for those aged between two and five; and consistent limits on screen time for those over six.The spectacle frames are just as important as the lenses.When the lenses are not fitted on the face correctly, their focus areas do not correspond to the child's line of sight. As such, the spectacles do not treat the myopia adequately and may exacerbate its progression, says Dr Pang.Keeping in mind a child's active lifestyle, Ms Park says the ideal frame should be light, flexible and preferably with adjustable nose pads.Its material should also be resistant to sweat and corrosion. Get the ST Smart Parenting newsletter for expert advice. Visit the microsite for more.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/life/myopia-rising-among-kids-here-as-screen-time-goes-up-during-the-pandemic", "Source": "google"}