{"Type": "", "Time": "2021-06-16", "Headline": "Fire breaks out in Outram Park shophouse; segments of ceiling fell onto two firefighters - The Online Citizen Asia", "Text": "Source: Kenny Tay & SCDF / FacebookAbout 20 people were evacuated after a fire broke out in a shophouse at Outram Park on Tuesday morning (15 Jun).In a Facebook post earlier today, the Singapore Civil Defence Force (SCDF) said that it was alerted to the blaze at No. 31 Teo Hong Road at about 11.15am.“Upon SCDF’s arrival, thick smoke was emitting from a shophouse. SCDF firefighters equipped with breathing apparatus sets proceeded into the smoke-logged shophouse,” it wrote.The fire at the ceiling on the third floor and the attic of the shophouse was extinguished using three water jets at around 1.15pm. A Combined Platform Ladder was also deployed to conduct aerial firefighting.SCDF went on to say that during the firefighting operations on the third floor, segments of the ceiling fell onto two firefighters.It stated that the firefighters, who were in full personal protective equipment (PPE) including helmets, were immediately evacuated and assessed by a paramedic.One of the firefighters was conscious when taken to Singapore General Hospital, while the other firefighter was treated at the site for minor scratches.Another firefighter, a full-time National Serviceman (NSF), experienced heat exhaustion and was conveyed to Singapore General Hospital.“Occupants from the shophouse had self-evacuated prior to SCDF’s arrival. About 20 other occupants from the neighbouring units were evacuated by SCDF as a precautionary measure,” said SCDF.Damping down operations are ongoing, and the cause of the fire is under investigation. © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/15/fire-breaks-out-in-outram-park-shophouse-segments-of-ceiling-fell-onto-two-firefighters/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}