{"Type": "", "Time": "2021-06-16", "Headline": "Man arrested after allegedly stabbing victim with scissors that he snatched from Hougang wake", "Text": "Submitted by Stomper RandyThis story was submitted via Stomp App contribution.This story was submitted via Stomp App contribution.A 28-year-old man was arrested over a fight in Hougang that left another man injured.In response to a Stomp query, the police said they were alerted to a case of voluntarily causing hurt by dangerous weapon at Block 702 Hougang Avenue 2 on June 9, at 12.16am.\"A 30-year-old man was conscious when taken to hospital,\" they added.\"A 28-year-old man was arrested in relation to the case.\"Stomper Randy shared photos of the incident that were posted on Facebook.According to Shin Min Daily News, the altercation occurred at a carpark, near a void deck where a funeral wake was taking place.Residents reported hearing the two men, who are acquainted, in a loud argument.The suspect had allegedly rushed into the void deck and asked the mourning family if he could 'borrow' a pair of scissors that was on a table.Despite their refusal, the suspect took the scissors and went back to the carpark, where the stabbing took place. Police were then called.A resident in the vicinity, Ms Li, said that the assailant continued to rain blows on his victim, who had fallen to the ground.The suspect was seen picking up a bamboo pole and waving it in the middle of the road before he fled, reported Shin Min.He was subsequently arrested after the police traced his whereabouts.Police investigations are ongoing.Get more of Stomp's latest updates by following us on Facebook, WhatsApp, Twitter, Instagram and YouTube.View the discussion thread.View the discussion thread.Download the new STOMP app today.SPH Digital News | The Straits TimesAll rights reserved | Terms & Conditions | Data Protection Policy | Advertise with usSPH Digital News / STOMP / Copyright (c) 2019 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E.", "Section": "", "Writers": "", "URL": "https://stomp.straitstimes.com/singapore-seen/man-arrested-after-allegedly-stabbing-victim-with-scissors-that-he-snatched-from", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}