{"Type": "", "Time": "2021-06-16", "Headline": "Malaysian court overturn Nora Quoirin 'misadventure' jungle death inquest decision as open verdict declared", "Text": "News Corp is a network of leading companies in the worlds of diversified media, news, education, and information services.A MALAYSIAN court has overturned a ruling by the coroner in the inquest into the death of Irish teenager Noirin Quoirin and declared an open verdict.The body the 15-year-old, who had learning difficulties, was discovered after a huge hunt through the rainforest following her disappearance from a resort outside Kuala Lumpur in 2019.In January, a coroner handed down a ruling of misadventure, indicating her death during the family holiday was accidental rather than a crime, and said no one else was involved.But her London-based parents, who have dismissed authorities' claims their daughter wandered into the jungle alone at night, and believe she was abducted, said they were \"utterly disappointed\" by the verdict.They lodged a challenge and sought to have the ruling revised to an open verdict -- suggesting there are still questions to be answered about the case.Judge Azizul Azmi Adnan this morning handed down his ruling at 9am Irish time at the High Court in Seremban, outside Kuala Lumpur, via video-link because of coronavirus curbs.He said it is unlikely that Nora left their residence at the Dusun resort by herself, navigated the challenging terrain and evaded detection for six days during an extensive search and rescue operation.Presenting the family's case at a hearing last week, lawyer Louise Azmi said an open verdict would be \"appropriate\".She said: \"The last thing that (Nora) would do is to walk away from the security of her parents.\"Malaysian police have stuck to their version of events -- that the teenager clambered out of a window of the family's holiday chalet and wandered off, and insist there was no sign of foul play.But her mother, Meabh, has said she believes someone could have placed her body in the spot where it was found, not far from the resort.The teenager disappeared a day after her family checked in to the Dusun Resort, triggering a 10-day hunt involving hundreds of rescuers, helicopters and sniffer dogs.An autopsy concluded she likely died of starvation and internal bleeding.The coroner said the teenager had been left disoriented by the long journey from Britain to Malaysia, likely leading her to wander off, and that there was no sign she was murdered or sexually assaulted.The teen had a condition known as holoprosencephaly, where the brain fails to develop normally. She had limited verbal communication and could only write a few words. Cyclist, 22, left for dead after being hit by car has 'life changing' injuries Co Down diplomat's shock as same-sex wed ceremony seen by 20 MILLION people Keane mocked by pundits over 'captain's armband' jumper worn for France win Woman whose late ­husband built home with mica bricks says he'd be devastated©News Group Newspapers Limited in England No. 679215 Registered office: 1 London Bridge Street, London, SE1 9GF. \"The Sun\", \"Sun\", \"Sun Online\" are registered trademarks or trade names of News Group Newspapers Limited. This service is provided on News Group Newspapers' Limited's Standard Terms and Conditions in accordance with our Privacy & Cookie Policy. To inquire about a licence to reproduce material, visit our Syndication site. View our online Press Pack. For other inquiries Contact Us. To see all content on The Sun, please use the Site Map. The Sun website is regulated by the Independent Press Standards Organisation (IPSO)", "Section": "", "Writers": "", "URL": "https://www.thesun.ie/news/7148828/nora-quoirin-family-court-jungle-death-malaysia/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}