{"Type": "", "Time": "2021-06-16", "Headline": "Opinion | Israel’s Coalition of Patriotic Traitors - The New York Times", "Text": "AdvertisementSupported byBret stephensBy Bret StephensOpinion ColumnistIsrael’s new government must be a puzzle for anyone who thinks of the Jewish state as a racist, fascistic, apartheid enterprise.Issawi Frej is Arab and Muslim and used to work for the Peace Now movement. Now he’s Israel’s minister for regional cooperation. Pnina Tamano-Shata is Black: The Mossad rescued her, along with thousands of other Ethiopian Jews, from hunger and persecution when she was a small child. She’s the minister for immigration and absorption. Nitzan Horowitz is the first openly gay man to lead an Israeli political party. He’s the health minister. At least one deputy minister, as yet unnamed, is expected to be a member of the Raam party, which is an outgrowth of the major Islamist political group in Israel.As for Benjamin Netanyahu, “King Bibi” has finally left office — churlishly, bitterly, pompously — but in keeping with the normal democratic process. He faces criminal indictments in multiple cases. His immediate predecessor as prime minister, Ehud Olmert, spent 16 months in prison on corruption charges.It’s some fascist state that subjects its leaders to the rule of law and the verdicts of a court. Meanwhile, Mahmoud Abbas, president of the Palestinian Authority, “postponed” elections in April. He’s in the 17th year of his elected four-year term of office.A new government, even one as fragile and fractious as Israel’s, is always an opportunity for a course correction. But the course correction Israel most needs is not the one its critics generally suppose.Netanyahu lasted in office as long as he did not because Israelis wanted a strongman or someone who would crush the Palestinians. He lasted because he was, in many ways, good at the job.Over his 12 continuous years in office, the Israeli economy roughly doubled in size. Last year’s Abraham Accords brought the overarching Arab-Israeli conflict to a near conclusion, even if the Israeli-Palestinian conflict remains unsolved. Despite periodic battles with Hamas, there were no all-out wars. Israelis were more secure in their persons during the Netanyahu years than they had been in the decade prior. And Israel’s Covid-19 vaccination campaign was the envy of the world.Against Iran, Israel conducted arguably the most successful covert-ops campaign in modern history. With respect to Palestinians, Netanyahu avoided both the territorial concessions demanded by the left and the re-occupation of Gaza desired by the extreme right. Toward the United States, Netanyahu defied Barack Obama and got what he wanted from Donald Trump: the American Embassy in Jerusalem, recognition of Israeli sovereignty in the Golan Heights, and U.S. withdrawal from the 2015 Iran nuclear deal.None of this may square with the wishes of Western elites or progressives, whose obsession is for a Palestinian state. But what Israelis wanted in the last election wasn’t a Palestinian state, which is a good idea in theory but (for now) a terrible idea in practice.What Israelis want is a better form of politics, the one area in which Netanyahu conspicuously failed. It’s a politics freed of his habits of demagogy, vilification, sleaziness and sheer pettiness — a politics that ultimately brought him down.That’s the promise of the new government. It’s led by Naftali Bennett, a right-winger and former director of the settlers’ council who is the first religiously observant Orthodox Jew to be prime minister. It’s anchored by Yair Lapid, a centrist and former TV journalist who epitomizes secular Israel. It got into power thanks to the support of the Raam party’s Mansour Abbas, a religiously conservative Muslim who has implicitly given a stamp of endorsement to a government whose policies — especially toward Palestinians — he surely opposes. It includes members who are to the right of Likud and to the left of Labor.It’s difficult to think of any coalition government, in any country, that is as ideologically diverse. It’s also easy to suppose that nothing holds it together beyond shared loathing of Netanyahu, who remains leader of the opposition. It wouldn’t take much to bring the new government down and return him to power.But there is also an opportunity in the new government, and it holds lessons for other Western democracies gripped by partisanship and paralysis. Nearly all members of the new coalition had to sacrifice a point of political or moral principle, break ranks with some of their own constituents and get branded as traitors to their respective movements in order to make this coalition possible. They are ideological turncoats, at least to those who think of ideological purity as a virtue.Being willing to abandon a ferocious conviction for the sake of a pragmatic compromise used to be considered a virtue in democracy. Ideological treason can also be a form of civic patriotism. In what’s supposed to be one of the free world’s most factionalized, tribalized, internally divided countries — Jews, Arabs, secular, national-religious, ultra-Orthodox, Mizrahi, Russian, Druze and so on — an Israeli government is giving civic nationalism a go.It may or may not work. But like so much else in Israel, it deserves more respect than it is likely to get.The Times is committed to publishing a diversity of letters to the editor. We’d like to hear what you think about this or any of our articles. Here are some tips. And here’s our email: letters@nytimes.com.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement", "Section": "", "Writers": "", "URL": "https://www.nytimes.com/2021/06/14/opinion/israel-government-coalition.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}