{"Type": "", "Time": "2021-06-16", "Headline": "Eastern Pacific joins ammonia bunker study - Splash247", "Text": "Eastern Pacific Shipping (EPS) has joined a study with Nanyang Technological University, Singapore (NTU Singapore) to explore the use of ammonia as an alternative marine fuel.The study will examine the development of the ammonia supply chain as well as the development of bunkering protocols. It is hoped that the results will aid the maritime industry as it transitions to lower carbon fuels.As a bunkering fuel, ammonia has a range of technical challenges. For the new study, EPS will be lending its expertise in the loading, transporting, and discharging of gas cargoes, including ammonia.EPS currently manages one of maritime’s largest independent gas carrier fleets with ten mid- to large-size gas carriers. The company has another twelve mid-, large-, and very large gas carrier newbuilds set to be delivered between 2022 and 2023.Cyril Ducau, CEO of EPS, said: “As a leading tonnage provider, EPS has a responsibility to use whatever means necessary to lower our emissions today. Simultaneously we are committed to sharing our findings, best practices, and technical expertise to develop better solutions for tomorrow. Our participation in the study with NTU Singapore supports our holistic strategy of testing a full spectrum of alternative marine fuels, including ammonia. We look forward to the results and sharing them with the industry.”EPS recently announced that it was entering a partnership that will fund a Maritime Decarbonisation Centre in Singapore. The company also signed a memorandum of understanding with OCI and MAN Energy Solutions to develop methanol and ammonia as marine fuels.Your email address will not be published. Required fields are marked *CommentName * Email * Website   Subscribe now for free daily news updates.Does Home Depot need to lease containers to fill the ship?...I think you maybe missed my point!...We have seen this response when ships in trouble have tried...Manning levels? Could we see the seafarers who are supposed...Agreed. Article was very disappointing and brings to light h...What percentage of newbuilds contracted in the 2020s will be dual fuelledTotal Voters: 9RT @Splashrenewable: TotalEnergies joins consortium to bid for Scottish offshore wind https://t.co/bbjUctQKP3 #offshorewind https://t.co/HX…RT @Splash_247: Equinor extends Wood offshore support contract https://t.co/Jfp5WGvQFw https://t.co/E4sX7M7WOKRT @Splash_247: JP Morgan Global Maritime exits kamsarmax sector https://t.co/hRVWPrx2gH https://t.co/TSgsYEzOJKRT @LTDManagement: Japanese yards offer last available slots as China builds up its naval might - Splash247 https://t.co/eW8RkL204hRT @LTDManagement: MSC’s secondhand splurge over the past 10 months hits record 60 ships - Splash247 https://t.co/NeiViHUzBjDon't have an account?", "Section": "", "Writers": "", "URL": "https://splash247.com/eastern-pacific-joins-ammonia-bunker-study/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}