{"Type": "", "Time": "2021-06-16", "Headline": "Family left in shock by shooting of young Palestinian woman - The Washington Post", "Text": "JERUSALEM — Mai Afaneh appeared to have a happy family life and a fulfilling career. So when she left her West Bank home early on Wednesday, no one thought anything was wrong.But a short while later, her family received the devastating news that she had been shot and killed by Israeli troops, allegedly after carrying out an attempted car-ramming attack.In just a few short moments, she became another statistic — the latest in a list of Palestinians killed by the Israeli military under unclear circumstances.The cases play out in a similar pattern. The army reports an attempted attack by a Palestinian assailant, usually acting alone and unaffiliated with any militant group. Then, it says troops “neutralized” the attacker.Some 20 Israelis have been killed in shootings, stabbings and car-ramming attacks since 2018, according to Israel’s Foreign Ministry. Many others have been badly hurt.But not all cases are clear. In cases without Israeli casualties, sometimes there is video evidence to support the account. Other times, there isn’t.Human rights groups say many of the attackers could have been stopped without killing them, and in some cases, have suggested innocent people were killed.Military investigations are sometimes launched but rarely provide clarity and almost never find wrongdoing on the part of troops. Families, meanwhile, are left wondering what really happened to their loved ones.Afaneh, who was 28, left an inconclusive trail of clues behind her. She had suffered some health problems. There were some distraught Facebook posts about Palestinians killed by Israel. But relatives said she had no reason or ability to carry out an attack.She had earned her doctorate in psychology in Jordan, was happily teaching at a local university and had a good family life with her husband and 5-year-old daughter, relatives said.“She was not politically affiliated. All she cared about was her studies and helping her family and husband,” said her father, Khaled Afaneh.He said the previous night she was laughing and talkative before dropping off her daughter to spend the night with the grandparents. He said she needed colon surgery, had just gotten out of the hospital and was very weak.“Even if she really wanted to attack, they could easily stop her. There was no justification to kill her,” he said, speaking at the family’s home in Abu Dis, a town on the eastern outskirts of Jerusalem.According to the military, Afaneh drove her car toward a group of soldiers who were guarding a construction site in Hizmeh, about a half-hour drive from her home, then got out of the vehicle brandishing a knife before she was shot.The military said one soldier was lightly injured jumping out of the way of the car. It said there were no security cameras at the scene so it couldn’t provide footage of the incident.“I believe she lost control over the car. Maybe she entered the wrong way,” said her uncle, Usama Afaneh. “I don’t believe she intended to do anything. It’s not her nature.”The uncle said she had told her husband that morning that she was going out to pick up some breakfast. He had no idea how she ended up so far away from the house but speculated she was on her way to the city of Ramallah, where she sometimes did work for her university.Despite her upbeat demeanor, some of Afaneh’s posts on social media were troubling.On May 15, at the height of Israel’s war against Hamas militants in the Gaza Strip last month, she posted a photo of what appears to be a dead Palestinian child.“We will stay here, either martyrdom or victory,” she wrote. A smaller photo showed her with a Palestinian flag painted on her face. On Instagram, she wrote: “There is no more life left to live.”The following day, under the same photo of the child, she wrote on Facebook: “My little one, your tears are cleaner than Zamzam water,” referring to a spring in Saudi Arabia that is revered by Muslims. “We will give birth to children even if we know that they will be martyrs in the future.”Her father played down the posts, saying they were written at the height of a bloody war and reflected the general mood of Palestinians at the time. He said he remained in shock as he searched for answers.“I didn’t expect this to happen. Actually I don’t know what happened. Nobody has seen what happened,” he said.The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/world/family-left-in-shock-by-shooting-of-young-palestinian-woman/2021/06/16/f3e35dec-ced1-11eb-a224-bd59bd22197c_story.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}