{"Type": "", "Time": "2021-06-16", "Headline": "Scammers targeting people in S'pore weave Covid-19 vaccines, MOH into their false narratives, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Scammers have continued to target people in Singapore during the pandemic and are now weaving vaccines and vaccination drives into their false narratives.Recent scams have adapted their plots from that of pretending to be a Chinese official to now purportedly being an official from the Ministry of Health (MOH).This is an extension of vaccine-related scams that the ministry had warned about earlier this year.MOH had said it was aware of websites, e-mails, SMS text messages and phone calls falsely claiming to offer registration for vaccination.In an instance of the latest type of scams, a person reported receiving a robocall claiming to be from MOH to scamalert.sg, the anti-scam site operated by the National Crime Prevention Council.According to the report dated May 19, the call claimed MOH had been trying to contact the person to get a vaccine jab, and instructed the person to press \"9\" to get in touch with the authorities.The automated message was in both English and Mandarin.The person who reported the call, however, had already received both doses of the vaccine, and urged others not to fall for the scam.Ms Carolyn Misir, a principal psychologist at the Police Psychological Services Department, said scammers use several persuasion techniques that lead victims deeper into the scam's narrative.\"The process of the scam and persuasion techniques used are quite similar to the China officials impersonation scam, with some variation to include the Covid-19 vaccine,\" she said.\"Victims may be given a case reference number and the actual medical term of an antiviral medicine such as Remdesivir, so that the victim believes the legitimacy and authority of the caller.\"She said the victim may be directed to as many as four callers, who provide social proof, pretend to offer help, and create anxiety and fear, all so victims give up their personal details.Some may also be asked to meet a \"staff member\" who will then pass them \"official documents\".This induces victims to part with their money and become more convinced of the scam, said Ms Misir.The Straits Times understands that while vaccine-related scams are known to the police, there have been few victims who have lost money to such ruses.However, Mr Tom Kellermann, the head of cyber security strategy at software company VMware, warned that the public should still be wary, as those behind such ploys may be after personal information which is then sold online.\"The vaccine has only put a larger target on the healthcare industry's back,\" he said.\"In Singapore specifically, the accelerated vaccine roll-out has led to cyber criminals attempting to steal data and private information.\"He added that scams involving the healthcare industry and vaccines can have serious consequences, such as the hampering of the mass vaccination process and loss of confidence in the healthcare system.\"Taking the proper precautions is not only in your own interest, but also in the interest of those around you,\" he said.\"The best defence is to always be careful of what you click. If something looks suspicious, it probably is.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/scammers-weave-covid-19-vaccines-moh-into-their-false-narratives", "Source": "google"}