{"Type": "", "Time": "2021-06-16", "Headline": "Telok Blangah Drive Food Centre closed for disinfection after hawker gets Covid-19, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A hawker centre at Block 79 Telok Blangah Drive will be closed for deep cleaning after a hawker there tested positive for Covid-19.The Ministry of Health (MOH) had said on Monday (June 14) that a 42-year-old Singaporean man who is a hawker at the centre had developed body aches on June 12 and a fever on June 13.He sought treatment at Singapore General Hospital and later tested positive for the coronavirus.He is a family member of another Covid-19 case, a cooking assistant at 115 Bukit Merah View Market & Food Centre who tested positive on June 13.As at Monday, there were 16 cases linked to the Bukit Merah centre, which is now a Covid-19 cluster.The closure of the Telok Blangah Drive Food Centre for deep cleaning and disinfection as a result of Monday's case was announced in a Facebook post by West Coast GRC MP Rachel Ong on Tuesday night.She said the National Environment Agency has been working together with the Telok Blangah Shopkeepers & Stallholders Association to engage stallholders and assist them with their concerns and enquiries.The town council has also put up notices at the food centre and neighbouring blocks to inform residents about the situation.She added: \"The safety of our residents and stallholders are our topmost priority and we will continue to work to ensure that the necessary precautions are in place... We encourage all residents and friends to monitor your health closely and to see a doctor promptly if you feel unwell.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/telok-blangah-drive-food-centre-closed-for-disinfection-after-hawker-gets-covid-19", "Source": "google"}