{"Type": "", "Time": "2021-06-16", "Headline": "NTU Singapore’s new mini robots can swim like jellyfish and build micro-devices", "Text": "\nby Sam Cox\n\n3 hours ago47 Views From left: Lum Guo Zhan, Yang Zilin and Xu Changyu. Image: NTU SingaporeTiny robots with advanced dexterity and manoeuvrability could have applications in drug delivery and the construction of micro-structures.Scientists at Nanyang Technological University, Singapore have developed tiny robots that can perform precision movements when controlled using magnetic fields.Focused on optimising the millimetre-sized robots’ movement in three-dimensional space, the researchers increased the precision of available control capability along the three spatial axes as well as rotating between them (commonly known as roll, pitch and yaw).Of these six degrees of freedom, the new NTU Singapore miniature robots are capable of rotating 43 times faster than previous generations in the critical sixth degree of freedom.Using a control computer, scientists can precisely vary the strength and direction of magnetic fields generated by an electromagnetic coil system. By embedding magnetic microparticles into their miniature robots, NTU Singapore researchers could control them through the application of these magnetic fields.These robots are often no bigger than a grain of rice and may be made from ‘soft’ materials such as biocompatible polymers. These materials are non-toxic to humans and are well-suited to integration with the magnetic components.The researchers highlighted the possible applications of this technology through showcasing a jellyfish-inspired robot capable of swimming in water and squeezing past a tight barrier. In doing so, they argued the possibility of putting these robots to work in hard-to-reach places, such as surgical procedures in the brain, or drug delivery elsewhere in the body.Another ‘gripper robot’ assembled a three-dimensional structure in less than five minutes – 20 times faster than previous generations of mini robots. This was intended to demonstrate a potential application in manufacturing and the establishment of ‘micro-factories’.The research was published in the journal Advanced Materials in May 2021 and featured as the front cover for its 10 June issue.Lum Guo Zhan, lead author of the study and assistant professor at the School of Mechanical and Aerospace Engineering in NTU Singapore, said the breakthrough came in discovering an “elusive” third and final principal vector of the applied magnetic fields, which is necessary for controlling such machines.“By fully understanding the physics of these miniature robots, we are now able to accurately control their motions,” said Lum.He claimed his team’s proposed fabrication method can magnetise mini robots to produce six-degrees-of-freedom torques magnitudes larger than existing devices.“Our findings are therefore pivotal, and they represent a significant advancement for small-scale robotic technologies,” Lum added.PhD students Xu Changyu and Yang Zilin, co-authors of the research, said, “Besides surgery, our robots may also be of value in biomedical applications such as assembling lab-on-chip devices that can be used for clinical diagnostics by integrating several laboratory processes on a single chip.”The research team now aims to make their robots even smaller, on the scale of a few hundred micrometres, and to ultimately make the robots fully autonomous.Related:\n                    Singapore,             medtech,             engineering,             materials science,             robotics,             research,             manufacturing \n                                                Sam Cox is a journalist at Silicon Republic covering sci-tech news                                            editorial@siliconrepublic.com\n31 Mar 2021476 Views \n2 Jun 2021334 Views \n23 Mar 2021362 Views \n5 days ago526 Views \n22 hours ago182 Views \n2 Jun 2021487 Views \n32 minutes ago \n41 minutes ago \n1 hour ago \n1 hour ago \n2 hours ago \n3 hours ago \n18 hours ago \n18 hours ago \n20 hours ago \n22 hours ago \n22 hours ago \n23 hours ago \n1 day ago \n1 day ago \n1 day ago \n1 day ago \n1 day ago \n1 day ago \n1 day ago \n1 day ago \n1 day ago \n1 day ago \n1 day ago \n1 day ago All content copyright 2002-2021 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.\n            Designed by Zero-G and Square1.io ", "Section": "", "Writers": "", "URL": "https://www.siliconrepublic.com/machines/ntu-singapore-mini-robots-soft-robotics", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}