{"Type": "", "Time": "2021-06-16", "Headline": "COVID-19: Centre Confirms 1 Death Due To Vaccine, Says Benefits Outweigh Risks", "Text": "COVID-19: There were two cases of hospitalisation linked to vaccines (File).A government report has, for the first time, acknowledged one death in India due to vaccination.A 68-year-old man, fully vaccinated, died on March 31 and it has been labelled as \"vaccine product related reaction\" in a report assessing 31 severe cases reported since the government launched the vaccine drive in January.The report is by the National Adverse Events Following Immunization (AEFI) committee under the Union Health Ministry. Of the 31 cases, 28 are deaths.\"This is the first death where causality has been established, with vaccine resulting in an anaphylaxis reaction. But compared to the overall numbers, only a small number had a severe reaction. 31 cases were investigated and one death was due to vaccine, and among anaphylaxis cases, only two were found to be product-related. Most anaphylaxis reactions are managed,\" said NK Arora, Advisor, National AEFI Committee.Of 31 cases, three cases were reported as \"Anaphylaxis\" or any severe reaction experienced by the person half an hour after the shot. Two of them were hospitalized and discharged but one died.Eighteen cases were found to be unrelated to vaccines and classified as \"coincidental\". There were two cases of hospitalisation linked to vaccines.In seven cases, there is no definite evidence to link the deaths to vaccines. In the case of two cases, there is not enough information.\"Overall, the benefits of vaccination are overwhelmingly greater than the small risk of harm,\" the health ministry said.\"Mere reporting of deaths and hospitalizations as serious adverse events did not automatically imply that the events were caused due to vaccines. Data from the first week of April shows the reporting rate is 2.7 deaths per million vaccine doses administered and 4.8 hospitalizations per million vaccine doses administered,\" the ministry explained.Track Latest News Live on NDTV.com and get news updates from India and around the world. Watch Live News:Follow Us:................................ Advertisement ................................", "Section": "", "Writers": "", "URL": "https://www.ndtv.com/india-news/covid-19-centre-confirms-1-death-due-to-vaccine-says-benefits-outweigh-risks-2464192", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}