{"Type": "", "Time": "2021-06-16", "Headline": "China calls US 'ill' after Biden rallies G-7 against Beijing, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BEIJING (BLOOMBERG) - China lashed out at the US, calling the country \"very ill indeed,\" after US President Joe Biden secured support from European allies to present a more united front against Beijing. Chinese Foreign Ministry spokesman Zhao Lijian criticised Mr Biden’s efforts during summits of the Group of Seven (G-7) and North Atlantic Treaty Organisation (Nato) in recent days.The response was the latest sign of Beijing’s frustration with Washington, amid tensions over everything from trade and security to human rights and the pandemic.\"The US is ill and very ill indeed,\" Mr Zhao told reporters in the ministry’s first news briefing since the G-7 meetings in the UK. \"The G-7 had better take its pulse and come up with a prescription.\"Mr Zhao criticised the G-7’s communique, which expressed concern about Chinese polices in Taiwan, Hong Kong and Xinjiang – issues that Beijing argues are its own domestic affairs.Still, he sought to play down the size of US' coalition, saying the statement \"exposes the bad intentions of the US and a few others to create confrontation and estrangement and expand differences and disagreements.\"Washington has been seeking to build a united front on Beijing, though Mr Biden settled for a modest condemnation at the G-7 meeting and incremental results from Nato.A communique released after the Nato meeting mentioned China 10 times, compared to just once after the last summit in 2019. Russia was named more than 60 times this year.The document also said that the bloc \"maintains a constructive dialogue with China where possible.\"\"China certainly has reason to be worried as the Nato action can be seen as yet another US-led move to encircle and contain China,” said Associate Professor Vivian Zhan, an expert on Chinese politics at the Chinese University of Hong Kong.\"China will be motivated to strengthen its ties with the US allies, such as through trade, investment and diplomatic actions so as to undermine the US alliance or make it more costly for the US to maintain it.”China took particular aim at Nato, after Secretary-General Jens Stoltenberg said the alliance was \"concerned by China’s coercive policies, which stand in contrast to the fundamental values enshrined in the Washington Treaty\" on which the bloc rests.Mr Stoltenberg cited China’s rapidly expanding nuclear arsenal, military cooperation with Russia and its use of disinformation.The alliance has \"inflicted war and turmoil on the world,\" Mr Zhao said, raising the 1999 bombing of its embassy in Belgrade.\"That is Nato’s debt of blood to the Chinese people,\" Mr Zhao said.  The US later apologised for the incident, saying it was a mistake resulting from the use of outdated maps.Earlier, China's mission to the European Union had struck a more measured tone, saying the country doesn’t pose a \"systemic challenge\" to any countries.Still, the mission warned that Beijing wouldn’t \"sit back\" in the face of any challenges, according to a statement posted on its website Tuesday (June 15).Mr Biden had pushed for the G-7 to confront China on topics such as forced labour and human rights abuses, and on its Belt and Road Initiative infrastructure plan.He said he also raised the issue of China refusing outside access to its laboratories to determine the origin of the Covid-19 outbreak.The G-7 communique calls for a \"timely, transparent, expert-led, and science-based\" study led by the World Health Organisation into the disease's origins.Some including German Chancellor Angela Merkel expressed concern about turning the G-7 into an anti-China group.\"This is not about being against something, but for something,\" Dr Merkel said at one point in the summit. China doesn’t pose a threat to any of Nato member countries, said Mr Henry Wang, president of the Centre for China and Globalisation, which has former government officials on its advisory board and describes itself as China’s leading global non-governmental think tank. \"China is not taking Nato as a rival and Nato should not project a rivalry on China,\" he said.\"We should really concentrate on peaceful constructions and working with the world, particularly in fighting the pandemic, climate change and the economic recovery.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/china-calls-us-ill-after-biden-rallies-g-7-against-beijing", "Source": "google"}