{"Type": "CommentaryCommentary", "Time": "2021-06-16", "Headline": "Commentary: G7 summit proved the world has shifted after Trump", "Text": "The leaders pointedly reiterated liberal democracies’ commitment to multilateralism, says a foreign affairs observer.MELBOURNE: What a difference a year makes in international diplomacy.A year ago, then-US President Donald Trump was obliged to abandon his plans for a G7 summit at the presidential retreat of Camp David outside Washington.Various excuses were advanced by participants, including the inadvisability of travelling across the world in the midst of a pandemic. But in reality few, if any, G7 leaders wanted to associate themselves with Trump in what was hoped would be the last days of an ill-starred presidency.A year later, these same leaders gathered at an English coastal retreat – in the shadow of a persistent COVID-19 pandemic – to celebrate the end of a disruptive chapter in diplomatic history.Relief was palpable in the interactions of representatives of the United States, United Kingdom, France, Germany, Japan, Italy and Canada.America was back, not in its “America First” guise, but as the proclaimed leader of the free world, to use an old-fashioned description.However, in the four years of the Trump presidency, during which Washington effectively abandoned its global leadership role in favour of an inward-looking posture defined by its embrace of an America First doctrine, the world had changed, and shifted dramatically.In 2016, the final year of the Obama administration, the G7 summit in Japan focused on the issue of climate in the wake of the Paris Agreement signed in April of that year. Its other priorities were disputes in the South China Sea and, interestingly enough, the need to strengthen a global response to pandemics in light of experiences with the Ebola virus in Africa.That global response has been found to be inadequate. This prompts the question: What notice did global health authorities, principally the World Health Organization, take of the G7’s 2016 communique?CHINA, THE PRIMARY G7 CONCERNFive years later, the challenges identified in the 2016 document have been vastly magnified. This has been brought about by a combination of lack of US leadership on issues such as climate, and a broader global failure to manage China’s rise.It looks like the email address you entered is not valid.In 2016, China’s activities in the South China Sea in defiance of the United Nations Convention on the Law of the Sea (UNCLOS) were a growing concern, as were signs of its increasing assertiveness under its nationalist leader, Xi Jinping.But the consensus view then was that China’s rise could be accommodated without undue disruption to a rules-based international order. That has proved a significant miscalculation.Fast-forward to the 2021 G7 in Cornwall, where concerns about China’s rise in its various dimensions stalked the round-table discussions and bilateral meetings. No other issue came close to matching worries about China: Not climate change, nor the ongoing challenges of the pandemic.In the end, the G7 communique was relatively restrained on China. This reflected differences of opinion among participants about how to manage a difficult situation.The US and Canadians would have liked stronger language. The Europeans favoured a less hawkish approach. Japan was somewhere in the middle.POINTED REFERENCES TO CHINAReferences to China were nevertheless pointed, in contrast to previous G7 communiques, which have danced around the issue of Beijing’s challenges to a rules-based global order.From an Australian perspective, the communique’s reference to China’s resort to economic reprisals to punish those who found themselves at odds with its policies will have been welcome:With regard to China, and the competition in the global economy, we will continue to consult on collective approaches to challenging non-market policies and practices which undermine the fair and transparent operation of the global economy.On human rights, the G7 was commendably forthright:We will promote our values by calling on China to respect human rights and fundamental freedoms, especially in relation to Xinjiang and those rights, freedoms and high degree of autonomy for Hong Kong enshrined in the Sino-British joint declaration and the Basic Law.Significantly, Taiwan made its way into a G7 communique for the first time. Here, the world’s leading democracies issued a fairly blunt warning to Beijing not to further destabilise relations across the Taiwan Strait:We underscore the importance of peace and stability across the Taiwan Strait, and encourage the peaceful resolution of cross-Strait issues. We remain seriously concerned about the situation in the East and South China Seas and strongly oppose any unilateral attempt to change the status quo and increase tensions.Predictably, Chinese commentators dismissed the G7 process as a sideshow, claiming “the world’s economic and political centre of gravity had shifted”, as the Global Times put it.AWKWARD POSITION FOR MORRISONMorrison, as an official guest, will have been relieved the G7 did not reach a consensus on the timing for a phase-out of coal for generating electric power.On the other hand, he will not have overlooked strong language in the communique calling for a commitment to achieve net zero greenhouse gas emissions “as soon as possible”.Australia will have had no issue with other G7 initiatives such as calls for a global minimum tax to ensure greater global equity. Nor will it object to a proposal for liberal democracies to contribute to an infrastructure fund to compete with China’s Belt and Road Initiative in the developing world.Morrison will no doubt have been disappointed he did not have a “one-on-one” meeting with US President Joe Biden. Instead, he had to make do with a three-way conversation involving the summit’s host, UK Prime Minister Boris Johnson.It is not clear whether this was a snub, but those briefing journalists in advance of the G7 should not have raised expectations.In one respect, Morrison will have found the Cornwall G7 awkward. No other leader of a Western liberal democracy had aligned themselves as closely with the Trump White House.In his attempts to position himself alongside Trump, Morrison echoed the then US president’s antagonism towards international institutions, broadly summed up by the Morrison’s reference to “negative globalism” in a Lowy Institute speech in 2019.These were sentiments the former US president used to promote his version of an America First policy, in contrast to the multilateralist tendencies of his predecessors.Morrison’s adoption of this Trumpism, now quietly discarded in his public statements, sits uncomfortably with the new president’s emphasis on Washington’s global leadership in partnership with like-minded countries and institutions.Pointedly, the G7 communique reiterated liberal democracies’ commitment to “multilateralism”.If nothing else, Australia’s prime minister should have concluded in Cornwall that his own personal investment in a Trump presidency was not the most prudent course. The world has shifted.Tony Walker is Vice-Chancellor’s Fellow at La Trobe University. This commentaryfirst appearedon The Conversation.", "Section": "", "Writers": "", "MainKeyWord": "G7,US,Joe Biden,COVID-19,China,Australia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/commentary/g7-cornwall-trump-biden-morrison-china-climate-covid-recovery-15018070", "Source": "google"}