{"Type": "Sport", "Time": "2021-06-16", "Headline": "Football: France's Pogba lucky to have perfect sidekick in Kante", "Text": "MUNICH: France midfielder Paul Pogba earned the Star of the Match award for his display in the world champions' 1-0 win over Germany in their Euro 2020 Group F opener on Tuesday but knows how lucky he is to play alongside N'Golo Kante.Powerhouse Pogba's sublime pass in the 20th minute unlocked Germany's defence, allowing Lucas Hernandez to drive in a cross that Germany's Mats Hummels turned into his own net.Pogba, 28, delivered several other moments of quality as the link between France's midfield and the dream attacking trident of Antoine Griezmann, Kylian Mbappe and Karim Benzema.Adrien Rabiot was also a disciplined presence in Didier Deschamps' midfield that was ultimately far too crafty for a German side that looked short of cohesion.But it was Chelsea's Kante, who at the age of 30 appears to be elevating his games to new levels, who knitted it together.A few weeks after his masterful display helped Chelsea overcome favourites Manchester City in the Champions League final, Kante again showed that he remains the beating heart of world champions France.When required as a defensive shield in the second half, as Germany tried to build some momentum, Kante was immense.Almost inevitably, Kante was also in close proximity whenever France turned over possession - using the ball efficiently and with no little vision.Pogba's Manchester United career has spluttered at times, yet when playing for France, Kante's influence rubs off on him to such an extent that he looks like a world-beater.In the 28 games he has started for France with Kante, Les Blues have won 22, drawn six and lost none.\"Pogba was absolutely immense tonight,\" France's Euro 2000 winner Robert Pires told UEFA's website. \"We know all about his technique. He's back to his best, physically.\"Pogba's words after the game would have been music to the ears of Deschamps, as he attempts to add the European crown to the World Cup his side won in Russia in 2018.\"We know we need to live up to our tag as world champions and come out on to the pitch with humility,\" Pogba said.\"When we need to suffer, we do it together and when we attack, we do it together,\" added the midfielder, who said this week how much of an honour it was to play alongside Kante.Eight of France's starting team against Germany played in the 2018 World Cup final win over Croatia and, while it was not a five-star display, they won with something to spare as both Benzema and Mbappe had goals ruled out for offside.Those looking for weaknesses were left disappointed as France's unbeaten run in competitive matches reached 17.\"We spent all night talking about France's attacking players, but again another clean sheet,\" former Manchester United skipper Roy Keane told ITV Sport. \"That's a defence that can win them the title. They are brilliant at the back.\"For Germany, a first defeat in the opening match of a European Championship gives coach Joachim Loew much to ponder.They looked toothless in attack with the returning Thomas Mueller failing to gel with Kai Havertz and Serge Gnabry.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "sports,football,Kante,France,win,Paul Pogba", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/euro-2020-france-s-pogba-lucky-to-have-perfect-sidekick-in-kante-15023376", "Source": "google"}