{"Type": "", "Time": "2021-06-16", "Headline": "'Oh my god, I'm in a whale's mouth': US diver lives to tell the tale, World News - AsiaOne", "Text": "Ever had a nightmare of being eaten alive? It almost came true for a lobster diver.Michael Packard was swallowed by a humpback whale on June 11, off Cape Cod, Massachusetts, when he was diving for lobsters.After jumping off his vessel and diving 14 meters deep into the sea, he felt a \"huge bump and everything went dark around [him]\". He thought he was attacked by a great white shark, which was common around the area, but realised that there were no teeth around him and that he did not feel any pain.In an interview with CBS Boston, he said: \"And then I realised: 'Oh my God, I'm in a whale's mouth and he's trying to swallow me. This is it, I'm going die'\".He was in the creature’s mouth for about 30 seconds, Packard said.The whale then suddenly emerged to the surface, started shaking its head, and spat him out.Packard was then hauled back onto the boat by his crewmate who had been scanning the water for air bubbles from his oxygen respirator.[embed]https://www.instagram.com/p/CP_hYF2jHlp/[/embed]Despite the scare, the lobster diver said in a Facebook post the following day: \"I am very bruised up but have no broken bones.\"He only suffered a suspected dislocated knee and bruises on his legs from the incident and was soon rescued by the Provincetown fire department.Such human-whale encounters are rare, a whale expert told Cape Cod Times, as humpback whales, which feed mainly on krill and fish, are not aggressive.Packard's experience is likely to be accidental, as the whales \"do what we call gulp feeding, and they can open their mouths up incredibly widely,” experts told NBC Boston.ALSO READ: Whale nearly swallows South African conservationistxavierpoh@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/world/oh-my-god-im-whales-mouth-us-diver-lives-tell-tale", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}