{"Type": "", "Time": "2021-06-16", "Headline": "Thailand targets reopening within 120 days as economy flounders after Covid-19 travel curbs, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BANGKOK (REUTERS) - Thailand will reopen to visitors within 120 days after more than a year of coronavirus travel curbs, a calculated risk needed to revive its troubled economy, Prime Minister Prayut Chan-o-cha said on Wednesday (June 16).The country is ahead of target in securing 105.5 million doses of coronavirus vaccine for this year, and will seek more supplies next year, Mr Prayut said in a nationally televised speech.He added that the country plans to administer an average of 10 million shots of coronavirus vaccine each month from July onwards and aims to reopen the tourism-reliant country to fully vaccinated travellers, local and foreign, without a quarantine requirement.\"Reopening the country is one of the important ways to start reducing the enormous suffering of people who have lost their ability to earn an income,\" he said.\"When we take into consideration the economic needs of people, the time has now come for us to take that calculated risk.He said he aimed to declare Thailand fully open within 120 days and for tourism centres that are ready, \"to do so even faster\".He said the risk was necessary and the country could not afford to wait to complete all of its vaccinations and for the spread of the virus to halt.Strict entry requirements and quarantine measures helped keep Thailand's coronavirus outbreaks under control until recent months, but the curbs saw arrival numbers plummet to a fraction of its nearly 40 million visitors in 2019.It will start with a pilot reopening from July 1 on its most popular island, Phuket, which has been vaccinating most of its local population.Thailand lost about US$50 billion (S$66.3 billion) in tourism revenue last year - an 82 per cent plunge.Mr Prayut urged the public to get vaccinated as fast as possible and said the reopening target could be met only if the vaccines are delivered according to the committed schedules.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/thailand-targets-reopening-within-120-days-as-economy-flounders", "Source": "google"}