{"Type": "", "Time": "2021-06-16", "Headline": "Opinion | Vladimir Putin Has Nothing to Fear From Joe Biden - The New York Times", "Text": "AdvertisementSupported byGuest EssayBy Elena ChernenkoMs. Chernenko is a special correspondent for Kommersant, an independent newspaper in Russia.MOSCOW — For a while, it wasn’t clear that this week’s meeting in Geneva between President Vladimir Putin of Russia and President Biden would go ahead.Mr. Biden, seeking his first encounter as president with Mr. Putin, made the invitation in mid-April; but it took until the end of May for the summit to be confirmed. Despite Mr. Putin’s experience with American presidents — he’s dealt with four, across two decades — the Kremlin, Russian officials said, was considering the risk that Mr. Biden would use the meeting to publicly lecture his Russian counterpart on democracy and human rights.The caution seemed reasonable. After all, the new American administration, especially by comparison with its predecessor, devotes considerable attention to promoting human rights across the globe. And Mr. Biden set out his stall when he agreed in an interview in March that Mr. Putin is a “killer.”Yet the Kremlin eventually accepted the invitation. Why? Besides the chance to de-escalate tensions, there’s one very good reason: Mr. Putin has nothing to fear from Mr. Biden. Enduringly popular and freshly buoyed by the quashing of the opposition, Russia’s president has ample cause to feel secure. Whatever the American president might say in Geneva — or his administration do, by way of sanctions — will not affect Mr. Putin’s rule in Russia.The first impediment for Mr. Biden is straightforward: His message will not get a good airing. Television, dominated by channels run or controlled by the state, remains the main source of news for three-quarters of Russians, so most people in Russia will see the American president through the Kremlin’s eyes. Independent media, recently curtailed by the authorities declaring several prominent outlets to be “foreign agents,” won’t be able to redress the imbalance.Yet even without this media filter, Mr. Putin has no reason to fear any aspersions Mr. Biden might cast his way. Though the president’s popularity has waned a touch since its peak in 2014, he retains the trust and approval of over 60 percent of Russians, according to Levada Center, an independent and highly respected polling organization. This might be more inertia and apathy than a conscious political affiliation, but the result is the same. The opposition can only dream about such ratings: Support for the most prominent opposition leader, Aleksei Navalny, doesn’t rise above 20 percent.The blame for that can’t be placed squarely on the Kremlin. Though the opposition is hampered by a range of state restrictions, the fact remains that opposition rallies do not attract significant numbers of participants. The last big protest in support of Mr. Navalny — one of the largest displays of dissent in the past decade — brought between 51,000 and 120,000 people to 109 cities across the country on April 21, according to opposition outlets. But even if you take the higher number, that amounts to less than 0.1 percent of the country’s population. Protesting is a minority interest.And that’s not just because Russian authorities have repeatedly demonstrated their willingness to brutally suppress gatherings. Many people unhappy with life in Russia stay away from protests because they don’t associate themselves with the organizers and don’t believe they can bring about change from the street. In a recent survey by the Levada Center, only 21 percent of respondents said they would consider going to a rally in support of economic demands, and even fewer, 16 percent, said they’d go in support of political demands. There are demographic divides — young people are generally more eager to protest — but that doesn’t really change the picture.What’s more, those ready to actively challenge Mr. Putin’s rule have been repressed. Mr. Navalny, who returned to the country in January in the hope of setting off a substantive movement to oppose Mr. Putin, was imprisoned with a two-and-a-half-year sentence. Many of his allies were jailed, while others fled the country. And last week, his organization, the Anti-Corruption Foundation, whose activities were already suspended, was officially labeled “extremist” — effectively preventing its activists from running in future elections and further intimidating supporters.It’s not just Mr. Navalny. Another opposition network — Open Russia, founded by a former oil tycoon and now exiled Kremlin critic, Mikhail Khodorkovsky — recently announced its closure, hoping to protect its coordinators. That didn’t stop the arrest on May 31 of one of the group’s executives, Andrey Pivovarov, who now faces up to six years in prison. Fearing the same fate, another prominent opposition figure, Dmitry Gudkov, fled to Ukraine in early June.Ahead of September’s legislative elections, the authorities have disbanded the opposition and docked the media, closing down the space for dissent. But a majority of Russians, consumed by the concerns of everyday life and long inured to Mr. Putin’s rule, don’t seem to care much. With them, Mr. Biden’s message about the inviolability of human rights and the sanctity of democracy — both of which are slipping away in Russia, to no general uproar — is likely to ring hollow.Even among Russians who actively support democracy, the rule of law and human rights, Mr. Biden won’t find much support. Over the past decades, many Russian liberals have become disillusioned with the West, especially the United States. For some, America’s image started to crack with the bombing of Yugoslavia and the war in Iraq. For others, it was the revelations of WikiLeaks and Edward Snowden, which brought to light a host of America’s covert operations and dirty dealings, that soured feelings of admiration.And for many, the presidency of Donald Trump — during which Washington abandoned international agreements, treated allies as clients, badly mismanaged the pandemic and, most important, exacerbated political polarization and social dysfunction — definitively stripped America of its authority. With this legacy, no American president would have a substantial audience in Russia.Secure internally and with little to lose, Vladimir Putin is ready for President Biden. As for his image in the United States and the rest of the West, it’s fair to assume — after years as their arch-villain and evil mastermind — that Mr. Putin couldn’t care less.Elena Chernenko (@ElenaChernenko) is special correspondent for Kommersant and a member of the executive board of the PIR Center, an independent nongovernmental organization in Moscow.The Times is committed to publishing a diversity of letters to the editor. We’d like to hear what you think about this or any of our articles. Here are some tips. And here’s our email: letters@nytimes.com.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement", "Section": "", "Writers": "", "URL": "https://www.nytimes.com/2021/06/16/opinion/putin-biden-summit.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}