{"Type": "", "Time": "2021-06-16", "Headline": "Students negotiate a tough road towards milestone exams, Latest Singapore News - The New Paper", "Text": "The second nationwide home-based learning (HBL) exercise for students will come to an end in stages, the Ministry of Education (MOE) announced yesterday.Primary 4 to 6 pupils, Secondary 3 to 5 and all junior college and Millennia Institute students will be the first to return to school on June 28. Secondary 1 and 2 students will return to school from July 1 and the rest will go back from July 6.Those sitting PSLE and N-, O- and A-level examinations this year have had to live with the coronavirus for more than a year now and been forced to make unprecedented adjustments while preparing for the milestone tests.Dr Jason Tan, associate professor in the policy, curriculum and leadership academic group at the National Institute of Education, said negotiating two HBL sessions and adjusting to various safety measures both in and out of school would have been challenging.\"These exams play an important role in determining the next stages of the students' lives and having them amid the disruptions caused by the virus is certainly not ideal,\" he told The New Paper yesterday.\"This period is already a stressful one for them, knowing the importance of these exams. Faced with social isolation like being apart from their classmates and not having co-curricular activities is bound to affect their social and emotional well-being, which also plays a part in how they do academically.\"On May 16, MOE announced that all students would move to HBL from May 19, the second such exercise since the virus appeared here early last year.The current mid-year holidays started on May 29 and end on June 27.Last year's HBL was from April 8 to May 5, during the circuit breaker, when Singapore went into a lockdown from April 7 to June 1.Ms Vivien Le, founder of Le Xue Education Group, a Chinese education centre, believes many of the students taking crucial exams this year would have found it tough.The former MOE teacher said: \"This year's cohort had to go through two rounds of disruptions.\"Students who find it more challenging learning online may find it difficult since a portion of their syllabus from these two years were taught online, especially when it comes to the foundation topics taught last year.\"But she noted that some learning styles may be suited to online learning.Miss Ren Yun Ting, 18, a second-year student at Tampines Meridian Junior College, said she was productive during the recent HBL exercise as she continued preparing for her upcoming A-level exams.She said: \"The school uploaded a lot of information and resources such as mock exam papers for us to do, and I had the flexibility to plan my time on how I wanted to revise.\"While she missed meeting her friends and having fun in school, the time she saved on travelling and attending co-curricular activity sessions helped with revision work.\"I may not be able to say I am 100 per cent confident to take the exams now, but I am definitely making great use of my holidays to consolidate my learning, and I am well prepared for my upcoming exams, which is an important milestone before the A levels,\" she added.Some have struggled more.Madam Lunny Liu, 50, a tutor, said her 11-year-old daughter, who will sit the Primary School Leaving Examination later this year, found the HBL less effective.\"She never had very good self-discipline and home-based learning made it worse. Also, it affected her understanding of some lessons taught in class because she does better with physical interaction.\"Students taking the PSLE and N-, O- and A-level exams face huge pressure, and Ms Le said the pandemic could exacerbate the strain.A mother who wanted to be known only as Mrs Lim said despite the challenges that her 12-year-old daughter has had to face, they have learnt to adapt as the PSLE draws closer.The 41-year-old sales manager said: \"Last year, my daughter was complaining about the safe management measures in school such as having to wear masks the whole day.\"She does not complain now and is looking forward to returning to school to prepare for her exams.\"While it has been disruptive, especially when tuition classes were shifted online, this pandemic has taught us to go with the flow and expect these constant changes.\"Get The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/students-negotiate-tough-road-towards-milestone-exams", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}