{"Type": "Asia", "Time": "2021-06-16", "Headline": "Parliament can reconvene in September or October if daily COVID-19 cases fall below 2,000: PM Muhyiddin", "Text": "KUALA LUMPUR: Malaysia's parliament, which has not met since the state of emergency was declared in January, can reconvene during the third phase of the national recovery plan, Prime Minister Muhyiddin Yassin said on Tuesday (Jun 15).This is likely to happen in September or October this year, he added.\"I wish to give my commitment that the parliament meeting can be held in this phase, around September or October, with tight standard operating procedures (SOPs) in place,\" he said when unveiling the plan in a televised address.Mr Muhyiddin said this had been his stance since early on that Malaysia's system of parliamentary democracy could function again at the appropriate time when COVID-19 cases were under control and the country nearly reached herd immunity.\"I will continue to support the principles of parliamentary democracy and constitutional monarchy.\"Don't let there be any parties who purposely create unrest and disorder among the people to the extent of hindering the government's main task to handle the pandemic,\" Mr Muhyiddin said.The national recovery plan is a four-phase COVID-19 exit strategy beginning with the current total lockdown. Daily COVID-19 cases, intensive care unit occupancy and vaccination rate are the three indicators for the country to transition from one phase to another.To enter phase three, daily cases have to fall below 2,000, the public healthcare capacity is at a comfortable level with enough ICU beds, and 40 per cent of Malaysia's population has received both vaccine doses, Mr Muhyiddin said.\"The earliest these thresholds can be reached is by the end of August 2021,\" he said.As the country moves into each different phase, Mr Muhyiddin said additional economic activities would be allowed to resume, barring those with a high risk of spreading COVID-19 or involved crowds.For instance, education and certain sports activities could begin to reopen gradually during the plan's third phase.Currently, Malaysia is in the midst of a total lockdown known as movement control order 3.0, whichhas been extendeduntil Jun 28.A total of 5,419 new cases were recorded on Tuesday, bringing the national tally to 667,876. The country could transition to the second phase when daily average cases fall below 4,000, the prime minister said.The fourth and final phase is expected to be implemented by the end of October at the earliest when daily cases fall below 500 and 60 per cent of the population has been fully vaccinated, Mr Muhyiddin added.\"(The fourth phase) is when we can return to normal daily life as much as possible. All economic sectors will open, more social activities will be permitted, interstate travel will be allowed and domestic tourism will also reopen with strict SOPs,\" he said.Mr Muhyiddin stressed that the national recovery plan is dynamic and the government would decide to move into the next phase when the three thresholds are achieved.In January, Malaysian King Al-Sultan Abdullah Ri’ayatuddin Al-Mustafa Billah Shah had proclaimed a state of emergency in Malaysia to help curb COVID-19’s spread. It is set to end on Aug 1 or earlier depending on the state of the pandemic.With the state of emergency in place, bothparliament and state legislature sittings, as well as elections,are suspended while economic activities are allowed to continue.Since last week, the king hasheld a series of audiences with 18 key political leaders, including opposition leader Anwar Ibrahim and former prime minister Mahathir Mohamad, for discussions on Malaysia’s current state of emergency and COVID-19 efforts.In a statement on Tuesday, the palace said their views would be presented in the special Malay rulers' meeting at 2.30pm on Wednesday.RM1 BILLION DAILY LOSS DURING TOTAL LOCKDOWNSince the pandemic, the Malaysian government has rolled out stimulus packages worth RM380 billion (US$92 billion) in total.In his Tuesday address, Mr Muhyiddin noted that the country suffered an economic loss of RM1 billion daily during the current lockdown.\"We cannot carry on like this. For health and the continuation of all our lives, we need to get out of this crisis quickly,\" he said.The prime minister urged those yet to register for their vaccine to do so through the MySejahtera application.\"Until now, the total number of registrations are at 13.8 million. Our target is to ensure at least 26 million of Malaysia's population are vaccinated by the end of the year to achieve herd immunity,\" he said.He added that 1.4 people are fully vaccinated so far, while 3.2 million people have received their first dose.The prime minister said he hoped the national recovery plan could guide the country towards reclaiming the \"much treasured freedoms\" while doing all it could to protect the lives and livelihoods of Malaysians.\"I am cautiously optimistic that with proper planning, execution and support from all Malaysians, we can emerge victorious and stronger from this crisis,\" he said.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Malaysia,Muhyiddin Yassin,COVID-19", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/malaysia-muhyiddin-recovery-plan-parliament-september-october-15018472", "Source": "google"}