{"Type": "Asia", "Time": "2021-06-16", "Headline": "Japan should have scrapped domestic trials to speed up COVID-19 inoculations: Vaccine chief", "Text": "TOKYO: Japan's requirement of domestic clinical trials for COVID-19 vaccines cost it precious time in inoculating its population, vaccine programme chief Taro Kono said on Tuesday (Jun 15).About 4.8 per cent of Japan's population has been fully vaccinated, a Reuters tracker shows, the lowest rate among large, wealthy economies at a time when tens of thousands of visitors are poised to arrive for the Tokyo Olympics starting on Jul 23.\"If I could go back all the way to the beginning, I would have probably scrapped the clinical trial that we did,\" Kono told reporters.\"It's probably necessary for ordinary times, but in the case of emergency, or state of emergency, like COVID-19, I think we should have started the vaccination as early as possible.\"Japan's mid-February start of vaccinations lagged behind most major economies and was dependent on initially scarce doses of Pfizer-BioNTech's vaccine imported from overseas.Kono, the administrative reform minister tapped to head the programme in January, said that opposition parties pushed for domestic trials, and that media would have pilloried the government if accidents had happened without them.But some public health experts have said that the domestic trials, involving 200 subjects or fewer, were scientifically meaningless.In recent weeks, the vaccine campaign has picked up steam and is set to accelerate now that thousands of companies have signed up to use government supplies to administer shots to employees and families.Kono said he hoped that daily vaccinations would hit 1 million by the end of June, up from about 700,000 now.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Japan,COVID-19,coronavirus,vaccine", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/covid-19-vaccination-japan-should-have-scrapped-domestic-trials-15019854", "Source": "google"}