{"Type": "", "Time": "2021-06-16", "Headline": "NY Lifts Most Coronavirus Restrictions - The New York Times", "Text": "AdvertisementSupported byOfficials made the move after more than 70 percent of adults in both states had received a first dose of the coronavirus vaccine.By Luis Ferré-Sadurní and Shawn HublerThe governors of New York and California, the states hit earliest and hardest by the pandemic, triumphantly announced on Tuesday that they had lifted virtually all coronavirus restrictions on businesses and social gatherings as both states hit milestones in vaccinating their residents. In New York, where 70 percent of adults have received at least one dose of the vaccine, the order from Gov. Andrew M. Cuomo means that restaurants will no longer be forced to space tables six feet apart; movie theaters will be allowed to pack their auditoriums without spacing seats apart; and entering commercial buildings won’t require a temperature check.“This is a momentous day and we deserve it because it has been a long, long road,” Mr. Cuomo said at the World Trade Center in Lower Manhattan on Tuesday, adding that the changes meant a “return to life as we know it.” In California, where 72 percent of adults have received at least one dose of the vaccine, Gov. Gavin Newsom called Tuesday “reopening day,” as he lifted similar capacity limits on businesses and social distancing requirements, with some exceptions.Businesses in both states, however, will still have the option of requiring health precautions on their premises. The two governors, both Democrats who are facing political difficulties, made their announcements at events that seemed more like rallies than news conferences. For all the celebration, however, the nation was also poised to reach 600,000 dead from the coronavirus, a grim reminder of the virus’s painful toll even as Americans begin to enjoy a summer with significantly fewer limitations, if any, on their ability to live, work and socialize. More than 63,000 have died from the virus in California, while in New York that number has reached nearly 53,000 — the two highest totals in the country. Yet both governors took the opportunity to look ahead. In a 45-minute speech, Mr. Cuomo, who is facing multiple investigations and the possibility of an impeachment proceeding, highlighted many of his pet infrastructure projects, embraced political supporters and announced a display of fireworks statewide scheduled for Tuesday night. Mr. Newsom, who is facing a recall campaign, but has seen his approval ratings improve as the pandemic has receded, showed up at Universal Studios Hollywood flanked by an assortment of Minions from the “Despicable Me” movie franchise and the “Transformers” robot hero Optimus Prime to announce $1.5 million lottery prizes to people who had been vaccinated. In both states, health officials have struggled to expand vaccinations among significant pockets of their population. Some of the lowest adult vaccination rates in New York City, for example, are in the Bronx, where 38 percent of adults are fully vaccinated and in Brooklyn, where 41 percent are, while several populous counties in California have yet to hit a 40 percent full vaccination rate for all residents. Even so, the lifting of restrictions in the coastal states that were once epicenters of the pandemic marked a symbolic moment in the nation’s fight against the coronavirus, and are expected to bring back the type of scenes familiar to most New Yorkers and Californians in prepandemic times.“Rollback of most of the remaining Covid-19 restrictions is the green light that employers have been waiting for in order to bring employees back to the workplace,” said Kathryn Wylde, the president of the Partnership for New York City, an influential business group.In California, even business owners who had been critical of Mr. Newsom expressed relief at the new rules. “I see light! I see light!” joked Michael Helmrich, whose Mandarin Restaurant in Sacramento was so battered during the past year that he posted a sign in the front window reading, “Newsom sucks — the life out of California small businesses.” Mr. Cuomo set the 70 percent threshold that triggered the end of the restrictions in New York last week as a way to spur on the state’s reopening and incentivize people to get vaccinated, saying “virtually all” coronavirus rules would expire. Washington D.C. and 13 other states besides New York and California have all reached the same threshold, according to the latest federal data, with Vermont topping the list at 84 percent. Maryland will lift most virus restrictions on July 1, the state announced on Tuesday. President Biden will host a 1,000 person gathering on July 4 on the South Lawn of the White House to celebrate the country’s continued return to normalcy. Mayor Bill de Blasio on Tuesday announced that the city would hold a parade on July 7 to honor front line and essential workers. California and New York residents should still expect to see some signs of pandemic life even with the restrictions lifted.Both states will still abide by mask guidance from the Centers for Disease Control and Prevention, which has advised that unvaccinated people should wear masks indoors and maintain social distancing. Some stricter restrictions will remain in correctional and health care facilities, as well as in schools, public transit and homeless shelters.And the decision to end many of the precautions, such as allowing vaccinated customers to walk around without masks, will be up to individual businesses. Some may decide to keep them in place in order to allow their clientele and employees to feel safe.Despite the cause for celebration, it will likely be months before New York City’s commercial corridors in Manhattan resemble anything like the hustle and bustle before the pandemic. Just 12 percent of workers have returned to their offices as of late May, about the same rate it was last fall, according to Partnership for New York City.California has been in better shape economically than most states, although its tourism sector “really had the sledgehammer taken to it,” Mr. Newsom noted on Monday. The state’s unemployment rate remains about 4 percentage points higher than before the crisis and higher than the national average, largely because of layoffs at restaurants, hotels and tourist attractions. Over the past few months, as the virus positivity rate has reached record lows, Mr. Cuomo has eased an array of pandemic-era rules, but Tuesday’s announcement was a near total cancellation of restrictions. Twenty-four-hour subway service resumed last month. Bars and restaurants were allowed to operate at 100 percent capacity and remain open past midnight. State officials have also loosened capacity limits to allow more people in concert halls and sports stadiums.The governor was in a celebratory mood on Tuesday, delivering a speech with upbeat music, as well as handshakes with major labor leaders, whom Mr. Cuomo honored with plaques to recognize the sacrifice of essential workers during the pandemic. Mr. Cuomo did not take questions from reporters.“Remember June 15,” Mr. Cuomo said, noting that was also the birthday of his father, Gov. Mario M. Cuomo, whom the younger Cuomo often invokes. “It is the day that New York rose again.”For a governor who climbed to national fame at the height of the pandemic, the speech appeared to suggest a “mission accomplished” moment in the state’s battle against the virus at a time when Mr. Cuomo has been embroiled in several scandals. The governor has been scrambling to rehabilitate his image following sexual harassment accusations that have led to calls for his resignation, including among members of his own party. Multiple state and federal investigations are looking into the accusations, as well as his handling of nursing home death information and a $5.1 million deal he received last year to write a pandemic memoir.Mr. Newsom is facing a recall campaign. The attempt to oust him — a Democratic governor in a blue state who was elected in 2018 in a landslide — defied even the expectations of its Republican backers by qualifying for the ballot. Speaking without a face covering at Universal Studios, Mr. Newsom said it was time “to move beyond capacity limits, to move beyond these color codings, move beyond social distancing and physical distancing, and — yes, as you saw me walk up to the stage — to move beyond mask coverings.” “Today is a day to reconnect — to give people hugs, to remind them we’re not out of the woods yet, to remind them we’re all in this together,” the governor said. “California is open again.”Still, some public health experts expressed concerns about a fuller reopening as the pace of vaccinations has slowed substantially in recent weeks, say that it was critical to increase the vaccination rate before the fall, when more people are indoors.“My worry is whether this will erode the momentum of getting more people vaccinated,” said Dr. Wafaa El-Sadr, a professor of epidemiology and medicine at Columbia Mailman School of Public Health. “I worry people are going to think this is behind us.”Others, however, said abandoning restrictions was merited, given the improving infection and hospitalization rates, but, most importantly, the number of people that have been vaccinated.Dr. Kitaw Demissie, the dean of the School of Public Health at SUNY Downstate Medical Center in Brooklyn, said that reaching a 70 percent vaccination rate represented a real public health success.“Seventy percent is really good in my opinion,” he said, estimating that at least another 10 percent of people in New York City had immunity from prior infection. “So that will take us probably to 80 or 85 percent immunity.”Luis Ferré-Sadurní reported from New York City and Shawn Hubler reported from Sacramento, Calif. Joseph Goldstein, Matthew Haag and Patrick McGeehan contributed reporting. Advertisement", "Section": "", "Writers": "", "URL": "https://www.nytimes.com/2021/06/15/nyregion/coronavirus-restrictions.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}