{"Type": "", "Time": "2021-06-16", "Headline": "Centuries-old shipwrecks found off Singapore", "Text": "Two centuries-old shipwrecks packed with ceramics and other artefacts have been found off Singapore in a rare discovery that will shed light on the city-state's maritime heritage, archaeologists said Wednesday.The prosperous island nation has long been a key trading hub on global shipping routes connecting the Indian Ocean and the South China Sea.The wrecks were found off Pedra Branca, a rocky outcrop east of Singapore, according to the National Heritage Board and think tank the ISEAS-Yusof Ishak Institute, which worked together on the project.The first wreck, discovered after divers accidentally came across ceramic plates in 2015, was carrying Chinese ceramics that possibly date back to the 14th century, when Singapore was known as Temasek.Some of the items were similar to artefacts found in archaeological digs on land, which showed that Singapore was a trading hub well before the arrival of British colonisers in 1819.Undersea excavations on the first wreck led to the discovery of the second, which is likely to be the Shah Munchah, a merchant vessel built in India that sank in 1796 while sailing from China to India.Items recovered from the second wreck ranged from Chinese ceramics to glass and agate objects, as well anchors and cannons, the heritage board and think tank said.The survey and recovery of artefacts from the two wrecks was completed this year.Such cannons were typically mounted on merchant ships used by the East India Company --- the trading behemoth through which the British empire expanded in Asia -- in the 18th and 19th centuries, they added.The vessel discovered in 2015 was the first ancient shipwreck to be found in Singapore's waters.It was carrying \"more Yuan dynasty blue-and-white porcelain than any other documented shipwreck in the world,\" said Michael Flecker, a visiting fellow at the ISEAS-Yusof Ishak Institute's archaeology unit.\"Many of the pieces are rare, and one is believed to be unique.\"The Yuan dynasty existed in what is now China in the 13th and 14th centuries.Much of the Chinese cargo in the second wreck was destined for eventual shipping to Britain, said Flecker.mba/sr/qanPremier League champions Manchester City will start the defence of their title away to Tottenham after the fixtures for the 2021-22 season were unveiled on Wednesday.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neMeet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Alibaba Group was the victim of a months-long web-scraping operation by a marketing consultant that siphoned up sensitive data including usernames and phone numbers.It's useful to be ready with the names of a few companies you'll scoop up in case a crash occurs. The post 3 Stocks I Will Buy If the Market Crashes Tomorrow appeared first on The Smart Investor.Sentosa isn’t expensive as you think it is. Here’s everything you need to know about the island’s entrance fees cost, car park rates, beach reservations and hacks on how to save. Thanks to COVID-19, plans to travel overseas for a well-deserved holiday is starting to […] The post Sentosa Island: Entrance Fee And Parking Rates appeared first on SingSaver Blog - We Compare, You Save.Learn more about scalp psoriasis. Look for scalp psoriasis treatments.Kevin Durant finished with 49 points while playing every minute of the game as the Brooklyn Nets rallied from a 17-point deficit to beat the Milwaukee Bucks 114-108 in game five of their NBA playoff series on Tuesday.Turkish President Recep Tayyip Erdogan on Tuesday pledged support for Azerbaijan if the ex-Soviet country was attacked, as he made a visit to the disputed Nagorno-Karabakh region.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Sick of seeing others get rich in the stock market? Have you heard of Everlasting Stocks?If you’re wondering whether Ethereum is a good long term investment, keep reading.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aThe largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.Find furniture you love, at prices that fit your budget with flexible financing.The League of Legends: Wild Rift esports scene will be kicking into full gear this 19 June with the League of Legends: Wild Rift 2021 SEA Icon Series Summer Super Cup.A sinking fire-damaged container ship could take months to salvage because of rough monsoon seas, Sri Lanka said Tuesday, as authorities investigated whether the deaths of dozens of turtles and dolphins were caused by the disaster.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.This new car cloth can easily remove all the car scratches and dents from your car.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.Cristiano Ronaldo netted a double to become the European Championship's all-time leading scorer as Portugal struck three times late on to beat a stubborn Hungary 3-0 in their Euro 2020 opener at a packed Puskas Arena on Tuesday.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).The Russian skipper of a container ship that caught fire and burned for almost two weeks before sinking off Sri Lanka's coast has been arrested and is expected to be charged with marine pollution, police said Monday.The inflation outlook among Americans is at its highest level ever, while many are upbeat about their employment situation, a New York Federal Reserve survey released Monday said.The report covering May showed one-year inflation expectations jumped 0.The emergence of problems in a new-generation nuclear reactor in China threatens to undermine efforts by its French designer to sell it elsewhere, and could hurt Beijing's nuclear industry, analysts said.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/centuries-old-shipwrecks-found-off-093907017.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}