{"Type": "", "Time": "2021-06-16", "Headline": "New York and California lift most Covid-19 curbs as they hit vaccination milestones, United States News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.NEW YORK (NYTIMES) - The governors of New York and California, the states hit earliest and hardest by the Covid-19 pandemic, triumphantly announced on Tuesday (June 15) that they had lifted virtually all coronavirus restrictions on businesses and social gatherings as both states hit milestones in vaccinating their residents.In New York, where 70 per cent of adults have received at least one dose of the vaccine, the order from Governor Andrew Cuomo means that restaurants will no longer be forced to space tables 6 feet (1.8m) apart; movie theatres will be allowed to pack their auditoriums without spacing seats apart; and entrance to commercial buildings would not require a temperature check.“This is a momentous day and we deserve it because it has been a long, long road,” Mr Cuomo said on Tuesday at the World Trade Centre, in Lower Manhattan, adding that the changes meant a “return to life as we know it”.In California, where 72 per cent of adults have received at least one dose of the vaccine, Govenor Gavin Newsom called on Tuesday “reopening day”, as he lifted similar capacity limits on businesses and social distancing requirements, with some exceptions.Businesses in both states, however, will still have the option of requiring health precautions on their premises. The two governors, both Democrats who are facing political difficulties, made their announcements at events that seemed more like rallies than news conferences.For all the celebration, however, the nation was also poised to reach 600,000 dead from the coronavirus, a grim reminder of the virus’s painful toll even as Americans begin to enjoy a summer with significantly fewer limitations, if any, on their ability to live, work and socialise. More than 63,000 have died from the virus in California, while in New York that number has reached nearly 53,000 – the two highest totals in the country.Yet both governors took the opportunity to look ahead.In a 45-minute speech, Mr Cuomo, who is facing multiple investigations and the possibility of an impeachment proceeding, highlighted many of his pet infrastructure projects, embraced political supporters and announced a display of fireworks statewide scheduled for Tuesday night.Mr Newsom, who is facing a recall campaign but has seen his approval ratings improve as the pandemic has receded, showed up at Universal Studios Hollywood flanked by an assortment of Minions from the \"Despicable Me” movie franchise and the “Transformers” robot hero, Optimus Prime, to announce US$1.5 million (S$1.9 million) lottery prizes to people who had been vaccinated.Even with the restrictions lifted, California and New York residents should still expect to see some signs of pandemic life.Both states will still abide by mask guidance from the Centres for Disease Control and Prevention, which has advised that unvaccinated people should wear masks indoors and maintain social distancing. Some stricter restrictions will remain in correctional and health care facilities, as well as in schools, public transit and homeless shelters.Mr Cuomo was in a celebratory mood on Tuesday, delivering a speech with upbeat music, as well as handshakes with major labour leaders, whom Mr Cuomo honoured with plaques to recognise the sacrifice of essential workers during the pandemic. He did not take questions from reporters.\"Remember June 15,” Mr Cuomo said, noting that was also the birthday of his father, Govenor Mario Cuomo, whom the younger Mr Cuomo often invokes. “It is the day that New York rose again.”New York Mayor Bill de Blasio on Tuesday announced that the city would hold a parade on July 7 to honour front line and essential workers.On Independence Day on July 4, President Joe Biden will host a 1,000-person gathering on the South Lawn of the White House to celebrate the country’s continued return to normalcy.Some public health experts, however, have expressed concerns about a fuller reopening as the pace of vaccinations has slowed substantially in recent weeks, and they said it was critical to increase the vaccination rate before autumn, when more people are indoors.“My worry is whether this will erode the momentum of getting more people vaccinated,” said Dr Wafaa El-Sadr, a professor of epidemiology and medicine at Columbia Mailman School of Public Health. “I worry people are going to think this is behind us.”Others, however, said abandoning restrictions was merited, given the improving infection and hospitalisation rate, and, most important, the number of people who have been vaccinated.Dr Kitaw Demissie, dean of the School of Public Health at SUNY Downstate Medical Centre in Brooklyn, said reaching a 70 per cent vaccination rate represented a real public health success.“Seventy per cent is really good in my opinion,” he said, estimating that at least another 10 per cent of people in New York City had immunity from prior infection. “So that will take us probably to 80 per cent or 85 per cent immunity.”Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/united-states/us-tops-600000-covid-deaths-new-york-and-california-drop-curbs", "Source": "google"}