{"Type": "Asia", "Time": "2021-06-16", "Headline": "'Good idea': Philippines' Duterte mulls vice presidential bid", "Text": "MANILA: Philippine President Rodrigo Duterte said on Wednesday (Jun 16) that a run for vice president in next year's elections was a \"good idea\" because he has unfinished business, including solving the country's drug problem.Duterte, who is barred by the constitution from seeking re-election, will end his six-year term in June 2022, but his party was encouraging him to run again for office, as vice president.\"There are a lot of people pushing me to run for vice president. It is a good idea, particularly if we talk about the drug problem,\" Duterte said in a speech.\"I am scared for the next generation.\"His remarks came a day after a prosecutor of theInternational Criminal Court(ICC) announced that permission had been sought for a formal investigation into thousands of killings in a war on drugs waged by Duterte since 2016.Presidential spokesperson Harry Roque said that Duterte would not cooperate with the ICC because the Philippines had withdrawn its membership.The ICC's Rome Statute, however, gives it jurisdiction with crimes committed while a country was a member.Rumours have swirled that Duterte might try to stay in power by endorsing a presidential bid by his top aide and incumbent senator Christopher \"Bong\" Go while contesting the separate vice presidential election.Opinion polls show that Duterte remains hugely popular in the Philippines, despite the huge drugs war death toll.But Duterte on Wednesday said that he had made a promise to an ally, Congressman Martin Romualdez, the nephew of former first lady Imelda Marcos, that he would support him should he decide to run for vice president.\"If Romualdez runs, I am out. If he doesn't, I am out, maybe,\" Duterte said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Philippines,Rodrigo Duterte", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/philippines-duterte-mulls-vice-presidential-bid-15027146", "Source": "google"}