{"Type": "World", "Time": "2021-06-16", "Headline": "Republicans introduce Bill to fire Fauci, face of US COVID-19 response", "Text": "WASHINGTON: Several Republican lawmakers, eager to blame a US government official for the response to the COVID-19 pandemic, introduced a Bill on Tuesday (Jun 15) to fire Anthony Fauci, the face of American efforts to combat COVID-19.Congresswoman Marjorie Taylor Greene led a handful of colleagues in announcing the so-called Fire Fauci Act, which would reduce the famed infectious disease expert's government salary to zero and require the Senate to confirm someone to fill his position.Fauci, who has advised seven US presidents, had become a trusted figure in the government's COVID-19 response, beginning with his work during Donald Trump's administration.But conservatives have taken aim at his performance, accusing him of misleading Americans and providing contradictory advice on masks and social distancing.\"Dr Fauci was not elected by the American people. He was not chosen to guide our economy. He was not chosen to rule over parents and their children's education,\" Greene told reporters.\"But yet Dr Fauci very much controlled our lives for the past year.\"The Bill is not expected to receive a floor vote in the Democratically-controlled House.Greene, whose extremist statements have made her a controversial figure in Congress, pointed to a series of Fauci emails that Republicans seized on to argue that he misled Americans and initially dismissed the idea that COVID-19 may have originated in a Chinese laboratory.\"It's time to fire Dr Anthony Fauci and give answers to the American people,\" she said.The White House defended Fauci this month after the emails surfaced, calling him \"an undeniable asset\" in the pandemic response.Greene also aimed a fiery accusation at China, voicing suspicion that a Wuhan laboratory was seeking to weaponise the virus.\"Why would there ever be viruses created, taken out of nature, that can be shared and passed among bats or other creatures, and then harnessed and changed into some sort of virus that can be spread among people? There's a word for that: It's called bioweapon,\" she said.\"Were we all victims of a bioweapon? We demand answers.\"China also must be held accountable, she said, noting the Wuhan Institute of Virology's \"gain-of-function\" research, in which scientists increase the strength of a virus to better study its effects on hosts.This week the Chinese scientist at the center of theories that the pandemic originated with a leak from her specialised Wuhan lab denied her institution was to blame for the health disaster.\"How on earth can I offer up evidence for something where there is no evidence?\" Dr Shi Zhengli told The New York Times.Another fire Fauci sponsor, congressman Mo Brooks, expressed support for Greene's bioweapons theory, saying a country would only make a virus more contagious for \"militarisation purposes\".Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Anthony Fauci,COVID-19,United States", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/republicans-anthony-fauci-fire-covid-19-response-15023596", "Source": "google"}