{"Type": "", "Time": "2021-06-16", "Headline": "China’s Campaign to Control Commodities Goes Into Overdrive - Bloomberg", "Text": "Workers at a metal stock yard in Shanghai on June 7. The run up in commodities prices has fanned concerns in China that factories will eventually need to pass on higher costs to consumers, hurting the economy. China has stepped up its campaign to rein in commodity prices and reduce speculation in a bid to ease the threat to its pandemic rebound from soaring raw material costs.State-owned enterprises were ordered to control risks and limit their exposure to overseas commodities markets by the State-owned Assets Supervision and Administration Commission, according to people with knowledge of the matter. The companies have been asked to report their futures positions for Sasac to review, said the people, who asked not to be identified because the information is confidential.In a second development, the National Food and Strategic Reserves Administration will soon release state stockpiles of metals including copper, aluminum and zinc, the agency said in a statement Wednesday. The metals will be sold in batches to fabricators and manufacturers, it said, without giving the volumes to be released.Metals prices in London and Shanghai fell, as did the Singapore Exchange’s iron ore contract. Shares of metals companies in China and Hong Kong declined, while Australia’s metals and mining sub-index posted its biggest loss in almost a month. European stocks fell too, with Rio Tinto Plc, BHP Group and ArcelorMittal SA losing at least 0.8%.“We haven’t seen the country release state reserves for years,” said Jia Zheng, a commodity trader with Shanghai Dongwu Jiuying Investment Management Co. “This will boost short-term supply, sending a bearish signal to the market.”The scrutiny on overseas commodities positions, meanwhile, is aimed at “curbing excessive speculation as prices are overheated and could bring risks to SOEs,” said Jia.The run up in commodities prices has fanned concerns in China that factories will eventually need to pass on higher costs to consumers, hurting the economy. The role of speculators has drawn particular scrutiny from authorities.Read more: China Targets ‘Speculators and Hoarders’ to Stop Commodity BoomWhile China has accelerated its efforts to curb inflationary pressures, the moves have had mixed results. Chinese Premier Li Keqiang stepped up the rhetoric on May 12, urging the country to deal with soaring prices. Iron ore slumped in the latter part of May following his comments, though it’s since rebounded, and base metals prices remain much higher than last year despite a recent retreat.Goldman Sachs Group Inc. said last month the country’s efforts are likely to be in vain as China is no longer the buyer dictating pricing, with the price dip a clear buying opportunity.Read more: Tracking China’s Campaign to Rein In Sky-High Commodity PricesChina doesn’t publish information about the volumes it holds in its state reserves, but the government quietly sets aside commodities as a way of insulating from future price spikes. The material can be released in emergencies, such as previous instances of selling pork to cool inflation concerns due to a shortage of the staple meat.This would be the first publicly announced release of copper from China’s state stockpiles since 2005, when Beijing sought to damp local prices after wrong-way bets by a government trader. Reserves of aluminum and zinc were also sold in 2010. The lack of detail on volumes set to be released this time means it’s uncertain how effective the move will be in taming prices.It’s also unclear what could have triggered Sasac’s latest order on overseas positions. The regulator hasn’t ruled out further measures, including those that target specific companies under its control, the people said. A fax to Sasac seeking comment didn’t receive a reply.The government had already asked domestic firms, including steel mills, commodities merchants and brokerages, to reduce bullish bets on local futures markets for highly volatile raw materials like iron ore and coal.The expansion of oversight suggests Beijing is now seeking to exert a measure of control over the international benchmarks that influence commodities prices in China, as well as deterring speculation more generally among state-owned companies.— With assistance by Jason Rogers, Winnie Zhu, Alfred Cang, James Thornhill, and James Poole", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-16/china-orders-state-firms-to-curb-overseas-commodities-exposure", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}