{"Type": "", "Time": "2021-06-16", "Headline": "2 firefighters taken to hospital after extinguishing fire that broke out at Tanjong Pagar shophouse", "Text": "This story was submitted via Web contribution form.This story was submitted via Web contribution form.Two firefighters were taken to hospital after a fire broke out at 31 Teo Hong Road in Tanjong Pagar on Tuesday morning (June 15).Stomper Justin alerted Stomp to the fire and shared videos he took of smoke rising from a shophouse.The Singapore Civil Defence Force (SCDF) said in a Facebook statement that upon arrival, thick smoke was coming from the building.[Fire @ No. 31 Teo Hong Road] At about 11.15am, SCDF was alerted to a fire at the aforementioned address. Upon SCDF's...Posted by Singapore Civil Defence Force on Tuesday, June 15, 2021Firefighters were equipped with breathing apparatus sets before proceeding into the smoke-logged shophouse.\"The fire at the ceiling on the third floor and the attic of the shophouse was extinguished with three water jets at about 1.15pm,\" SCDF said. \"Two career firefighters were conducting firefighting operations on the third floor when segments of the ceiling fell onto them.\"Both firefighters who were in full personal protective equipment (PPE) including helmets, were immediately evacuated. \"They were assessed by an SCDF paramedic. \"One of the firefighters was conscious when conveyed to Singapore General Hospital while the other firefighter was treated at the site for minor scratches.\"Another firefighter, a Full-Time National Serviceman (NSF), experienced heat exhaustion and was conveyed to Singapore General Hospital.\"A Combined Platform Ladder was also deployed to conduct aerial firefighting.The occupants from the shophouse had self-evacuated prior to SCDF's arrival while about 20 other occupants from neighbouring units were evacuated by SCDF as a precautionary measure.Damping down operations are ongoing and the cause of the fire is under investigation.Get more of Stomp's latest updates by following us on Facebook, WhatsApp, Twitter, Instagram and YouTube.View the discussion thread.View the discussion thread.Download the new STOMP app today.SPH Digital News | The Straits TimesAll rights reserved | Terms & Conditions | Data Protection Policy | Advertise with usSPH Digital News / STOMP / Copyright (c) 2019 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E.", "Section": "", "Writers": "", "URL": "https://stomp.straitstimes.com/singapore-seen/2-firefighters-taken-to-hospital-after-extinguishing-fire-that-broke-out-at-tanjong", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}