{"Type": "", "Time": "2021-06-16", "Headline": "Ronaldo breaks Euro goalscoring record as Portugal beat Hungary", "Text": "Cristiano Ronaldo netted a double to become the European Championship's all-time leading scorer as Portugal struck three times late on to beat a stubborn Hungary 3-0 in their Euro 2020 opener at a packed Puskas Arena on Tuesday.The holders, who appear to have a much stronger squad than when they won their first major title five years ago, laboured for long periods in Budapest.But Raphael Guerreiro made the vital breakthrough in the 84th minute and Ronaldo slammed in a penalty shortly afterwards before tapping home in injury time.\"It was essential to start on the right foot in order to gain confidence,\" said Ronaldo. \"Now, we have to continue and win the next game.\"The Juventus striker has now scored 11 goals in the tournament, two more than French great Michel Platini, who netted nine times when he led France to glory in 1984.The 36-year-old is also just three goals away from matching Iranian Ali Daei's all-time international scoring record of 109.\"It was a difficult game, against an opponent who defended very well during 90 minutes, but we scored three goals, and I am very grateful to the team for helping me to score two goals,\" he added.Ronaldo chose by far the biggest crowd of the tournament to break the record in front of, with Budapest the only Euro 2020 venue not to limit fan capacity due to Covid-19.The Puskas Arena has a capacity of almost 68,000 fans.\"We didn't deserve a 3-0 defeat, with a bit of luck it could have been a point each, but it was an experience of a lifetime,\" said Hungary goalkeeper Peter Gulacsi.World Cup winners France and three-time European champions Germany meet in the other Group F game later in the day at Munich's Allianz Arena.Portugal coach Fernando Santos opted to play Liverpool forward Diogo Jota and Bernardo Silva alongside Ronaldo, with Joao Felix left on the bench.It almost paid instant dividends, as Jota forced Gulacsi into a smart save with a left-footed drive in the fourth minute, although he perhaps should have squared the ball for an unmarked Ronaldo.The Portuguese talisman created an opportunity for Bernardo Silva in the 28th minute by winning the ball back high up the pitch, only for the Manchester City winger to delay his shot too long and see the opening snuffed out by an excellent tackle from Hungary centre-back Willi Orban.Hungary offered very little from open play, although they sent Portugal a warning shortly before half-time when Adam Szalai headed a free-kick too close to Rui Patricio.- Ronaldo misses glorious chance -The best chance of the opening period fell to Ronaldo in the 44th minute, only for the Portugal captain to plant the ball over from six yards out after meeting Guerreiro's low cross.Portugal came out of the blocks quickly after the break, knowing failure to win would put them in trouble in such a difficult group, with Pepe seeing a downward header well saved by the stretching Gulacsi.Santos' men continued to press despite Hungary growing in confidence, with Bruno Fernandes drawing Gulacsi into another fine stop with a dipping strike from long range.Despite having Felix, in-form Eintracht Frankfurt striker Andre Silva and Pedro Goncalves, last season's top scorer in the Portuguese league, on the bench, Santos waited until the 71st minute to make a change, sending on Rafa Silva for Bernardo Silva.Hungary thought they had snatched a shock lead through substitute Szabolcs Schon, but he was denied by the offside flag.Rafa Silva played a key role in the opening goal, though, as his deflected cross was met by Guerreiro, whose shot also took a huge deflection and dribbled agonisingly into the corner of the Hungarian net.The home side's resistance was totally over three minutes later, as Orban pulled back Rafa Silva clean through on goal.Ronaldo made no mistake, sending Gulacsi the wrong way to add another record to his collection on the day he became the first player in history to play at five European Championships.There was more to come from Ronaldo, as he danced through after a one-two with Rafa Silva and rolled in his 106th goal for Portugal.jc/asPremier League champions Manchester City will start the defence of their title away to Tottenham after the fixtures for the 2021-22 season were unveiled on Wednesday.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neMeet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Alibaba Group was the victim of a months-long web-scraping operation by a marketing consultant that siphoned up sensitive data including usernames and phone numbers.It's useful to be ready with the names of a few companies you'll scoop up in case a crash occurs. The post 3 Stocks I Will Buy If the Market Crashes Tomorrow appeared first on The Smart Investor.Sentosa isn’t expensive as you think it is. Here’s everything you need to know about the island’s entrance fees cost, car park rates, beach reservations and hacks on how to save. Thanks to COVID-19, plans to travel overseas for a well-deserved holiday is starting to […] The post Sentosa Island: Entrance Fee And Parking Rates appeared first on SingSaver Blog - We Compare, You Save.Learn more about scalp psoriasis. Look for scalp psoriasis treatments.Kevin Durant finished with 49 points while playing every minute of the game as the Brooklyn Nets rallied from a 17-point deficit to beat the Milwaukee Bucks 114-108 in game five of their NBA playoff series on Tuesday.Turkish President Recep Tayyip Erdogan on Tuesday pledged support for Azerbaijan if the ex-Soviet country was attacked, as he made a visit to the disputed Nagorno-Karabakh region.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Research best security system. Protect yourself and your home with wireless alarm systems.If you’re wondering whether Ethereum is a good long term investment, keep reading.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aThe largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.Find furniture you love, at prices that fit your budget with flexible financing.The League of Legends: Wild Rift esports scene will be kicking into full gear this 19 June with the League of Legends: Wild Rift 2021 SEA Icon Series Summer Super Cup.A sinking fire-damaged container ship could take months to salvage because of rough monsoon seas, Sri Lanka said Tuesday, as authorities investigated whether the deaths of dozens of turtles and dolphins were caused by the disaster.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.Sick of seeing others get rich in the stock market? Have you heard of Everlasting Stocks?US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.The inflation outlook among Americans is at its highest level ever, while many are upbeat about their employment situation, a New York Federal Reserve survey released Monday said.The report covering May showed one-year inflation expectations jumped 0.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).The Russian skipper of a container ship that caught fire and burned for almost two weeks before sinking off Sri Lanka's coast has been arrested and is expected to be charged with marine pollution, police said Monday.US carrier Southwest Airlines was ramping operations back up Tuesday after canceling some 500 flights following a second major outage in 24 hours due to computer issues.The emergence of problems in a new-generation nuclear reactor in China threatens to undermine efforts by its French designer to sell it elsewhere, and could hurt Beijing's nuclear industry, analysts said.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/ronaldo-breaks-euro-goalscoring-record-180720956.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}