{"Type": "", "Time": "2021-06-16", "Headline": "Do something useful with your time: Michelle Chia hits back at netizen accusing her of breaching Covid-19 rules, Entertainment News - AsiaOne", "Text": "For many people, the Covid-19 restrictions on social gatherings mean they're not able to spend time with friends. But some might meet each other secretly in hopes of not getting caught. We've seen that before in the birthday gathering involving local celebrities Terence Cao, Jeffrey Xu, and Shane Pow late last year.Recently, a netizen came across what seemed to them like a similar gathering of local celebrities and decided to call them out for it. The netizen had come across a five-person gathering, which included local celebrities Michelle Chia, Pornsak, and celebrity hairstylist Addy Lee.The get-together happened on Sunday (June 13), and Pornsak posted a video of it on his Instagram Story. The video shows five people sitting around a table, enjoying a meal together.Given that the quota for social gatherings and home visits were two pax at that time, the netizen in question attempted to expose them all by reposting Pornsak's video along with the caption: \"Why 23 hours ago they can have more than 5 pax gathering? [sic]\"Michelle did not take too kindly to this accusation and the 45-year-old went onto her personal Instagram account in response. \"Because only Pornsak and I were guests. The rest are residents of the unit. Thank you for your 'kind concern',\" she jabbed.ALSO READ: Zoe Tay gifts bras to local female celebs and this is Stefanie Sun's replySo, there was no breaching of the law after all. Not long after, Michelle followed up with another post, this time, in Mandarin. “If you’re free, then do something useful with your time. If you want to stir up trouble, you should be clear of the circumstances first. If not, you're the one who ends up looking like a fool,\" she stated.\"But if this is how you find your own happiness, then we’ll treat it as if we’re doing a good deed, and give you happiness. Wishing you a delightful life!”Ouch, Michelle is certainly not one to mince her words.The moral of the story here? Let's not jump the gun and be too quick to accuse others of wrongdoings, shall we?ALSO READ: Addy Lee, Pornsak and Michelle Chia start livestream on Facebook to sell anything from pet perfume to million-dollar homesamierul@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/entertainment/do-something-useful-your-time-michelle-chia-hits-back-netizen-accusing-her-breaching", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}