{"Type": "", "Time": "2021-06-16", "Headline": "Actress Xiang Yun looks back on 40 years in show business, Entertainment News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Veteran actress Xiang Yun is celebrating 40 years in show business with a look back at her career.In the latest bite-sized episode of Mediacorp series #justswipelah, she touched on how she got started.\"I wanted to act. I liked to act,\" the 59-year-old said in the nine-minute clip. \"My dad went to a fortune teller when I was young, who said I'd become an actress. Who would have thought I would go on to do it for 40 years. Time passes too quickly.\"Now one of the most respected actresses in Mediacorp, she was one of the first drama trainees at the television station, then known as Singapore Broadcasting Corporation, in 1981.Her first lead role in a drama was in All That Glitters Is Not Gold in 1983, but it was period drama The Awakening the following year that made her a household name, together with co-star Huang Wenyong.When asked who was her most memorable screen partner, she unhesitatingly said: \"Of course, it is my long-time screen partner, Huang Wenyong.\"Huang died in 2013 of lymphoma at the age of 60.\"I'll never forget him because we went through many hardships together. In life, to have someone who shares the same frequency as you, that's very rare.\"It was also through acting that she met her husband, Edmund Chen, 60, who has since retired from acting.\"Like many others, I didn't want to find my other half at my workplace. But when we filmed Patrol together, he was so passionate that I surrendered to him,\" she said with a laugh.Patrol, a police drama, aired in 1989 and they swiftly married the same year.Touching tributes from fellow actors such as Pierre Png, Felicia Chin and Romeo Tan, as well as her husband and two children, who followed in her footsteps to become actors, made her tear up a few times.Those who have worked with her praised her professionalism and positive attitude, as well as her motherly nature.However, the funniest snippet came from actor-host Bryan Wong, who revealed his nickname for her.She wanted a less old-fashioned English name than Roslyn, which an aunt had given her, so he came up with a very modern one, playing on the word \"yun\", which means cloud.\"He said 'iCloud' and he and Wenyong laughed like crazy,\" she said. \"He was so pleased with himself.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/life/entertainment/actress-xiang-yun-looks-back-on-40-years-in-show-business", "Source": "google"}