{"Type": "", "Time": "2021-06-16", "Headline": "Former Supreme Court judge Goh Joon Seng dies, aged 86, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Former Supreme Court judge Goh Joon Seng, who had served on Singapore's Council of Presidential Advisers (CPA) for more than a decade, died of cancer on Tuesday afternoon (June 15).He was 86, and is survived by his wife and two sons.Born in China, Mr Goh was first admitted as a lawyer here in 1963, and his practice as senior partner at Goh Poh & Partners consisted mainly of insurance and building cases. He was appointed a Supreme Court judge in October 1990.He had read law at the then University of Singapore. He attended Holy Innocent's English School from 1948 to 1953 - it was renamed Montfort School in 1958.During his time on the bench, he built up a strong reputation for his decisions and mediation skills, and was well-liked by lawyers for his gentle and courteous manner.After retiring as a judge, Mr Goh became a consultant to law firm Lee and Lee and also continued to serve the public in various capacities.For instance, he was tasked with chairing the three-member Commission of Inquiry set up to investigate the escape of Jemaah Islamiah terrorist Mas Selamat Kastari from the Whitley Road Detention Centre in 2008.He had also played an instrumental role as the founding chairman of numerous mediation bodies here, including the Singapore Mediation Centre (SMC), the Singapore Chamber of Maritime Arbitration (SCMA) as well as the former Consumer Mediation Unit (CMU), which handled customer complaints that banks are unable to resolve on their own.Described by former Chief Justice Chan Sek Keong as an \"approachable, friendly and unassuming judge who is Mr Affability himself\", Mr Goh was appointed the chairman of the SMC when it was launched in 1997 to resolve disputes through mediation. He played a key role in overseeing the growth and development of mediation services in Singapore until he stepped down from the position in 2003.Justice Belinda Ang Saw Ean, who is SMC's chair, said Singapore owes a lot of its reputation as a centre for mediation to Mr Goh.\"What was once a little-known form of dispute resolution has become established thanks to his guidance and stewardship... Those who knew him will remember that he was a gentleman through and through.\"He was also founding chairman of the Financial Industry Disputes Resolution Centre (Fidrec) from 2005 to 2017, which was set up to sort out disputes between consumers and institutions and incorporates the CMU and the Insurance Disputes Resolution Organisation (Idro).During his time at Fidrec, Mr Goh oversaw the resolution of complaints related to investments that unravelled after United States investment bank Lehman Brothers went belly up in 2008.He was also a member of the Council of Presidential Advisers from 2008 to April this year, and had chaired the Presidential Council for Religious Harmony from 2005 to 2017.For his contributions, he was awarded the Public Service Star in the 2006 National Day Awards, as well as the Meritorious Service Medal in 2016.President Halimah Yacob on Tuesday said Mr Goh made many valuable contributions as a member of the CPA. \"He was meticulous and known for his attention to details, and was often counted upon to provide the legal perspective to the issues at hand,\" she said.She added that Mr Goh’s tenure in the CPA also coincided with a period when Singapore’s reserves protection framework was put to the test, first during the global financial crisis in 2008 and then most recently during the Covid-19 pandemic.\"On both occasions, Mr Goh and the CPA provided wise counsel on the proposals to draw upon our past reserves to manage the crises.\"Chief Justice Sundaresh Menon also said on Tuesday that Mr Goh was a greatly respected judge who was admired and liked in equal measure by those who served with him and those who appeared before him.\"This was a time of much change in the profession, and many at the Bar will remember it as a challenging period. Joon Seng did his part in implementing the many reforms of the time, but always with kindness, and he came to be known to many of us as the gentle face of justice.\"In a statement, Home Affairs and Law Minister K. Shanmugam said that Mr Goh was a very committed volunteer with the Volunteer Special Constabulary (VSC), where he served for 23 years, including two years as its commander. The VSC was formed immediately after World War II, in 1946, to assist regular police officers.\"He was a wonderful person, and had great judicial temperament. It was always a pleasure to appear in his court. He was very kind to counsel, was patient, had a keen sense of right and wrong... His passing is a considerable loss for Singapore,\" said Mr Shanmugam.Minister for Culture, Community and Youth and Second Minister for Law Edwin Tong said that Mr Goh had left a lasting impression on him when he was a young lawyer and appeared before him in several of his early cases.\"I learnt a lot from him, from always being on top of each case, the way he reasoned the cases before him to the empathy he showed to the accused persons and their families. He was someone with a strong head and a generous heart, and mixed them both to find the balance of justice,\" said Mr Tong.He added that Mr Goh also struck him as someone who always had Singapore's interests at heart. When their paths crossed after he took office at the Ministry of Law, and when Mr Goh was SCMA chairman, Mr Goh also discussed several key questions with him, including how jobs can be created for Singaporeans, and how Singapore can be positioned as a maritime and dispute resolution hub.Senior Judge Chao Hick Tin, chairman of SCMA, said Mr Goh had played an instrumental role in SCMA's growth as its founding chairman from 2009 to 2019.\"It is because of his outstanding leadership, dedication, and contributions that SCMA has made remarkable progress since its inception in 2009,\" said Justice Chao.The Montfort School and Montfort Alumni Association added that Mr Goh actively participated in alumni activities and supported school fund-raisers, and even lent his legal skills to writing the alumni’s Constitution.Holland-Bukit Timah GRC MP Christopher de Souza, a partner at Lee and Lee, said Mr Goh was a role model to many lawyers in the firm.\"Mr Goh had a brilliant legal mind and a kind countenance... He would freely share his deep knowledge and insights into legal cases whenever we approached him. His values of diligence and stewardship will remain with the firm, and its lawyers, for a long time. We deeply mourn his passing.\"The funeral will be held next Monday (June 21).Correction note: An earlier version of this article had used a picture which wrongly identified Justice Tay Yong Kwang as Mr Goh Joon Seng. We are sorry for the error.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/former-supreme-court-judge-goh-joon-seng-dies-aged-86", "Source": "google"}