{"Type": "", "Time": "2021-06-16", "Headline": "North Korea defector says 'even North Korea is not this nuts' after attending Ivy League university: 'Complete chaos'", "Text": "A North Korean defector is claiming that the United States’s future \"is as bleak as North Korea\" after she attended an Ivy League university.\"Even North Korea is not this nuts,\" North Korean defector Yeonmi Park said of her experience at Columbia University. \"North Korea was pretty crazy, but not this crazy.\"The 27-year-old Park said she transferred to Columbia from a South Korean university in 2016, but her experience at the school left her disturbed.\"I expected that I was paying this fortune, all this time and energy, to learn how to think. But they are forcing you to think the way they want you to think,\" Park said. \"I realized, wow, this is insane. I thought America was different, but I saw so many similarities to what I saw in North Korea that I started worrying.\"STUDENT GOVERNMENT RECUSES PRESIDENTIAL SEARCH COMMITTEE MEMBER BECAUSE OF HIS CONSERVATIVE VIEWSOne such similarity Park noticed was an anti-Western sentiment, but she also noted that other red flags, such as collective guilt and extreme political correctness, were also pervasive at the school.In one instance, Park said she was “scolded” by a staff member for saying she enjoyed classic literature such as Jane Austen.\"I said, ‘I love those books.’ I thought it was a good thing,\" Park said. \"Then, she was like, 'Did you know that those writers, who had a colonial mindset, were racists and bigots who wrote those books? So they are subconsciously brainwashing you.'\"Park noted that such incidents were not isolated, as every class she took at the school contained the kind of anti-American propaganda she had grown up with as a young student in North Korea.\"’American bastard' was one word for North Koreans,” Park said she was taught growing up. \"The math problems would say, 'There are four American bastards, you kill two of them, how many American bastards are left to kill?'\"The North Korean defector was also confused about issues related to gender and language, recalling how every class would require students to tell the class their preferred pronouns.\"English is my third language. I learned it as an adult. I sometimes [still] say 'he' or 'she' by mistake, and now they are going to ask me to call them 'they'? How the heck do I incorporate that in my sentences?\" Park asked.\"It was chaos,\" Park continued. \"It felt like the regression in civilization.\"Park said she used to engage professors and fellow students in debates and arguments but learned quickly “how to just shut up\" so she could maintain her grades and GPA.She noted that as she was growing up in North Korea, she had no concept of love and liberty. Park took aim at students who told stories of being oppressed, arguing they did not know what real oppression looks like.\"Because I have seen oppression, I know what it looks like,\" Park said, noting she had seen 13 people die of starvation.\"These kids keep saying how they’re oppressed, how much injustice they've experienced ... They don't know how hard it is to be free,\" she continued. \"I literally crossed through the middle of the Gobi Desert to be free. But what I did was nothing, so many people fought harder than me and didn't make it.\"Park and her mother originally fled North Korea when she was 13 years old, attempting to cross China’s frozen Yalu River when they were caught by human traffickers who sold them into slavery. Park was sold for less than $300, while her mother was sold for about $100.Christian missionaries later helped Park and her mother flee Mongolia, after which they made the trek across the Gobi Desert to reach South Korea.Park published a memoir in 2015, titled In Order to Live, in which she describes her ordeal fleeing from one of the most oppressive regimes in the world.\"The people here are just dying to give their rights and power to the government. That is what scares me the most,\" Park said.She believes America’s educational institutions are now stripping their students of the ability to think critically, something she compared to her educational experiences in North Korea.\"In North Korea, I literally believed that my dear leader [Kim Jong Un] was starving,\" Park said. \"He's the fattest guy — how can anyone believe that? And then, somebody showed me a photo and said, 'Look at him, he's the fattest guy. Other people are all thin.' And I was like, 'Oh my God, why did I not notice that he was fat?' Because I never learned how to think critically.\"\"That is what is happening in America,\" she continued. \"People see things, but still they've just completely lost the ability to think critically.\"Park pointed out that she did not grow up with the wealth of information Americans have access to on the internet, yet argued even with such access, Americans now “choose to be brainwashed.”\"North Koreans, we don't have internet, we don't have access to any of these great thinkers, we don't know anything. But here, while having everything, people choose to be brainwashed. And they deny it,” Park said.While she at one time had high hopes and expectations for life in the U.S., Park now says her experiences have left her worried about the country’s future.\"You guys have lost common sense to [a] degree that I as a North Korean cannot even comprehend,\" Park said.CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\"Where are we going from here?\" she asked. \"There’s no rule of law, no morality, nothing is good and bad anymore, it's complete chaos.\"\"I guess that's what they want. Eventually, they want to destroy every single thing and then rebuild into a communist paradise maybe,” she concluded.Washington Examiner VideosTags: News, Critical Race Theory, Columbia University, North Korea, College, Kim Jong UnOriginal Author: Michael LeeOriginal Location: North Korea defector says 'even North Korea is not this nuts' after attending Ivy League university: 'Complete chaos' Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neAlibaba Group was the victim of a months-long web-scraping operation by a marketing consultant that siphoned up sensitive data including usernames and phone numbers.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Sentosa isn’t expensive as you think it is. Here’s everything you need to know about the island’s entrance fees cost, car park rates, beach reservations and hacks on how to save. Thanks to COVID-19, plans to travel overseas for a well-deserved holiday is starting to […] The post Sentosa Island: Entrance Fee And Parking Rates appeared first on SingSaver Blog - We Compare, You Save.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Learn more about scalp psoriasis. Look for scalp psoriasis treatments.Turkish President Recep Tayyip Erdogan on Tuesday pledged support for Azerbaijan if the ex-Soviet country was attacked, as he made a visit to the disputed Nagorno-Karabakh region.The League of Legends: Wild Rift esports scene will be kicking into full gear this 19 June with the League of Legends: Wild Rift 2021 SEA Icon Series Summer Super Cup.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aFind furniture you love, at prices that fit your budget with flexible financing.It's useful to be ready with the names of a few companies you'll scoop up in case a crash occurs. The post 3 Stocks I Will Buy If the Market Crashes Tomorrow appeared first on The Smart Investor.The Russian skipper of a container ship that caught fire and burned for almost two weeks before sinking off Sri Lanka's coast has been arrested and is expected to be charged with marine pollution, police said Monday.Kevin Durant finished with 49 points while playing every minute of the game as the Brooklyn Nets rallied from a 17-point deficit to beat the Milwaukee Bucks 114-108 in game five of their NBA playoff series on Tuesday.Sick of seeing others get rich in the stock market? Have you heard of Everlasting Stocks?The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.If you’re wondering whether Ethereum is a good long term investment, keep reading.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).A sinking fire-damaged container ship could take months to salvage because of rough monsoon seas, Sri Lanka said Tuesday, as authorities investigated whether the deaths of dozens of turtles and dolphins were caused by the disaster.Cristiano Ronaldo netted a double to become the European Championship's all-time leading scorer as Portugal struck three times late on to beat a stubborn Hungary 3-0 in their Euro 2020 opener at a packed Puskas Arena on Tuesday.The inflation outlook among Americans is at its highest level ever, while many are upbeat about their employment situation, a New York Federal Reserve survey released Monday said.The report covering May showed one-year inflation expectations jumped 0.This new car cloth can easily remove all the car scratches and dents from your car.Japan has requested consolations with China at the World Trade Organization (WTO) over anti-dumping duties that have been placed on its stainless steel products since July 2019, the Geneva-based body confirmed on Tuesday. The request, which was circulated to WTO members on Tuesday after having been submitted on Friday, claims the measures imposed on steel billets, hot-rolled coils and hot-rolled plates appear to be inconsistent with various provisions under the General Agreement on Tariffs and T* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.With Afghan troops in retreat and soon to lose vital American air support, Taliban commanders are voicing exuberance about quickly seizing full control of the country and re-establishing their version of an Islamic state.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/north-korea-defector-says-even-211100779.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}