{"Type": "", "Time": "2021-06-16", "Headline": "China to launch manned Shenzhou-12 spacecraft on Thursday - CGTN", "Text": " Share CopiedChina will launch its Shenzhou-12 spacecraft, carrying astronauts Nie Haisheng, Liu Boming and Tang Hongbo at 9:22 a.m. on Thursday, the China Manned Space Engineering Office announced on Wednesday.Click here to review the press conference on the launch of China's manned spacecraft Shenzhou-12Currently at the launch pad at the Jiuquan Satellite Launch Center in northwest China, the Long March-2F Y12 rocket carrying the Shenzhou-12 spacecraft will be refueled with propellant this morning.Nie will serve as the commander of the flight crew. Three other astronauts, Zhai Zhigang, Wang Yaping and Ye Guangfu, make up the backup crew.Read more: Here are the first astronauts set to live in China's space stationThe Shenzhou-12 flight mission is the first manned space mission to take place during the construction of China's space station.It has multiple tasks, including technology verification in such areas as astronauts' long-term stay in orbit, space supply replenishment, extravehicular activities and operations, and in-orbit maintenance.It will also test for the first time the search and rescue of astronauts at the Dongfeng landing site, carry out multidisciplinary space applications and experiments, and comprehensively assess the functions and performance of each system performing the mission to further examine their compatibility and coordination.As scheduled, the Shenzhou-12 spaceship will, after orbital injection, conduct rendezvous and docking in fast automated mode on to the front port of the Tianhe core module to form a complex with the core module and the Tianzhou-2 cargo ship.The astronauts will then move into the core module and start working and living with a synchronized work and rest arrangement between space and ground. After staying for about three months in orbit, they will return to the Dongfeng landing site onboard the re-entry capsule.Currently, the complex of the Tianhe core module and Tianzhou-2 cargo ship is in stable condition with all equipment working normally and ready for rendezvous and docking of astronauts to move in. \"All the pre-launch preparations have also been basically completed,\" said Ji Qiming, assistant to the director of the office.9 flight missions ahead for space station constructionChina has planned 11 missions to complete the construction of its space station by the end of 2022, namely three launches of space station modules, four cargo vessel flights, and four manned missions.The recently launched Tianhe core module and the Tianzhou-2 cargo spacecraft have already formed a complex operating in orbit.The upcoming Shenzhou-12 mission boasts four features, said Ji.It will further verify the functions and performance of the manned space-to-Earth transportation system. The Shenzhou-12 manned spacecraft has such new capabilities as fast automated rendezvous and docking, radial rendezvous and docking, and 180-day in-orbit berthing. The return technology has been improved with better accuracy of the landing point, and the emergency rescue mode will be installed for the first time.During the three months' in-orbit stay of the crew members, various supporting technologies for long-term space flight will be assessed, such as regenerative environmental control and life support, space station supplies, and astronaut health management.The capabilities of astronauts to complete extravehicular activities and operations with robotic arms will also be evaluated, as they will, for the first time, carry out long-time activities outside the module for equipment installation, repair and maintenance.The landing site, which was changed from the Siziwang Banner in north China's Inner Mongolia Autonomous Region to the Dongfeng landing site, will activate the normalized emergency standby search and rescue mode for the first time.Read more: China Space Station: what will astronauts' living space look like?Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3", "Section": "", "Writers": "", "URL": "https://news.cgtn.com/news/2021-06-16/China-to-launch-Shenzhou-12-spacecraft-carrying-3-astronauts-on-Thu--118idk88wqQ/index.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}