{"Type": "", "Time": "2021-06-16", "Headline": "Japan to ship 1 million Covid-19 vaccines to Vietnam on June 16, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.TOKYO (REUTERS) - Japan will send one million Covid-19 vaccine doses to Vietnam, Foreign Minister Toshimitsu Motegi said on Tuesday (June 15), as Vietnam seeks to accelerate its vaccine procurement drive to tackle a more stubborn wave of infections.The shipment of AstraZeneca vaccines produced in Japan are due to arrive in Vietnam on Wednesday, Mr Motegi told reporters.Vietnam, with a population of around 98 million, has recorded a total of 10,241 coronavirus cases, with only 58 deaths, since the pandemic began.Japan is considering additional vaccine donations to Vietnam and Taiwan, and it is planning similar shipments to Indonesia, Malaysia, the Philippines and Thailand from early July, Mr Motegi added.Taiwan received 1.24 million AstraZeneca doses from Japan earlier this month to counter a resurgence of Covid-19 cases on the island. The Taiwanese government thanked Japan on Tuesday for mulling over additional aid.\"We will continue to maintain close communication with the Japanese side and look forward to the smooth arrival of the vaccines in Taiwan as soon as possible,\" Taiwan's Foreign Ministry said in a statement.Japan has pledged US$1 billion (S$1.3 billion) and 30 million doses to the Covax facility that provides vaccines to needy countries. But the shipments to Vietnam, Taiwan and other Asian neighbours are being made outside of Covax to speed up delivery, Mr Motegi said.\"If we go through an international organisation, the procedures in getting approval may take time,\" he said.Japan approved AstraZeneca's vaccine last month and has contracted to buy 120 million doses of it. But there are no immediate plans to use the shots domestically, amid lingering concerns raised internationally over blood clots.Taiwan has millions of doses on order worldwide but supply shortages have led to delays in receiving them, with just about 4 per cent of a population of 23.5 million having received at least one shot as it battles the spike.With just 132 new cases reported on Tuesday, the island is gradually bringing the domestic outbreak under control.“The overall trend seems to be heading in a better direction, but we still can’t relax,” Health Minister Chen Shih-chung said in Taipei, the capital.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/japan-to-ship-1-million-covid-19-vaccines-to-vietnam-on-june-16", "Source": "google"}