{"Type": "", "Time": "2021-06-16", "Headline": "Biden pushes US fighter jets in talks with Swiss, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.GENEVA (AFP) - US President Joe Biden sang the praises on Tuesday (June 15) of two US-made fighter jets in the running for a major contract to replace Switzerland's fleet, his Swiss counterpart said.\"Mr Biden recalled the excellent quality of the two US planes\" - the F35 made by Lockheed Martin and the F/A 18 made by Boeing, Swiss President Guy Parmelin told reporters after meeting with the US leader in Geneva.Biden is due to hold a summit with Russian President Vladimir Putin in the city on Wednesday.The two US fighters are competing against the Rafale, made by French company Dassault, and the Eurofighter by Airbus, to replace its ageing fleet of F-5 Tigers and F/A-18 Hornets - both US-made.\"I reminded him that we have a process under way, which was decided on long ago, and that the government will reach its decision based on the process currently under way,\" Parmelin said.According to Swiss media, a decision is expected on June 23 on who gets the contract, worth 6 billion Swiss francs (S$8.8 billion).Switzerland's long-standing position is one of armed neutrality and the landlocked European country has mandatory conscription for men.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/biden-pushes-us-fighter-jets-in-talks-with-swiss", "Source": "google"}