{"Type": "", "Time": "2021-06-16", "Headline": "Xiang Yun on Huang Wenyong, meeting husband Edmund Chen, cries after watching clips from celebs like Elvin Ng and Felicia Chin, Entertainment News - AsiaOne", "Text": "Xiang Yun is celebrating her 40th anniversary in showbiz and many of her colleagues are showering her with messages of encouragement.In fact, she was so touched that she even cried.On the Mediacorp series Just Swipe Lah, the 57-year-old talked about her illustrious career and she was also filmed watching video messages from various celebrities such as Elvin Ng, Felicia Chin, Jeffrey Xu, Zhang Yaodong, and Romeo Tan. Her two children with former actor Edmund Chen, Yixi and Yixin, recorded touching clips for her as well.[embed]https://www.youtube.com/watch?v=0qgsuY2x2YA&[/embed]Reflecting on her career, Xiang Yun said the beloved late actor Huang Wenyong was her most memorable screen partner. \"I'll never forget him because we went through many hardships together. In life, to have someone who shares the same frequency as you, that's very rare,\" she explained. When asked about meeting Edmund, she laughed: \"Like many others, I didn't want to find my other half in the same workplace. I didn't think that after filming Patrol with him, he would be so passionate. I was no match for him.\"Among the celebs who 'confessed' to her, first up was Elvin, 40, who said: \"Xiang Yun, I think you're really great... At every stage [of your career], you command respect and admiration. I can see that your condition is very good now. And I feel very reassured because you look healthier and more confident...\"I remember when we were filming Heart to Heart, your health and morale... perhaps you felt a little [like] things were not smooth-sailing for you.\"[[nid:532763]]Xiang Yun explained that the year she was filming the drama with Elvin, she was \"very busy\" and \"rushing here and there\".She added: \"It felt like I reached a dead end where I was thinking if I should leave showbiz. But luckily I have so many colleagues who love me. I should share my experience during this period with everyone. I also hope to motivate people to live life more positively.\"As for 36-year-old Felicia, the thing she likes most about Xiang Yun is her \"clear and motivating voice\" that she'll hear in the morning when the latter is greeting everyone.Felicia said: \"I really respect your drive and your professionalism. No words can compare.\"Xiang Yun described Felicia as a hardworking actress with a positive attitude.When watching the video, Xiang Yun dabbed her eyes with tissues as she said: \"Thank you, thank you. I'm very grateful, really. I've always been like this. I grew up in a hawker centre [and] when someone came over, we'll say 'Wah, we are so lucky today, it didn't rain'.[[nid:532799]]\"If everyone adopted this attitude as a habit, the world would be really wonderful.\"The breaking point came after Jeffrey's message. He described her as \"my older sister, mum, and my colleague\". The 32-year-old then said that Xiang Yun will \"always be our Ah Jie\" and thanked her for everything she has sacrificed for the industry.Xiang Yun replied: \"Aiyo, why are you making me cry every time? I can't stand it.\"In response to all of the concerned messages from fellow actors, she said: \"So they've been silently watching over me. We're not just colleagues who barely know each other.\"bryanlim@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/entertainment/xiang-yun-huang-wenyong-meeting-husband-edmund-chen-cries-after-watching-clips-celebs", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}