{"Type": "", "Time": "2021-06-16", "Headline": "Vaccine advisers not planning to back Covid jabs for children, says UK minister | Vaccines and immunisation | The Guardian", "Text": "Academics call for doses to go to people elsewhere in world before those in UK who are relatively safeFirst published on Wed 16 Jun 2021 06.21 EDTVaccination experts are not planning to recommend Covid-19 jabs for children, a cabinet minister has said, while prominent academics have suggested that existing doses should be used to immunise vulnerable people around the world before those in the UK who are relatively safe.Speaking for the government on Wednesday, Liz Truss, the international trade secretary, said she understood that the Joint Committee on Vaccination and Immunisation (JCVI) would not recommend the vaccination of under-18s.During an interview with BBC Breakfast, she added that the government would “look very closely at the JCVI’s recommendation” and would make clear its position in due course.The UK’s medicines regulator, the Medicines and Healthcare products Regulatory Agency (MHRA), has approved the Pfizer/BioNTech vaccine for use among children aged 12 and older in the UK. But officials have not yet confirmed whether the vaccination programme will be extended to children once the adult vaccine campaign is complete.Some academics have questioned the wisdom of giving vaccines to young children, who data suggests are relatively safe from the direct effects of Covid – particularly when more vulnerable people elsewhere in the world are without vaccines. Other people have suggested that vaccinating children could help prevent outbreaks in schools.Prof Calum Semple, a member of the government’s Scientific Advisory Group for Emergencies (Sage), said: “The risk of death [from Covid in children] is one in a million. That’s not a figure and plucking from the air, that’s a quantifiable risk.”The University of Liverpool professor of child health and outbreak medicine told BBC Radio 4’s Today programme: “We know in wave one and wave two put together there were 12 deaths in children – in England, Scotland, Wales and Ireland, put together – and that is rare because there are about 13 to 14 million children in the UK.“So, we’re talking about vaccinating children here mainly to protect public health and reduce transmission … So we’re now coming into a really interesting ethical and moral debate here about vaccinating children for the benefit of others.”Earlier this week, one of the scientists behind the Oxford/AstraZeneca jab said that since children were at “relatively low risk of serious infection”, the question then arose of when to vaccinate them.If you have been affected or have any information, we'd like to hear from you. You can get in touch by filling in the form below, anonymously if you \nwish or contact us via WhatsApp by clicking here or adding the contact +44(0)7766780300. Only the Guardian can see your contributions and one of our \njournalists may contact you to discuss further. You do not need to use your full nameTown or area is fineWe accept images and pdfs. Maximum total file size: 6MBWe accept images and pdfs. Maximum total file size: 6MBYour contact details are helpful so we can contact you for more information. They will only be seen by the Guardian.Your contact details are helpful so we can contact you for more information. They will only be seen by the Guardian.Prof Sir Andrew Pollard told the Today programme on Tuesday: “My view is that we really ought to be using those doses, at this moment, for people in low- and middle-income countries who are at the greatest risk of severe disease. [We should] consider the ‘when’ after the rest of the world’s most vulnerable have been protected.”This month school leaders called for pupils to be vaccinated as a matter of priority after UK regulators approved the Pfizer jab for 12- to 15-year-olds and data showed outbreaks of the Delta variant in schools throughout England.Teaching union and school leaders said starting a vaccination programme for teenagers soon could mean most secondary school pupils would receive two doses by the time the new term starts in September, minimising the risk of further disruption to their education.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/society/2021/jun/16/uk-minister-vaccine-advisers-not-planning-back-covid-jabs-children", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}