{"Type": "", "Time": "2021-06-16", "Headline": "UK COVID-19 Update: Long COVID Funding for GPs, 10 Pandemic Lessons Learned", "Text": "No ResultsNo ResultsTim LockeJune 15, 2021 \n\n  These are the UK coronavirus stories you need to know about today.GPs in England are getting around £30 million to help improve long COVID diagnosis and care.There's also additional funding for 15 new paediatric long COVID treatment and referral hubs.Some estimates suggest that 340,000 people may need long COVID support, including 68,000 who will need rehab or other specialist treatment.NHS England Chief Executive, Sir Simon Stevens told the NHS Confederation conference that the condition is \"one of the major health challenges emerging from the pandemic\".Wales is also investing in long COVID care through its new Adferiad (Recover) patient pathway programme.Professor Peter Saul, joint chair of RCGP Cymru Wales, said: \"The condition has required us all to learn and adapt quickly to support our patients.\"Primary care is at the forefront of long COVID care and this announcement will provide confidence that we will have the infrastructure, shared knowledge and data for GPs and their teams across Wales to respond to patients’ needs.\"Sir Simon also told the NHS Confederation conference:The NHS will have to \"gear up\" for new treatment categories, including neutralising monoclonal antibodies1% of hospital beds in England have patients with COVID-19 in them, 30% are occupied by people aged 65 and over, 70% by younger peopleAll adults in England should be able to book their COVID-19 jabs \"by the end of this week\"Vaccine supply \"continues to be constrained, so we’re pacing ourselves at precisely the rate of which we’re getting that extra vaccine supply between now and July 19\"The BMA welcomed the decision to delay England's next lockdown changes by a month to 19 July, which Prime Minister Boris Johnson called \"terminus date\".Chair of Council, Dr Chaand Nagpaul, said: \"I am glad the Government has listened to the BMA and others like us who, in recent days, made clear the need for the current restrictions in England to remain in place for a few more weeks. As the Prime Minister and Chief Medical Officer said, the number of cases in England has gone up 64% compared with the previous week, and we know that the highly transmissible Delta variant accounts for the vast majority of those infections. According to the latest data, the average weekly number of people admitted to hospital in England with COVID-19 has increased by 50% in the past week, and in the North West the rise is 61%. Even a small further increase could compromise the ability of doctors to tackle the backlog of non-COVID cases.\"We are without doubt, in a phase where cases of the virus are spiralling, but the data we have still doesn’t yet show the full impact of this or of the easing of restrictions on 17 May. Furthermore, the more people who have the virus, the more likely it is that new variants of concern will emerge and numbers of those with longer term ill health following infection will increase. So, it is important to do whatever we can to avoid high levels of virus circulating in the community.\"Also announced yesterday were more sporting test events with a full Centre Court capacity for Wimbledon's men's and women's finals, and 50% capacity for the Euros match at Wembley on 29 June. The events will make use of lateral flows tests and the NHS App to prove COVID-19 status.SAGE published the latest modelling data used to support the PM's decision.Commenting via the Science Media Centre, Mark Woolhouse, professor of infectious disease epidemiology, University of Edinburgh, said: \"The model outputs also show – but do not highlight – the expected situation on July 21. Daily numbers of cases are projected to be several times higher than they are now and to still be increasing at that date. \"Though the number of hospitalisations may still be low, the models generate a rapid increase after July 21. On the basis of the data we should see if these projections are correct, this could make it extremely difficult for the Government to decide that it is safe to lift restrictions on July 21. Conversely, if daily numbers of cases are falling by July 21 then that will indicate that the more pessimistic model projections were not accurate and the delay was only precautionary.\"First Minister Mark Drakeford said Wales should not be \"taking risks\" by scrapping coronavirus restrictions while the number of people falling ill from the virus continues to rise.He told the PA news agency: \"We expect to see the number of people falling ill from coronavirus in Wales rise over the weeks ahead because of the Delta variant.”He added: \"We’re in a very different position than we would have been only a matter of months ago, and we need to protect the ground we’ve already gained by not taking risks that might undermine everything we’ve achieved together.\"Scotland is \"likely\" to maintain coronavirus restrictions for a further 3 weeks from June 28, First Minister Nicola Sturgeon has announced. Then the country was previously expected to move into Level 0 on that date.Scotland reported emergency department attendances have reached the highest level since before the pandemic.There were 28,493 attendances in the first week in June, compared with 26,115 the previous week.The 4-hour target was met for 83.8.%, below the 95% target. The Office for National Statistics (ONS) said deaths in England and Wales were 4.8% below the 5-year average in the week ending 4 June but the figures were affected by the bank holiday.COVID-19 accounted for 1.3% of all deaths, slightly higher than the previous week.There have now been 153,493 UK deaths where COVID-19 was mentioned on the death certificate.Cancer Research UK said around 10,600 fewer breast cancer patients have started treatment in the last year in England under the pandemic, and the figure is around 38,000 for all cancers.It said \"hard won\" progress in breast cancer care could slow down.Professor Charles Swanton, the charity's chief clinician, said: \"Considering the huge disruption to cancer services, sadly, these figures are not surprising. And we’re seeing the impact of effectively pausing breast screening which detects almost a third of breast cancer cases.\" University of Aberdeen researchers have partnered with NHS Grampian, and private companies to produce \"game-changing\" AI backed antibody tests that can detect exposure to the Delta and Alpha virus variants.Academic lead on the project, Professor Mirela Delibegovic, said: \"Accurate antibody tests will become increasingly important in the management of the pandemic and this is a truly game-changing technology with the potential to dramatically change the trajectory of global recovery from the pandemic.\" The Royal College of Anaesthetists (RCoA)  issued a report identifying 10 key pandemic lessons learned for the UK healthcare system.The wellbeing of NHS staff is paramountStaff shortages must not persist, now is the time to invest in workforceWe need increased critical care capacity across the UKAppropriate and timely supply of PPE is keyPerioperative care has a critical role to play in the NHS recovery and beyondWe should maintain pandemic skillsCollaboration and information sharing are critical for a successful pandemic responseLocal decision-making worksThe healthcare system must be better prepared for future pandemicsThere is huge potential for digital innovationsRCoA President, Professor Ravi Mahajan, said: \"Over half of our members said they had acquired new, transferable skills, and it is now crucial that staff are supported to maintain the knowledge gained so we can build a pool of ‘reservists’ who can quickly step up to support ICUs when needed.\"A survey of 711 adults from Marie Curie, and Cardiff and Bristol universities, issued as a preprint highlights problems faced by people seeking grief support during the pandemic.Forty-percent tried to get support, and just over half experienced long waiting lists, or a lack of appropriate support.Dr Emily Harrop from the Marie Curie Palliative Care Research Centre based at Cardiff University said: \"We really need politicians and policy-makers to take a thorough look at how we can make changes to support people both before and after a death in the future.\" There are changes to care home rules in England from Monday. Subject to testing, people admitted to homes from the community will no longer face 14 days of isolation.However, isolation is still needed for admissions from hospital, or other care homes.Overnight stays with friends and family away from homes are also being allowed. The Vaccine Taskforce has a new Chair, Sir Richard Sykes, who's CV includes the Royal Institution, King Edward VII’s Hospital, and the UK Stem Cell Foundation.\"I am determined to make sure the UK remains in the best possible position to beat this virus and has the tools it needs to respond to future public health threats,\" he said. This article contains information from PA Media.  See more global coronavirus updates in Medscape’s   Coronavirus Resource Centre.  © 2021 WebMD, LLC Send comments and news tips to uknewsdesk@medscape.net.\nCite this: Tim Locke. UK COVID-19 Update: Long COVID Funding for GPs, 10 Pandemic Lessons Learned - Medscape - Jun 15, 2021.UK Editor, MedscapeYou have already selected  for My AlertsClick the topic below to receive emails when new articles are available.You've successfully added  to your alerts. You will receive email when new content is published.processing....", "Section": "", "Writers": "", "URL": "https://www.medscape.com/viewarticle/953098", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}