{"Type": "", "Time": "2021-06-16", "Headline": "'Justice never sleeps': Families of Philippine drug war victims welcome ICC probe", "Text": "By Neil Jerome Morales and Karen LemaMANILA (Reuters) - Philippine President Rodrigo Duterte will not cooperate with an investigation into the country's bloody war on drugs planned by the International Criminal Court (ICC), his spokesperson said on Tuesday, while families of the victims cheered the move.Normita Lopez, whose son was a victim of the anti-drugs campaign, said she could not contain her happiness when she learned about the ICC prosecutor's request to open a full investigation into the killings.\"I am happy because I realised that justice never sleeps,\" said Lopez, 56, who is among the many complainants to the ICC calling for Duterte's international indictment over thousands of alleged extra-judicial killings.\"God is not sleeping, he always finds a way,\" she said. Her 23-year-old son was killed in May 2017 for allegedly resisting arrest during a sting operation.In what human rights groups described as a landmark step towards justice, the ICC prosecutor asked the court on Monday to allow a full investigation into the killings in the brutal war on drugs, which Duterte unleashed when he took office in 2016.Since then, Philippine security forces say they have killed 6,117 suspected drug dealers because they fought back violently, but rights groups say authorities have summarily executed drug suspects.Duterte, who in March 2018 cancelled the Philippines' membership of the ICC's founding treaty, will not cooperate with the probe, his spokesperson said, while rejecting the ICC prosecutor's findings.\"We will not cooperate because we are no longer a member,\" spokesperson Harry Roque told a news conference on Tuesday.Under the ICC's statute, it has jurisdiction for crimes committed while a country was a member until a year after it sought to withdraw, in this case between 2016 and 2019, when the Philippines' pullout became official.ICC chief prosecutor Fatou Bensouda said on Monday that she had concluded a preliminary examination into the killings and had sought permission from the court for a full inquiry.She had said last December there were reasonable grounds to believe crimes against humanity had been committed during Duterte's bloody anti-narcotics crackdown, whose death toll has stirred international outrage.A series of Reuters stories in 2016 and 2017 exposed the brutal killings being carried out in the Philippines as part of the war on drugs. Many of these stories were referred to in the ICC report on its preliminary examination.2016 series: https://www.reuters.com/investigates/section/philippines-duterte2017 series: https://www.reuters.com/investigates/section/philippines-drugsPOPULAR AT HOMEDespite concerns from the international community about the crackdown on drugs, Duterte remains popular at home and many Filipinos back his tough stance on crime.His single six-year term as president will end in June next year, and political analysts say he would want an ally to win the presidency to protect him from potential legal challenges and political vendettas once he loses immunity out of office.\"We do not need foreigners to investigate killings in the drug war because the legal system is working in the Philippines,\" Roque said, adding he believed launching a formal probe was \"legally erroneous and politically motivated.\"Roque said police used appropriate force and there was \"no intention to target and kill civilians.\"A government anti-drugs agency said in a statement that cases filed against erring officers were being dealt with and denied there were \"policies that permit, tolerate, and condone killings and other human rights violations.\"But Randy delos Santos, uncle of high school student Kian delos Santos who was killed by police officers in August 2017, said he refused to believe government claims that the victims had fought back. He said he hoped reports on his nephew's death, which form part of the ICC report, will pave the way for other families of drug war victims to secure justice.((See the Reuters report on the 17-year-old's killing here https://www.reuters.com/article/us-philippines-drugs-student-idUSKCN1B51U2))\"I welcome the ICC (prosecutor's move). There are many who died (in the drugs war). I feel the pain of other families,\" delos Santos told Reuters.(Reporting by Neil Jerome Morales; Additional reporting by Eloisa Lopez; Editing by Ed Davies and Raju Gopalakrishnan)With Afghan troops in retreat and soon to lose vital American air support, Taliban commanders are voicing exuberance about quickly seizing full control of the country and re-establishing their version of an Islamic state.Dramatic courtroom clash as judge says evidence for charges against Tevin Biles-Thomas is ‘insufficient’Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Human remains have been found in London in the search for 20-year-old suspected murder victim Agnes Akom.  Metropolitan Police officers discovered the remains in Neasden Recreation Park near Cricklewood in northwest London.  Hungarian national Ms Akom, also known as \"Dora\", had been living in the UK for three years.Home Secretary Priti Patel has said an independent report accusing the Metropolitan Police of “institutional corruption” over the Daniel Morgan murder case is “deeply alarming”. “This is one of the most devastating episodes in the history of the Metropolitan Police,” she told MPs in the House of Commons on Tuesday.British farmers: What do you think of the UK-Australia trade deal?We’d like to hear how British farmers feel about the information that has so far emerged about the new trade agreement, and how they believe it might impact them A display of pork products available in store at a Morrisons meat counter in Leeds, as the supermarket announces they are supporting British pig farmers who are suffering as a result of changes in demand from EU countries by introducing deals on sausages, bacon and pork,This new car cloth can easily remove all the car scratches and dents from your car.Mark Drakeford was asked about the proposed levy during a sitting of the Welsh Parliament.The Israeli air force launched air strikes on the Gaza Strip early Wednesday after militants in the Palestinian territory sent incendiary balloons into southern Israel, security sources and witnesses said. The airstrikes and balloons marked the first major flare-up between Israel and Gaza since a ceasefire on May 21 ended 11 days of heavy fighting that killed 260 Palestinians, according to Gaza authorities, and 13 people in Israel, the police and army there said.According to Palestinian sources,Channel 4 News said the alleged offences include serious sexual assault and rape.Research best security system. Protect yourself and your home with wireless alarm systems.Ireland expects that Britain's approach to Brexit talks with the European Union are likely to change and improve following pressure exerted by international partners at the Group of Seven summit at the weekend, Foreign Minister Simon Coveney said.  Ever since the United Kingdom voted to leave the European Union in 2016, the two sides have been trying to work out how to deal with post-Brexit trade and the British province, which has a land border with EU member Ireland.  Tensions between British Prime Minister Boris Johnson and European Union leaders on the issue, which some worry has the potential to escalate into a full-scale trade war, overshadowed the G7 summit at the weekend.Footage shared on social media showed Newsnight political editor Nicholas Watt chased and harrassed by a mob of demonstrators.Dispute comes after Boris Johnson claimed EU leaders need to ‘get into their heads’ that province is part of UKNew research has identified TEN favorite stocks for the upcoming yearFox contributor mocked for being among ‘the most un-self-aware people to walk the planet’At least one officer was filmed repeatedly kneeing a teenager in the stomach during the Saturday arrestIreland will double the quarantine period for unvaccinated or partially vaccinated arrivals from Britain to 10 days but still plans to allow people to move more freely between the two countries from mid-July, Transport Minister Eamon Ryan said.  The change is due to the rapid spread of the more infectious Delta variant in Britain, which delayed plans to lift most remaining COVID-19 restrictions there by a month on Monday.  \"It is just to reflect concern about the Delta variant and to try and hold back the development of that variant here as much as we can and give us time to get vaccines out to give us cover against it,\" Ryan told reporters on Tuesday.Top deals and info researched for you right here. Get the best results on the go, now!Marcus Fysh has criticised the government for extending lockdown measuresMainland Scotland will not move down to the lowest level of Covid restrictions for at least five weeks, Nicola Sturgeon has disclosed as she delayed once more the easing of lockdown. The First Minister said her original plan for the country to move to Level 0 of her five-tier system on June 28 would be postponed by three weeks so more people could be vaccinated. However, her official spokesman later confirmed the new July 19 target - the same date chosen by Boris Johnson to lift all restrictionsNato has declared for the first time that China is a security challengeEvery PC user must read this in 2021 - Do it now.The duo will embark on a series of road trips.Some fans booed England for taking the knee before their opening match of Euro 2020 at the weekend.The former 'Gladiators' presenter has bared all in a bid to encourage men to talk about grief.", "Section": "", "Writers": "", "URL": "https://uk.news.yahoo.com/philippines-duterte-not-cooperate-icc-033300288.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}