{"Type": "", "Time": "2021-06-16", "Headline": "India confirms first death due to adverse reaction after Covid vaccine | The Independent", "Text": "India has administered 259 million doses of coronavirus vaccines to date, though only 5% of the population have received both shotsFind your bookmarks in your Independent Premium section, under my profileA man receives a shot of a Covid-19 vaccine during an inoculation drive in Bengaluru, India, on 10 June, 2021.An Indian government panel studying the side-effects of Covid-19 vaccines has said that a 68-year-old man died due to anaphylaxis after inoculation, the first confirmed death in the country directly linked to a reaction to vaccination. A report by the National Adverse Events Following Immunisation (AEFI) panel, which is part of India’s health ministry, said the man was vaccinated with Covishield — the local branding for the Oxford-AstraZeneca vaccine, produced here by the Serum Institute of India — on 8 March and labelled the case as a “vaccine product-related reaction.”Dr NK Arora, chairperson of the AEFI committee, told India Today it “is the first death that we have seen in which the reason of death after an investigation was found to be anaphylaxis after vaccination.”It is not yet clear how many doses of the vaccine the man took. Anaphylaxis is a severe allergic reaction which develops suddenly and gets worse very quickly, according to NHS UK. The AEFI report looked at 31 cases reported between 5 February and 31 March. Out of these, three were found to be vaccine product related, 18 were classified as having no link to vaccination and seven as indeterminate. One was an anxiety-related reaction and two cases were found to be unclassifiable.In the other two product-related reaction cases, people were hospitalised and have since recovered, the report showed. The AEFI committee said that vaccine product-related reactions are “expected reactions that can be attributed to vaccination based on current scientific evidence.” Examples of such reactions are allergic reactions and anaphylaxis, among others, it said.But the committee also maintained that the benefits of vaccination are overwhelmingly greater than the small risk of harm.India has administered 259 million doses of coronavirus vaccine to date, but less than 5 per cent of its population is fully inoculated. The government says it plans to vaccinate the entire adult population by the end of the year, though it will have to dramatically ramp up its vaccination drive to achieve this.Join thought-provoking conversations, follow other Independent readers and see their repliesA man receives a shot of a Covid-19 vaccine during an inoculation drive in Bengaluru, India, on 10 June, 2021.EPAWant to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.Log inNew to The Independent?Want an ad-free experience?Subscribe to Independent Premium.", "Section": "", "Writers": "", "URL": "https://www.independent.co.uk/asia/india/india-death-covid-vaccine-anaphylaxis-b1866164.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}