{"Type": "", "Time": "2021-06-16", "Headline": "Coronavirus Live Updates: India records 62,224 new cases and 2,542 deaths", "Text": "A single day rise of 62,224 new coronavirus infections were reported taking India's total tally of COVID-19 cases to 2,96,33,105, while the active cases were recorded below nine lakh after 70 days. The COVID-19 death toll climbed to 3,79,573 with 2,542 fresh fatalities, according to the Health Ministry on Wednesday. Congress leader Rahul Gandhi said India needs quick and complete vaccination and not the BJP's 'brand of lies and rhyming slogans' to cover up the vaccine shortage caused by the government's inaction.A net decline of 47,946 cases has been recorded in the COVID-19 caseload in a span of 24 hours.The 2,542 new fatalities include 1,458 from Maharashtra, 267 from Tamil Nadu, 166 from Kerala and 115 from Karnataka.A total of 3,79,573 deaths have been reported so far in the country including 1,14,154 from Maharashtra, 33,148 from Karnataka, 30,068 from Tamil Nadu, 24,851 from Delhi, 21,914 from Uttar Pradesh, 17,049 from West Bengal, 15,650 from Punjab and 13,342 from Chhattisgarh.The decision regarding enhancing interval between two doses of Covishield was based on scientific evidence and taken in a transparent manner, NTAGI Chair N K Arora said on Tuesday.There was no dissenting voice among the members of the National Technical Advisory Group on Immunization (NTAGI ), he said, according to a tweet by the Union Health Ministry.The government had on May 13 said it has accepted the COVID-19 Working Group's recommendation and extended the gap between the two doses of the Covishield vaccine from 6-8 weeks to 12-16 weeks.\"Based on the available real-life evidence, particularly from the UK, the COVID-19 Working Group agreed for increasing the dosing interval to 12-16 weeks between two doses of Covishield vaccine. No change in the interval of Covaxin vaccine doses was recommended,\" the ministry had said in a statement.\"The recommendation of the COVID-19 Working Group was accepted by the National Expert Group on Vaccine Administration for COVID-19 (NEGVAC), headed by Dr V K Paul, Member (Health), Niti Aayog, in its meeting on May 12, 2021,\" the ministry said.It has accepted this recommendation of the COVID-19 Working Group of extension of the gap between the first and second doses of Covishield to 12-16 weeks, the health ministry added.RELATED READS:‘Didn't Back Doubling Gap Between 2 Astrazeneca Doses’COVID: Int’l Haj Cancelled, Indian Panel Nixes All ApplicationsDespite Noises, Yogi Comfortably Placed in UP If No Third Wave74% Indian Workers Want Hybrid Work Options: StudyCoca-Cola lost a staggering $5.2 billion thanks to Cristiano Ronaldo at Euro 2020. Watch the viral moment here.The central agencies want to ascertain whether there exists any Chinese conspiracy angle to this fraud.Celebrated surgeon and author of the New York Times best seller \"The Plant Paradox\" reveals what many have suspected for a long time, and even worse.London [UK], June 15 (ANI): As the controversy around fugitive diamantaire Mehul Choksi's disappearance from Antigua refuses to die down, a UK-based law firm looking after the case has released images and videos on Monday claiming that he was kidnapped from Antigua.Desi Twitter is experiencing waves of nostalgia in the latest trend, a throwback to mosaic flooring in middle-class households.People have a lot of faith in the prime minister as opposed to the chief ministers, despite claims to the contrary.Find furniture you love, at prices that fit your budget with flexible financing.The therapy, AZD7442, was 33% effective in reducing the risk of people developing symptoms compared with a placebo, but that result was not statistically significant..New Delhi, Jun 15 (PTI) A pan-India 'fraud-to-phone' network has been busted by security agencies, which have also arrested eight people and seized nearly 300 new mobile phones bought with stolen funds, officials said on Tuesday.NEW DELHI (Reuters) -Having barely got over a devastating second wave of coronavirus infections, India was gripped with alarm on Tuesday over risks of a resurgence as crowds thronged railway stations and shopping malls a day after major cities relaxed curbs on movement.  The capital New Delhi, in the north, and tech hub Bengaluru, in the south, were among the cities that have begun lifting strict lockdowns as the nationwide tally of new infections  dropped to its lowest level in more than two months.  After a strict five-week lockdown, authorities in Delhi have fully re-opened shops and malls, and allowed restaurants to have 50% seating.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Cashew nut trees are native to Brazil but have been cultivated all over the world. Like most nuts, cashews have several health benefits and can be easily tweaked into dishes. In addition, they are also used as an alternative to dairy products in the form of cashew milk, cashew-based cheese, and cream. Here, we cover the various health benefits of cashews.A speedy vaccination programme could compensate for the government’s initial laxity displayed in COVID managementA look back at the two weeks of French Open which crowned Novak Djokovic and Barbora Krejcikova as the men's and women's champions.This new car cloth can easily remove all the car scratches and dents from your car.The men allegedly forced him to chant Jai Sri Ram, cut Saifi’s beard and assaulted him for 4 hours in Loni.Likely to be priced at Rs 1,114 per dose in India, Novavax vaccine will be a two-dose jab like the other vaccinesIn the last few years, nearly 800,000 Rohingya have fled from MyanmarSo mad that I just learned this...After coming to power in Bengal in 2011, Mamata, besides working on governance, has also created more space for youngsters in the party.Apple reportedly aims to provide a non-invasive solution to check blood sugar levels without pricking the skin.A 62-year-old woman died allegedly after being stabbed 20 times by a man who also sexually assaulted her in east Delhi's Dallupura village.Search for scalp psoriasis treatment options. These treatments for scalp psoriasis are more affordable than everHyderabad (Telangana) [India], June 15 (ANI): Oracle India head and his wife were booked for cheating customers by collecting huge advance amounts for the projects using the goodwill of the Oracle company, informed the police on Tuesday.Sister Lucy was was a prominent face in the protest against rape-accused Bishop Mulakkal.In the latest development in the Rajasthan political crisis saga, six MLAs, who broke away from the BSP and joined the Congress, went into a huddle on Monday (14 June), reports India Today.  This came after the Sachin Pilot group sought fulfilment of their demands for political and ministerial appointments.", "Section": "", "Writers": "", "URL": "https://in.news.yahoo.com/coronavirus-live-blog-india-daily-cases-deaths-040321761.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}