{"Type": "", "Time": "2021-06-16", "Headline": "Coronavirus Vaccination: Deaths After Vaccination 0.0002% Of 23.5 Crore Doses Administered: Centre", "Text": "All vaccines have some reactions in body post inoculation, do not spread misinformation: Centre (File)The Ministry of Health and Family Welfare on Tuesday clarified that any death or hospitalisation following COVID-19 vaccination cannot be automatically assumed to be due to vaccination.As per the official release by the ministry, there have been some media reports suggesting an increase in the cases of severe Adverse Events Following Immunization (AEFI), which have also resulted in 'succumbing of patients' post-vaccination. As per the media reports, 488 deaths following vaccination are linked to post-COVID complications during January 16, 2021 and June 7, 2021 period where the total vaccination coverage was 23.5 crore.Dr VK Paul, Member Health, NITI Aayog said, \"All vaccines have some reactions in the body post inoculation, do not spread misinformation.\"The Union Ministry clarified that these reports are based on incomplete and limited understanding of the matter at hand and noted that the term \"succumbed\" insinuates causality, that is, the deaths were caused due to vaccination.The number of deaths reported following COVID-19 vaccination in the country is only 0.0002 per cent of 23.5 crore doses administered, which is within the expected death rates in a population. In a population, deaths occur at a certain rate. Crude death rate in 2017 as per Sample Registration System (SRS) data is 6.3 per 1,000 persons annually.The release stated, \"It is also important and pertinent to note that the mortality rates for those testing positive for COVID-19 disease is more than 1 per cent and COVID-19 vaccination can prevent these deaths. Therefore, the risk of dying following vaccination is negligible as compared to the known risk of dying due to COVID-19 disease.\"The AEFI is defined as 'any untoward medical occurrence which follows immunization and which does not necessarily have a causal relationship with the usage of the vaccine. It can be any unfavourable or unintended sign, abnormal laboratory finding, symptom or disease'. Healthcare workers, doctors and vaccine recipients have been always encouraged by the Government of India as well as state governments to report all deaths, hospitalisations and events resulting in disability as well as any minor and adverse events following immunisation at any point of time after vaccination.Deaths, hospitalisations or events causing disability or concern following any vaccination are categorised as serious or severe cases and are to be investigated at the district level. Causality assessments help to understand whether the event was caused due to the vaccine and are conducted at the state and national level. Therefore, any death or hospitalisation following vaccination cannot be automatically assumed to be due to vaccination unless investigated by the AEFI Committees at the district, state and national level and attributed to the vaccination.There is a robust system of AEFI surveillance at every level from the district to the state. Once the investigation is completed, the reports are released on the website of the Union Health Ministry, following transparent sharing of COVID vaccination related information.Track Latest News Live on NDTV.com and get news updates from India and around the world. Watch Live News:Follow Us:................................ Advertisement ................................", "Section": "", "Writers": "", "URL": "https://www.ndtv.com/india-news/any-death-or-hospitalisation-following-covid-19-vaccination-cannot-be-automatically-assumed-to-be-due-to-vaccination-centre-2464508", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}