{"Type": "", "Time": "2021-06-16", "Headline": "'Momentous day' -New York lifts Covid restrictions", "Text": "\n        Show Ad\n      “What New York has done is extraordinary. We went from literally worst to first.”Governor Andrew Cuomo on Tuesday congratulated the state on reaching a crucial milestone:He reported that 70% of New York adults have received at least one dose of COVID-19 vaccine… greatly reducing the infection rate.Which is why, Cuomo said, the stringent mandates put in place after New York’s traumatic first wave of COVID-19 were no longer necessary.“The state mandates that have proven right and correct and brought us through this pandemic are relaxed as of today, effective immediately.”While safety precautions are still required on public transit and in healthcare settings, Cuomo said most social gathering restrictions, capacity restrictions, health screenings and disinfection protocols are over.It’s a ‘momentous day’, said Cuomo, in the state’s fight against the virus.“You know who beat covid? The people of New York beat covid.” (Flash) \"New York State has fully vaccinated a larger share of adults than any other big state in the country.”States initially hardest hit are now reopening, after aggressive vaccination campaigns.New York joined California, where restrictions including physical distancing, mask mandates and capacity limits on many businesses ended on Tuesday.Fireworks all across New York were set to mark Tuesday's milestone, and state landmarks like the Empire State Building were to be lit in blue and gold - the state’s colors - to honor essential workers.JERUSALEM (Reuters) -Thousands of Israeli far-right nationalists marched in a flag-waving procession through East Jerusalem on Tuesday, an event that reignited tensions with Palestinians and posed an early challenge to Israel's new government.  Last month, Israeli-Palestinian confrontations in contested Jerusalem helped trigger 11 days of cross-border fighting between Israel and Gaza's ruling Hamas militant group.  On Tuesday, Israeli police in riot gear and on horseback cordoned off areas leading to the walled Old City's flashpoint Damascus Gate, clearing the area to Palestinians before the marchers arrived.Hundreds of Israeli ultranationalists, some chanting “Death to Arabs,” paraded Tuesday in east Jerusalem in a show of force that threatened to spark renewed violence just weeks after a war with Hamas militants in the Gaza Strip.  Palestinians in Gaza responded by launching incendiary balloons that caused at least 10 fires in southern Israel.  Early Wednesday, Israeli aircraft carried out a series of airstrikes at militant sites in Gaza, the first such raids since a shaky cease-fire ended the war last month.Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.Jerry Ramos spent his final days in a California hospital, hooked to an oxygen machine with blood clots in his lungs from COVID-19, his 3-year-old daughter in his thoughts.  Ramos didn't live to see it.  The approaching 600,000 mark, as tracked by Johns Hopkins University, is greater than the population of Baltimore or Milwaukee.Data: CDC; Chart: Danielle Alberti/AxiosAt least 70% of New York adults have received at least one dose of the COVID-19 vaccine, Gov. Andrew Cuomo announced Tuesday, meaning all state-mandated COVID-19 restrictions are lifted effective immediately. Why it matters: Once the epicenter of the pandemic, Tuesday's announcement brings New York one step closer towards normalcy and a \"return to life as we know it,\" Cuomo said.Get market news worthy of your time with Axios Markets. Subscribe for free.DetCalifornia has pursued a more measured approach to reopening than the hype would have it, seeking to balance the need to get businesses back on their feet while recognizing that the best way to lure customers and workers out of hibernation is by ensuring they feel safe from the virus itself.Today's mortgage refi rates at 1.77% FIXED - No hidden points or fees! 1.97% APR. Cut your payment while rates are still low.Sir Keir Starmer has said the UK and EU need to negotiate to remove trade barriers and avoid a trade war, and accused Boris Johnson of not having read or understood the Brexit treaty. The UK and EU are currently teetering on the brink of a sausage trade war as they argue over the implementation of the Northern Ireland Protocol and its Irish Sea border with Britain. The Protocol means checks are carried out on British goods exported to Northern Ireland, which continues to follow some EU rules, toCalifornia Gov. Gavin Newsom celebrated the state's reopening at the Universal Studios theme park in Los Angeles with another lottery drawing, giving away $1.5 million each to 10 people who have received COVID-19 vaccinations in the state. (June 15)Tunisian President Kais Saied called on Tuesday for a dialogue with political parties on creating a new political system and amending the 2014 constitution, which he described as “with locks everywhere”, in an effort to ease the ongoing political crisis.  Saied's comments could pave the way for an end to a months-long political standoff with Prime Minister Hichem Mechichi, who is backed by parliament Speaker Rached Ghannouchi, leader of the moderate Islamist Ennahda party, over powers and political alliances.Over 55? You may want to start packing your bags for senior apartments near you. Look for local senior apartments.Fox contributor mocked for being among ‘the most un-self-aware people to walk the planet’‘After consulting Pfizer, NYC Department of Health sent out an email on our behalf alerting everyone to return for another vaccine,’ company responsible for mistake tells The Independent in statementThe Senate confirmed Ketanji Brown Jackson on Monday to the U.S. Court of Appeals for the District of Columbia, an influential court that has been a springboard for future Supreme Court justices.Cut your monthly payment while rates are low. Free Quotes. Wont affect your credit. Calculate New Payment. (1.97% APR)Lt Gen Rouleau described the golf outing with Gen Vance as a ‘private activity’The movie and TV star died after being involved in a scooter collision 10 days ago in New York.Reporter who broke story on meeting linked to former secretary of state’s private email server subject to right wing conspiracySearch for control scalp psoriasis. These treatments for scalp psoriasis are more affordable than everDonald Trump has been reminded of time he branded pandemic a ‘hoax’White House chief of staff wanted DOJ to investigate conspiracy concerning Italian satellitesBarbara Starr has called on the Biden administration to introduce new protections for journalistsSo mad that I just learned this...“They’re still bending the knee to Donald Trump,” House Democratic Caucus Chair Hakeem Jeffries saysDenis Sinyakov/GettyIt’s been a good spring for Russian President Vladimir Putin. First, the White House announced that they were waiving sanctions on the company behind Russia’s Nord Stream II gas pipeline to Germany, and then days later it was announced that U.S. President Joe Biden and Putin would meet for a day-long summit in Geneva on June 16. These overtures towards Moscow stand in stark contrast to the most recent round of sanctions against Russia that the Biden administration imposed jus‘I mean, would you rather have AC or would you rather have AOC?’ the comedian Blaire Erskine asked in the guise of a Texas power grid official", "Section": "", "Writers": "", "URL": "https://news.yahoo.com/momentous-day-york-lifts-covid-204143770.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}