{"Type": "", "Time": "2021-06-16", "Headline": "Joe Biden should be wary when meeting Vladimir Putin – the Russian leader is not playing the same game | The Independent", "Text": "Do not expect much to come from the first face-to-face meeting between the two leadersFind your bookmarks in your Independent Premium section, under my profileFind your bookmarks in your Independent Premium section, under my profileBiden says US not seeking ‘conflict’ with RussiaWith the first summit between Joe Biden and Vladimir Putin now upon us in Geneva, one should look on this encounter in a different light from the old meetings during the Cold War.The Soviet Union of the time acted as a great power organised according to certain ideological dogmas and trying to impose the order it praised onto the rest of the world. The West comprising of the United States and Western Europe actually practiced the same attitude, but one based on values rather than by an ideology.Today’s Russia is not a leading power similar to the Soviet Union. It’s only significant asset is the nuclear arsenal it inherited from the USSR. Economically it is just outside the top 10 nations by GDP and pushes the religious and ethnic values of the \"Russian world\" Socially it’s looking backwards, celebrating unique Russian morality, \"traditional values\" and glorifying its past over outlining the contours of its future. There is an argument that it has actually been one of the greater losers of globalisation.In his early years of Putin's time in power, he expressed certain sympathy towards the European Union – such as in his 2001 Bundestag speech: “As for European integration, we not just support these processes, but we are looking to them with hope”.But as it became clear to Putin that neither Europe nor the West in general had no enthusiasm for recognising Russia as their equal partner, Moscow’s position changed – and it spent time swinging between Putin’s harsh talks in Munich and Bucharest in 2007 and 2008 and former president Dmitry Medvedev’s \"reset\" from 2009 to 2011.The Russian actions over Ukraine in 2014, I would argue, was the first expression of a new strategy – the bones of which can be seen in an academic report entitled “New Rules or No Rules?” The authors assume that the old order was maybe not very attractive, but stable and enduring – and that it contained the blueprint for \"rules\" to follow. The major \"rule\" was, by some coincidence, the power of force, Second, this old world was managed through blocs and alliances, with those in charge of these things responsible for the \"order\" within them. Third, the idea of sovereignty was considered a universal one, and the sovereign’s rights were not subjected to any international laws (governing either the inter-state relations or the internal systems of governance). What was illegal under such conditions, cannot be considered as \"justified\"The \"rules\" then exist only where there’s order, and order is established once and for a long time (if not forever). If the \"order\" is constantly disrupted or changed, it can-not be regarded as such – and if there’s no order, then nobody needs to play by the \"rules\". So it was that \"post-Crimean\" Russia emerged not as a country that wants to propose its own \"rules\", but as one that has no trust in \"rules\" imposed by others.I believe that for Putin, today’s world represents chaos – it cannot be anything else because it is changing. Presidents change, crises appear, and new ethical and judicial norms arise. These developments are incompatible with the very idea of order – so they make any kind of \"rules\" useless. Therefore, today’s world is a scene on which only a ‘game without rules’ can be played. The world is now managed in an unordered way so any nation has a right to respond, disobeying the old \"rules\" and either establishing their own, or acting arbitrarily.The Russian seizure of Crimea was an important milestone here: the Kremlin organised a referendum after it annexed the territory that was used as a legitimisation of Crimea’s transfer from Ukraine to Russia. For Russia to act this way was a \"new rule’ – and the West was left free to consider whether it was a breach of international law.The Kremlin doesn’t establish its own rules in Russia’s domestic policy – it remains extremely unpredictable – but it denounces any of those that have been recognized by the greater part of international community.This \"game with no rules\" is Putin’s dream as he can rationalise any action.Everything Moscow – or Russia-connected individuals – have been accused of in recent years that shocked the Western world – from poisoning individuals in the streets of British cities, to develop-ing extensive \"fake news’ farms\" and securing the Assad regime in Syria was \"natural\" from the point of view of this doctrine.The Kremlin, I believe, realises that it’s too weak to pretend to be a part of the community that creates the rules of the contemporary world, but it has proved that it’s powerful enough to defy them – and among the \"rules\" it defies is the rule requiring the statesman to be clear and honest in his dealings.I would doubt that Putin feels guilty about his actions, because he became a strong believer in the idea that there is no order in the entire world, so anything is possible. For example, if you may jail local opposition activists, why should you refrain from it?I believe today’s Russia isn’t a \"Soviet Union 2.0\" – it is a power guided by a set of ideas completely different from those governing the Western world. For Putin, only in an \"orderly\" world – i.e. one that allows sovereign states to establish spheres of interest without any concern of international conventions – can Moscow be asked to act in an \"orderly\" way. And so, Russia acts as if the \"rules\" don't exist.This very fact makes dealings with Putin extremely difficult – and it’s what President Biden should be prepared for. The upcoming meeting in Geneva is symbolic, the Kremlin’s spokesperson has already said the Russian leadership do not expect any breakthroughs from it.In Geneva – and in any other place where the Western-Russian \"dialogue\" may take place during Putin’s time in power – one will witness an encounter of two different worlds, rather than of two nations that want to try and work together on one single world. The West isn’t looking in a mirror when it comes to Russia – it is confronted by an entirely different beast altogether.Vladislav L. Inozemtsev is a special advisor to MEMRI’s Russian media studies projectJoin thought-provoking conversations, follow other Independent readers and see their repliesJoe Biden is in Geneva to meet with Vladimir PutinAPWant to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.Log inNew to The Independent?Want an ad-free experience?Subscribe to Independent Premium.", "Section": "", "Writers": "", "URL": "https://www.independent.co.uk/voices/biden-putin-meeting-geneva-russia-b1866906.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}