{"Type": "", "Time": "2021-06-16", "Headline": "Exclusive: No green light to start vaccinating children, ministers to be told", "Text": "\nJCVI expected to make recommendation against the move until scientists have more data on the risks\nMinisters will be advised against the mass rollout of Covid vaccinations to children until scientists obtain more data on the risks, The Telegraph understands.Experts on the Joint Committee on Vaccination and Immunisation (JCVI) are expected to make a recommendation against the vaccination of under-18s in the immediate future.The committee is understood to be preparing an \"interim\" statement for release as soon as the end of the week following a meeting on Tuesday.  At a meeting, members are understood to have voiced serious ethical concerns about vaccinating children, given that they rarely suffer serious illness from Covid.The statement is set to say more time is needed to assess studies of vaccine rollouts in other countries where children are being vaccinated – including the US and Israel – before deciding whether such a programme should be launched in the UK.A Whitehall source said: \"Nobody is going to green light the mass vaccination of children at this stage. \"Scientists want to see more data from the US and elsewhere before taking a firm stand either way. Nobody is going to make a final decision at this point. The JCVI will want to weigh up the benefits against the risks before vaccinating children, and it wants more data.\"The advice may disappoint ministers, who have instructed officials to be ready to roll out vaccines for children this summer in order to suppress Covid and help keep schools open. Ministers have said Britain has bought enough of the Pfizer vaccine to offer jabs to all children aged between the ages of 12 and 17.Teaching unions have also called for the vaccination of children, and on Monday Prof Chris Whitty, the chief medical officer, suggested they may need to be vaccinated to ensure that their education can continue without disruption.Asked whether Covid jabs would be rolled out to children, Prof Whitty told a Downing Street news conference that the \"wider question\" was about whether this would help limit the disruption the virus was causing to their schooling.Boris Johnson also suggested the decision to keep restrictions in place until July 19 was partly timed to coincide with the start of the school holidays, as the spread of the virus among young people will reduce.In the US, the Centers for Disease Control and Prevention recommended that all children aged over 12 should get a Covid vaccination in May. Israel – which achieved the fastest rollout to adults globally – has just begun vaccinating those aged 12 to 15.Both countries have been able to largely relax Covid rules, which will increase pressure on the UK Government to follow suit in vaccinating children.The Pfizer vaccine has been deemed safe for those aged 12-15 by the Medicines and Healthcare products Regulatory Agency (MHRA), so ministers could ignore the JCVI's advice.A senior government source said: \"The Pfizer vaccine has been licensed for 12 to 15-year-olds by the MHRA, and a number of countries will be vaccinating children in those age groups. Ministers have not received advice, and no decisions have been taken.\"On Tuesday, France opened up vaccinations to children aged 12 and over in a bid to ward off a rise in infections as it lifts restrictions.The UK has the highest take-up of vaccines globally, with 30 million people – including almost all over 50s – now double-jabbed. Later this week the programme will open up bookings to everyone over 18.However, there is concern from some scientists that the high transmissibility of the Indian or delta Covid variant means the spread of the virus cannot be checked without a still wider rollout of vaccinations.But in recent days, the JCVI's deputy chairman has expressed increasing concern about a shift to vaccination of children.Prof Anthony Harden told BBC Radio 4's Today programme: \"We do have to be absolutely sure these vaccines are completely safe. The MHRA said they are safe in trials, but of course that's very different to immunising millions of children.  \"We'll be looking very carefully at the data emerging from the States and other countries on vaccines in children before making any assumptions, but we're not there yet with children.\"Previously, Prof Harden had said the benefit to children's health was \"pretty marginal\" because most get very mild illness, but the case for jabbing them in order to secure their education could be considered. On Tuesday, he declined to comment.Separately, it emerged on Tuesday night that ministers are set to announce that Covid jabs will become mandatory for care home workers.We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage.", "Section": "", "Writers": "", "URL": "https://www.telegraph.co.uk/politics/2021/06/15/exclusive-no-green-light-start-vaccinating-children-ministers/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}