{"Type": "Singapore", "Time": "2021-06-16", "Headline": "Warm and humid weather to continue into second half of June: Met Service", "Text": "SINGAPORE: The warm and humid weather in the first two weeks of June is expected to continue into the month's latter half, the Meteorological Service Singapore (MSS) said on Wednesday (Jun 16).In the second fortnight of June, daily temperatures are expected to range between 25 degrees Celsius and 34 degrees Celsius on most days, sometimes reaching 35 degrees Celsius on days with little or no rain.\"Warm and humid conditions can also be expected on some nights when prevailing winds from the southeast or south blow warm and humid air from the sea,\" said the Met Service.On these nights, night-time minimum temperatures of up to 28 degrees Celsius can be expected, particularly over the south-eastern parts of the island.The monsoon rain band is forecast to lie further north of the Equator and low-level winds are expected to blow from the southeast or southwest.On a few days in the early part of the fortnight, a mass of dry air from the Indian Ocean is forecast to move over the equatorial Southeast Asia region.This will bring fair and warm weather over Singapore and the surrounding region, said MSS.On some days, there will be localised short-duration thundery showers over parts of the island in the late morning and early afternoon due to strong day-time heating of land areas.\"On one or two days, widespread thundery showers with gusty winds due to Sumatra squalls are forecast between the pre-dawn hours and morning,\" said the Met Service.Overall, the rainfall for June is expected to be below normal over some parts of Singapore.REVIEW OF WEATHER IN FIRST HALF OF JUNEIn its review for the weather in the first half of June, the Met Service said that the light and variable winds over Singapore and the surrounding region strengthened to blow from the southeast or southwest. The shift signalled the end of the inter-monsoon period and the start of the Southwest Monsoon season.Thundery showers fell mostly over the western half of the island and in the late morning and afternoon. They were due to strong solar heating of land areas coupled with localised convergence of winds.\"There were also a few days when thundery showers fell during the night and in the pre-dawn hours,\" the Met Service said.On Jun 15, moderate to heavy thundery showers fell mainly over the western and northern parts of the island in the afternoon. The daily total rainfall of 93.8mm recorded at Mandai that day was the highest daily rainfall for the first half of the month.The first fortnight was \"generally warm\", with nine days where the daily maximum temperature was above 34 degrees Celsius.The highest daily maximum temperature of 35.5 degrees Celsius was recorded at Marina Barrage on Jun 4.On a few warm nights, particularly over the southern parts of Singapore, the minimum night-time temperatures ranged between 28 degrees Celsius and 29.2 degrees Celsius.Rainfall was below average for most parts of Singapore except in the north-western parts of the island where it was above average, said the Met Service.The highest rainfall anomaly of 138 per cent above average was recorded at Choa Chu Kang. The anomaly was lowest at Sentosa at 61 per cent below average.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "weather,Meteorological Service Singapore", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/warm-humid-weather-continue-second-half-june-met-service-15026340", "Source": "google"}