{"Type": "", "Time": "2021-06-16", "Headline": "Thai PM vows kingdom's reopening in four months, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BANGKOK (AFP) - Thailand plans to fully reopen to foreign visitors in four months, Premier Prayut Chan-O-Cha vowed on Wednesday (June 16), citing the urgent need to save the kingdom's ailing tourism industry.The coronavirus pandemic has hammered Thailand's tourism sector amid border closures and strict hotel quarantine measures.The impact has reverberated across different sectors - downing hotels, restaurants, bars and local transport operators - and the country's present battle against a third wave has left local businesses clambering for more government aid.Tourism previously made up almost 20 per cent of Thailand's national income.\"I am therefore setting a goal for us to be able to declare Thailand fully open within 120 days from today, and for tourism centres that are ready to do so even faster,\" Premier Prayut said in a televised address on Wednesday evening.He said the only exception would be \"if a truly serious situation develops\".\"I know this decision comes with some risk... but I think when we take into consideration the economic needs of people, the time has now come for us to take that calculated risk,\" he said.To do this, Thailand's top priority is to get at least one shot for everyone in the country ahead of the re-opening, he said.Prayut expects 50 million Thais to be inoculated by October with a target of at least 10 million per month.\"We cannot wait for a time when everyone is fully vaccinated with two shots to open the country or for when the world is free of the virus,\" he said.Thailand has recorded close to 205,000 infections and 1,525 deaths.Prayut's administration has been under pressure over its economic management as Thailand experiences its worst performance since the Asian economic crisis of 1997.The government has also been under fire over its slow vaccine rollout, which to date has seen about seven per cent of the population inoculated with a first dose before the program was paused this week due to a lack of supply.A so-called \"Phuket sandbox\" has also been floated - allowing vaccinated tourists to enter the country without quarantine - but the mixed messaging from authorities on the program has left some potential visitors gun-shy on purchasing flights.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/thai-pm-vows-kingdoms-reopening-in-four-months", "Source": "google"}