{"Type": "", "Time": "2021-06-16", "Headline": "Macau follows Hong Kong in shuttering Taiwan office", "Text": "Macau said Wednesday it was closing its representative office in Taiwan, following neighbouring Hong Kong which made the same move last month in protest at Taipei's support for pro-democracy activists.Hong Kong and Macau are \"semi-autonomous\" Chinese cities, although foreign policy is all but decided by Beijing and the central government has taken an increasingly more direct say in how both former colonies are run in recent years.In a short statement, Macau announced its Economic and Cultural Delegation in Taiwan will temporarily suspend operations from June 19.In response, Taiwan's Mainland Affairs Council expressed \"deep regret over the Macau government's unilateral decision,\" saying it would continue to keep its trade office in the Chinese gambling enclave open.Macau gave no reason for the closure. But the wording was almost identical to last month's statement by Hong Kong.That announcement was then followed by Hong Kong's government confirming the closure was indeed political.Taiwan, Hong Kong said, had \"grossly interfered\" in the city's affairs on repeated occasions and \"created irretrievable damage\" to relations.Hong Kong and Macau abide by authoritarian China's view that democratic, self-ruled Taiwan is part of its territory and must be seized one day, by force if necessary.That makes any official contact with Taipei tricky, even though Taiwan is a major trading partner.China had encouraged trade offices when relations were warmer.But since the 2016 election of Taiwan's President Tsai Ing-wen, Beijing cut official contacts and ramped up economic, military and diplomatic pressure.Beijing loathes Tsai because she regards Taiwan as a de facto sovereign nation and not part of \"one China\".Her government is also a vocal supporter of democratic principles and has quietly helped open its doors to some Hong Kongers trying to escape Beijing's crackdown on dissent after huge democracy protests rocked the financial hub in 2019.jta/qanFor Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.If you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Malaysian durians have topped fruit and vegetable presales at a big Chinese retail festival, showing the pulling power of the pungent delicacy.A Malaysian court Wednesday overturned an inquest verdict of \"misadventure\" in the death of a French-Irish schoolgirl who vanished in the jungle, replacing it with an \"open\" ruling in a victory for her family.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neThe US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.EVOS Savage Girl started the finals strong by defeating DR Hellcats in the opener. However, the Filipina squad bounced back in the next game to force the series to a decider.With Afghan troops in retreat and soon to lose vital American air support, Taliban commanders are voicing exuberance about quickly seizing full control of the country and re-establishing their version of an Islamic state.US carrier Southwest Airlines was ramping operations back up Tuesday after canceling some 500 flights following a second major outage in 24 hours due to computer issues.Chinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiThe European Union and United States launched a trade and technology council that seeks to “write the rules of the road” on the global economy, in the face of growing competition from China. It was the latest salvo against Beijing on US President Joe Biden’s whistle-stop European tour, which had seen him succeed in rallying support among the G7, Nato and now EU for a much-vaunted transatlantic coalition to face down China’s rising influence. A joint EU-US statement said the council would focus oEuropean and US stock markets marked time on Wednesday as investors brace for fresh signals from the US Federal Reserve on its stimulus policy.A minimalist can get away with less The post How Much Does It Cost To Furnish Your HDB Flat? appeared first on DollarsAndSense.sg.The freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.Royal Caribbean is pushing back the maiden voyage of a new ship by a month after eight crew members tested positive for Covid-19, the company's chief executive said.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aSmall is beautiful again in Hong Kong’s initial public offerings (IPOs) as retail investors reaped a windfall from some eye-catching market returns in the absence of blockbuster tech listings. Angelalign Technology is extending that stellar run. Shares of the Chinese maker of clear orthodontic braces soared in its trading bow on Wednesday, more than doubling the money for retail investors who turned its HK$2.91 billion (US$374 million) offering into the city’s best market debutant so far this qu", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/macau-follows-hong-kong-shuttering-045921867.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}