{"Type": "", "Time": "2021-06-16", "Headline": "Man's death after machine part fell on his head ruled as misadventure by coroner, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The death of a man who made headlines more than 20 years ago for being Singapore's youngest bone marrow donor as a 15-month-old infant has been ruled as a misadventure.Mr Seamus Shi Liang died on Dec 2, 2020, after a part of a machine he was fixing while working fell on his head.Coroner Sharmila Sripathy said in her findings on Wednesday (June 16) that there was no evidence of foul play.She said the 26-year-old did not place wooden blocks between two components of the machine before removing another of its parts.This could have prevented the accident from happening.Mr Shi was featured in The New Paper (TNP) in 1995, when his bone marrow was donated to his elder sister, Ms Sinead Shi Rui, who had leukaemia.Doctors had ruled out their parents as donors. TNP said that the father, Mr Stephen See, had hepatitis and the mother's bone marrow was only a 50 per cent match to her daughter.Mr Shi was working as a service engineer for Arburg, which manufactures plastic injection moulding machines, when he died.On the day of the tragedy, he went with a colleague to another manufacturing firm, Meiban Micro, to repair a vertical plastic moulding machine.As part of the repair works, he had to remove a component of the machine, which was secured by multiple bolts.He placed his head between two other parts of the machine as he unscrewed the bolts.One of the parts dropped onto him seconds after he removed the bolts, pinning his head.Mr Shi's colleague and Meiban Micro workers tried to rescue him but failed.Paramedics pronounced him dead at the scene after Singapore Civil Defence Force officers extricated the body.Injuries to the head and neck were cited as the cause of death.Citing Ministry of Manpower investigations, Coroner Sripathy noted that both Mr Shi and his colleague were not trained to repair plastic moulding machines with the same configuration as the one at Meiban Micro.But she said that he and a different co-worker had repaired another machine of the same model in March 2020.On that occasion, wooden blocks were placed between parts of the machine.This safety measure was not stated in Arburg's risk assessment at that time, the coroner added.She extended her condolences to Mr Shi's family.Mr Stephen See was present in court on Wednesday, but declined to speak to the media.A family friend, who did not want to be named, was also present.When asked if the family would be pursuing any further civil action, the friend said they were keeping their options open.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/mans-death-after-machine-part-fell-on-his-head-ruled-as-misadventure-by", "Source": "google"}