{"Type": "", "Time": "2021-06-16", "Headline": "Premier League fixtures 2021-22: Manchester City, Chelsea face tough start, Manchester United have favourable opening", "Text": "Janusz Michallik picks which potential transfer would have a greater impact in the Premier League title race next season. (1:35)The opening day of the 2021-22 Premier League season will see Manchester City begin their title defence away at Tottenham Hotspur on Aug. 14, the league announced on Wednesday.Pep Guardiola's City will have to face Spurs, Arsenal, Leicester, Chelsea and Liverpool in their first seven games of the season.- The complete guide to the 2021-22 Premier League season\n- Ogden: City, Chelsea given horror start but does it matter? Runners-up Manchester United begin their season at Old Trafford against rivals Leeds United followed by a more favourable run against Southampton, Wolverhampton Wanderers, Newcastle, West Ham United, Aston Villa and Everton.Following a poor defence of their 2019-20 Premier League title, Liverpool's season starts with a trip to Norwich. They will face both Chelsea and City at Anfield in their opening seven games.Liverpool's toughest run, however, comes during the Christmas period with three away games at Spurs, Leicester and Chelsea as well as a game against Leeds at Anfield on Dec. 26.Champions League winners Chelsea play Crystal Palace at home on Aug. 14 followed by a London derby with Arsenal. Alongside their early fixture with Liverpool, they also face Spurs away in the first six games.Chelsea's participation in the Club World Cup means they will have to rearrange games in December, with fixtures for the competition in Japan yet to be released.Arsenal -- who finished eighth -- must play Liverpool, City and north London rivals Spurs in the first month-and-a-half of the league.No Premier League matches will take place on the weekend of Jan. 29 as part of the FIFA international match calendar.The opening game between City and Spurs could have added significance should the latter's talisman Harry Kane make a move to Manchester this summer.ESPN reported in May that Kane had told Spurs he wants to leave the club and City are one of the leaders to secure the England international's signature.The 2019-20 season was disrupted by the COVID-19 pandemic which forced a halt to the competition for 100 days and the following season saw fans kept out of stadiums for much of it.The attempt of six clubs to join the breakaway European Super League in April saw fans protest both outside and inside stadiums, with United fans breaking into Old Trafford to express their unhappiness with the club's owners.On the pitch, Guardiola's side ran away with the title, wrapping up the league on May 11, finishing 12 points clear of rivals United.While City also won the Carabao Cup, they lost 1-0 to Chelsea in the Champions League final and Leicester City walked away with the FA Cup.", "Section": "", "Writers": "", "URL": "https://www.espn.com/soccer/english-premier-league/story/4410573/premier-league-fixtures-2021-22-manchester-citychelsea-face-tough-startmanchester-united-have-favourable-opening", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}