{"Type": "", "Time": "2021-06-16", "Headline": "King: Reconvene Parliament as soon as possible | The Star", "Text": "\n                    Wednesday, 16 Jun 2021\n                KUALA LUMPUR: The King has called for the Parliament to be reconvened as soon as possible.Istana Negara Comptroller of the Royal Household Datuk Ahmad Fadil Shamsuddin said that Yang di-Pertuan Agong Al-Sultan Abdullah Ri'ayatuddin Mustafa Billah Shah conveyed this after looking at all the views presented by the political leaders, the Special Independent Committee on Emergency and experts as well as government agencies.\"This is to allow the Emergency Ordinance and the National Recovery Plan to be debated by members of the Dewan Rakyat,\" read the statement on Wednesday (June 16).The statement follows a special meeting of Malay Rulers held at Istana Negara earlier on Wednesday to discuss efforts to combat Covid-19.He said His Majesty realised the importance of a functioning Parliament during the pandemic in order for lawmakers to debate the Emergency and the national recovery plan.\"Members of the Dewan Rakyat can also discuss the government's spending to help the rakyat who are facing hardship and to recover the national economy,\" he said.He said His Majesty also called on the government to act decisively to simplify bureaucracy and speed up the Covid-19 vaccination process in order for the country to achieve herd immunity as early as possible.The King also expressed the need for a strong and stable government administration so it can function effectively in handling the spread of Covid-19 and to heal the country's economy, added Ahmad Fadil.\"His Majesty also is of the view that vaccination is the only exit strategy to curb the spread of the Covid-19 in the country,\" said Ahmad Fadil.\"The King also expressed his highest gratitude for the continuous support of the Malay Rulers who reflected the concern of the country and for the livelihood of the people,\" read the statement.Yang di-Pertuan Agong also expressed his gratitude to frontliners and the rakyat for sacrificing and their efforts to fight the spread of Covid-19, added Ahmad Fadil.The King also urged the people to continue and pray that the rakyat and the country are protected by Allah and will be able to end the pandemic.Related stories:No need to extend Emergency beyond Aug 1, say Malay RulersSpecial meeting of Malay Rulers: Johor Sultan, Armed Forces Chief leave the PalaceSpecial meeting of Malay Rulers: All have arrived except Kelantan Ruler\n\nTags / Keywords:\nmalay rulers\n                                                                ,\n                                                                                                King\n                                                                ,\n                                                                                                Parliament\n                                                                ,\n                                                                                                istana negara\n                                                                ,\n                                                                                                emergency\n                                                                ,\n                                                                                                covid-19\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/news/nation/2021/06/16/king-reconvene-parliament-as-soon-as-possible", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}