{"Type": "", "Time": "2021-06-16", "Headline": "Dickson Yeo, man who spied for China, to remain behind bars", "Text": "SINGAPORE — Dickson Yeo, the Singaporean man who was jailed in the US for spying for China and was arrested by the Internal Security Department (ISD) upon his return to Singapore last year will be continue to be held in detention under the Internal Security Act.In a statement on Tuesday (15 June), the department said its investigations have established that Yeo \"worked for the intelligence apparatus of a foreign state and had carried out various taskings given to him by his foreign handlers in exchange for monetary gains\".From 2016 until his arrest in the US in 2019, Yeo was asked to source for information and provide reports on issues, including information relating to Singapore, and had approached various people in Singapore to try to get information for his reports, said the ISD.He also set up a front company in Singapore as a cover, not only for information-gathering activities but also for his foreign handlers to recruit others.\"He had also tried, but failed, to secure employment in the Singapore government sector to further his information-gathering activities,\" the department added.The ISD said its investigations are still ongoing and Yeo's continued detention is necessary \"to facilitate probes into the full extent of his activities\".\"The Singapore Government takes a very serious view of anyone who enters into a clandestine relationship with a foreign government and engages in activities at the behest of the foreign power that is inimical to our national security and interests, including bilateral relations,\" the department added.Yeo was a doctoral candidate at the National University of Singapore's Lee Kuan Yew School of Public Policy (LKYSPP) when he was recruited by Chinese intelligence officers after a 2015 trip to Beijing to give a presentation on the political situation in Southeast Asia.He was first arrested by American counterintelligence officers in November 2019. He pleaded guilty in July last year to one charge of operating illegally as a foreign agent, and admitted to working between 2015 and 2019 for Chinese intelligence “to spot and assess Americans with access to valuable non-public information, including US military and government employees with high-level security clearances”.A few days after he entered his plea, LKYSPP said it had terminated Yeo’s PhD candidature with immediate effect. Yeo had enrolled as a PhD student there in 2015 and was granted a leave of absence in 2019.In October last year, Yeo was jailed for 14 months in the US for passing to the Chinese government valuable, but unclassified, military and political information that he had duped a number of Americans into giving him. Prosecutors said that Yeo was motivated by monetary gain and a shared desire with China to weaken the global standing of the US. Among the information Yeo handed over to China were reports on a military aircraft program, US troop withdrawal in Afghanistan and on a US Cabinet member, who was not identified in court documents.“I take full responsibility for what I have done,” Yeo reportedly said during sentencing. “I am sympathetic to China’s position, but it was not my intention to harm anyone.”In a statement announcing his arrest upon his return to Singapore in December last year, Singapore's Ministry of Home Affairs said, “Singapore will not allow our nationals to be subverted or used by any foreign actors for activities prejudicial to our security and national interests.\"We will deal firmly with such individuals in accordance with our laws,” the ministry added.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeRelated story:Dickson Yeo, Singaporean who spied for China, arrested by ISDSingaporean pleads guilty in US to working for Chinese intelligenceSingapore man sentenced to prison for spying for China in USFor Yemeni fisherman Fares Abdulhakeem and his friends, the day was like any other as they headed out to sea to earn a living in the war-torn country -- until they hit the jackpot in the belly of a whale.If you’re a foodie that’s leaving the comforts of your home to try the hottest restaurant in town, here are the credit cards you should have in your wallet. If there’s one thing Singaporeans love more than good food, it’s good food deals. Whether you’re […] The post Best Dining Credit Cards In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.If you’ve got a Citibank credit card, you’re in luck. Here are the deals you can enjoy as a Citibank credit cardmember (on top of the credit card’s own perks). A well-known global bank, Citibank offers some of the best credit cards in Singapore. It […] The post Citibank Credit Card Promotions and Deals: June 2021 appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Malaysian durians have topped fruit and vegetable presales at a big Chinese retail festival, showing the pulling power of the pungent delicacy.A Malaysian court Wednesday overturned an inquest verdict of \"misadventure\" in the death of a French-Irish schoolgirl who vanished in the jungle, replacing it with an \"open\" ruling in a victory for her family.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neThe US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.EVOS Savage Girl started the finals strong by defeating DR Hellcats in the opener. However, the Filipina squad bounced back in the next game to force the series to a decider.With Afghan troops in retreat and soon to lose vital American air support, Taliban commanders are voicing exuberance about quickly seizing full control of the country and re-establishing their version of an Islamic state.US carrier Southwest Airlines was ramping operations back up Tuesday after canceling some 500 flights following a second major outage in 24 hours due to computer issues.Chinese billionaire Jack Ma of Alibaba is keeping a low profile and has taken up painting as a hobby, while the tech giant he co-founded has put last year’s regulatory troubles behind it, according to his close business partner Joseph Tsai. In a wide-ranging interview with American media, Tsai said Ma was living a “normal life”, and also weighed in on Hong Kong’s national security law and global prospects for post-pandemic economic recovery. “He is lying low right now,” Tsai, executive vice-chaiThe European Union and United States launched a trade and technology council that seeks to “write the rules of the road” on the global economy, in the face of growing competition from China. It was the latest salvo against Beijing on US President Joe Biden’s whistle-stop European tour, which had seen him succeed in rallying support among the G7, Nato and now EU for a much-vaunted transatlantic coalition to face down China’s rising influence. A joint EU-US statement said the council would focus oEuropean and US stock markets marked time on Wednesday as investors brace for fresh signals from the US Federal Reserve on its stimulus policy.A minimalist can get away with less The post How Much Does It Cost To Furnish Your HDB Flat? appeared first on DollarsAndSense.sg.The freehold residential redevelopment site in Lorong J Telok Kurau Road presently seats two detached houses and a pair of semi-detached houses, which are to be sold collectively The post Freehold residential redevelopment site in Telok Kurau for sale at $30.6m appeared first on iCompareLoan.Royal Caribbean is pushing back the maiden voyage of a new ship by a month after eight crew members tested positive for Covid-19, the company's chief executive said.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aSmall is beautiful again in Hong Kong’s initial public offerings (IPOs) as retail investors reaped a windfall from some eye-catching market returns in the absence of blockbuster tech listings. Angelalign Technology is extending that stellar run. Shares of the Chinese maker of clear orthodontic braces soared in its trading bow on Wednesday, more than doubling the money for retail investors who turned its HK$2.91 billion (US$374 million) offering into the city’s best market debutant so far this qu", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/dickson-yeo-singaporean-spied-china-remain-behind-bars-040547816.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}