{"Type": "", "Time": "2021-06-16", "Headline": "Consensus among all needed for global tax reforms: Wong, Politics News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.The move to reform the global tax system and set a global minimum corporate tax rate is understandable, but the Group of Seven (G-7) wealthy nations cannot be the only ones setting the rules, said Finance Minister Lawrence Wong.All countries, big and small, must be involved in coming to a global consensus. This will also ensure a level playing field across all jurisdictions, he added yesterday.Speaking at the CNBC Evolve Global Summit about a week after the G-7 countries agreed to the historic tax deal, he acknowledged the need for deeper international cooperation to synchronise taxation systems around the world.He added: \"When these new rules are in place, Singapore will certainly adjust our tax systems accordingly to be in line with the global consensus, and also in consultation with businesses here.\"The tax agreement, many years in the making, would force multinational corporations to pay taxes in all countries they operate in. The G-7 has committed to a global minimum corporate tax of at least 15 per cent in the agreement.Asked about this, Mr Wong said: \"It's a judgment call... But we also have to be careful that this new threshold doesn't end up being a maximum rate that ends up not allowing countries to generate more revenues than they would desire to.\"Singapore's headline corporate tax is 17 per cent, but the effective tax rate may be lower.He added that there was also a need to make sure the new rules do not inadvertently lead to reduced incentives for businesses to invest and innovate because \"it will just shrink the pie for everyone and we'll be then scrambling for our share of a smaller pie\".The G-7 deal comes as governments around the world emerge from the Covid-19 pandemic with record levels of borrowing and grapple with how to raise revenues.While Singapore had been able to draw on about $50 billion of its past reserves to tide the country through the crisis, Mr Wong said it continues to run deficits and expects healthcare and social spending to rise in the coming years as the population ages.When these new rules are in place, Singapore will certainly adjust our tax systems accordingly to be in line with the global consensus, and also in consultation with businesses here.That is why the country is thinking of how to raise revenues in a way that is fair and equitable, he added.Asked if that would mean higher taxes in Singapore, Mr Wong said the Government is studying different options for tax increases.In doing so, it will have to ensure that Singapore continues to \"have a tax system that's fair and progressive and equitable to everyone\", he added.\"Basically, those with means should pay their fair share of taxes.\"He noted that this was also the maxim underlying the global tax reforms.\"In many developed countries with rapidly ageing populations, they find it hard to impose taxes on their population because the young will end up with a disproportionately high fiscal burden. At the same time, they find it difficult to tax corporates because the corporate tax base is increasingly mobile in this globalised world,\" he said, adding that this is why there has been increased pressures on international taxation systems.Asked how best to make Singapore a more digitalised and future-ready economy, Mr Wong said the country has prioritised spending on digital transformation and building a green economy to keep its competitive edge.On digital transformation, he said it cuts across all sectors and improvements are being made to boost digital infrastructure and connectivity.Meanwhile, he acknowledged that the debate is still ongoing on what constitutes green investments, and said Singapore is participating in forums on developing stricter, more rigorous standards.For now, he said, Singapore uses a whole range of different measurements and criteria to determine a bona fide green investment, with factors such as carbon intensity and energy usage efficiency.On whether Singapore would ever have to make a choice between protecting the climate and pursuing growth, Mr Wong said: \"It is indeed a very difficult trade-off, and I think that trade-off and the decisions to make have to be made not just by Singapore, but also by countries everywhere.\"The reality is that the world is facing a climate emergency. Perhaps all that we are seeing now with Covid-19 is really just a dress rehearsal for the bigger emergency that is to come, which is climate change.\"Mr Wong added that there would be a cost to mitigating climate change and \"someone has to pay for it\".For a start, the carbon price around the world will have to be much higher, and this will translate into higher prices for people, he noted.He said Singapore will do its part and has already started with a carbon tax, which will be reviewed and potentially raised in future in line with plans to lower emissions and achieve greener growth.Mr Wong, who also spoke about Covid-19 and its impact on the economy, said the global trading system has mostly adjusted and recovered from the initial hit when the pandemic started.But he was less sanguine about the prospects for air travel.With the region still facing rolling waves of infection and vaccination rates for many countries still low, \"I don't think we will be able to see open and free travel in the region, in particular, any time soon\", said the minister, who co-chairs the multi-ministry task force tackling the pandemic.Asked about travel bubbles, he said he refrains from talking about them because \"each time we talk about it, it gets burst and then we all start getting disappointed\".Singapore will continue to talk to countries in the region with low, stable infection rates to establish safe travel lanes for two-way travel, he added.On whether the country will ease restrictions further, he said the reopening will be done in a controlled manner to guard against outbreaks.He added that when Singapore reaches a stage where its vaccination rates are higher, there will be \"more confidence to ease up on restrictions further\".The hope is that at least 50 per cent of Singapore residents will be fully vaccinated by August, he said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/politics/consensus-among-all-needed-for-global-tax-reforms-wong", "Source": "google"}