{"Type": "", "Time": "2021-06-16", "Headline": "Nine more infections linked to Bukit Merah View cluster, Latest Singapore News - The New Paper", "Text": "The closure of Bukit Merah View Market and Food Centre will be extended to June 26, after nine more cases were linked to the cluster yesterday, taking the total number of linked cases to 25. The centre has been closed since Sunday and was meant to reopen today.There were 14 cases confirmed yesterday.Separately, Telok Blangah Drive Food Centre will be closed for deep cleaning from today till Friday after a hawker there tested positive. Testing of stallholders at Redhill Market and Food Centre continues today after an infected person was found to have visited there.Three of the nine cases announced by the Ministry of Health (MOH) yesterday were food stall vendors at Bukit Merah View Market and Food Centre.A sales executive at Halnaz Frozen Goods and a teacher at KidsCampus Chai Chee were also linked to the cluster.The latter, a 35-year-old, is a family member of a previous case, a 42-year-old man who works as a hawker at Telok Blangah Drive Food Centre and tested positive on Monday.However, as the hawker did not declare the teacher as his close contact, she was not put on quarantine. She is asymptomatic and was detected when she went for a Covid-19 test at a clinic on Monday. She tested positive later that day.The detection of more cases among market and food centre staff at Bukit Merah View and close contacts suggests there is ongoing spread with wider transmission, said MOH yesterday.Anyone who visited the shops at 115 and 116 Bukit Merah View between May 25 and June 12 is advised to monitor their health closely and minimise social interactions as far as possible for 14 days from their date of visit.They should also see a doctor immediately if they feel unwell. Free Covid-19 testing is also available for this group.Aside from the nine cases linked to the Bukit Merah centre cluster, there was one other linked case last night, a 35-year-old senior executive at Nets.Four unlinked cases were also announced, including a 41-year-old migrant domestic worker. After she developed symptoms on Monday, her employer took her to a regional screening centre (RSC) to get tested for Covid-19, and she later tested positive.MOH said yesterday that those who are unwell or have medical concerns should consult their primary care doctors and not go directly to an RSC to get tested unless specifically invited to do so. - THE STRAITS TIMES14 New cases34 Deaths10 Community, linked137 In hospital4 Community, unlinked62315 Total cases0 Imported61896 Total recoveredGet The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/nine-more-infections-linked-bukit-merah-view-cluster", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}