{"Type": "Singapore", "Time": "2021-06-16", "Headline": "Chinatown Complex, Night Safari among places visited by COVID-19 cases during infectious period", "Text": "SINGAPORE: Chinatown Complex and the Night Safari were on Wednesday (Jun 16) added to a list of public places visited by COVID-19 community cases during their infectious period.The wet market and a myCK outlet at Chinatown Complex were on the list.Other new locations include Fu Lu Shou Complex, Kim San Leng coffee shop at 116 Bukit Merah View and Katong Shopping Centre, said the Ministry of Health (MOH).Two supermarkets were also added to the list, both within shopping malls: Sheng Siong at Junction 10 and NTUC FairPrice at Katong V.The list of new locations is as follows:The list excludes residences, workplaces, healthcare facilities and public transport.Those identified as close contacts of cases would have been notified by MOH.As a precautionary measure, individuals who were at these locations during the specified timings should monitor their health closely for 14 days from the date of their visit.\"They should see a doctor promptly if they develop symptoms of acute respiratory infection (such as cough, sore throat and runny nose), as well as fever and loss of taste or smell, and inform the doctor of their exposure history,\" said the ministry.There is no need to avoid places where confirmed cases of COVID-19 have been, added MOH.\"The National Environment Agency will engage the management of affected premises to provide guidance on cleaning and disinfection,\" said the Health Ministry.Singapore reported 19 new COVID-19 community cases on Wednesday, includingthree with no links to previous infections.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,MOH", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/chinatown-complex-night-safari-places-visited-covid-19-cases-moh-15027458", "Source": "google"}