{"Type": "Singapore", "Time": "2021-06-16", "Headline": "Woman seen without a mask asks again for charges to be dropped, citing 'immunity' as a citizen and as an ex-SAF officer", "Text": "SINGAPORE: A womanfacing charges for not wearing a maskon multiple occasions returned to court properly masked on Tuesday (Jun 15) and asked again for the charges to be dropped, citing \"immunity as a citizen\" and an ex-Singapore Armed Forces (SAF) officer.Phoon Chiu Yoke, 53, said she was involved as an \"ex-plaintiff\" and as a witness to unspecified cases in the SAF and she could not face her current case in a public court without \"prejudice\" and causing embarrassment to the SAF and the Government of Singapore.The judge told her that the past cases she might have been involved in are irrelevant to her current charges.Phoon faces multiple charges for contravening COVID-19 regulations by not wearing a mask. She was given most of the charges last month, after turning up in court for an earlier offence and being photographed without a mask.She was remanded at the Institute of Mental Health and released on bail, but no details of her IMH report were given in open court.On Tuesday, the prosecutor asked for a three-week adjournment, saying there were additional charges pending for Phoon.Phoon, who was unrepresented, told District Judge Janet Wang: \"I'm applying for all these charges to be dropped. I was an ex-naval officer in the SAF ... I was an ex-plaintiff to cases and an eyewitness, it's not possible for me to have a fair hearing because of all these cases previously.\"She added that she could not continue with this public case without prejudicing or causing embarrassment to the SAF and the Government of Singapore.Asked by the judge to explain what these past cases were, Phoon repeated that she was a plaintiff in \"a few cases\", without elaborating.\"I should be granted immunity as a citizen and also as an ex-SAF officer,\" she added.The judge reiterated to her that any prior matters she might have faced in the SAF would not be relevant to the current set of charges.\"Your honour I beg to differ, because due to the grave matters in the previous charges when I was serving in the SAF, it's not possible for me to have a fair hearing in any court in Singapore,\" Phoon said.\"These are matters which (are) very serious ... and I do not have the privy to discuss this in a public court.\"The judge told her again that this is not relevant, but Phoon said she begged to differ.Judge Wang told her she might want to seek legal advice and adjourned the case to July. Phoon remains out on bail of S$8,000.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "court,crime,COVID-19,Phoon Chiu Yoke", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/phoon-chiu-yoke-mask-saf-officer-navy-court-15016890", "Source": "google"}