{"Type": "", "Time": "2021-06-16", "Headline": "Singapore central bank reprimands insurers AIA, Aviva and Prudential", "Text": "SINGAPORE, June 15 (Reuters) - Singapore's central bank said on Tuesday it has reprimanded the local businesses of insurers AIA, Prudential and Aviva for breaching requirements related to risk management and supervisors' pay. The Monetary Authority of Singapore (MAS) said its investigations found numerous instances where remuneration was paid to supervisors over sales of investment products and life policies, violating its regulations. A MAS reprimand is issued when there are failures in a financial institution that may pose potential risks to its business, market participants and investors. Those reprimanded were AIA Financial Advisers Private Limited, Prudential Assurance Company Singapore, Aviva Ltd and Aviva Financial Advisers Pte Ltd. The companies did not immediately respond to separate requests for comment. The MAS has dealt firmly with these financial institutions \"to send a clear message to the industry on the importance of upholding high ethical standards,\" Ho Hern Shin, deputy managing director, financial supervision, said in a statement. (Reporting by Chen Lin; Editing by Martin Petty) My Policeman has finished filming.The Federal Reserve announced Wednesday that it was keeping interest rates near zero for now but indicated that it may raise rates sooner than previously expected in response to strong growth and rising inflationary pressures. “Progress on vaccinations has reduced the spread of COVID-19 in the United States,” the Federal Open Market Committee said in a statement. “Amid this progress and strong policy support, indicators of economic activity and employment have strengthened.” The Fed raised its eThe prices of so-called meme stocks may be distorted because the majority of trades in those names are executed away from public exchanges where share price formation occurs, the head of the New York Stock Exchange said on Wednesday.  \"Meme stocks,\" which often start as low-priced, highly shorted stocks that users of online forums such as Reddit's WallStreetBets rally behind, are some of the most heavily traded and volatile shares on any given day.  Shares of companies like video game retailer GameStop Corp and theater chain operator AMC Entertainment have whipsawed this year, with GameStop having rallied more than 1,600% in January alone, prompting trading halts by some brokers and sparking Congressional and regulatory hearings.French businessmen Marc Menasé, Michaël Benabou and Charles-Hubert de Chaudenay, along with investors MACSF Epargne Retraite and IDI, said on Wednesday they plan to list a 150 million euro special purpose acquisition company (SPAC) in Paris.  Named DEE Tech, the SPAC's capital could be increased to up to 195 million euros ($234 million), the founders said in a statement.  A SPAC is a shell company that uses proceeds from going public to buy other firms that have not yet been identified at the time of the listing.There’s a new SUV Nürburgring lap record, and it’s owned by a new Porsche Cayenne variant previewed for us a short time ago.  Porsche decided the best way to tease the debut of its “new performance model of the Cayenne series” is to reveal that it bested every other crossover/SUV on the Green Hell, and we don’t think it’s the worst of ideas.  The previous record holder also came from within the Volkswagen Group.Controversial Republican had previously described rioters as ‘peaceful patriots’A rope tornado whipped up dust and dirt as it snaked across farmland in D’Arcy, Saskatchewan, on June 15.“This was early in the formation, when the tornado was moving quite quickly and had just touched down,” wrote filmer Danae Serfas on Facebook.“Once it was over, we went to where it crossed the road. It had ripped all of the gravel off the ground,” Serfas told Storyful.On Tuesday Environment Canada warned of “hot, windy and stormy” conditions capable of producing hail, tornadoes, and lightning.News reports said several communities were placed under tornado warnings, but damage was minimal. No injuries were reported. Credit: Danae Serfas via StoryfulIndigenous Services CanadaLincoln Motor will launch its first all-electric vehicle in 2022 followed by three other EVs as part of the luxury brand's goal to electrify its entire portfolio by the end of the decade.  The first EV will come to market just in time for Lincoln's 100th birthday celebration — and nearly four years since initial reports emerged that the brand was aiming to electrify its lineup.  Like GM's luxury brand Cadillac, Lincoln doesn't have an all-electric vehicle in its lineup.In today's world, the best way to stop living paycheck-to-paycheck may be making some counterintuitive decisions—and unlearning everything you thought you knew about money. Here's how to get started.Retail and hospitality sectors alone have built up £5bn in rent arrears which landlords cannot yet pursue them forU.S. President Joe Biden did not secure a commitment from his Russian counterpart, Vladimir Putin, on Wednesday to renew a U.N. cross-border aid operation into Syria, a senior administration official said ahead of an expected showdown over the issue at the United Nations Security Council next month.  Washington and several other members of the 15-member Security Council are pushing to expand the cross-border operation, which U.N. aid chief Mark Lowcock has described as a \"lifeline\" for some 3 million Syrians in the country's north.Pinkett Smith shared some of Shakur's unpublished words.Cult Gaia's Serita Cutout Dress is no doubt the style of the season. The post This $460 Cult Gaia dress is the dress of the summer — here are 5 affordable alternatives to it appeared first on In The Know.Demonstrators have been holding vigils and protests in the space since Winston Smith, a Black man, was killed by local deputies on a fugitive taskforce earlier this month‘While disappointing, this is the right decision for the health and well-being of our crew and guests’Los Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.Imagine owning Wayfair Inc. or Chewy, Inc. before their brands became what they are today. We are pleased to invite you to meet the COO and CEO of PARTS iD, Inc., which recently went public and operates a similar business model but remains off the radar of many investors. IPO Edge and The Palm Beach […]This stress relief strategy—rooted in Chinese acupressure and modern psychology—has emerged in recent years to help heal anxiety, fear, and emotional pain on your own.Joe Biden wrapped up the first overseas trip of his presidency Wednesday after rallying allies and facing off with Russian President Vladimir Putin.  The eight-day, three-country swing included meetings with leaders of the Group of Seven wealthiest democracies in scenic Cornwall, England, and a meeting with Queen Elizabeth II at Windsor Castle.  In Brussels, Biden huddled with nearly a dozen NATO allies and met with the leadership of the European Union.", "Section": "", "Writers": "", "URL": "https://sg.finance.yahoo.com/news/singapore-central-bank-reprimands-insurers-063429059.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}