{"Type": "", "Time": "2021-06-16", "Headline": "Biden calls for 'basic rules of the road' at pragmatic summit with Putin, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.GENEVA (REUTERS) – US President Joe Biden and Russian President Vladimir Putin decided at a “pragmatic” first summit on Wednesday (June 16) to hold arms control and cyber-security talks and return their respective ambassadors, while agreeing to differ on other issues.The discussions at the lakeside Villa La Grange in Geneva lasted less than four hours – far less than Biden’s advisers had said they expected.Putin, 68, called Biden, 78, a constructive, experienced partner, and said they spoke “the same language”, but added that there had been no friendship, rather a pragmatic dialogue about their two countries’ interests.Biden said he had “told President Putin we need some basic rules of the road that we can all abide by”, adding: “I did what I came to do.”The scheduling of separate news conferences meant there was none of the joviality that accompanied a 2018 meeting in Helsinki between Putin and Biden’s predecessor, Donald Trump, where Putin presented Trump with a soccer ball. There was also no shared meal.Putin, who was first to brief reporters, said the meeting had been constructive, without hostility, and had showed the leaders’ desire to understand each other.He said it was “hard to say” if relations with the United States would improve, but that there was a “glimpse of hope” regarding mutual trust. There were no invitations to Washington or Moscow.Biden, speaking shortly afterwards, said there was “no substitute for face-to-face dialogue”, and that he had told Putin his agenda was “not against Russia”, but “for the American people”.He also said the discussions had spent a great deal of time on arms control and on cyber-attacks, where he had told Putin that “critical infrastructure should be off-limits”.In perhaps his strongest remark, he said the consequences would be “devastating for Russia” if jailed opposition figurehead Alexei Navalny died.Both men said Russia and the United States shared a responsibility for nuclear stability, and would hold talks on possible changes to their recently extended New Start arms limitation treaty.Putin showed little appetite for compromise on a range of other issues, dismissing Washington’s concerns about Navalny, about Russia’s increased military presence near Ukraine’s eastern border, and about US suggestions that unidentified Russians were responsible for a series of cyber-attacks in the United States.Putin said Navalny had ignored the law and had known what would happen if he returned to Russia from Germany, where he had received treatment for an attempt inside Russia to kill him with poison.He also accused Kyiv of breaking the terms of a ceasefire agreement with pro-Russian rebels in eastern Ukraine.The Kremlin leader said Russia had been the target of numerous cyber-attacks originating in from the United States.Biden said he had raised human rights issues and also the fate of US citizens jailed in Russia. Putin said he believed some compromises could be found, although he gave no indication of any prisoner exchange deal.Arms control is, however, one domain where progress has historically been possible despite wider disagreements.In February, Russia and the United States extended for five years the New Start treaty, which caps the number of strategic nuclear warheads they can deploy and limits the land- and submarine-based missiles and bombers to deliver them.Both sides had said in advance of the summit that they hoped for more stable and predictable relations, even though they were at odds over everything from arms control and cyber-hacking to election interference and Ukraine.Putin and Biden shook hands on arrival before going inside, and Biden flashed a \"thumbs-up\" to reporters as he left the villa where the talks were held and got into his limousine.The first round of talks – which included Biden, Putin, US Secretary of State Antony Blinken and Russian Foreign Minister Sergei Lavrov – lasted almost two hours, officials said.Talks resumed after a break at around 4pm (10pm Singapore time), with Moscow’s ambassador to the United States, Anatoly Antonov, who was recalled to Russia in March, among those present. That round ended at 5.05pm.Relations between Moscow and Washington have been deteriorating for years, notably with Russia’s 2014 annexation of Crimea from Ukraine, its 2015 intervention in Syria and US charges – denied by Moscow – of meddling in the 2016 election that brought Donald Trump to the White House.They sank further in March when Biden said he thought Putin was a “killer”, prompting Russia to recall Antonov to Washington for consultations. The United States recalled its ambassador in April.Putin said on Wednesday that he had been satisfied by Biden’s explanation of the remark.Trump’s summit in 2018 with Putin in Helsinki had included a meeting accompanied only by interpreters, but Biden and Putin had no solo talks.Standing beside Putin in Helsinki in 2018, Trump refused to blame him for meddling in the 2016 US election, casting doubt on the findings of his own intelligence agencies and sparking a storm of domestic criticism.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/us-president-biden-meets-russian-leader-putin-in-geneva-for-summit", "Source": "google"}