{"Type": "", "Time": "2021-06-16", "Headline": "Euro 2021: After a year's absence, fans are returning and football is back! | Marca", "Text": "Editions:En/football/uefa-euroThe Euro 2020 match between Hungary vs Portugal had over 60,000 in attendanceHungary's 3-0 defeat to Portugal on Tuesday isn't likely to be a game that will be remembered for too long for what happened on the pitch, but the occasion will go down in history.As many as 61,000 fans filled the Puskas Arena, which made it the first elite-level football match to be played in an almost full stadium since the beginning of the coronavirus pandemic.The last year or so of football has started to become normal, not that anybody would have wanted empty stadiums to become a habit. But in the time that fans have been away from their seats, new norms have been found. The ability to hear players' and coaches' every word was novel for a while, then became a luxury that had never been afforded to television broadcasters and attending journalists. As far as the football itself goals, home advantage became no more than something from a bygone era, with away teams enjoying increasingly more success in the absence of far from welcoming hosts. The wait for the real normality is ending, though, and Tuesday evening in Hungary reminded us of that. Streets around them are going to be closed off and/or filed with traffic but, most importantly, the soundtrack that all football fans have craved for so long is returning.Every goal celebration, shouts for handball, protests against officials, and the momentary silence when a home team concede a goal before the away fans' cheers come through are all on their way back. Football as we know it was taken away from us in 2020, but it's coming back in 2021, and let's hope that it's for good.©  Unidad Editorial Información Deportiva, S.L.U. Todos los derechos reservados.Follow us", "Section": "", "Writers": "", "URL": "https://www.marca.com/en/football/uefa-euro/opinion/2021/06/15/60c91dffe2704ec45e8b45b8.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}