{"Type": "Singapore", "Time": "2021-06-16", "Headline": "Cancelled meeting with PA a 'missed opportunity for constructive dialogue', says woman in standee controversy", "Text": "SINGAPORE: The People's Association (PA) decision to cancel a meeting with a couple whose wedding photo the PA turned into a cut-out standee is a \"missed opportunity for constructive dialogue\", said Ms Sarah Bagharib, the woman in the photo.The standee had been used without the couple's permission as part of Hari Raya decorations at a Tiong Bahru estate in Radin Mas constituency.On Tuesday (Jun 15), Ms Sarah, a communications specialist, responded to a statement the PA issued on Monday explaining why it had decided not to meet her and her husband, Mr Razif Abdullah.The PA said it had offered the meeting to apologise to the couple in person, and to clarify its position, elaborate on the steps it had taken to prevent such incidents from recurring, and hear her suggestions of how it might improve.The PA, in that statement on Facebook, then explained why it had decided to cancel the meeting, saying comments that Ms Sarah had made online led the PA to believe that her purpose in meeting them had \"gone far beyond the Radin Mas incident\".The PA also said Ms Sarah \"characterised this incident as 'racist'\" and that she \"shared claims that this incident 'perpetuate the racist culture'\".\"These are accusations we reject. While the error was culturally insensitive, it was certainly not racist. It is not right to raise the allegation of racism, without basis, to stoke emotions and sentiments,\" said the PA in Monday's statement.It added that Ms Sarah had made a call online for the public to share their messages and suggestions to the PA. It said that the meeting should not be \"appropriated as a platform for her to funnel the views and comments of persons unrelated to the incident\".\"All these lead us to believe her purpose in agreeing to meet with us has gone far beyond the Radin Mas incident. We therefore see no point in proceeding with the meeting,\" PA said.SARAH BAGHARIB RESPONDSIn an Instagram post on Tuesday evening, Ms Sarah said that it was disappointing that PA had decided to cancel the meeting, which had been scheduled to take place earlier in the day at 10am.\"While there was an infringement of our privacy and Intellectual Property rights, our intentions have always been clear from the start - to be active citizens and to positively contribute to making Singapore a better, more inclusive home for our daughter,\" she said.\"We feel this is a missed opportunity for constructive dialogue; for thoughts and suggestions of members of the community to be relayed, and also for the People’s Association to listen to the people’s voices. It is unfortunate that the PA has turned this opportunity down.\"She added that the incident did not just affect her and her husband through the \"culturally insensitive\" depiction of Hari Raya celebrations, but also the \"wider community\" that celebrates Hari Raya.\"We will continue to advocate for deeper intercultural understanding and greater social cohesion in our everyday lives as Singaporeans,\" Ms Sarah said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "People's Association,culture,race", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/pa-peoples-association-sarah-bagharib-standee-hari-raya-15019792", "Source": "google"}