{"Type": "", "Time": "2021-06-16", "Headline": "Host Michelle Chia slams netizen who implied she and Pornsak breached Covid-19 rules, Entertainment News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Actress-host Michelle Chia, 45, has taken to social media to clarify that she did not breach Covid-19 safe distancing guidelines.On Sunday (June 13), she and actor-host Pornsak Prajakwit, 39, better known just as Pornsak, had a gathering with celebrity hairstylist Addy Lee, 50, for a meal at his place, together with two other members of his household.This was in accordance with the rules at the time, which allowed public social gatherings of two people, while each household could receive two visitors.Pornsak had posted a video on his Instagram Stories of the gathering, which was then shared by an Instagram user who questioned why there were five people at the gathering, implying that they had broken Covid-19 rules.A day later, Chia clapped back on her Instagram Stories with a reply: \"Because only Pornsak and I were guests. The rest are residents of the unit. Thank you for your 'kind concern'.\"Chia, who recently started live-stream company Mdada with Lee and Pornsak, followed up with a brutal note to the online vigilante in Chinese.\n(From left) Celebrity hairstylist Addy Lee with Michelle Chia and Pornsak Prajakwit in a photo from March. PHOTO: MDADA\n\"If you're free, then do something useful with your time. If you want to stir up trouble, you should be clear of the circumstances first. If not, you're the one who ends up looking like a fool,\" she wrote.\"But if this is how you find your own happiness, then we'll treat it as if we're doing a good deed, and give you happiness. Wishing you a delightful life.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/life/entertainment/host-michelle-chia-slams-netizen-who-implied-she-and-pornsak-breached-covid-19", "Source": "google"}