{"Type": "", "Time": "2021-06-16", "Headline": "Woman in Hari Raya wedding photo controversy responds to PA's cancellation of planned meeting, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The woman at the centre of a controversy over the misuse of her wedding photograph for Hari Raya Aidilfitri decorations has responded to the People's Association's (PA) decision to cancel a planned meeting, saying it was a missed opportunity for constructive dialogue.In a statement on Tuesday (June 15), communications specialist Sarah Bagharib, 30, said it was disappointing that the PA has decided to cancel the meeting with her and her husband that was meant to take place at 10am on Tuesday.\"While there was an infringement of our privacy and intellectual property rights, our intentions have always been clear from the start - to be active citizens and to positively contribute to making Singapore a better, more inclusive home for our daughter,\" she said.She was referring to how her and her husband's wedding photo had been used by a vendor to create a standee alongside a decorative platform and banner depicting Radin Mas MP Melvin Yong and his Hari Raya Aidilfitri greetings to residents at a Housing Board estate in Radin Mas constituency recently.This drew a public apology from the PA and an offer from the government agency to meet her and her husband, Mr Razif Abdullah, to apologise in person for the distress caused by its mistakes.The PA had explained in an earlier statement that its Radin Mas constituency office had engaged a vendor, Warabi Enterprise (Art Studio), to design and put up Hari Raya Aidilfitri decorations at the Tiong Bahru Orchid estate.After Ms Sarah drew attention to the matter, the PA removed the standee, and offered to meet the couple.However, the PA on Monday announced that it had decided to cancel the meeting, citing disagreements with the couple over the purpose of the meeting and how they had characterised the incident.The PA noted that she had made a public call for messages and suggestions ahead of the meeting, and said it did not see why the meeting \"should be appropriated as a platform for (Ms Sarah) to funnel the views and comments of persons unrelated to the incident\".It had also said Ms Sarah had shared claims that the incident \"perpetuates the racist culture\" and was \"racist\", and rejected these claims.In her response to the PA's decision, Ms Sarah said that the incident did not just affect her and her husband through the \"culturally insensitive\" depiction of Hari Raya Aidilfitri celebrations, but also the wider community that celebrates Hari Raya Aidilfitri.\"We are all equal stakeholders in the work that the PA does. We feel this is a missed opportunity for constructive dialogue; for thoughts and suggestions of members of the community to be relayed, and also for the People's Association to listen to the people's voices. It is unfortunate that the PA has turned this opportunity down,\" she said.\"We will continue to advocate for deeper intercultural understanding and greater social cohesion in our everyday lives as Singaporeans,\" Ms Sarah added.On Monday, the PA said it had wanted to clarify its position, elaborate on the steps it had taken to prevent such incidents from recurring, and hear her suggestions of how it might improve at the meeting.A post shared by sarah bagharib (@sarahbagharib)It also said it had, over e-mail, explained to Ms Sarah that it values racial and religious harmony in Singapore.The PA also said that what happened in Radin Mas was an isolated incident, but nevertheless shows that it can fall short.\"We agree it is important for our staff and volunteers to be sensitive to and knowledgeable about the cultures of all our ethnic groups. We are now looking at establishing a resource panel to guide and advise our staff on cultural matters,\" it said.It added that it will also step up training efforts to enhance staff and volunteers' understanding and appreciation of Singapore's different cultures.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/woman-in-hari-raya-wedding-photo-controversy-responds-to-pas-cancellation-of-planned", "Source": "google"}