{"Type": "", "Time": "2021-06-16", "Headline": "Malaysia's Malay rulers urge govt to reconvene Parliament, lift emergency after Aug 1, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.KUALA LUMPUR - Malaysia's King on Wednesday (June 16) said that Parliament should be reconvened \"as soon as possible\" to allow MPs to debate emergency laws and the country's Covid-19 recovery plan.In a statement issued by the national palace, also known as the Istana Negara, after a special meeting of the Malay rulers on Wednesday, Sultan Abdullah Ahmad Shah said he came to this conclusion after hearing views from heads of political parties, the Special Independent Committee on Emergency 2021 and briefings by government experts.The statement was signed by the Comptroller of the Royal Household, Datuk Indera Ahmad Fadil Shamsuddin.Malaysia’s Parliament last sat in December to pass this year’s Budget.A separate statement issued by the Council of Rulers - representing the nine royal Malay houses - said it agrees with the King that Parliament should be reconvened soon.The statement also said that Malaysia's national state of emergency should be lifted after Aug 1.\"There is no need to place the country under the state of emergency after 1 Aug, 2021,\" said the statement which was signed by the Keeper of the Royal Seal, Tan Sri Syed Danial Syed Ahmad.The ongoing state of emergency was imposed from Jan 11 in the light of rising Covid-19 cases.It suspends the requirement for Parliament to reconvene within six months of its last sitting.The state of emergency had also ensured that Prime Minister Muhyiddin Yassin's administration, whose control of the House has been challenged, remains in power.After hearing the views of the politicians and experts, \"His Majesty expresses his opinion that Parliament should reconvene as soon as possible\", the statement said. \"This will allow for debate by Members of Parliament on the emergency laws and the National Recovery Plan\".\"His Majesty also expresses his hope that the Covid-19 infection curve could be flattened quickly, and is of the view that vaccinations are the only exit strategy to control the spread of the Covid-19 pandemic in the country,\" it added.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/malaysias-king-urges-govt-to-reconvene-parliament-as-soon-as-possible", "Source": "google"}