{"Type": "", "Time": "2021-06-16", "Headline": "Euro 2020: Cristiano Ronaldo stunt costs Coca-Cola $4 billion", "Text": "Coca-Cola has lost a staggering $4 billion after Cristiano Ronaldo's viral press conference stunt at Euro 2020.Speaking to the media ahead of Portugal's opening clash with Hungary on Tuesday, Ronaldo didn't want a bar of two Coke bottles sitting on the desk in front of him.Coca-Cola is the official sponsor of Euro 2020 and have placed two bottles in front of everyone speaking at press conferences.But in a viral moment that has sent social media users into a frenzy, Ronaldo picked up the two Coca-Cola bottles and put them out of sight before holding up his water bottle and saying: \"Drink water.\"Coca-Cola probably wouldn't have been impressed by Ronaldo's actions, and even less so after taking a look at the stock market on Tuesday.The company saw a staggering $4 billion wiped off its market value in the hours after Ronaldo's press conference.According to The Athletic, Coca-Cola’s shares were worth $73.02 each before the press conference, but dropped to $71.85 afterwards.That 1.6 per cent drop in value is worth the eye-watering total of $4 billion.Coca-Cola released a statement after Ronaldo's presser, saying “everyone is entitled to their drink preferences” and everyone has different “tastes and needs”.On Tuesday, Ronaldo became the all-time top scorer at the European Championships after two goals in the final minutes helped title holders Portugal beat Hungary 3-0 in their Group F opener.Ronaldo now has 11 goals, taking sole possession of the record he previously shared with France's Michel Platini on nine.Portugal finally broke the deadlock in a game they dominated thanks to Raphael Guerreiro six minutes from time just after Hungary had a goal ruled out for offside.A Ronaldo penalty and a second effort added to the final score, which was harsh on Hungary who worked hard in front of a packed Puskas Area in Budapest - the only stadium to be filled to capacity at the Euros due to the coronavirus pandemic.Portugal had no trouble controlling the first half but struggled to convert their chances created into goals.Diego Jota had a good early opportunity but his powerful header was saved by Hungary keeper Peter Gulacsi, who also managed to block an attempt by Ronaldo in the 19th minute when the Portuguese superstar was already offside.Ronaldo then wrote his name in the record books with a goal from the spot late in the match after Willi Orban fouled Rafa Silva in the box. The Portuguese superstar then scored his 106th for Portugal and closed the gap to Iranian Ali Daei's record (109) of the all-time men's international top goalscorer.\"It was important to win, it was a difficult game,\" Ronaldo said. \"I'm grateful to the team for helping me to score two goals and be the Man of the Match. Now we must go on.\"Hungary's Szalai said the defeat \"is frustrating\" and that Portugal \"didn't work enough to score,\" while keeper Gulacsi believed they needed a little luck to score a goal.Also read: If you had invested Rs 25,000 in Bitcoin in 2015 this is how rich you would beHere's how much money Bill Gates makes per minuteHow much does Mark Zuckerberg spend on his security?Who is the secretive Bitcoin billionaire who invented Bitcoin? Unveiling Satoshi Nakamotowith AAPPremier League champions Manchester City will start the defence of their title away to Tottenham after the fixtures for the 2021-22 season were unveiled on Wednesday.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neMeet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Alibaba Group was the victim of a months-long web-scraping operation by a marketing consultant that siphoned up sensitive data including usernames and phone numbers.It's useful to be ready with the names of a few companies you'll scoop up in case a crash occurs. The post 3 Stocks I Will Buy If the Market Crashes Tomorrow appeared first on The Smart Investor.Sentosa isn’t expensive as you think it is. Here’s everything you need to know about the island’s entrance fees cost, car park rates, beach reservations and hacks on how to save. Thanks to COVID-19, plans to travel overseas for a well-deserved holiday is starting to […] The post Sentosa Island: Entrance Fee And Parking Rates appeared first on SingSaver Blog - We Compare, You Save.Learn more about scalp psoriasis. Look for scalp psoriasis treatments.Kevin Durant finished with 49 points while playing every minute of the game as the Brooklyn Nets rallied from a 17-point deficit to beat the Milwaukee Bucks 114-108 in game five of their NBA playoff series on Tuesday.Turkish President Recep Tayyip Erdogan on Tuesday pledged support for Azerbaijan if the ex-Soviet country was attacked, as he made a visit to the disputed Nagorno-Karabakh region.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Research best security system. Protect yourself and your home with wireless alarm systems.If you’re wondering whether Ethereum is a good long term investment, keep reading.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aThe largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.Sick of seeing others get rich in the stock market? Have you heard of Everlasting Stocks?The League of Legends: Wild Rift esports scene will be kicking into full gear this 19 June with the League of Legends: Wild Rift 2021 SEA Icon Series Summer Super Cup.A sinking fire-damaged container ship could take months to salvage because of rough monsoon seas, Sri Lanka said Tuesday, as authorities investigated whether the deaths of dozens of turtles and dolphins were caused by the disaster.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.Cristiano Ronaldo netted a double to become the European Championship's all-time leading scorer as Portugal struck three times late on to beat a stubborn Hungary 3-0 in their Euro 2020 opener at a packed Puskas Arena on Tuesday.This new car cloth can easily remove all the car scratches and dents from your car.The Russian skipper of a container ship that caught fire and burned for almost two weeks before sinking off Sri Lanka's coast has been arrested and is expected to be charged with marine pollution, police said Monday.The inflation outlook among Americans is at its highest level ever, while many are upbeat about their employment situation, a New York Federal Reserve survey released Monday said.The report covering May showed one-year inflation expectations jumped 0.The emergence of problems in a new-generation nuclear reactor in China threatens to undermine efforts by its French designer to sell it elsewhere, and could hurt Beijing's nuclear industry, analysts said.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/euro-2020-cristiano-ronaldo-stunt-costs-coca-cola-52-billion-205154311-065441277.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}