{"Type": "", "Time": "2021-06-16", "Headline": "Spanish man jailed for killing and eating his mother - BBC News", "Text": "A Spanish man has been sentenced to 15 years in prison after killing his mother and eating her remains.Alberto Sánchez Gómez, 28, was arrested in 2019 after police found body parts around his mother's home - some in plastic containers.The court rejected Sánchez's arguments that he was experiencing a psychotic episode at the time of the killing.He will now serve 15 years for murder and a further five months for the desecration of a corpse. He has also been ordered to pay his brother €60,000 ($73,000, £52,000) in compensation.Police arrived at the home in eastern Madrid in February 2019 after a friend raised concerns about the welfare of María Soledad Gómez, who was in her 60s.During the trial, the court heard that Sánchez, then aged 26, had strangled his mother during a dispute. He then dismembered and ate parts of her body over the following two weeks, feeding some to his dog.Spanish media say he had been known to police because of violence against his mother and that he had breached a restraining order at the time of his arrest.Spanish man tried for 'killing and eating mother'Russian man charged with cannibalismSpain country profileBiden and Putin praise talks but discord remainsThe US and Russia agree to nuclear arms control talks but progress at the Geneva summit is limited.The long awaited handshake between Biden and Putin. VideoThe long awaited handshake between Biden and PutinAnother life-saving Covid treatment foundWhat Putin really wants from BidenWhat do young Americans admire about Russia?How Europeans have reacted to Biden's visitDrone cameras record social lives of killer whales. VideoDrone cameras record social lives of killer whalesHow Ethiopia has changed over the last 50 yearsBrexit and Northern Ireland - what are the options?The continuing trauma of S Korea's spy cam victimsUnidentified stones in SA spark diamond rush. VideoUnidentified stones in SA spark diamond rushBBC Worklife: Why women are more sexually fluidFootball phrases15 sayings from around the worldBiden and Putin praise talks but discord remains1Germany withdraws Nato platoon over 'racist' party2The 32-year-old taking on Big Tech3Spanish man jailed for killing and eating mother4Berlin squat riot leaves dozens of police wounded5California's drought may have solved plane mystery6The continuing trauma of S Korea's spy cam victims7US Senate votes to make Juneteenth a holiday8Another life-saving Covid treatment found9What do young Americans admire about Russia?10© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "Section": "", "Writers": "", "URL": "https://www.bbc.com/news/world-europe-57487868", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}