{"Type": "", "Time": "2021-06-16", "Headline": "Cristiano Ronaldo snub wipes billions off Coca-Cola’s market value | Euro 2020 | The Guardian", "Text": "Last modified on Wed 16 Jun 2021 09.47 EDTCristiano Ronaldo’s removal of two Coca-Cola bottles during a press conference at the European Championship has coincided with a $4bn fall in the share price of the drinks company.The Portugal captain is a renowned health fanatic and made it clear what he thinks of the carbonated soft drink. The 36-year-old shifted the bottles of Coca-Cola away from him during a press conference in Budapest on Monday in the prelude to his country’s Group F game against Hungary.Ronaldo followed it by holding up a bottle of water before declaring in Portuguese: “Agua!”, appearing to encourage people to choose that instead.Coca-Cola is one of the official sponsors of Euro 2020. The company’s share price dropped from $56.10 to $55.22 almost immediately after Ronaldo’s gesture, a 1.6% dip. The market value of Coca-Cola went from $242bn to $238bn – a drop of $4bn.A Euro 2020 spokesperson said: “Players are offered water, alongside Coca-Cola and Coca-Cola Zero Sugar, on arrival at our press conferences.” Everyone “is entitled to their drink preferences”.Ronaldo is a pop culture colossus, boasting almost 300 million Instagram followers.On Tuesday, he scored twice in Portugal’s 3-0 win over Hungary – moving beyond the France great Michel Platini as the record goalscorer at the European Championship finals, with 11. This article was amended on 16 June 2021 to reflect a correction by the AAP whose earlier report attributed the following quote to Coca-Cola instead of to a Euro 2020 spokesperson: “everyone is entitled to their drink preferences” reflecting different “tastes and needs”.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/football/2021/jun/16/cristiano-ronaldo-snubs-coca-cola-billions-wiped-off-drink-giants-market-value", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}