{"Type": "", "Time": "2021-06-16", "Headline": "Football: Hummels own goal gifts France 1-0 Euro win over Germany, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.MUNICH, GERMANY (REUTERS) - Title favourites France launched their Euro 2020 Group F campaign with a 1-0 victory over Germany on Tuesday (June 15), courtesy of an own goal by Mats Hummels, as the sluggish-looking hosts lost their opening fixture at the European Championship for the first time.The world champions went ahead in the 20th minute when midfielder Paul Pogba’s raking pass was fired back across the goal by Lucas Hernandez and defender Hummels shanked the ball into his own net as he tried to clear it.It was a deserved win for France, who also hit the crossbar while the Germans now have to up their game against holders Portugal on Saturday, while France play Hungary.“It was our first match and it was a huge game,” said France coach Didier Deschamps. “It could have been a semi-final or a final. But we have the three points that will be very important.“They are tough to play against but we were there, on the spot. This win does a lot of good.” Germany’s record 50th Euro match got off to a tentative start before a couple of French chances fell to Pogba and Kylian Mbappe.The visitors’ gradual pressure paid off when Pogba launched an outstanding cross-field pass to Hernandez, who cut the ball back only for Hummels, who had been dropped more than two years ago and was recalled for the tournament, to clip it into the roof of the net past his own goalkeeper Manuel Neuer.The Germans were desperate to impress in front of a home crowd to make amends for their shock 2018 World Cup first-round exit, but instead they rarely broke through the French rearguard.When they did it was usually with Robin Gosens from the left, and one of his crosses found Ilkay Gundogan, whose shot veered wide of the post.It was France who almost scored again in the 52nd when another quick break saw Adrien Rabiot cut in from the left but he hit the post with Neuer already moving in the opposite direction.That looked to shake the hosts into action, and they carved out three consecutive chances, with Gosens again in the mix, until an injury to Benjamin Pavard around the hour mark gave the French some much-needed respite.France gradually conceded possession but remained lethal on the break with Mbappe and Karim Benzema both putting the ball in the net but having their efforts ruled offside.Mbappe was also denied what looked like a penalty after out-sprinting Hummels to chase down a long ball in the 78th minute, but replays showed the German got just enough boot to the ball to prevent a shot before Mbappe went to ground.“It was a brutally intense game and we fought until the end,” Germany coach Joachim Loew said.“An own goal decided it. I cannot blame the team because we fought a lot. We maybe lacked a bit of punching power in and around the box.“Tomorrow, we have to process things but look ahead. We lost, we are disappointed, but we still have two games and we can fix it.”France, unbeaten in their last 17 competitive outings, are second in Group F behind holders Portugal, who beat Hungary 3-0 earlier on Tuesday.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-world-champions-france-open-euro-2020-campaign-with-win-over-germany", "Source": "google"}