{"Type": "", "Time": "2021-06-16", "Headline": "Girl uses $400 savings to buy groceries for the needy; others offer free meals, pizzas, Life News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Shakthipriya Saravanan may be only seven, but she is also pitching in to help the needy during the pandemic. As part of a charity project by her school, Lianhua Primary, she has set up a \"Share And Care\" corner in her neighbourhood to provide free groceries to anyone who needs them. It runs for a month till June 30.The corner was initially stocked with essentials such as rice, instant noodles and cooking oil bought with the girl's $400 savings and her parents' contributions. The selection expanded to include bread and Nutella as school volunteers and residents came forward to donate food.Beneficiaries of the corner have left thank-you notes for the Primary 1 pupil. It made Shakthipriya's mother, Mrs Jaymaleni Saravanan, 36, an executive at Singapore First Aid Training Centre, realise how \"small, kind actions have huge effects\".Says the girl: \"I am thankful that my cause is helping many people.\"Shakthipriya is among those stepping up to help those affected by the pandemic, including businesses affected by the dining-in ban.To support food and beverage (F&B) social enterprises badly hit by the restrictions, non-profit organisation Be Kind SG compiled a list of them on Facebook and encouraged people to patronise them.Founder of Be Kind SG, Ms Sherry Soon, 40, felt it was especially important to highlight F&B businesses employing people with special needs during this time.\"Social enterprises may have to let go of their staff if there is no business, and these staff may not be able to be re-employed as other employers may not give them a chance,\" she says.Other organisations, such as KB Free Soup For All and Krsna's Free Meals, are providing free meals to those affected by the pandemic.KB Free Soup For All is a soup kitchen initiative operating from June 7 to July 2. It is organised by social enterprise M2 Cafe and food-sharing group KampungBishan. Every weekday, the soup kitchen provides 100 takeaway packets of soup and rice from noon to 2pm at M2 cafe at The Adelphi.The cafe had been struggling to survive due to the fall in dine-in traffic. After phase two (heightened alert) restrictions kicked in, owner Toh Kian Beng, 41, decided to halt operations.But his desire to help marginalised communities led him to adapt the restaurant space into a soup kitchen. \"Apart from the hundreds of people who have been nourished by our warm soup and rice, I hope that more individuals can receive hope from our initiative,\" he says.\nPeople packing food for the KB Free Soup For All soup kitchen, which provides 100 takeaway packets of soup and rice every weekday at the M2 cafe at The Adelphi. PHOTOS: COURTESY OF KB FREE SOUP FOR ALL\nIn a similar spirit, Krsna's Free Meals launched a fund-raising campaign on give.asia last month, after the number of migrant workers and locals who approached it doubled during this period.The registered soup kitchen serves 850 to 1,000 breakfast meals and about 600 lunch meals daily at its premises in Little India.Having raised $20,853 at the end of the campaign, which exceeded the goal by $853, it plans to source for more affordable ingredients to diversify its breakfast offerings and provide more fruit.Ms Latha Govindasamy, 52, a public relations executive for Krsna's Free Meals, says: \"We have made it a habit to introduce good food and fruit to build up the immunity of our beneficiaries, who usually do not make their health a priority.\"\n Krsna's Free Meals serves 850 to 1,000 breakfast meals and about 600 lunch meals daily at its premises in Little India. PHOTO: COURTESY OF KRSNA'S FREE MEALS\nMeanwhile, from now until Sunday, cafe Arteastiq DePatio at Plaza Singapura is giving free pizzas to students from low-income families.In support of The Straits Times School Pocket Money Fund (STSPMF), it has teamed up with car enthusiast group SG Convertible Club to launch the \"Drop A Good Cause, Drop A Message, Drop A Pizza\" initiative. Consumers can buy any pizza at half-price from the cafe to give to STSPMF beneficiaries and the organisers will provide another pizza for free to the fund's beneficiaries.Ms Tan Bee Heong, 55, general manager of the fund, thinks this is a \"very welcome treat\" for low-income families, especially when many parents have lost their jobs due to Covid-19.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/life/girl-uses-400-savings-to-buy-groceries-for-the-needy-others-offer-free-meals-pizzas", "Source": "google"}