{"Type": "", "Time": "2021-06-16", "Headline": "Putin says US and Russia will return ambassadors, following summit with Biden, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.GENEVA (BLOOMBERG) - The US and Russia will return their ambassadors to their posts and have agreed to hold talks on arms control, cyber-security and diplomatic ties, Russian President Vladimir Putin said after his summit meeting with US President Joe Biden.“We agreed that they would return to their service,” Putin said on Wednesday (June 16) at a news conference after the Geneva summit concluded.“As for the timeline, tomorrow or the day after, this is a technical question.”The talks with Biden were “on the whole productive, substantive, concrete and took place in an atmosphere aimed at achieving results, the most important of which was that glimmer of trust,” Putin said.Each side understood each other’s red lines on key issues, he said.The rouble extended gains after Putin’s comments on the ambassadors, appreciating as much as 0.8 per cent before trimming its advance to trade up 0.4 per cent at 71.9150 per dollar as of 7.31pm in Moscow.Russia’s ambassador to the US, Anatoly Antonov, was recalled earlier this year after the US expelled a group of other diplomats. The US envoy to Russia, John Sullivan, then left Moscow as tensions simmered. Both were in Geneva for the summit between the two presidents.Putin praised Biden as a “very constructive, balanced” man and said they largely “spoke the same language.” Still, he said conditions weren’t right for them to hold a summit in Moscow or Washington and they did not invite each other to visit.Putin denied Russia was behind cyberattacks and reiterated allegations that most of them come from the US.He told reporters the US was entirely to blame for the worsening in relations, and said Washington supports groups that are seeking to contain Russia.“We are behaving absolutely normally given the threats we face,” Putin said. Russia and the US “need to agree on the rules of the game” to ensure stability and “I think we can agree on all this. At least that’s the impression I got from my meeting with President Biden,” he said.Putin said Biden raised the case of jailed opposition leader Alexei Navalny. The Kremlin leader said Navalny had sought deliberately to be arrested after his return to Russia in January from Germany, where he had been recovering from a nerve agent poisoning that the US has blamed on Putin’s security services.The Kremlin denies involvement.Asked about Biden’s comment in a television interview that Putin was a killer, the Russian leader said the US president had called him after the remark was broadcast and explained himself. Putin said he was satisfied with the explanation.The summit was substantially shorter than aides had predicted, ending after about 2.5 hours of talks.US officials said on Tuesday they expected the meetings could stretch four hours or more. Biden was seen giving a thumbs up to reporters as he left the final meeting ahead of his planned press conference.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/putin-says-us-and-russia-will-return-ambassadors-following-summit-with-biden", "Source": "google"}