{"Type": "", "Time": "2021-06-16", "Headline": "PA's follow-up statement on Tiong Bahru Hari Raya standee incident an instance of \"classic gaslighting\" of minorities' legitimate concerns on racism, netizens say - The Online Citizen Asia", "Text": "Source: Sarah Bagharib @sarahbagharib / InstagramThe saga between the People’s Association (PA)’s and communications specialist Sarah Bagharib continues as the organisation’s follow-up statement rouses the anger of many members of the public online.PA had used Ms Sarah’s wedding photograph as a prop in its Hari Raya Aidilfitri display at an HDB estate in Tiong Bahru. While the standee was subsequently removed and the PA offered her a public apology, the organisation later said it rejects Ms Sarah’s “accusations” of racism, branding the incident “culturally insensitive” and an “isolated case”.Posting on Facebook on Monday (14 June), PA referenced her interview with Nanyang Technological University professor Walid Jumblatt Abdullah, from which she was quoted as saying that the incident has perpetuated a culture of racism.“It is not right to raise the allegation of racism, without basis, to stoke emotions and sentiments,” said PA.The organisation claimed that it had explained to Ms Sarah that while it acknowledges that its staff “should have been more culturally sensitive”, it is not right to paint “sweeping conclusions from this incident”.Doubling down on its point that Ms Sarah’s case was an isolated one, PA said that it finds Ms Sarah’s public call for messages or suggestions that they would like to have relayed to the organisation in their meeting an “odd” one.“We do not see why our meeting should be appropriated as a platform for her to funnel the views and comments of persons unrelated to the incident,” said PA, adding that it is of the view that Ms Sarah’s purpose in agreeing to meet its representatives “has gone far beyond the Radin Mas incident”.PA said that it will not be following through with the meeting as there is “no point” in doing so, in light of the above.“We agree it is important for our staff and volunteers to be sensitive to and knowledgeable about the cultures of all our ethnic groups. We are now looking at establishing a resource panel to guide and advise our staff on cultural matters. We will also step up training efforts to enhance staff and volunteers’ understanding and appreciation of our different cultures,” it added.PA also claimed that Ms Sarah’s 1 June email had falsely alleged that it was “hasty in sharing the name of the vendor” in order to “distance and deflect blame” from itself.“The vendor had identified himself directly to Ms Sarah on 28 May, and apologised. This was before PA issued our statement on 29 May,” it said.“It is regrettable that Ms Sarah did not clarify this point during her Instagram Live interview with Mr Walid J. Abdullah on 7 June. Instead she persisted in conveying the impression that PA had deflected blame from itself,” PA added.Commenting on PA’s Facebook post, netizens expressed their shock and anger toward PA’s “gaslighting” statements in its second public “apology”.“Not only are you not aware of your mistake (yes, it’s racist), you’ve completely downplayed and dismissed her outrage,” one commenter said.Several commenters pointed out how racism does not require intent, and that in the case of PA as a community organisation that receives funding from the government, such ignorance toward important markers of a minority race’s culture “points to institutionalised racism” to some extent.“It is racist because the standee incident is you disregarding the nuances of their culture for the sake of decoration and marketing,” one commenter said.“This is an example of racial discrimination, especially when the same thing never happens to Chinese people in Singapore in PA-related events,” another said.Others questioned PA’s attempt to draw a distinction between the cultural insensitivity it purports to have perpetuated and the racism it claims to not have engaged in, saying that the two are not necessarily mutually exclusive. Challenging PA’s view that its error was a one-off incident born out of cultural insensitivity alone, Désirée Lim, who teaches Philosophy at Penn State University, commented: “Persistent and wilful ignorance of this nature is not the same thing as an innocent factual error. It is about negligence and not-caring — the implicit judgment that a group is not deserving of proper understanding and accurate portrayal, because it does not merit such efforts from the dominant race.”“What the PA sought here was to give the superficial impression that they were on board with the celebration,” she added.“The PA could have hired willing Malay-Muslims to pose for festive photographs; instead, they thought that any Malay couple would do. Would the Chinese members of the PA who wrote this excuse of a response like it if their family photos were stolen without their consent and used for a completely different context — perhaps placed on an advertisement for a Chinese restaurant in New York?” Assistant Professor Lim said. Several commenters said that racism goes beyond overt acts of violence and could entail cultural insensitivity such as the kind demonstrated by PA in the case at hand.“Go to australia or the usa hopefully u can come back being a humble being knowing what it feels to be a minority,” one said.Another said: “listen to minorities. They are the ones that have to deal with all the racism thrown at their faces.”Many commenters, including renowned playwright Alfian Sa’at, questioned PA’s motives behind cancelling the meeting with Ms Sarah.They pointed out that the meeting could have been a precious opportunity to foster PA’s understanding of the lived experiences of racial minorities in Singapore with regard to racism.“Why are you making it seem as if the meeting you have set up with her is a precious privilege you have extended, to be withdrawn if somehow Ms Sarah fails to abide by your terms?” Mr Alfian questioned.A couple of commenters highlighted the absurdity of a government institution rejecting dialogue with a person from a minority community in the wake of multiple racist incidents reported in the media, which they view as a form of slamming the door in the faces of minorities and shutting out their genuine concerns regarding their safety and wellbeing.Many individuals of the Chinese majority race also aired their discontent with PA’s response, explicitly branding the organisation’s error with the standee and its subsequent responses as racist and narrow minded.  Several commenters said that while the standee incident itself did not necessarily tar its work as a community organisation, the defensiveness it displayed in its latest post had served to do so.The PA’s deflection of blame to Ms Sarah in its follow-up post this time appears to be a form of “bullying” by a public institution against one individual, which many have said is particularly ironic for an organisation aimed at taking into account the people’s views and seeing minorities as significant, equal stakeholders in its goals.Several commenters also compared the PA’s follow-up statement to that issued by the Ministry of Manpower in former DJ Jade Rasif’s case after a week-long dispute over Ms Jade’s migrant domestic worker’s quarantine order.Several commenters took a jibe at the PA’s public relations and communications team, wondering how the follow-up post was approved.They also questioned why the people behind the handling of Ms Sarah’s case remain unnamed in PA’s public statements thus far. One commenter said that the PA should organise concrete initiatives to “rectify their mistakes and to improve their cultural sensitivities by conducting free classes to other races on Malay and Indian (plus other minorities) festivals, religious norms and cultural sensitivities”.However, another commenter wondered how mistakes such as that in Ms Sarah’s case could surface despite grassroots organisations representing the interests of the Malay community regularly reaching out to community partners across races and religions. © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/15/pas-follow-up-statement-on-tiong-bahru-hari-raya-standee-incident-an-instance-of-classic-gaslighting-of-minorities-legitimate-concerns-on-racism-netizens-say/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}