{"Type": "", "Time": "2021-06-16", "Headline": "Beijing tells Nato to stop hyping up China threat", "Text": "China has accused Nato of slandering its peaceful development after alliance leaders warned about \"systemic challenges\" coming from Beijing.China's actions, including expanding its nuclear arsenal, threatened \"rules-based international order\", Nato said.It was the first time Nato had placed China at the centre of its agenda.In its response, China said its defence policy was \"defensive in nature\" and urged Nato to \"devote more of its energy to promoting dialogue\".\"Our pursuit of defence and military modernisation is justified, reasonable, open and transparent,\" China's mission to the European Union said in a statement.It added that Nato should view China's development in a \"rational manner\" and \"stop taking China's legitimate interests and rights as an excuse to manipulate bloc politics, create confrontation and fuel geopolitical competition\".China's rebuttal came on the same day that it flew 28 air force jets into Taiwan's air defence zone, the island's government said. It is the fifth incursion this month, and the largest to date.Biden says America is back at the tableNato: US and Europe are safer standing togetherWhat does the US do for Nato?Nato's statement came at the end of a one-day summit in Brussels on Monday.It marked Joe Biden's first Nato meeting as US president.The powerful political and military alliance between 30 European and North American countries sees Russia as a main threat. Mr Biden is due to meet Russian President Vladimir Putin in Geneva on Wednesday.According to the summit's communiqué (concluding statement), China's \"stated ambitions and assertive behaviour present systemic challenges to the rules-based international order and to areas relevant to Alliance security\".\"We remain concerned with China's frequent lack of transparency and use of disinformation,\" it says.Nato chief Jens Stoltenberg told reporters: \"We're not entering a new Cold War and China is not our adversary, not our enemy.\"But, he added: \"We need to address together, as the alliance, the challenges that the rise of China poses to our security\".China is one of the world's leading military and economic powers, whose ruling Communist Party has a tight grip on politics, daily life and much of society.The Chinese military currently has the largest armed forces in the world, with over two million personnel on active duty.Nato has become increasingly concerned about the growing military capabilities of China, which it sees as a threat to the security and democratic values of its members.In recent years, the alliance has also grown wary of China's activities in Africa, where it has set up army bases.The North Atlantic Treaty Organisation, known as Nato, is the world's most powerful regional defence allianceIt was set up in 1949, after World War Two, to counter the threat of communist expansionIt was founded on the principle of collective defence between alliesIt originally had 12 members, but now has 30 - made up of European countries and the US and CanadaNato's current missions include offering training and assistance to Afghan security forces, maintaining a peacekeeping force in Kosovo and supporting counter-terrorism work in IraqAs well as military operations, Nato has supported relief efforts after crises like Hurricane KatrinaRead more about NatoUK Prime Minister Boris Johnson said: \"When it comes to China, I don't think anybody around the table wants to descend into a new Cold War with China.\"Nato's tough message on China followed criticism of the country by the G7, a group of major economies that met for a summit in England last week.In a communiqué G7 leaders criticised China for alleged human rights abuses and demanded a transparent investigation of the origins of Covid-19 in the country.In response, China accused the G7 of \"lies, rumours and baseless accusations\" in a statement through its embassy in the UK.Beijing’s new top diplomat in Hong Kong, who called the battle against “foreign forces” his top priority after taking the job last month, has doubled down on that message, saying those seeking to curb China’s growth or undermine its dignity are “doomed to fail”. In his first public appearance as commissioner of the Chinese Ministry of Foreign Affairs in Hong Kong, Liu Guangyuan on Wednesday said last week’s passing of an anti-sanctions law by China’s top legislative body reflected a “pressing neAlibaba Group was the victim of a months-long web-scraping operation by a marketing consultant that siphoned up sensitive data including usernames and phone numbers.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Sentosa isn’t expensive as you think it is. Here’s everything you need to know about the island’s entrance fees cost, car park rates, beach reservations and hacks on how to save. Thanks to COVID-19, plans to travel overseas for a well-deserved holiday is starting to […] The post Sentosa Island: Entrance Fee And Parking Rates appeared first on SingSaver Blog - We Compare, You Save.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Learn more about scalp psoriasis. Look for scalp psoriasis treatments.Turkish President Recep Tayyip Erdogan on Tuesday pledged support for Azerbaijan if the ex-Soviet country was attacked, as he made a visit to the disputed Nagorno-Karabakh region.The League of Legends: Wild Rift esports scene will be kicking into full gear this 19 June with the League of Legends: Wild Rift 2021 SEA Icon Series Summer Super Cup.Moscow and Beijing, both facing confrontation from the West, are likely to strengthen their alliance regardless of the outcome of a US-Russia summit, observers say. US President Joe Biden is expected to raise contentious issues with his Russian counterpart Vladimir Putin when they meet in Geneva on Wednesday to discuss the deteriorating relationship between the Kremlin and the West. China and Russia, meanwhile, have “no choice” but to move closer, especially after the G7 and Nato leaders took aResearch best security system. Protect yourself and your home with wireless alarm systems.It's useful to be ready with the names of a few companies you'll scoop up in case a crash occurs. The post 3 Stocks I Will Buy If the Market Crashes Tomorrow appeared first on The Smart Investor.The Russian skipper of a container ship that caught fire and burned for almost two weeks before sinking off Sri Lanka's coast has been arrested and is expected to be charged with marine pollution, police said Monday.Kevin Durant finished with 49 points while playing every minute of the game as the Brooklyn Nets rallied from a 17-point deficit to beat the Milwaukee Bucks 114-108 in game five of their NBA playoff series on Tuesday.Find furniture you love, at prices that fit your budget with flexible financing.The US death toll from Covid-19 surpassed 600,000 on Tuesday, although officials hailed progress towards a return to normality as its world-leading vaccination program promised to turn the page on one of the worst health crises in American history.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.If you’re wondering whether Ethereum is a good long term investment, keep reading.Sick of seeing others get rich in the stock market? Have you heard of Everlasting Stocks?A sinking fire-damaged container ship could take months to salvage because of rough monsoon seas, Sri Lanka said Tuesday, as authorities investigated whether the deaths of dozens of turtles and dolphins were caused by the disaster.Cristiano Ronaldo netted a double to become the European Championship's all-time leading scorer as Portugal struck three times late on to beat a stubborn Hungary 3-0 in their Euro 2020 opener at a packed Puskas Arena on Tuesday.The inflation outlook among Americans is at its highest level ever, while many are upbeat about their employment situation, a New York Federal Reserve survey released Monday said.The report covering May showed one-year inflation expectations jumped 0.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Japan has requested consolations with China at the World Trade Organization (WTO) over anti-dumping duties that have been placed on its stainless steel products since July 2019, the Geneva-based body confirmed on Tuesday. The request, which was circulated to WTO members on Tuesday after having been submitted on Friday, claims the measures imposed on steel billets, hot-rolled coils and hot-rolled plates appear to be inconsistent with various provisions under the General Agreement on Tariffs and T* Peso hits lowest since May 28  * Singapore stocks track best day since May 18  * Graphic: World FX rates https://tmsnrt.rs/2RBWI5E  * Asian stock markets: https://tmsnrt.rs/2zpUAr4  By Shashwat Awasthi  June 15 (Reuters) - The Philippine peso fell the most in more than two months on Tuesday after coronavirus curbs were prolonged in the capital Manila and nearby provinces until end-June and quarantine measures were tightened to battle rising infections.  The Philippines has the second highest number of infections and casualties in Southeast Asia after Indonesia and finds its healthcare sector stretched as it battles rising cases.  President Rodrigo Duterte announced the extension of curbs on Monday.With Afghan troops in retreat and soon to lose vital American air support, Taliban commanders are voicing exuberance about quickly seizing full control of the country and re-establishing their version of an Islamic state.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/beijing-tells-nato-stop-hyping-064623680.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}