{"Type": "Singapore", "Time": "2021-06-16", "Headline": "COVID-19 task force 'evaluating' timing and scope of reopening amid fresh outbreak: Lawrence Wong", "Text": "SINGAPORE: The COVID-19 multi-ministry task force is \"evaluating the timing and scope\" of the next stage of Singapore's reopening, Finance Minister Lawrence Wong said in a Facebook post on Wednesday (Jun 16).\"We are now at stage 1 of our reopening. Stage 2 is scheduled next Monday. Unfortunately we now have new cases breaking out and a major new cluster in Bukit Merah,\" said Mr Wong, who co-chairs the task force.\"Given these developments, we are evaluating the timing and scope of the next stage of reopening. The MTF is studying the situation carefully with public health experts and will provide further updates soon.\"As of Tuesday, theBukit Merah View Market and Food CentreCOVID-19 cluster consisted of 25 cases.In a video accompanying his Facebook post, Mr Wong said that the new COVID-19 cases in Bukit Merah are \"breaking out not only in the market and the hawker centre, but also, all around the vicinity\".\"And day by day, we are seeing the number of unlinked cases, the cryptic cases in the community are likely to be rising too,\" he said.The market, which was slated to reopen on Wednesday after being closed since Sunday, will now be shut for two weeks until Jun 26.Explaining the decision on Tuesday, the Ministry of Health (MOH) said that the detection of more cases among employees at the market and their close contacts suggests there is \"ongoing spread with wider transmission\".All staff and tenants who had been working at the market from May 25 were placed on quarantine, and will be tested during quarantine.All 85 tenants and workers of the neighbouring 116 Bukit Merah View have also been tested for COVID-19, while free COVID-19 testing has been extended to members of the public who had visited the shops at 115 and 116 Bukit Merah View between May 25 and Jun 12.Stallholders atRedhill Market and Food Centre, which is a short walk away from Bukit Merah View Market and Food Centre, will undergo mandatory swab tests after a COVID-19 case recently visited the market.\"I know this is a difficult time for everyone,\" Mr Wong said.\"I want to assure all of you that we are doing our very best to control the infection  and we want to ensure that we do not have another flare-up before we reach sufficiently high levels of vaccination in our community.\"Dining-in at food and beverage outlets is currently banned as part of Phase 3 (Heightened Alert) and was scheduled to resume onJun 21, provided the COVID-19 situation remained under control.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,Lawrence Wong", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/covid-19-task-force-evaluating-the-timing-and-scope-reopening-15025980", "Source": "google"}