{"Type": "", "Time": "2021-06-16", "Headline": "Singapore central bank reprimands insurers AIA, Aviva and Prudential", "Text": "SINGAPORE, June 15 (Reuters) - Singapore's central bank said on Tuesday it has reprimanded the local businesses of insurers AIA, Prudential and Aviva for breaching requirements related to risk management and supervisors' pay. The Monetary Authority of Singapore (MAS) said its investigations found numerous instances where remuneration was paid to supervisors over sales of investment products and life policies, violating its regulations. A MAS reprimand is issued when there are failures in a financial institution that may pose potential risks to its business, market participants and investors. Those reprimanded were AIA Financial Advisers Private Limited, Prudential Assurance Company Singapore, Aviva Ltd and Aviva Financial Advisers Pte Ltd. The companies did not immediately respond to separate requests for comment. The MAS has dealt firmly with these financial institutions \"to send a clear message to the industry on the importance of upholding high ethical standards,\" Ho Hern Shin, deputy managing director, financial supervision, said in a statement. (Reporting by Chen Lin; Editing by Martin Petty) Polestar, the premium electric vehicle maker owned by China's Geely and Volvo Cars, will build its Polestar 3 electric SUV at Volvo's U.S. plant in South Carolina starting in the second half of 2022, the brand's chief executive said.  The Volvo plant in Ridgeville, South Carolina, near Charleston, currently builds the Volvo S60 sedan and will add the Volvo XC90 SUV in 2022, Polestar said on Wednesday.Investor groups have asked the U.S. Securities and Exchange Commission for more corporate disclosures on climate change and other environmental, social and governance (ESG) issues while business interests have pushed back, a Reuters review of correspondence published by the regulator shows.  The deadline for the public to submit comments to the SEC on the topic expired on Monday.  Thousands of investors and advocates, from large asset managers to individual investors,  as well as companies and trade groups made submissions, which were accessible on the SEC website.Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.Top news and what to watch in the markets on Wednesday, June 16, 2021.Lincoln is planning to introduce an all-electric vehicle lineup by 2030, with a new fully electric car scheduled for next year.Members of the media are invited to attend an important infrastructure announcement regarding COVID-19 response and active transportation for Central Prince Edward Island with Wayne Easter, Member of Parliament for Malpeque, on behalf of the Honourable Catherine McKenna, Minister of Infrastructure and Communities, and the Honourable Dennis King, Premier of Prince Edward Island.Have you saved $500,000 for retirement—and are you unsure about how to start your estate plan? Get The Investor’s Guide to Estate Planning now.Québec produces more strawberries than any other Canadian province. Strawberries are delicate and difficult to keep fresh. In response to this challenge, Monique Lacroix, a professor at the Institut national de la recherche scientifique (INRS), and her team have developed a packaging film that can keep strawberries fresh for up to 12 days. The team's findings on how this film protects against mould and certain pathogenic bacteria have been published in Food Hydrocolloids.Today, ClearEstate, a digital-first estate settlement platform for North American executors, announced its platform launch into the US in partnership with California-based funeral home operator Anthem Partners. The estate settlement fintech also announced C$2.5M in seed extension funding to support product innovation and an expanded further rollout across the United States and Canada.The Honourable Mary Ng, Minister of Small Business, Export Promotion and International Trade, will deliver a keynote address and moderate a panel at the Diversio and Rosenzweig & Company \"Gender and Racial Equality in the C-Suite: An International Dialogue\" event.Cut your monthly payment while rates are low. Free Quotes. Wont affect your credit. Calculate New Payment. (1.97% APR)Members of the media are invited to 3 separate activities related to the Centre Block rehabilitation project.The Canadian Mental Health Association (CMHA) today welcomes a donation of more than $500,000 made by Shoppers Drug Mart Inc on behalf of the company and its Associate owners. The donation will enhance and expand CMHA's cross-Canada network of community-based mental health and well-being learning centres – often called \"Recovery Colleges.\" The centres are welcoming spaces that help all people, including women, families and vulnerable groups, access the support they need in an environment that isSubway® Canada is hosting its first-ever virtual concert with Canadian Diamond/Multi-Platinum selling and JUNO Award winning dance music duo Loud Luxury on June 23rd to raise awareness for the issue of child hunger experienced throughout the summer months. The concert is in support of Never Miss Lunch™, an initiative from Subway® Canada committed to providing children with access to the food they need so they can reach their full potential. On the day of the concert, $1 from every footlong purchThis small company behind it is sparking a potential 20,300% market surge. Click here for details.i-80 GOLD CORP. (TSX: IAU) (OTC: IAUCF) (\"i-80\", or the \"Company\") is pleased to announce that rehabilitation of underground drill bays is completed and underground drilling has commenced at the Company's Granite Creek (\"Granite Creek\" or \"the Property\") property located in Humbolt County, Nevada. The Company's Getchell Property has been renamed Granite Creek to avoid confusion with the Getchell open pit located at the nearby Turquoise Ridge mine property.The JCVI plans to recommend against vaccinating under-18s until more data is gathered on the risks to young people, but ministers have not yet received advice on the matterSterling scored in Sunday's 1-0 win over Croatia as England began the Euros with a victory for the first time in nine attempts.  The Manchester City forward, who was at the weekend awarded an MBE for his services to racial equality in sport, said meditation helped him feel relaxed.  \"I'm doing a little bit of meds,\" Sterling told British media.Wall Street legend Whitney Tilson says there's a huge new tech trend coming – and he's giving away his top pick for free right here.Deceased is said to have been killed while walking in the mountains near Liptovska LuznaThe Independent’s political commentators John Rentoul and Andrew Grice will be joined by two guest speakers, David Gauke and the Rt Hon Lord Adonis, to discuss Brexit five years onFinding the 'perfect' summer dress is no mean feat.Millionaire Wall Street Legend Urges Americans Get Out Of Cash Before April 27th.It was a great joy this week to witness the Portuguese footballer not so much endorse a product, as contribute to wiping $4bn off its market valueA Malaysian court Wednesday overturned an inquest verdict of \"misadventure\" in the death of a French-Irish teen who vanished in the jungle, replacing it with an \"open\" ruling in a victory for her family.McDonald’s had also “sweeten the experience” by offering the BTS Meal “at a special price of S$8.90”, which is said to be 10% off the usual delivery price.", "Section": "", "Writers": "", "URL": "https://sg.finance.yahoo.com/news/singapore-central-bank-reprimands-insurers-063429059.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}