{"Type": "", "Time": "2021-06-16", "Headline": "Alberto Sánchez Gómez: Spanish man jailed for eating his mother", "Text": "A Spanish cannibal who committed unspeakable crimes against his own mother has been jailed. WARNING: Graphic.Gomez has been sentenced to 15 years in prison.Source:FacebookWARNING: GraphicA convicted Spanish cannibal who killed his mother, ate parts of her body and fed some of her to his dog has been sentenced to 15 years in prison.Alberto Sanchez Gomez, 28, will also serve an additional five months for desecrating his 68-year-old mother’s corpse after a court rejected his claims that he was having a psychotic episode during the gruesome slaying, the BBC reported.The unemployed waiter — who’s been dubbed the “Cannibal of Las Ventas” — claimed in court in April that he heard voices telling him to kill Maria Soledad Gomez as they watched television in their apartment in 2019, according to reports.A jury in Madrid found him guilty of strangling his mother following an argument, the Independent reported in May.Alberto Sanchez Gomez cut his mother’s body into 1000 pieces.Source:FacebookProsecutors said Gomez used a carpenter’s saw and two kitchen knives to cut his mother’s body into 1000 pieces — some of which were found in Tupperware containers inside their residence.Gomez fed other portions of his mother’s remains to his dog over the course of two weeks, the Sun previously reported.“Yes, my mother is in here, dead,” Gomez told officers investigating a report about the missing woman. “Me and the dog have been eating her bit by bit.”Gomez consumed some of his mother’s body parts raw while cooking other pieces, the Independent reported.The court dismissed claims by Gomez’s attorneys that he was “psychologically disturbed” at the time of the slaying. Maria Gomez was missing for about a month at the time of her son’s arrest, according to CNN.Gomez has been sentenced to 15 years in prison.Source:FacebookLocal media dubbed Gomez the “cannibal of Las Ventas” in reference to the Madrid neighbourhood near its famed bullring where he and his mother lived.Gomez reportedly said in court he was “very repentant” for strangling his mother and eating parts of her body.“I suffer anxiety from the moment I wake up,” Gomez said, the Independent reported. “I think of my mother and I’m absolutely heartbroken.”This story originally appeared in the New York Post and has been reproduced with permission.A NOTE ABOUT RELEVANT ADVERTISING: We collect information about the content (including ads) you use across this site and use it to make both advertising and content more relevant to you on our network and other sites. Find out more about our policy and your choices, including how to opt-out.Nationwide News Pty Limited Copyright © 2021. All times AEST (GMT +10).Powered by WordPress.com VIP", "Section": "", "Writers": "", "URL": "https://www.news.com.au/world/europe/spanish-man-jailed-for-eating-his-mother/news-story/bc8248dc85e9e9dd417f35e4f24da1d3", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}