{"Type": "", "Time": "2021-06-16", "Headline": "Man threatened to kill woman, her mum and her BF after she ended their 'intimate relationship'", "Text": "Shaffiq AlkhatibThe Straits TimesJun 15, 2021A man who had an \"intimate relationship\" with a woman was so unhappy she wanted to sever ties with him that he threatened to kill her, her mother and her boyfriend.Gabriel Heng Jing Heng also threatened to burn down the victim's home.He relentlessly stalked the 24-year-old woman, who was not his girlfriend, from July 2018 to September 2019.On Tuesday (June 15), the 26-year-old Singaporean was sentenced to 18 months' jail and a fine of $3,000 after pleading guilty to three counts of criminal intimidation.He also admitted to one count each of assault, harassment and mischief.The woman cannot be named due to a gag order to protect her identity.Heng got to know her in 2016 and they grew close. But she decided to end their friendship in December 2017 because she felt he was \"very possessive\".Despite this, he frequently demanded to meet her and used vulgarities as well as threats when she refused.The woman started ignoring his text messages and calls from July 27, 2018, but this did little to stop his attempts to contact her.In just a few days, she received more than 100 missed calls from him.On July 29, he sent her a text message, threatening to burn down her home and slash her mother if she refused to see him later that day.The victim later blocked his mobile phone number on WhatsApp and Telegram.In August, she moved out and sought shelter at a relative's home until January 2019.Undeterred, Heng continued trying to contact the woman by using another phone number.He sent her multiple threatening messages from August 2018 to July 2019, including a message on July 25, in which he threatened to kill her, her mother and her boyfriend.Heng was arrested and charged in court two days later after the woman alerted the police.He was ordered to stop contacting her as part of his bail conditions.Two months later, while out on bail, he breached the conditions by continuing to text her.Separately, Heng threatened to burn down his grandmother's home in October 2019 after a dispute, despite the 73-year-old woman acting as his bailor. She discharged herself from the responsibility soon after.In an unrelated case, Heng assaulted a valet driver in July 2019. He also kicked and dented another man's car in 2020.In mitigation, Heng's lawyers, Mr Josephus Tan and Mr Cory Wong from Invictus Law Corporation, said their client has a history of conditions, including attention deficit hyperactivity disorder, and is remorseful.Heng is now out on bail of $15,000 and must surrender himself at the State Courts on July 13 to begin serving his jail term.Get a copy of The Straits Times or go to straitstimes.com for more stories.Get more of Stomp's latest updates by following us on Facebook, WhatsApp, Twitter, Instagram and YouTube.View the discussion thread.View the discussion thread.Download the new STOMP app today.SPH Digital News | The Straits TimesAll rights reserved | Terms & Conditions | Data Protection Policy | Advertise with usSPH Digital News / STOMP / Copyright (c) 2019 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E.", "Section": "", "Writers": "", "URL": "https://stomp.straitstimes.com/singapore-seen/man-threatened-to-kill-woman-her-mum-and-her-bf-after-she-ended-their-intimate", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}