{"Type": "", "Time": "2021-06-16", "Headline": "Wales set for hostile crowd - Sports - The Jakarta Post", "Text": "Please Update your browser\n          Your browser is out of date, and may not be compatible with our website. A list of the most popular web browsers can be found below.\n          Just click on the icons to get to the download page.Log in with your social accountWales are readying themselves for a hostile reception when they face Turkey in Baku at Euro 2020 later after Tuesday's action saw world champions France beat Germany and Cristiano Ronaldo become the all-time top European Championship goal-scorer.After drawing 1-1 with Switzerland in their opening Group A game at the weekend, Wales face Turkey in Baku where locals are expected to get behind their Turkish neighbours, who will also have several thousand travelling fans on their side.\"Hostility is no problem. This is what we do for a living. We're used to playing in away games and being in front of hostile crowds,\" Wales captain Gareth Bale said.Turkey come into the game by the Caspian Sea desperate to shake off the disappointment of losing 3-0 to Italy in the tournament's opening match.\"For two days following the game we were very fragile, we were very broken. We were really tired and negative,\" Turkey captain Burak Yilmaz said on Tuesday as he looked forward to having the crowd on his side in Baku.\"It will be like a host city for us. With the help of the country we want to win this game.\"Impressive in their first outing, and with home advantage in Rome, Italy can secure a place in the last 16 already with a win over Switzerland later on Wednesday.Before that Russia host neighbours Finland in Saint Petersburg looking for their first points in Group B.© 2016 - 2021 PT. Bina Media Tenggara", "Section": "", "Writers": "", "URL": "http://www.thejakartapost.com/news/2021/06/16/wales-set-for-hostile-crowd-after-france-win-and-ronaldo-makes-history-at-euro-2020.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}