{"Type": "World", "Time": "2021-06-16", "Headline": "New Israel government faces early test with far-right march", "Text": "JERUSALEM: Israel's fledgling new government faced an early test Tuesday (Jun 15) as Jewish ultranationalists prepared to march into annexed east Jerusalem, stoking tensions the UN has warned threaten a fragile Gaza ceasefire.Rallies by far-right Jewish groups in Arab neighbourhoods have raised tensions in recent months, prompting a police intervention in the flashpoint Al-Aqsa mosque compound that triggered the deadliest flare-up of Israeli-Palestinian violence since 2014.The so-called March of the Flags, which celebrates the anniversary of Israel's 1967 occupation of the city's eastern sector, was originally scheduled for last Thursday but was delayed due to Israeli police opposition to the route and warnings from Gaza's Islamist rulers Hamas.The former government of veteran premier Benjamin Netanyahu put off the march until Tuesday, a decision confirmed late Monday by the incoming government of Prime Minister Naftali Bennett.\"The right to demonstrate is a right in all democracies,\" said Internal Security Minister Omer Bar-Lev.\"The police is ready and we will do everything in our power to preserve the delicate thread of coexistence.\"Organisers consulted police on the best route for the march that begins at 1430 GMT to avoid friction with Arab residents, the government said.But Palestinian prime minister Mohammad Shtayyeh condemned it as a provocation.\"We warn of the dangerous repercussions that may result from the occupying power's intention to allow extremist Israeli settlers to carry out the Flag March in occupied Jerusalem tomorrow,\" Shtayyeh tweeted in English.He said it was \"a provocation and aggression against our people, Jerusalem and its sanctities that must end\".The new Israeli premier is himself a Jewish nationalist but the coalition he leads also includes centrist and left-wing parties and, for the first time in the country's history, an Arab party.The support of the four lawmakers of the Islamic conservative Raam party was vital to the wafer-thin majority that the government won in a historic confidence vote that unseated Netanyahu on Sunday.\"VERY FRAGILE\"UN Middle East peace envoy Tor Wennesland urged all sides to behave responsibly to avoid damage to a hard-won May 21 ceasefire that ended 11 days of heavy fighting in and around Gaza.\"Tensions are rising again in Jerusalem at a very fragile & sensitive security & political time, when UN & Egypt are actively engaged in solidifying the ceasefire,\" Wennesland said.\"Urge all relevant parties to act responsibly & avoid any provocations that could lead to another round of confrontation.\"The US embassy called on its staff to avoid entering the walled Old City in the heart of east Jerusalem because of the march and \"possible counter-demonstrations\".Israel's annexation of east Jerusalem since the Six-Day War of 1967 is not recognised by most of the international community which says the city's final status should be a matter of negotiation between the two sides.The Palestinians claim the city's eastern sector as the capital of their future state.HAMAS WARNINGThe iconic Al-Aqsa Mosque compound in the heart of the Old City is Islam's third holiest site and a national symbol for all Palestinians regardless of religion.It is also Judaism's holiest site but by longstanding convention Jews are not allowed to pray inside the compound and visits by Israeli Jewish politicians often trigger disturbances.When the march was originally announced for last week, senior Hamas official Khalil Hayya warned it could spark a return to violence like that of May 10-21.\"We warn the occupation (Israel) against letting the march approach east Jerusalem and Al-Aqsa Mosque compound,\" Hayya said.\"We hope the message is clear so that Thursday doesn't become (a new) May 10.\"Last month's conflict started after Hamas issued a deadline for Israel to remove its security forces from flashpoint areas of east Jerusalem, and then fired a salvo of rockets at Israel when the ultimatum went unheeded.Israeli strikes on the Gaza Strip between May 10 to May 21 killed 260 Palestinians including some fighters, the Gaza authorities said.In Israel, 13 people were killed, including a soldier, by rockets fired from Gaza, the Israeli police and army said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Gaza,Hamas,Jerusalem,Israel,compound,religion & spirituality", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/new-israel-government-faces-early-test-with-far-right-march-15018626", "Source": "google"}