{"Type": "Asia", "Time": "2021-06-16", "Headline": "Malaysia parliament should reconvene as soon as possible, says king after special rulers' conference", "Text": "KUALA LUMPUR: Malaysia's King Al-Sultan Abdullah Ri’ayatuddin Al-Mustafa Billah Shah said on Wednesday (Jun 16) that parliamentary sittings should reconvene as soon as possible, after he chaired a special rulers' conference.A statement issued by the palace said: \"After reviewing all the perspectives of the leaders of the political parties, the 2021 Independent Emergency Special Committee as well as briefings by experts from government agencies, His Majesty expressed the view that parliamentary sessions should be held as soon as possible.\"It added: \"This is to enable the emergency ordinances and the national recovery plan to be debated by the members of the House of Representatives.\"According to the statement, the king expressed hope that the COVID-19 outbreak could be curbed immediately and that vaccination was the only \"exit strategy\" to control the spread of the pandemic.\"In this regard, His Majesty expressed the view that the government must act decisively to simplify bureaucracy andspeed up the vaccination process for the people so that the goal of herd immunity of 80 per cent can be achieved as soon as possible,\" it added.The statement also highlighted that Sultan Abdullah expressed the view that there was a need for \"a stable and strong government administration\" able to function effectively in dealing with the pandemic.\"His Majesty is fully aware of the role of parliament as an important platform for elected representatives to convene and discuss various issues, especially those related to the spread of the COVID-19 pandemic,\" it said.\"Members of the Dewan Rakyat can discuss the allocation of government expenditure to help people in need and revive the national economy,\" the statement added.The special conference on Wednesday was held after the king met with 18 key leaders of Malaysian political parties and the Special Independent Committee on Emergency 2021.The kingfirst declared a state of emergency on Jan 12to curb the spread of COVID-19. The emergency was scheduled to last until Aug 1 or earlier depending on the state of coronavirus infections.Since it was declared, federal parliamentary sessions and state legislative assemblies have not sat. No elections were held during this period.The state of emergency allows the king to proclaim several emergency ordinances on matters related to private hospital assets; temporary ownership of land, buildings or moveable properties of private hospitals; or to request to use the resources of private hospitals to treat patients.The government can also seek a more inclusive involvement from the private sector including private healthcare facilities to help ease the burden of government agencies, especially public hospitals.The suspension of parliament was seen as a move that helped Prime Minister Muhyiddin Yassin avoid an immediate challenge to his razor-thin majority in the august house.Opposition leaders have pleaded with the king againstextending the state of emergencyand called for parliament to reconvene.On Tuesday, Mr Muhyiddin said parliament could reconvene in September or October this year during the third phase of a national recovery plan.\"I wish to give my commitment that the parliament meeting can be held in this phase, around September or October, with tight standard operating procedures (SOPs) in place,\" he said whenunveiling the plan which comprises four phases in a televised address.Malaysia reported 5,150 new COVID-19 cases on Wednesday and the national total is currently 673,026.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Malaysia,COVID-19,state of emergency", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/malaysia-parliament-reconvene-as-soon-as-possible-king-covid-19-15024746", "Source": "google"}