{"Type": "", "Time": "2021-06-16", "Headline": "Malaysia's rulers end special meeting on Covid-19 crisis, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.KUALA LUMPUR - Malaysia’s Malay rulers have ended a closely watched meeting at the national palace with the King on Wednesday (June 16), with the country’s Covid-19 crisis and state of emergency high on the agenda.Several royal vehicle convoys began exiting the main gate of Istana Negara from about 5.15pm, Astro Awani news channel said. The special meeting of the Conference of Rulers started at 2.30 pm.Over the last week, Sultan Abdullah Ahmad Shah had granted audiences to political party leaders across the divide to get their views on the government's handling of the outbreak during the ongoing state of emergency, which will expire on Aug 1.The King had met 18 political leaders face to face as well as in virtual sessions from June 9, said a statement issued by the Comptroller of the Royal Household, Datuk Indera Ahmad Fadil Shamsuddin, on Tuesday.Aside from meeting political leaders, the King also granted an audience to the chairman of the Special Independent Committee on the Emergency, Tun Arifin Zakaria, at Istana Negara on Tuesday, it said.At the special meeting on Wednesday, experts from various government agencies were slated to present briefings on matters related to health, security, politics and the economy.The meeting was the second held by the Malay rulers to discuss the pandemic, after one was held in October last year.The Malay rulers, who include Sultan Abdullah, represent the nine Malay-majority states in Malaysia.The state of emergency was declared on Jan 12 amid a spike in Covid-19 cases. There have been calls for the emergency to be lifted due to the worsening Covid-19 health crisis.Malaysia has been struggling to bring down its Covid-19 infections this year, with daily cases hitting a record 9,020 on May 29.Daily infections have gone below 1,000 a day only once this year, at 941 cases on March 29.The nation is currently under another lockdown after record highs in Covid-19 cases and deaths were reported in recent weeks.Last Wednesday, opposition leader Anwar Ibrahim said he had pleaded with the constitutional monarch not to extend the state of emergency, as the move has not helped poorer Malaysians.Opposition Democratic Action Party secretary-general Lim Guan Eng, whose party has the most number of MPs, told reporters after his audience that the discussion with the King revolved around financial assistance for the people to see them through the outbreak.As a potential solution to Malaysia's crisis, the country's longest-serving premier Mahathir Mohamad mooted the revival of a council that governed the nation after its deadly May 13, 1969, race riots in his audience with the King last Thursday.Tun Dr Mahathir claimed the National Operations Council (Mageran), which was in charge for two years during the last national emergency until 1971, allowed Malaysia's second prime minister, Tun Abdul Razak Hussein, to \"solve political problems at the time\" by bringing in opposition parties to form a wider Barisan Nasional (BN) ruling coalition that had a stronger majority.Back then, Mageran was made up of a small group of political leaders and top civil servants that included the police and armed forces' chiefs. Dr Mahathir suggested including experts on the Covid-19 pandemic this time.Opposition coalition Pakatan Harapan has opposed the idea, while Umno, a member of the ruling coalition, has said that it is against extending the emergency.Opponents of Prime Minister Muhyiddin Yassin have also called for the resumption of Parliament, which last sat in December last year to pass this year's budget, so that the outbreak can be addressed.The state of emergency suspends the requirement for Parliament to reconvene within six months of its last sitting and also ensures the Muhyiddin administration remains in power.Tan Sri Muhyiddin on Tuesday unveiled a four-phase post-pandemic exit plan for Malaysia, ahead of the monarchs' special talks, projecting that Malaysia from September might gradually open up its economy, social sectors and also Parliament.The country has failed to fully recover from a resurgent outbreak arising from Sabah state polls in September last year.Malaysia in late October was reporting around 1,200 Covid-19 cases a day. On Wednesday, it recorded 5,150 cases.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/malaysias-royal-rulers-to-meet-king-on-covid-19-crisis", "Source": "google"}