{"Type": "", "Time": "2021-06-16", "Headline": "Suspected car bomb discovered close to Stadio Olimpico ahead of Italy vs Switzerland - Mirror Online", "Text": "According to reports from Italy, the suspected bomb was found inside a car parked in the Piazza Mancini area, which is close to the stadium hosting Wednesday night's Euro 2020 clashWant Euro 2020 news sent straight to your inbox? Sign up to our email updatesA suspected car bomb has been discovered close to the Stadio Olimpico ahead of Italy's Euro 2020 clash with Switzerland.According to reports in Italy, a fan spotted a suspicious item inside a parked car while heading to the stadium.The car was situated in the Prati district of the Italian capital Rome, reports Corriere dello Sport, which is close to where Wednesday night's Euro 2020 clash is taking place.The suspicious item was reported to the police and a bomb squad carried out a controlled explosion.It has not yet been officially confirmed whether the item was indeed a bomb.Italy beat Turkey 3-0 in their opening group game of Euro 2020.Ciro Immobile and Lorenzo Insigne were on the scoresheet with Merih Demiral netting an unfortunate own goal for Turkey.Switzerland on the other hand drew their opening game with Wales.The Swiss went 1-0 up on the night through Breel Embolo and looked good value for their lead before the Welsh hit back.Kieffer Moore fired home to draw level for Wales.Wales beat Turkey 2-0 ahead of Switzerland's clash with Italy this Wednesday, putting pressure on the Swiss to get a result in Rome.Gareth Bale, who missed a penalty in the win, but assisted both goals, said after the victory: \"I'm absolutely delighted with the win.\"We fought hard, we worked our socks off like we always do. Yes, I missed a penalty but I feel I showed good character to keep going.\"Aaron got in a few times, we've always linked up well all the time since our early days.\"We needed that victory more than anything and the second goal at the end was the icing on the cake.\"If you'd offered us four points at the start we would have bitten your hand off.\"We are happy, it puts us in a great position.\"The fans helped get your adrenaline going to push to those levels you need to get to.\"The Welsh fans were incredible and we want to thank the fans at home too who I'm sure will be cheering in their millions.\"", "Section": "", "Writers": "", "URL": "https://www.mirror.co.uk/sport/football/news/breaking-car-bomb-discovered-close-24335426", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}