{"Type": "", "Time": "2021-06-16", "Headline": "Mandatory Covid-19 tests for stallholders at Redhill Market and Food Centre, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - All stallholders at the Redhill Market and Food Centre will need to undergo mandatory Covid-19 tests after an infected person was found to have visited it.Announcing this on Tuesday (June 15), Radin Mas MP Melvin Yong said it was a precautionary measure to ensure the safety of those working and visiting the neighbourhood centre, which is usually busy.In a Facebook post, Mr Yong said the tests will be carried out on Tuesday and Wednesday at a temporary testing centre that had been set up at Block 84A Redhill Lane.Mr Yong added that he and the chairman of the Bukit Merah Shop Owners and Hawkers Association had visited the testing centre earlier on Tuesday afternoon to check on the testing process and to update stallholders on the latest situation.He said that most stallholders had completed their tests by midday and told him that the process was painless and smooth.Mr Yong added: \"They agree that getting tested is the responsible thing to do, so that everyone can have peace of mind when coming to the market and food centre.\"Let's continue to support our hawkers and market stallholders during this difficult time.\"The Ministry of Health (MOH) had said on Monday evening that Redhill Market and Food Centre had been visited by an infected individual on mornings between June 8 and 10.The testing operation at Redhill Market and Food Centre comes after mandatory Covid-19 testing commenced for 85 stallholders at the nearby Bukit Merah View Market and Hawker Centre on Monday after a new cluster of cases was detected by MOH last week.There were 16 confirmed cases linked to the Bukit Merah View Market and Food Centre cluster as at Monday.Redhill Market and Food Centre and Bukit Merah View Market and Hawker Centre are about a ten-minute walk from each other.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/mandatory-swab-tests-for-stallholders-at-redhill-market-food-centre-after-covid-19", "Source": "google"}