{"Type": "", "Time": "2021-06-16", "Headline": "More records for relentless Ronaldo! Portugal's late show leaves Hungary heartbroken in Budapest | Goal.com", "Text": "Hungary 0-3 Portugal: Match Statistics  There may only have been five minutes gone, but because of the look on Cristiano Ronaldo’s face as Diogo Jota took a shot instead of passing to him, it was tempting to think that it wasn’t going to be the Portugal captain's night.The Liverpool forward stung the hands of Hungary goalkeeper Peter Gulacsi with a decent effort from the edge of the area, but Ronaldo had wanted the ball and he made his team-mate aware of his disgust in no uncertain terms.The 36-year-old cut a frustrated figure for a further 80 minutes. At one point just before the break, he was left with his hands on his head after somehow missing the target from five yards. By the midway point of the second half, he had been reduced to making desperate claims for a penalty.The thing about Ronaldo is that even when it looks like things aren't going his way, he often ends up stealing the headlines.He said before Tuesday night's Euro 2020 Group F clash in Budapest that \"was not overwhelmed\" by the prospect of making history in his historic fifth appearance at the finals. Why would he have been? This is not a character that cracks under pressure. He knows how to deal with disappointment. He became the best player in the world as much for his drive and determination as his incredible footballing ability. He does not stop. He just keeps going.That's why he is now the European Championship's all-time leading scorer, with his double in a 3-0 win over a tenacious Hungary side taking him to 11 goals – two more than France legend Michel Platini.   Ali Daei’s international record of 109 is now also within touching distance. Ronaldo has moved to 106 strikes for the Seleccao. No wonder he was all smiles at the end of the game.However, both he and his team-mates were in anything but a celebratory mood as the second half at Puskas Arena drew towards a close with the game still scoreless.Portugal boast a squad packed with players who won league titles last season but it just wasn't clicking. They looked like a group of great individuals rather than a true team, and just couldn’t find a way through the home side's stubborn defence.The cauldron of sound created by a capacity crowd in Budapest added to their troubles. Every Portuguese touch was jeered and every successful Hungarian challenge was greeted by an enormous cheer. On paper, this was the ‘easy’ game in the 'Group of Death' for Portugal. Their hosts, after all, had never beaten them, and Hungary had only qualified for the Euros via the Nations League play-offs.Yet Marco Rossi’s side showed that they are not just here to make up the numbers. He had said in his pre-match press conference that Hungary could \"dream\" of upsetting Portugal and they thought they had taken the lead when Szabolcs Schon fired home with just 10 minutes to go.However, the 60,000 Hungary fans celebrating exuberantly were brought crashing down to Earth by the realisation that the offside flag had been raised.  Further disappointment would follow, as Portugal's superior strength in depth finally took its toll.Rossi's game plan had worked well, with Hungary nullifying Portugal with their deep defence. Seleccao coach Fernando Santos even admitted afterwards that his side had looked \"anxious\" in the second half but the introduction of Rafa Silva and Renato Sanches changed things.“I brought Rafa on and the game opened up because he is very, very fast,” Santos said after the game. “We wanted Renato to move the ball up from midfield, we wanted to play a more vertical game and free up Rafa. I think it worked well enough because we won 3-0!\"Fortune smiled on the champions. The crucial first goal came courtesy of a deflected strike from Raphael Guerreiro, while the second was the result of a soft penalty, which was emphatically converted by Ronaldo, who had only had three touches in the Hungarian box before then.However, Portugal's third goal was pure class, with Ronaldo starting and finishing a move in fine style, by tapping home after taking the ball coolly around Gulacsi.The game had started with Ronaldo screaming at a team-mate in familiar frustration. It ended with him celebrating in his usual style. We shouldn't have been surprised, of course. This is what he does. This is Cristiano Ronaldo, football's relentless record-breaker.", "Section": "", "Writers": "", "URL": "https://www.goal.com/en-sg/news/record-ronaldo-portugal-hungary-budapest/1y3faqr3b88h10mehfxjwc8vg", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}