{"Type": "", "Time": "2021-06-16", "Headline": "As China's Communist Party turns 100, a look at 10 events in the last century that marked the CCP-World News , Firstpost", "Text": "\n                        From elementary school essay competitions to patriotic films to an unending parade of speeches, banners, and news headlines, China is in the midst of celebrating the CCP's 100-year anniversary\n                    \n                            Women gesture as they pose for a souvenir picture at a photo exhibition featuring people's lives under communist party from 1921 to 2021 on display at the Wangfujing shopping district in Beijing. AP\n                        The Chinese Communist Party (CCP) is all set for a patriotic extravaganza to celebrate the 100th anniversary of its founding on 1 July. Since the establishment of the People’s Republic of China in 1949, the CCP has been in sole control of that country’s government.With its centenarian celebrations looming, party leaders are pulling out all the stops to celebrate the party's founding 100 years ago. From elementary school essay competitions to patriotic films to an unending parade of speeches, banners, and news headlines, China is in the midst of celebrating the CCP's 100-year anniversary.The Communist Party of China has more than 91 million members, according to the official Xinhua news agency — many of them grassroots cadres and ordinary civil servants.The CCP was founded as both a political party and a revolutionary movement in 1921 by revolutionaries such as Li Dazhao and Chen Duxiu. Those two men and others had come out of the May Fourth Movement (1919) and had turned to Marxism after the Bolshevik victory in the Russian Revolution of 1917. In the turmoil of 1920s China, CCP members such as Mao Zedong, Liu Shaoqi, and Li Lisan began organizing labour unions in the cities.It is a monolithic, monopolistic party that dominates the political life of China. It is the major policy-making body in China and oversees the central, provincial, and local organs of government to carry out those policies.Let's take a look at 10 defining moments for the party in the last century.1.May Fourth MovementThe party's journey started in 1921 when CCP was formed. China at that time was driven by feuding warlords, deeply mired in poverty, and powerless on the international stage. The Republic of China was established in 1912, but its government was weak and largely unable to solve China's problems, as noted by Axios.However, in reality, there was a war between regional warlords and militias, who claimed independence from the national government and sought to serve their own needs.On 4 May, 1919, thousands of students rallied in Beijing for a demonstration against the national government.In what is now called the May Fourth Movement,  on 4 May, 19191, more than 3,000 students from 13 colleges in Beijing held a mass demonstration against the decision of the Versailles Peace Conference, which drew up the treaty officially ending World War I, to transfer the former German concessions in Shandong province to Japan.The Chinese government’s acquiescence to the decision so enraged the students that they burned the house of the minister of communications and assaulted China’s minister to Japan, both pro-Japanese officials. Over the following weeks, demonstrations occurred throughout the country; several students died or were wounded in these incidents.2. Great Leap ForwardA decade after the Communist party took power in 1949, one of the largest manmade disasters in history struck an already impoverished land. In an unremarkable city in central Henan province, more than a million people – one in eight – were wiped out by starvation and brutality over three short years, as per The Guardian.The ironically titled \"Great Leap Forward\", a five-year economic plan, was supposed to be the culmination of Mao Zedong’s program for transforming China into a Communist paradise.The campaign was undertaken by the Chinese communists between 1958 and early 1960 to organize its vast population, especially in large-scale rural communes, to meet China’s industrial and agricultural problems.As per the BBC, the drive produced an economic breakdown and was abandoned after two years. Disruption to agriculture is blamed for the deaths by starvation of millions of people following poor harvests.3. Tibet's incorporationTibet’s incorporation into the People’s Republic of China began in 1950 and has remained a highly charged and controversial issue, both within Tibet and worldwide. Many Tibetans (especially those outside China) consider China’s action to be an invasion of a sovereign country, and the continued Chinese presence in Tibet is deemed an occupation by a foreign power.In 1950, Chinese troops entered Tibet, and a year later, the Chinese government formally gained control over the region and its devoutly Buddhist Tibetans. The Dalai Lama fled Tibet in 1959, to India, following a failed uprising against Chinese rule.The Dalai Lama and the exiled government, also known as the Central Tibetan Administration (CTA), has proposed what they call a \"middle way\" approach that would allow the exiled Tibetans to return to China on the condition of \"genuine autonomy\" for Tibet, though not full independence.In 2008, anti-China protests escalated into the worst violence Tibet had seen, just five months before Beijing was to host the Olympic Games. Pro-Tibet activists in several countries focussed world attention on the region by disrupting the progress of the Olympic torch relay.However, since 2010, the CCP has rebuffed attempts by the CTA to reopen dialogue and maintains that the Dalai Lama is a separatist.4. Cultural RevolutionThe Great Proletarian Cultural Revolution was a decade-long period of political and social chaos caused by Mao Zedong’s bid to use the Chinese masses to reassert his control over the Communist party.Fearing that China would develop along the lines of the Soviet model and concerned about his own place in history, Mao threw China’s cities into turmoil in a monumental effort to reverse the historic processes underway.In response to Mao’s admonishments, the Red Guard Movement was formed. The Red Guards was a mass student-led paramilitary social movement mobilized. While they sought to reinforce the Maoist standards of Communism, they were largely undisciplined and caused violence among those they saw as capitalists.They formed under the auspices of the Chinese Communist Party (CCP) in 1966 in order to help party chairman Mao Zedong combat “revisionist” authorities—i.e., those party leaders Mao considered as being insufficiently revolutionaryThe Revolution marked Mao's return to the central position of power in China after a period of less radical leadership to recover from the failures of the Great Leap Forward, which contributed to the Great Chinese Famine only five years prior.The Cultural Revolution lasted for at least 10 years up until Mao’s death in 1976.5. Rise of Deng XiaopingBy orchestrating China’s transition to a market economy, Deng Xiaoping left a lasting legacy on China and the world. After becoming the leader of the Communist Party of China in 1978, following Mao Zedong’s death two years earlier, Deng launched a program of reform that ultimately saw China become the world’s largest economy in terms of its purchasing power in 2014, according to The Conversation.Xiaoping was one of the most powerful figures in the People’s Republic of China from the late 1970s until his death in 1997. He abandoned many orthodox communist doctrines and attempted to incorporate elements of the free-enterprise system and other reforms into the Chinese economy.Under him, China undertook far-reaching economic reforms. The government imposed a one-child policy in an effort to curb population growth. With the \"open-door policy\", the party also opens the country to foreign investment and encourages development of a market economy and private sector.6. Tiananmen SquareWhile Xiaoping hoped to boost the economy and raise living standards by opening up the economy, the move brought with it corruption, while at the same time raising hopes for greater political openness.\n                Updated Date:\n                \n                    June 15, 2021 09:54:39 IST\n                \n\n                        TAGS:\n                    \n                Frontline and healthcare workers were assigned additional duties to help manage the public health emergency. But while the number of tasks expected of ASHAs kept increasing, the protective gear dwindled\n\n\n            \n                The Centre will take over from states, which were supposed to be carrying out about 25 percent of the country’s vaccination work, and continue with its ongoing inoculation efforts\n            \n                Ethanol is a biofuel, that is, a fuel produced by processing organic matter. The auto fuels we commonly use are mainly derived from the slow geological process of fossilisation, which is why they are also known as fossil fuels\n            Sign up for a weekly curated briefing of the most important strategic affairs stories from across the world.FirstpostSectionPlusToolsAppsNetwork18 sites Copyright © 2021. Firstpost - All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.firstpost.com/world/as-chinas-communist-party-turns-100-a-look-at-10-events-in-the-last-century-that-marked-the-ccp-9716901.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}