{"Type": "", "Time": "2021-06-16", "Headline": "More singles, fewer babies, Singapore sees slowest population growth since 1965 | The Star", "Text": "\n                    Wednesday, 16 Jun 2021\n                Women, especially if they were more educated, had fewer children.ST \nSINGAPORE (The Straits Times/ANN): Amid Singapore's slowest population growth since independence, not only are more Singaporeans staying single, even those who marry are having fewer babies.The nation's sixth census since independence in 1965 also found other key trends set in motion decades ago to have solidified further.One was that Singaporeans of all ages and races are better educated than they were 10 years ago. Another finding revealed on Wednesday (June 16) was that more do not consider themselves as having a religion.Conducted once every 10 years, the census is the largest national survey undertaken here on key characteristics of the population. This includes data on demographic, social, economic and employment issues, as well as on housing, transportation and education.Singapore's total population rose from 5.077 million in 2010 to 5.686 million in 2020.More findings from Census of Population 2020 will be released on Friday.1. Greying populationOver the past 10 years, Singapore's total population grew by around 1.1 per cent each year - the slowest rate since independence.The number of citizens grew from 3.23 million to 3.52 million, while the number of permanent residents held steady at around half a million.The population is also ageing, a shift that has ongoing multifaceted impact on the economy. Those aged 65 years and older formed 15.2 per cent of the resident population in 2020, a marked rise from 9 per cent in 2010.The median age rose from 37.4 to 41.5 years over the same period.The child dependency ratio - or residents aged below 20 years per 100 residents aged 20 to 64 years - decreased from 36.5 in 2010 to 30.6 in 2020.The old-age dependency ratio - or residents aged 65 years and over per 100 residents aged 20 to 64 years - increased from 13.5 to 23.4 over the same period.2. More staying singleIn a trend that has implications for continued population growth, the proportion of singles rose across all age groups over the past 10 years, with the sharpest increase among younger Singaporeans aged 25 to 34 years.The proportion of single men among those aged 25 to 29 years rose from 74.6 per cent to 81.6 per cent; for women, it rose from 54 per cent to 69 per cent.Less-educated men were more likely to stay single, whereas the opposite was true of women.3. Those married are having fewer babiesWomen, especially if they were more educated, had fewer children.The average number of children born per resident woman aged 40 to 49 years who had ever been married fell from 2.02 in 2010 to 1.76 in 2020.Within this age group, women who were university graduates had an average of 1.66 children in 2020 - marking a steady decline from 1.74 children 10 years ago and 1.95 in 2000.This was lower than the average of 1.94 among those with secondary qualifications.The proportion who were childless in this age group hit double digits (13.5 per cent) in 2020, after climbing from 6.4 per cent to 9.3 per cent in the preceding decade.4. Singaporeans are better educatedSingaporeans are also better educated. Among residents aged 25 years and over, almost six in 10 (58.3 per cent) attained post-secondary or higher qualifications, up from less than half (46.5 per cent) in 2010.The Chinese, Malay and Indian communities all saw improvements.Women have also closed the gap with each successive cohort.Among residents aged 55 years and over in 2020, the proportion with post-secondary or higher qualifications was 34 per cent for men and 22.8 per cent for women.This narrowed to a 2.4 percentage point difference among those aged 35 to 44 years. When it came to those aged 25 to 34 years, the proportion of women (90.2 per cent) exceeded men (90 per cent).Overall literacy remained high, with English being the language most frequently spoken at home for 48.3 per cent of residents aged five years and over in 2020, up from 32.3 per cent in 2010.Singaporeans also remain multilingual. Among residents who spoke English most frequently at home, more than 80 per cent also spoke a vernacular language at home.5. More with no religionAmong residents aged 15 years and over in 2020, 31.1 per cent identified themselves as Buddhists, 8.8 per cent as Taoists, 18.9 per cent as Christians, 15.6 per cent as Muslims and 5 per cent as Hindus.While it is clear that Singapore remains religiously diverse, there are growing numbers of Singaporeans who cite no religious affiliation.The proportion was 20 per cent in 2020, up three percentage points from a decade ago. This number was 15 per cent in 2000.The increase took place across all age groups.At a media briefing on Monday, Minister in the Prime Minister's Office Indranee Rajah said the census data showed Singaporeans had enjoyed significant progress over the past 10 years, and that the country remains multiracial, multi-religious and multilingual.Observing that Singaporean citizens account for a greater proportion of population growth in this decade, she said: \"Singaporeans who wish to start and raise families remain a priority because we want to grow the Singapore population, the Singapore core.\"At the same time, we have to supplement our population with some immigration, because we also need to support our economy. But that has to be very carefully calibrated.\" - The Straits Times/Asia News Network\nTags / Keywords:\nSingapore\n                                                                ,\n                                                                                                census\n                                                                ,\n                                                                                                population\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/16/more-singles-fewer-babies-singapore-sees-slowest-population-growth-since-1965", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}