{"Type": "", "Time": "2021-06-16", "Headline": "Parents understand need for staggered return to school, but some worry about HBL challenges, Parenting & Education News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Home-based learning (HBL) has been challenging for parents - especially those juggling busy work schedules - but they understand the need for caution in the Ministry of Education's (MOE) move to progressively allow students back to school after the June holidays.MOE had announced the move on Monday (June 14), adding that the aim is to keep students and staff safe from Covid-19.From June 28, when Term 3 begins, Primary 1 to 3 pupils will continue with a week of HBL. They will return to school on Tuesday, July 6, as Monday is a school holiday.Secondary 1 and 2 students will also be on HBL for three days till June 30, and return to school on Thursday, July 1.Students in Primary 4 to 6, Secondary 3 to 5, junior colleges and the Millennia Institute will return to school on June 28.Parents The Straits Times spoke to on Tuesday welcomed the move, though some noted that there could be challenges that could be stressful for both parents and children.Mrs Joanna Tan, 41, feels the staggered return is a good way to reassure parents of their children's safety.\"Younger children tend to get excited to see their friends on the first day back at school (which could lead to them not keeping to safe distancing measures),\" she said.Having one week of HBL could help them to adjust back to school without such risks, said the housewife, who has a son in Primary 6 and a daughter in Primary 2.But another parent, Ms Carmen Li, 38, said HBL can be challenging and has \"added extra stress to both parent and child\".She has an intense work schedule, she said, and it has been difficult to rush her own work while giving her Primary 3 daughter attention or technical support when needed.\"Primary 3 children are still dependent on their parents,\" said, Ms Li, who works in human resources.She added that her daughter uses her phone at times to call her teacher. \"I need to be on standby for her if she cannot get through homework. It is almost like I need to be right next to her.\"Ms Li said she hopes schools can suggest a self-directed timetable for children beyond school to support parents in dealing with their children's social needs and fight boredom.Mr Elgin Teng, 39, whose daughter is in Primary 1, said he was not surprised to hear of the move, given the trend in community cases and how the end of the June holidays was approaching.Said Mr Teng, a learning and development consultant, of his daughter: \"She gets to spend more time with the family and learn about... how we make a living. We also get to spend more time together over meals, so we see that as a good thing for her, although not so much for us parents because we now need to multitask.\"The homework load is not too heavy in Primary 1, but the challenge is when the work is done and his daughter starts to seek parental attention, Mr Teng added.\"The school is a valuable place for every child to grow in their social awareness, relationship management and face-to-face interactions... A shorter HBL might be healthier as a child's well-being needs to be extended into the space of physical interactions and also parents' space for mental rest.\"Mr Graham Teo, 42, who has a child in Secondary 1, also noted that while each Singaporean has a part to play in keeping the country safe, \"an integral part of going to school is the social interaction with friends and teachers\".Learning and working from home will be a part of the future, and schools are doing well under the circumstances, said Mr Teo, who works in procurement.\"However, with more HBL, teachers and parents need to understand that close partnership is now more crucial than ever. Both sides should reach out to each other instead of it being a one-sided effort.\"He added: \"Part of the fun of going to school is meeting and interacting with friends. We also need to pick up social skills, and there is no better place than school to do it in.\" Get the ST Smart Parenting newsletter for expert advice. Visit the microsite for more.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/parenting-education/parents-understand-need-for-staggered-return-to-schools-but-some-worry", "Source": "google"}