{"Type": "Business", "Time": "2021-06-16", "Headline": "Biden tells Putin certain cyberattacks should be 'off-limits'", "Text": "GENEVA: US President Joe Biden told Russian President Vladimir Putin on Wednesday (Jun 16) that certain critical infrastructure should be \"off-limits\" to cyberattacks, while the two leaders agreedin their summitto start cyber security talks.Biden said the list of organisations that should not be attacked includes the 16 sectors designated by the United States as critical infrastructure. The sectors, based on a description published by the US Homeland Security Department, include telecommunications, healthcare, food and energy.\"We agreed to task experts in both our countries to work on specific understandings about what is off-limits,\" Biden said. \"We'll find out whether we have a cybersecurity arrangement that begins to bring some order.\"In a separate press conference, Putin said he agreed to \"begin consultations\" on cybersecurity issues. He also said that while the United States had requested information from Russia about recent cyber-attacks, Moscow had similarly asked for information about attacks he said were coming from the US side and had not received a response.The talks follow several major hacking incidents in the United States against important government agencies and American companies that US officials have blamed on Russian hackers.Putin brought up a ransomware cyber-attack in May that disrupted activity at the Colonial Pipeline in the US Southeast, an attack attributed to a group believed to be based in Russia but one that Putin has said had no link to the Russian state.Putin said the cybersecurity consultations were \"extremely important\".\"We need to throw out all kinds of insinuations, sit down at the expert level and start working in the interests of the United States and Russia,\" Putin said.He said there were issues to work on, but specific details about what commitments should be made would be decided as negotiations develop.\"We certainly see where the attacks are coming from. We see that this work is coordinated from US cyberspace,\" Putin said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Vladimir Putin,business and finance,U.S.,attack,Joe Biden,Russia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/business/biden-tells-putin-certain-cyber-attacks-should-be-off-limits-15029462", "Source": "google"}