{"Type": "Singapore", "Time": "2021-06-12", "Headline": "Negotiations on wage increases for workers in security, landscape and lift and escalator sectors to be concluded soon: Tan See Leng", "Text": "SINGAPORE: Workers in the security, landscape, and lift and escalator sectors may soon see their salaries increase further under the progressive wage model, with tripartite partners “confident” they can conclude negotiations in the next few months, said Manpower Minister Tan See Leng.At a media briefing about the progressive wage model on Thursday (Jun 10), Mr Tan said recommendations for the three sectors were currently in the pipeline and that newly-formedtripartite clusters for food services, retail, andwaste managementwere also making headway.“The (Tripartite Workgroup on Lower-Wage Workers) is looking at ways to cover the various occupational groups under progressive wages, and this will benefit low wage workers employed in similar occupations but distributed across the various sectors,” he said, adding that the workgroup will share more on the plans soon.The update comes a day after the Government accepted proposals by the Tripartite Cluster for Cleaners (TCC)to increase the wages of cleanerseach year over six years from 2023, under the progressive wage model.It was the first wage review since the workgroup was launched in October last year to look into the salaries of low-wage workers and to improve their well-being.Senior Minister of State for Manpower Zaqy Mohamad, who chairs the workgroup, said the timeline for the roll-out of the wage increases will give employers time to adapt.“They have many contract obligations that typically run two to three years, so you must also be fair with the industry to adapt because they have committed salaries for existing contracts,” he said.“The six-year schedule also provides service buyers and providers with clarity on wage cost increases so that they can plan for the long term, and cleaning firms are also able to now price in wage increases in the next multi-year contracts that they have with the service buyers,” he added.He gave assurance that cleaners' wages will continue to grow from now to 2023, under an existing agreement that stipulates annual increments of 3 per cent each year.During the briefing, National Trades Union Congress (NTUC) secretary-general Ng Chee Meng explained the challenges behind implementing the progressive wage model for various sectors.“This is a very difficult journey ... It's not so easy as a blanket policy (dictating) that these are the wages, but it gives the ecosystem a runway that is sustainable that would benefit and create a win-win (situation) for both workers and employers,” he said.When asked why it takes a long time for the model to be implemented, Mr Ng said the model is a more \"involved\" process that may take a bit more time.“If you set (wages) too high ... workers may well be made redundant, loss of jobs, because businesses cannot carry that cost, they will exit, or even if they don't exit, workers may lose their jobs,” he added.“If you set it too low, then it becomes actually a wage ceiling for workers. If my real productivity deserves S$20, S$25 an hour and we got it quite wrong, as in many other practices of minimum wage when it's set too low, then actually, it becomes a wage ceiling. This (is) what I mentioned ... as potential downsides of (a) minimum wage.\"Responding to a question about how the wage increases - which only apply to Singaporeans and permanent residents - might push more employers to hire foreigners to lower manpower costs, Mr Tan said existing measures such as employment quota and qualifying salary requirements are in place.\"So, there will be more initiatives that you can see that would look very ... comprehensively at this foreign versus local talent and workforce complementarity,\" added the Manpower Minister.PWM VS MINIMUM WAGECurrently, the progressive wage model is mandatory for the cleaning, security and landscape industries. It was designed to raise the salaries of lower-wage workers by upgrading their skills and increasing their productivity.There have been numerous debates on the merits and effectiveness of the progressive wage model compared with a minimum wage system.During the briefing, Mr Zaqy compared Singapore’s progressive wage model to the minimum wage system implemented in other countries, such as the US and UK. He said the progressive wage model has brought about sustained wage increases in Singapore over almost a decade.In contrast, the federal minimum wage system implemented in the US has been stuck at US$7.25 per hour since 2009 due to \"political wrangling\", he said.He added that while the UK has increased its minimum wage, the country has also seen a significant increase in zero-hour contracts, where employers are not obliged to provide any minimum working hours and workers do not have to accept any work offered.“The Government is not against minimum wage. In fact, we have taken some parts of this in our social innovation because we take the best of breed from what we see out there,” he said.“So you see that the bottom rungs of our (progressive wage model) have some elements of minimum wage but we didn't stop there, we created ladders to create career progression.”BUSINESSES, CONSUMERS MUST DO THEIR PARTAs the progressive wage model expands to cover more sectors, businesses must continue to transform through automation and job redesign to help uplift the wages of their workers, said Dr Robert Yap, president of the Singapore National Employers Federation (SNEF).He added that workers will also have to upskill to stay relevant and ensure career progression.Mr Zaqy added that the Government will continue to help bear some of the cost increases through salary top-ups such as the Workfare Income Supplement Scheme. This is to ensure that the impact of the cost increases is not solely borne by businesses or consumers. Society must be prepared to do its part too, he said.“This is really about addressing social inequality ... As an advanced country and mature country like Singapore, this is where we need to take our society forward,” he said.“For us to say ... we want to care for low-wage workers but not pay them a decent salary, not support them as a society, that cannot stand for too long,” he added.“This is where society needs to extend its support for low wage workers. We may have to expect to pay a bit more, but I think if we know, deep in our heart that it supports, encourages and it's giving recognition to our low wage workers, our essential workers, for the work that they do. It is something that we must be prepared to support as a society.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Progressive Wage Model,Cleaners,Low-wage workers,Manpower", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/wage-reviews-low-wage-workers-security-landscape-lift-14984974", "Source": "google"}