{"Type": "Singapore", "Time": "2021-06-12", "Headline": "Racism exists but Singapore has made 'tremendous progress' in racial harmony: Shanmugam", "Text": "SINGAPORE: While racism exists, Singapore has made \"tremendous progress\" in racial harmony over the years, said Law and Home Affairs Minister K Shanmugam on Thursday (Jun 10) in an interview with CNA938.His comments follow recent incidents of alleged racism in public. Last week, a viral video emerged showing aman making racist remarkstowards an interracial couple at Orchard Road.In another incident last month,a 55-year-old woman was allegedly kickedand subjected to racial slurs by a 30-year-old man while she was brisk walking.When asked during the interview if Singapore's racial harmony is on a knife-edge, Mr Shanmugam said: \"I’ve always said there is racism in Singapore, but we are a better society than most other multi-racial societies that I know of.\"I mean, name me a society where there is no racism, which is multi-racial? I’ve felt that we have made tremendous progress.\"He added: \"Most people accept the norms of a multiracial society and we are making progress. The direction was positive and direction has been positive.\"Mr Shanmugam had said last week following the incident at Orchard Road that he is \"not so sure anymore\" that Singapore is \"moving in the right direction\" on racial tolerance.\"It's the direction that I'm concerned about,\" he added on Thursday. \"But as of today, I won’t say we are at knife-edge. I think that will be over-dramatising it.\"Mr Shanmugam also said that people should call out racism and do it sensibly.\"When it's in the public square, I think you should call out, you should frown against it and you should take action where it breaches the law, because it is cancerous, it's divisive and it undermines the values of our society,\" he added.On how the law deals with such incidents, Mr Shanmugam said there is a \"fairly strict framework\" in Singapore, but the country has to go beyond that to maintain racial harmony.\"Legal framework is one part of it, but the Government and society have to work very hard to maintain harmony. You can't bring about harmony and racial tolerance and acceptance just by having laws and enforcing them, you need to do much more,\" he said.\"The laws give the framework, the foundation, they are important, but you got to go beyond that. And the answer is not every time something happens, you charge,\" he added.\"When it is serious, investigations are conducted, then the Attorney General decides sometimes a warning, sometimes people are charged. But you are careful in the way you exercise that power.\"Although the Government plays \"an extremely important role\" in safeguarding racial and religious harmony, Singaporeans have a part to play as well, Mr Shanmugam said.\"It’s not a subtraction from Singaporeans to say, 'I’m an Indian', 'I’m a Chinese', 'I’m a Malay', or sub-identities. Those are extremely important. They give us our cultural ballast,\" he said.\"But beyond that, we are also Singaporeans, and that is a common identity. We have to emphasise that common identity, even as we recognise, accept, emphasise our individual identities. We need to have that common vision to say, look, we want to build a system based on justice, equality, meritocracy, and where everyone can feel equal, and everyone can feel protected,\" he added.\"The Government has a huge role in articulating that vision and being fair.\"NEED FOR DEEPER ENGAGEMENTIn a Facebook post earlier on Thursday,President Halimah Yacob said that while Singapore’s primary recourse has been the law and that those found guilty have been \"rightly punished\", this will not stop hate and chauvinism from perpetuating.“It is agonising to read about the incidents of hatred and chauvinism perpetrated by Singaporeans against each other. Such displays are so hurtful because we thought that we had done so much to protect our cohesion until we are shaken from our belief,” she said.“Our greatest fear is how such prejudice will affect our young and influence their minds. We wonder whether these are one-off incidents or reflective of a larger problem.\"Mdm Halimah called for deeper engagements about why cohesion is important and what it means to be a truly multiracial and multi-religious society.“We need this, as arguments such as the social media and the current pandemic as contributing factors, may mask the real issues,\" she said.\"In the meantime, let us start by being kinder to each other. We can control how we want to respond and do so in a constructive and meaningful way.”It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "racism,K Shanmugam,Halimah Yacob,racial harmony", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/racism-singapore-progress-in-racial-harmony-shanmugam-14986604", "Source": "google"}