{"Type": "", "Time": "2021-06-12", "Headline": "Japan clarifies no change in position, after PM Suga angers China by calling Taiwan a 'country', East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.TOKYO - There is \"no change\" in Japan's position towards Taiwan, top government spokesman Katsunobu Kato said on Friday (June 11), two days after Prime Minister Yoshihide Suga stoked China's fury by calling Taiwan a \"country\".Mr Kato told reporters that \"there is no change in Japan's basic position of maintaining a non-governmental, practical relationship with Taiwan\", in line with the 1972 Japan-China Communique.In what seems like an accidental slip-up, Mr Suga said at a nationally televised Diet debate on Wednesday that Australia, New Zealand and Taiwan are \"three countries that have imposed strong curbs on individual rights\" amid the Covid-19 crisis.The reference of Taiwan as a country (kuni or koku) goes against diplomatic tradition of referring to the island, which Beijing regards as a renegade breakaway province, as a region (chi-iki).Beijing has lodged stern representations with Tokyo. On Thursday, Chinese Foreign Minister spokesman Wang Wenbin deplored Japan for violating the spirit of the 1972 joint declaration issued when the two countries formalised relations.According to the communique, Japan recognises the People's Republic of China government in Beijing as the \"sole legal\" government of China. It also \"fully understands and respects\" that Taiwan is an \"inalienable part\" of Chinese territory.Mr Wang said that Mr Suga's statement not only \"broke Japan's solemn promise not to regard Taiwan as a country\", but also threatened to undermine the diplomatic foundation of Sino-Japan ties.These sensitivities come as Taiwan has become a political flashpoint amid Chinese muscle-flexing in regional waters. Fears are also rising among democratic nations of an expansion in communist influence, with the clampdown on freedoms in Hong Kong and China's vaccine diplomacy that is said to come with terms attached.Leaders of the Group of Seven (G-7) advanced economies, including Mr Suga, who are meeting in Britain this weekend, will likely write the Taiwan Strait into their communique, Japanese media have reported. They will also pledge to donate one billion doses of vaccines to developing countries.The first mention of Taiwan in a joint United States-Japan summit statement since 1969 came in April, when US President Joe Biden and Mr Suga cited the \"importance of peace and stability across the Taiwan Strait\".Japan has followed up with similar language in statements with the European Union and this week, at a meeting with Australian foreign and defence ministers.This month, Japan donated 1.24 million doses of AstraZeneca vaccine to Taiwan amid a surge in Covid-19 infections there, in a move that China has lambasted as \"political theatre\".Separately on Friday, Japan's Diet passed a resolution to urge the World Health Organisation to include Taiwan at its general meetings. Foreign Minister Toshimitsu Motegi said the \"region's\" experience in its Covid-19 fight makes its input invaluable to the global community.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/japan-clarifies-no-change-in-position-after-pm-suga-angers-china-by-calling-taiwan-a", "Source": "google"}