{"Type": "", "Time": "2021-06-12", "Headline": "Ex-students call out lecturer for offensive remarks in class, Latest Singapore News - The New Paper", "Text": "Former students of Ngee Ann Polytechnic engineering lecturer Tan Boon Lee have accused him of racially and religiously insensitive behaviour in the classroom.One of them, Ms Nurul Fatimah Iskandar, 22, said in an Instagram post on Wednesday that Mr Tan had initiated an offensive discussion about Islam during lesson time, when she was his student about four years ago.She told The Straits Times yesterday: \"He opened websites about Islam and explained why he didn't agree with certain Quranic verses.\"He then singled me out and tried to start a debate on the topic. It didn't help that I was the only Muslim student in class and I sat in the front row.\"Asked about Ms Nurul's allegations, Mr Tan declined to comment \"at the moment\" but said he remembers her as a former student.The polytechnic told The Straits Times last night that it was aware of the allegations against Mr Tan and deeply regrets Ms Nurul's experience.It added that it has a zero-tolerance approach to any form of misconduct by members of its community.\"Our staff members are expected to respect the cultural, ethnic and religious differences when interacting with students and other staff members,\" a spokesman for the poly said.Second Minister for Education Maliki Osman also addressed Ms Nurul's post, saying he was \"shocked and disappointed\" to hear about Mr Tan sharing his \"personal and derogatory views on Islam\".\"There is no place for any anti-ethnic and anti-religious remarks in our education institutions, and even more so from an educator,\" Dr Maliki said in a post on Facebook last night.Mr Tan, 60, is assisting the police with investigations after he was filmed making racist remarks to ice cream store owner Dave Parkash, 26, and his girlfriend Jacqueline Ho, 27, a user experience designer, in Orchard Road last Saturday night.The polytechnic has suspended him from teaching duties and is conducting an internal investigation after a video of the incident surfaced online on Sunday.In its statement last night, the polytechnic added that it would not hesitate to take disciplinary actions against Mr Tan, including dismissal, if appropriate.Ms Nurul, who is now an electrical engineering student at the National University of Singapore, said the incident involving Mr Tan happened in July 2017.She was a second-year electrical engineering student at the polytechnic at the time.Ms Nurul said it was tough for her to speak up against her lecturer as she was afraid her scholarship would be at stake if things went badly.Ms Nurul finally mustered the courage to send an e-mail to the school about what happened. She never got a response, she said.Since she put up the post about the incident on Instagram, Ms Nurul said more accounts about Mr Tan from other students have come to her attention.One Instagram user alleged that Mr Tan once made disparaging comments about Christianity in class, causing outrage among students.Another alleged that he had made her take off her hijab.National Institute of Education don Jason Tan said while it is important for teachers to be able to conduct discussions on difficult issues such as race and religion, they must do so with basic respect.\"The first step is for them to confront their own biases and prejudices,\" he said.\"What happens in classrooms shape students' values, attitudes and behaviours. \"Get The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/ex-students-call-out-lecturer-offensive-remarks-class", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}