{"Type": "Sport", "Time": "2021-06-12", "Headline": "Tennis: I'll remember this forever, says Djokovic after toppling Nadal in Paris", "Text": "PARIS: World number one Novak Djokovic said his win over Rafa Nadal in Friday's epic French Open semi-final was one of the top three matches he had played and he would remember it forever.The 34-year-old Serb lost the opening five games but hit back in magnificent fashion towin 3-6 6-3 7-6(4) 6-2in front of a raucous Court Philippe Chatrier crowd.He will now face Greek Stefanos Tsitsipas in Sunday's final, where he will seek a second French Open title and a 19th Grand Slam title in total - to move one behind the men's record haul held by Nadal and Roger Federer.\"Definitely the best match that I was part of at Roland Garros, and top three matches that I ever played in my entire career,\" Djokovic told reporters after inflicting only a third ever French Open defeat on 13-time champion Nadal.\"Considering the quality of tennis, playing my biggest rival on the court where he has had so much success and has been the dominant force in the last 15-plus years, and the atmosphere which was completely electric.\"One of these nights and matches you will remember forever.\"The omens did not look good for Djokovic when he went 5-0 down in the first set despite playing well. It had horrible similarities to last year's final which he lost to the Spaniard 6-0 6-2 7-5, only this time he wrenched back control.\"The beginning of the match was kind of resembling last year's final,\" Djokovic, who enjoyed loud support throughout the four-hour contest, said.\"I was not too nervous though even if I was 0-5 down because the feeling was different from last year's final, because I was just hitting the ball better and feeling better overall.\"I just kind of found my rhythm, found my groove. There was no looking back. Even though I lost the first set, I found my game. Things started to work out really nicely.\"FRESHEST GUYEven for a man of Djokovic's physical and mental resources, the emotions of Friday's win might leave a hangover and he will be fully aware that the last time he beat Nadal at the French Open in 2015, he ended up losing the final to Stan Wawrinka.\"I'm not the freshest guy right now obviously. But the good thing is that I have a day and a half to rejuvenate,\" he said.\"I'll enjoy this victory a little bit. I think I deserve after this big win to just relax a little bit without thinking about the next opponent, even though it's a Grand Slam final.\"Djokovic saved a set point at 5-6 in a pivotal third set full of spellbinding rallies before taking the tiebreak. He then reeled off the last six games of the match to take his record over career-long rival Nadal to 30-28.Incredibly, Djokovic is the first player in 116 matches to beat Nadal in best-of-five sets on clay after losing the opener.Asked what it meant to beat Nadal at a Grand Slam he has owned almost exclusively since 2005, Djokovic said it was difficult to put into words.\"I mean, he has been the most dominant player of the Roland Garros history. He lost two, now three times, in his entire career here,\" world number one Djokovic said.\"The amount of wins that he has made on this court isincredible. Each time you step on the court with him, youknow that you have to kind of climb Mount Everest to win.\"It's just one of these matches that I really will remember for a very long time, not just because I won the match but because of the atmosphere, the occasion was very special.\"(Reporting by Martyn Herman and Julien Pretot; Editing by Pritha Sarkar)It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "sports,Novak Djokovic,French Open,match,Rafa Nadal", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/french-open-djokovic-after-toppling-nadal-roland-garros-14998766", "Source": "google"}