{"Type": "", "Time": "2021-06-12", "Headline": "S'pore and Australia reaffirm ties, to work closer together on sustainability, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Singapore and Australia are looking to work closer together to enhance trade and investment in environmentally sustainable goods and services as well as drive down emissions in maritime operations, as part of deepening ties between the two countries.A new Green Economy Agreement and a public-private partnership to lower emissions in maritime shipping and port operations were part of discussions between Prime Minister Lee Hsien Loong and his Australian counterpart Scott Morrison yesterday.The two leaders met at the Istana and reaffirmed the excellent state of bilateral relations, the Ministry of Foreign Affairs (MFA) said in a statement.They also reaffirmed their shared commitment to strengthening the Singapore-Australia Comprehensive Strategic Partnership (CSP) agreement, which the two countries signed in 2015 to deepen cooperation. They noted the good progress made in the CSP over the past year, despite the challenges presented by Covid-19.The agreement's five pillars are economics and trade, defence and foreign affairs, science and innovation, people-to-people, and the digital economy, which was added as a fifth pillar last year. The MFA said both prime ministers agreed to keep the CSP forward-looking by furthering cooperation in emerging areas.By building upon a memorandum of understanding on low-cost emissions signed last year, both countries will be embarking on a public-private partnership on low-emission maritime and shipping, said MFA.A joint statement by the two prime ministers yesterday said that this partnership will start off with a combined initial contribution of up to A$30 million (S$30.8 million), and will see business and government in Australia and Singapore work together on low-emission fuels and technologies.\"The prime ministers also discussed exploring a broader partnership on a Green Economy Agreement to facilitate trade and investment in environmentally sustainable goods and services,\" MFA added.The ministry also said both countries will start discussions on a FinTech Bridge to enhance cooperation in fintech policy and regulation, which will build upon the high-level digital economy agreement that they made last year.This FinTech Bridge will look for opportunities for collaboration on joint innovation projects, as well as facilitate investments and new business opportunities in digital trade and financial services, said the two prime ministers.On the defence front, PM Lee said at a joint news conference with Mr Morrison that the Republic greatly appreciates Australia's generous support for the Singapore Armed Forces' training \"over many years, in many airbases and camps all over Australia\".A new memorandum of understanding (MOU) between the health ministries of the two countries was signed yesterday to enhance cooperation on healthcare and health technologies.The two countries have also agreed to ink an agreement on operational science and technology cooperation to develop and enhance capabilities for homeland security and law enforcement agencies to prevent crime and maintain law and order.An existing MOU between the Singapore Symphony Orchestra and Melbourne Symphony Orchestra will be renewed as well.Both leaders said that in an increasingly uncertain and complex strategic environment, Australia and Singapore are like-minded partners with a high degree of strategic trust. They agreed to increase the frequency and complexity of professional exchanges, dialogues and training activities between the two countries.The two leaders also discussed regional developments yesterday, and both said a strong, cohesive and responsive Asean is vital to the region's success and recovery.Agreeing that Asean could play an important role in facilitating a peaceful solution to the situation in Myanmar, PM Lee and Mr Morrison called for an immediate cessation of violence, the release of all political detainees there, including foreigners, and inclusive dialogue between all parties.Both prime ministers also reaffirmed their shared commitment to maintaining and promoting peace, security and stability in the region, as well as to the peaceful resolution of disputes, including full respect for legal and diplomatic processes, without resorting to the threat or use of force, in accordance with international law.They underlined Australia and Singapore's strong support for freedom of navigation, overflight and unimpeded trade in the South China Sea.\"They also emphasised the importance of non-militarisation of disputed features and self-restraint in the conduct of activities that would complicate or escalate disputes and affect peace and stability,\" said the joint statement.\"They urged all claimants to take meaningful steps to ease tensions and build trust, including through dialogue.\"Hariz BaharudinJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/spore-and-australia-reaffirm-ties-to-work-closer-together-on-sustainability", "Source": "google"}