{"Type": "Singapore", "Time": "2021-06-12", "Headline": "Singapore-Hong Kong air travel bubble remains on hold, to be reviewed in July", "Text": "SINGAPORE: TheSingapore-Hong Kong air travel bubblewill remain on hold even though the COVID-19 situation in Singapore has improved, the Ministry of Transport (MOT) said on Thursday (Jun 10).Authorities on both sides will review the situation in July before deciding on a launch date.The COVID-19 situation in Hong Kong has remained stable, with very few community cases in recent weeks, the ministry noted.“Both Singapore and Hong Kong remain strongly committed to launching the air travel bubble safely. We will continue to monitor the public health situation in both places closely,” MOT said.Both Singapore's Transport Minister S Iswaran and Hong Kong's Secretary for Commerce and Economic Development Edward Yau have maintained \"close contact\", the ministry said, adding that they agreed that both sides would review the situation in early July, before making a decision on the target launch dates of flights under the air travel bubble.“An update will be provided at that point,\" said MOT.The Singapore-Hong Kong air travel bubble was initially scheduled to be launched onNov 22last year, but it was deferred after a rise in COVID-19 cases in Hong Kong.A rescheduled launch planned forMay 26this year was also pushed back due to an increase in unlinked COVID-19 community cases in Singapore.Under the terms of the agreement, the travel bubble will be suspended for at least 14 days if the seven-day moving average of unlinked local COVID-19 cases a day, excluding dormitory resident cases in Singapore, is more than five in either Singapore or Hong Kong.During a press conference by the COVID-19 multi-ministry task force on Thursday, Health Minister Ong Ye Kung said he did not think that Singapore had met the criteria for the resumption of the air travel bubble.“And even if we crossed the criteria for resumption … we are in a very cautious state,” Mr Ong said in response to a question.“And so we probably don't want to rush. It’s important that at this state – embers are still there – we want to be quite cautious.\"Mr Ong said it is, however, important to “get conversations going”.“There's really … no harm, and in fact good, to continue to talk to our various partners, to see how we can restore our connections with the world safely. When the time is right,” Mr Ong said.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,Hong Kong,travel,aviation", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/singapore-hong-kong-air-travel-bubble-july-review-covid-19-14986574", "Source": "google"}