{"Type": "", "Time": "2021-06-12", "Headline": "Forum: Extend wage increases for cleaners to migrant workers, Forum News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.The Humanitarian Organisation for Migration Economics (Home) welcomes the news that cleaners who are Singaporeans and permanent residents will see wage increments under the Progressive Wage Model (Cleaners to see their wages increase over 6 years from 2023, June 8).However, as cleaning jobs are also performed by migrant workers, the move to increase the pay of cleaners must also include migrant workers, who are excluded from the Progressive Wage Model.In research that Home published last year regarding the working conditions of Bangladeshi conservancy workers, we stated that they earn gross monthly wages of between $500 and $800. We also found that they are severely overworked.Home spoke to more than 30 workers. Many reported working at least 12-hour shifts with little rest, and having to attend to unexpected calls at any time of the day or night.All the workers Home spoke to stated that they had no rest days at all. They also said it is not uncommon for a worker to be denied public holidays and annual leave for the period of their employment.The Covid-19 pandemic has increased their workload as work-from-home arrangements have generated more waste, and more intense and frequent cleaning is required to disinfect areas with higher footfall.While the Government encourages town councils to go beyond cost considerations in awarding bids to cleaning companies, town councils are still under pressure to be seen as fiscally prudent, and this results in contracts being awarded to companies that pay workers low wages.A cleaning company we interviewed said the low barriers to entry and competitive market conditions offer little incentive to pay workers more as companies are afraid of being priced out of the industry.All low-wage workers, regardless of nationality, should receive equal protection. It is important to include migrant cleaners in the Progressive Wage Model if we wish to deal with depressed wages and poor employment conditions in the sector.Responsible outsourcing can be mainstreamed only when wage inequalities and exploitative working conditions are tackled for all workers, and not just for a segment of them.When there is an underclass of migrants who are easy to exploit, companies are less willing to improve the wages, benefits and working conditions of its employees, local or foreign.Jaya Anil KumarHumanitarian Organisation for Migration EconomicsJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/opinion/forum/forum-extend-wage-increases-for-cleaners-to-migrant-workers", "Source": "google"}