{"Type": "", "Time": "2021-06-12", "Headline": "Covid self-test kits to be sold at some pharmacies from June 16: MOH, Latest Singapore News - The New Paper", "Text": "Covid-19 self-test kits will be sold by pharmacists at Guardian, Unity and Watsons pharmacies from next Wednesday, said the Ministry of Health (MOH) yesterday.Health Minister Ong Ye Kung, during an update by the multi-ministry task force on Covid-19, said: \"As we want to resume more activities, we need to make testing fast, easy and accessible.\"Sales will initially be limited to 10 antigen rapid test (ART) kits each person to ensure there are adequate supplies.They will be made available at more retail locations progressively.Singapore's director of medical services Kenneth Mak said: \"We will eventually allow test kits to be freely purchased as more ART test kit supplies are made available for retail sales.\"The ART kits produce results in less than 20 minutes, are simple to use and can be self-administered, MOH said.Associate Professor Mak said: \"The ART self-test kits complement our overall surveillance strategy.\"These fast and easy-to-use tests allow us to detect infected cases more quickly, in particular among individuals who do not have acute respiratory infection symptoms but are concerned that they may have been exposed to Covid-19.\"This might be for people who had been to a place that a confirmed case visited, for instance.The four self-test kits granted interim authorisation by the Health Sciences Authority for sale to the public are the Abbott PanBio Covid-19 Antigen Self-Test, the Quidel QuickVue At-Home OTC Covid-19 Test, the SD Biosensor Sars-CoV-2 Antigen Self-Test Nasal, and the SD Biosensor Standard Q Covid-19 Ag Home Test.Watsons Singapore will be retailing the Abbott and Quidel QuickVue test kits at all pharmacy stores in phase one of the test kit roll-out.\"We will be keeping with MOH's recommended guidelines on retail selling price, which will range from $10 to $13 per test kit,\" it said.MOH said: \"Individuals who have a positive result for their ART self-test should immediately approach a Swab And Send Home Public Health Preparedness Clinic for a confirmatory polymerase chain reaction (PCR) test. They are then required to self-isolate until they receive a negative PCR test result.\"Those who test negative on their self-test ART should still stay vigilant and adhere to prevailing safe management measures, MOH said.Individuals who have acute respiratory infection symptoms should visit a doctor for a full diagnosis and PCR test instead of relying on an ART self-test kit, it added.The Health Sciences Authority noted that ARTs have a lower sensitivity than PCR tests and a higher chance of false negative results.Get The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/covid-self-test-kits-be-sold-some-pharmacies-june-16-moh", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}