{"Type": "Singapore", "Time": "2021-06-12", "Headline": "Malaysian man arrested after spending more than 20 years on the run for smuggling illegal immigrants", "Text": "SINGAPORE: A 46-year-old man who had spent more than 20 years on the run for immigration offences he committed has been arrested, said the Corrupt Practices Investigation Bureau (CPIB) on Friday (Jun 11).Siva Kumar Ramachandram, who is Malaysian, was arrested by the CPIB with the help of the Malaysian Anti-Corruption Commission (MACC) on Mar 4 last year.On Sep 24, 1999, Siva was convicted and sentenced to five years' jail and 12 strokes of the cane for engaging in a conspiracy to smuggle illegal immigrants from Singapore into Malaysia through Woodlands Checkpoint.The conspiracy involved bribing a CISCO officer to allow buses ferrying the illegal immigrants to pass through the checkpoint without immigration clearance. The CISCO officer was convicted on Oct 5, 1999 and was sentenced to 12 months' jail and fined S$2,800 for corruption.Siva later absconded from Singapore sometime in 1999, while released on bail pending appeal of his conviction and sentence. An arrest warrant for him was issued on Mar 9, 2000, the date of his appeal hearing, which he failed to turn up for.CIPB investigations revealed that in October 1999, Siva left Singapore for Malaysia in the vehicle of an unknown individual known as \"Boy\".\"Boy\" had produced a passport belonging to someone else to the immigration officer at Woodlands Checkpoint. This led the immigration officer into believing Siva was someone else, thus allowing him to leave Singapore, said the authorities.He was arrested on Mar 4, 2020 and brought back to Singapore. Siva was charged on Apr 16 this year with offences punishable under the Immigration Act and the Penal Code.On Friday, he pleaded guilty and was sentenced to six months' jail with effect from the expiry of his existing five-year sentence meted out in 1999, said the bureau.\"The invaluable assistance and strong support by the MACC has resulted in Siva’s arrest on Mar 4, 2020.\"CPIB is grateful for the close collaboration with the MACC on this case to ensure that the offender was brought to justice and there was no escaping the long arm of the law,\" it said.The bureau said Singapore adopts a strict zero-tolerance approach towards corruption and other criminal activities.\"CPIB’s mandate is to investigate into any act of corruption in the public and private sectors in Singapore, and in the course of doing so, any other offences under any written law,\" it said.Anyone who is convicted of knowingly producing any false or misleading document under the Immigration Act can be sentenced to jail for up to two years and be fined up to S$6,000.Anyone who is convicted of failing to appear before a court of justice under the Penal Code can be sentenced to jail for up to six months and be fined up to S$5,000.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "CPIB,Singapore,Malaysia,crime,immigration", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/fugitive-20-years-immigration-crime-singapore-malaysia-14993840", "Source": "google"}