{"Type": "Singapore", "Time": "2021-06-12", "Headline": "12 investigated for illegal gambling, breaking COVID-19 rules at Bukit Panjang home", "Text": "SINGAPORE: Twelve people are being investigated for alleged illegal gambling activities and breaking of COVID-19 safe distancing rules at a home in Bukit Panjang, said the Singapore Police Force (SPF) on Friday (Jun 11).The suspects - seven men and five women - are aged between 21 and 70, the police said in a news release.Officers from Jurong Police Division conducted an operation at about 9pm on Thursday at a home along Gangsa Road. During the operation, they found the 12 purportedly gathering and engaging in gambling-related activities, said SPF.The suspects will be investigated for non-compliance of safe distancing measures. Under the current Phase 2 (Heightened Alert) restrictions, two distinct visitors per household are allowed daily.Among them, a 55-year-old woman and a 53-year-old man were arrested for allegedly using the unit as a common gaming house.Three other women and another man - aged 48 to 70 - are being investigated for gaming in a common gaming house.The police seized cash and gambling-related items, and investigations are ongoing.Anyone found guilty of using a place as a common gaming house may be fined S$5,000 to S$50,000 and jailed for up to three years.Suspects convicted of gaming in a common gaming house face a fine of up to S$5,000, up to six months' imprisonment or both.SPF said it takes \"a serious view against all forms of illegal gambling activities and will continue to take tough enforcement action\" against such lawbreakers.It also advised the public not to engage in illegal gambling and to comply with the prevailing safe distancing measures.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "SPF,gambling,crime", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/illegal-gambling-covid-19-gathering-bukit-panjang-gangsa-14994986", "Source": "google"}