{"Type": "", "Time": "2021-06-12", "Headline": "Lobster fisherman survives being swallowed WHOLE by humpback whale for 30 seconds | Daily Mail Online", "Text": "By Melissa Koenig For Dailymail.Com and Associated Press  Published:  21:03 BST, 11 June 2021   |  Updated:  01:22 BST, 12 June 2021    266View  commentsA lobster diver was swallowed whole by a hungry humpback whale - but lived to tell the tale because the creature didn't like how he tasted, and spat him back out.Michael Packard, 56, had been a commercial lobster diver out of Provincetown, Massachusetts for 40 years and was going on a routine lobster dive off the coast of Cape Cod last Friday morning when he said he 'felt a huge bump and everything went dark.'At first, he said he thought he had been attacked by a shark, but when he realized he did not feel any sharp teeth and was not in pain, he began to figure out what had happened.'I realized, oh my God, I'm in a whale's mouth ... and he's trying to swallow me,' Packard told WBZ-TV following the encounter. 'And I thought to myself OK, this is it - I'm finally - I'm gonna die.'Packard, who is an experienced diver, started to think about his wife and his 12 and 15 year old sons, and began to struggle inside the beast's mouth until, he said, he saw a light and the whale started shaking his head side-to side.'I just got thrown in the air and landed in the water,' Packard recounted to the CBS affiliate. 'I was free and I just floated there. I couldn't believe... I'm here to tell it.'   He estimates he was in the whale's mouth for about 30 seconds, but continued to breathe because he still had his breathing apparatus in. Michael Packard, 56, suffered only minor injuries after being trapped inside a humpback whale's mouth for roughly 30 seconds on Friday morning.Experts say being eaten by a humpback whale is extremely rare, with one suggesting the whale made a mistake when it sucked Packard in and quickly spat him out (file photo)Packard had been a lobster diver for 40 years at the time of the incident and was rescued by a crewmate who called authorities on the shorePackard took to Facebook following the incident to thank the Provincetown rescue squad for its 'caring and help'Packard was rescued by his crewmate Josiah Mayo who was aboard their boat 'The J n' J.'Mayo watched in shock as the water beside the boat erupted as the whale surfaced - and Packard flew out of the mammal's mouth. He plucked Packard out of the water, according to the Cape Cod Times, and used his radio to call authorities on the shore.The Provincetown Fire Department later confirmed that a call came in about a diver who had suffered serious injuries to his legs 'after interacting with a whale.'At first Packard said, he thought he had broken his legs in the incident, but doctors later told he he just had soft tissue damage and bruises, and he was released from a local hospital later that day. In a following Facebook post, Packard thanked the Provincetown rescue squad for its 'caring and help' He said that when he was stuck inside the whale's mouth his thoughts turned to his wife and his 12 and 15 year old sons Experts say it is extremely rare to be swallowed by a humpback whale, Peter Corkeron, a senior scientist at the New England Aquarium estimating there is a one in 1 trillion chance someone would be eaten by a whale.When a humpback feeds, he said,  'they do what we call gulp feeding, and they an open their mouths up incredibly widely,' which Jooke Robbins, the director of Humpback Whales Studies at the Center for Coastal Studies, said could limit their forward vision.'Based on what was described, this would have to be a mistake, and an accident on the part of the humpback,' Robbins concluded.'He was just unlucky enough to be in the wrong place at the wrong time,' Corkeron conceded.The humpback likely hoped it would get a mouthful of sand lance fish, which live in the waters off Cape Cod.Experts say whales are generally placid around humans, and show little aggression towards them.But they have warned divers to stay at least 100 feet away from the powerful animals at all times, because even an accidental brush with one can be very dangerous - as Packard discovered.  \n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group", "Section": "", "Writers": "", "URL": "https://www.dailymail.co.uk/news/article-9678057/Lobster-diver-injured-caught-whales-mouth.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}