{"Type": "", "Time": "2021-06-12", "Headline": "Duo to be charged for alleged roles in China officials impersonation scams, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Two men will be charged in court on Friday (June 11) for their alleged roles in a series of scams that cheated their victims of almost $1.6 million.The scams involved people calling and posing as police officers from China, said the Singapore Police Force on Thursday.Between July 18 and July 29, 2020, the Commercial Affairs Department received reports from five victims who had fallen prey to scammers pretending to be Chinese officials.Phone scammers claiming to be the Chinese police had accused the victims of being involved in transnational money-laundering crimes.The victims were believed to have been subsequently misled into handing over cash totalling $1,580,000 to various people in Singapore to prove that their money was not derived from illegal activities.The men, aged 46 and 48, are alleged to have been involved in the ruse as couriers, and received a combined $15,700 as commission.They are suspected of collecting $230,000 from three victims, which they handed over to unidentified people.The men got involved after responding to a job listing on Facebook promising $300 for courier work.They were then added into a WhatsApp chat where they received instructions to collect money from the victims.They surrendered their commission money over to the police during investigations.The pair were caught after the police received reports from the victims.The duo will be charged with assisting another to retain benefits from criminal conduct, which carries a penalty of 10 years in jail and/or a fine of up to $500,000.The police advise members of the public to take the following precautions when they receive unsolicited calls asking them to part with their money:1. Ignore the calls and the caller's instructions.2. Understand that no local government agency will demand payment through a phone call or social messaging platforms, or demand that they hand over cash to strangers, or ask for personal banking information.3. If they are not Singaporean, check with their embassy or high commission to verify the call.4. Call a friend or relative before making any decisions.\"Do not be pressured by the caller to act impulsively,\" added the police.The police also said that the public should not collect money for strangers, especially if they are claiming to be law enforcement officers.\"Such callers are likely to be scammers, and the members of the public who act on their instructions may unwittingly have committed a crime by assisting to launder money from criminal activities,\" they added.If they have information related to these scams, or if they have any doubts, the public can call 1800-255-0000 or submit it online at www.police.gov.sg/iwitness, said the police.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/duo-to-be-charged-on-friday-for-alleged-roles-in-china-officials-impersonation-scams", "Source": "google"}