{"Type": "", "Time": "2021-06-12", "Headline": "Issues raised in bus drivers' suit against SBS Transit would affect larger class of workers: High Court, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Lawsuits brought by 13 bus drivers against transport operator SBS Transit over overtime pay involve important questions of law that would affect a larger class of workers in Singapore, a High Court judge said.The workers claim in their suits, filed in 2019 and 2020, that they had been made to work without a rest day each week, and were also underpaid for overtime work.In a written judgment allowing the case to be transferred to the High Court, Justice Audrey Lim on Thursday (June 10) noted that the Employment Act provides for mandated rest days and limits to hours of work to protect the rights of employees.\"The question of whether this can be 'overridden' in a case where an employee is deemed to provide essential services... is important, as it affects a larger population of workers in general and not just the immediate plaintiff or parties to the case,\" Justice Lim said.A provision in the Act allows an employer to require employees in essential services to work in excess of the prescribed limit of hours or to work on a rest day.The questions thus involve the interpretation of provisions in the Employment Act relating to whether a rest day can be scheduled such that an employee can be made to work for 12 consecutive days over a 14-day period, and whether bus drivers fall within the definition of employees providing \"essential services\".Justice Lim said there would be potential ramifications on how such employment contracts are structured in terms of granting days off, computing overtime pay and determining work hours.On Sept 20, 2019, five bus drivers each filed a magistrate's court suit against SBS Transit. Subsequently, eight others filed similar suits against SBS.All 13 plaintiffs are represented by lawyer M. Ravi.Last year, the parties agreed for the suit relating to one plaintiff to be heard as a test case, to save time and money.This means the court's decision and findings on Mr Chua Qwong Meng's suit will be binding on all the plaintiffs.Mr Chua claims that SBS had breached the terms of his employment contract, which commenced on April 3, 2017, and the Employment Act.He alleged that SBS failed to give him a rest day each week.He also alleged that he was underpaid for overtime work - which includes working on a rest day, for working beyond the prescribed hours and for working on a public holiday.SBS, which is represented by Senior Counsel Davinder Singh, denies his claims.It asserts that it has complied with its contractual obligations and the laws, rules or regulations pertaining to working hours, overtime pay and rest days.In particular, the law provides that an employee providing \"essential services\" may be required to exceed the prescribed work hours, and to work on a rest day.In March, Mr Chua filed an application to transfer the test case from the magistrate's court to the High Court.Mr Ravi argued that the case should be transferred to the High Court, as it involves an important question of law that has the potential to affect all classes of employees in Singapore. Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/issues-raised-in-bus-drivers-suit-against-sbs-transit-would-affect-larger", "Source": "google"}