{"Type": "", "Time": "2021-06-12", "Headline": "China Port Delays Snarl Supply Chains as Ships Skip Singapore - Bloomberg", "Text": "Supply Lines is a daily newsletter that tracks trade and supply chains disrupted by the pandemic. Sign up here.Delays from congestion at southern Chinese ports triggered by fresh Covid-19 outbreaks are rippling through global supply chains, threatening to inflate costs and exacerbate disruptions.A cargo vessel operated by Cosco Shipping Lines Co. will skip a scheduled port stop in Singapore this month because of delays in China, according to alliance partner Ocean Network Express Holdings Ltd. One of CMA CGM’s vessels heading to China in July will also not call at the Southeast Asia trans-shipment hub.“The delays have already resulted in pressurizing soaring shipping prices within China due to a lack of containers and increased export demand,” said Josh Brazil, vice president of marketing at project44, a supply-chain intelligence firm. “These high shipping costs are just one factor that may contribute to an additional looming threat to global inflation.”Ship waiting times in Singapore are up from a year earlierSource: project44A virus outbreak at Yantian in Shenzhen has already inflated spot freight rates globally, with Drewry’s World Container Index increasing 10% in the past three weeks, said Simon Heaney, senior manager of container research at Drewry Shipping Consultants Ltd.“It feels inevitable that rates will climb higher as we head into the third-quarter peak season,” he said. “Both importers and exporters will suffer if delays and waiting times extend.”The disruption is causing further pain for global shippers already struggling with interruptions to supply chains from the pandemic, and the Ever Given’s grounding in the Suez Canal earlier this year. Trans-shipment dwell times in Singapore are at about eight to nine days now, up from roughly five days a year ago, according to estimates from project44.Vessel schedules and carrier service levels have been disrupted by delays at Yantian port, and congestion has spilled over to the nearby Shekou and Nansha terminals, PSA Singapore said in an emailed response to queries. “We expect vessel arrivals in Singapore to be affected as well.”However, container vessels calling at PSA Singapore’s terminal aren’t facing longer wait times as a result of the delays in Yantian yet, the container operator said.", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-11/china-port-delays-snarl-supply-chains-as-ships-skip-singapore", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}