{"Type": "", "Time": "2021-06-12", "Headline": "S'pore firm under probe for illegal mask manufacturing, repackaging , Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A local company is being investigated for manufacturing surgical masks here without a licence, the Health Sciences Authority (HSA) said on Friday (June 11).This is the first time a firm is suspected of that action.The manufacturing was observed taking place in an unhygienic and makeshift environment at Vision Empire International's facility in Ubi Crescent, with the masks placed in carton boxes and left out in the open.A total of 33 cartons, each containing about 2,500 masks, were seized.Under the Health Products Act, firms are required to have a licence from HSA to manufacture surgical masks.Vision Empire International was also suspected to have imported surgical masks from overseas before repackaging, rebranding and reselling them without having a licence to do so.Both manufactured and repackaged masks were sold under the brand Vision Empire Healthcare.They were sold on local e-commerce platforms for between $10 and $22 per box of 50 masks, according to preliminary investigations.Consumers who have made purchases are advised to stop using them immediately, HSA said.\nBoth manufactured and repackaged masks were sold under the brand Vision Empire Healthcare. PHOTO: HEALTH SCIENCES AUTHORITY \nIt added that these listings have been removed with the assistance of the platform administrators, and Vision Empire International has been directed to recall the products. Investigations are ongoing, the authority said.Manufacturers and repackers of surgical masks are licensed by HSA to ensure good quality and safety for use.\nThe manufacturing was observed taking place in an unhygienic and makeshift environment, with the produced masks placed in carton boxes and left out in the open. PHOTO: HEALTH SCIENCES AUTHORITY \n\nThe manufacturing was observed taking place in an unhygienic and makeshift environment at Vision Empire International's facility in Ubi Crescent. PHOTO: HEALTH SCIENCES AUTHORITY \nIn its release, the authority said surgical masks from unlicensed facilities have not been verified to meet the standards of quality, filtration capability and breathability.\"Sub-standard masks may not provide the desirable level of protection to the wearer,\" it added, noting that masks made, repackaged and/or stored in unsanitary conditions could be contaminated.\"Wearing such masks may increase the users' risk of developing skin irritation, respiratory symptoms or infections,\" HSA said.It will take strong enforcement action against those who illegally manufacture and/or supply masks.Those who do so could be prosecuted and, if convicted, jailed for up to two years or fined up to $50,000, or both.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/singapore-firm-investigated-for-illegal-surgical-mask-manufacturing", "Source": "google"}