{"Type": "", "Time": "2021-06-12", "Headline": "World Dream Resumes 50% Passenger Capacity From June 14 Onward - Cruise Industry News | Cruise News", "Text": "Following the latest announcement from the Singapore government, Dream Cruises is pleased to announce that effective from June 14, 2021, the World Dream will resume operating at the permitted 50 percent passenger capacity where guests from different households may now enjoy the option of traveling in a group size of up to five.Additionally, from June 21 onwards, guests may indulge in a feast for the palates and eyes where they may explore and enjoy dining in at over 35 F&B concepts around the ship including Asian, international and Halal-certified cuisine and enjoy additional live performances including singing, magic shows and ballroom dancing by our international performers.With the well-being of its guests and crew its number one priority, Dream Cruises maintains the highest standards in safety with comprehensive precautionary measures in place. Since the restart of cruise operations in November 2020, World Dream has enjoyed over seven months of COVID-19 incident-free sailings in Singapore and has received tremendous positive feedback on social media from guests on their experiences onboard the ship.“Dream Cruises would like to thank the people of Singapore who have continued to support World Dream even during this period of stricter health guidelines and safety precautions. Despite the heightened health measures of the previous month, World Dream has enjoyed robust sales in June and we are seeing limited availability of cruises in July,” said Michael Goh, president of Dream Cruises. “With the diligence of our crew to provide the safest environment for our guests onboard, World Dream has extended its proven track record as a worry-free vacation option for Singaporeans.”“Not only are we excited to welcome a higher capacity of guests up to 50% aboard World Dream for a Super Summer Seacation, we are also excited to introduce our unique Japanese-themed cruise experience from June 20 until Sept. 18. This includes the world’s first lavender fields of Hokkaido and Torii gates of Kyoto at sea, complemented by a variety of fun-filled Japanese-related activities and cuisine - ideal for vacationers and families, especially during the present school holidays,” he added.As part of the unique Japanese themed cruises on World Dream from June 20 to Sept. 18, guests can begin their wonderful journey aboard by strolling through the stunning and breathtaking torii tunnel surrounded by pink sakura trees, as well as a dreamy lavender field specially created and inspired by popular destinations like Hokkaido in Japan. Guests will also be able to enjoy all things Japanese, including Lavender sachet and crepe paper making workshops, relaxing with a Lavender Spa treatment or personally experiencing traditional Geisha culture from make-up demonstrations to hair ornament tutorials, Japanese parasol dance classes, as well as favorite and popular Japanese cuisine and so much more.“We had launched a series of successful thematic cruises centered around the Asia Pacific starting with the Rhythm of Korea and Amazing Thailandthematic cruises; and soon guests can discover the Wonders of Japan on World Dream. Guests can look forward to more amazing and global thematic cruises towards year-end including the Markets of the World and Nordic Christmas thematic sailings later this year,” noted Goh. Get the latest breaking cruise news. Sign up.101 Ships | 209,402 Berths | $61 Billion | ViewHighlights:Market Overview40+ New Ships2021-2027First to RecoverNew PlayersFull CoverageOrder TodayHighlights:Entire IndustrySupply DataAll Companies400 PagesDigital Access2027 OutlookOrder Today", "Section": "", "Writers": "", "URL": "https://www.cruiseindustrynews.com/cruise-news/25204-world-dream-resumes-50-passenger-capacity-from-june-14-onward.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}