{"Type": "Singapore", "Time": "2021-06-12", "Headline": "Melvin Yong elected CASE president, succeeding Lim Biow Chuan", "Text": "SINGAPORE: Member of Parliament (MP) Melvin Yong has been elected president of the Consumer Association of Singapore (CASE), the association said on Friday (Jun 11).Mr Yong, who is MP for the Radin Mas Single Member Constituency, succeeds Mr Lim Biow Chuan, who had helmed CASE since 2012.In a media release, CASE executive director Lee Siow Hwee said Mr Yong was elected at its 48th annual general meeting on Friday, where the new central committee was also elected or appointed into office.Mr Yong, 49, is assistant secretary-general of the National Trades Union Congress (NTUC) and executive secretary of the National Transport Workers' Union (NTWU).He was first elected to the CASE central committee in June 2018 and was appointed the role of vice-president in November 2019.As chairperson of CASE’s Consumer Empowerment Taskforce, he oversaw two projects that \"empower consumers to make informed purchasing decisions\".One of the projects, the Price Kaki app, gives consumers easy access to in-store retail prices and promotions of common household items, groceries, and hawker food, according to CASE. Since its launch in September 2019, it has been downloaded more than 72,000 times.The other project is Fuel Kaki, a website that gives consumers access to timely information on pump prices and promotions for effective comparison, said CASE. Since its launch in January 2020, there have been an average of 25,000 visitors a month to the website.Outgoing president Mr Lim was first elected CASE president on Jun 23, 2012. He served as vice-president from 2006 to 2012.\"Under Mr Lim’s leadership, CASE took firm and decisive steps to protect consumers by publicising and flagging out errant businesses and unfair practices to warn and alert consumers,\" said the association.Since 2012, it has issued several advisories against businesses in the beauty, motorcar, home renovation and furniture industries, \"where consumers tend to purchase big-ticket items\".CASE also went after \"recalcitrant\" businesses and signed voluntary compliance agreements with 22 businesses who undertook to cease their unfair practices and compensate affected consumers, it added.During Mr Lim’s tenure, CASE said it obtained injunctions against firms engaging in unfair practices and worked closely with the Competition and Consumer Commission of Singapore to protect consumers.Mr Lim led CASE’s efforts to promote fair trading and ethical business practices among businesses and industries to boost consumer confidence, the association added. Through its arm CaseTrust, CASE has launched joint accreditation schemes with industry associations, with 771 entities accredited as at May 31.Mr Lim also worked with the Ministry of Trade and Industry to advocate for the enactment of the Lemon Law provisions under the Consumer Protection (Fair Trading) Act before it took effect in September 2012, with CASE holding outreach events to educate consumers and businesses on the law.Mr Yong thanked Mr Lim and the outgoing central committee members for their contributions.He said: \"As CASE commemorates its 50th anniversary this year, it is timely that we take stock of our achievements and consider how we can continue to be relevant and respond to the needs of consumers.\"I will work closely with the new central committee, management and staff to look into how we can better protect and empower consumers in this new digital age.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Consumer Association of Singapore", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/mp-melvin-yong-elected-case-president-lim-biow-chuan-14993682", "Source": "google"}