{"Type": "", "Time": "2021-06-12", "Headline": "Cyclist who punched lorry driver along Jalan Eunos fined $5,600", "Text": "SINGAPORE — A cyclist who punched a lorry driver after the latter confronted him with a flask on the road was fined $5,600 on Thursday (10 June).Jeffery Todd Martin, a 57-year-old Canadian, was caught in a widely shared video punching lorry driver Zhang Ping, who fell along Jalan Eunos.Martin pleaded guilty to one count of causing hurt to Zhang, a 34-year-old Chinese national, and one count of riding his bicycle in a disorderly manner without regard to safety of others.Zhang was dealt with separately, according to court documents, which did not state his punishment.Martin, a Singapore permanent resident, was cycling ahead of Zhang on the extreme left lane along Jalan Eunos on 24 February 2019. Zhang caught up with Martin and overtook him from the right.At about 10.23am, as Zhang was passing Jalan Awang, Martin overtook him from the right side and cut in front. Martin turned around and pointed at Zhang as he overtook him. He continued cycling directly in front of Zhang and stopped in the middle of the lane. This forced Zhang to stop his lorry despite the moving traffic.Martin alighted from his bicycle as Zhang turned his lorry right. He hit Zhang’s driver window and shouted vulgarities.The Canadian also shouted at Zhang through the passenger window, prompting Zhang to make a sharp left turn with his lorry towards Martin. The latter picked up his bicycle and took a few steps backwards to avoid the lorry.Martin placed his bicycle at a nearby grass patch while Zhang alighted from his lorry and followed Martin with an orange water flask in hand. Zhang stood in front of Martin and gesticulated in the direction of his lorry, but without warning, Martin punched the right side of Zhang’s mouth.The force caused Zhang to fall backwards on the road of Jalan Eunos. Martin then retrieved his bicycle and continued cycling along Jalan Eunos in the direction of Still Road.A resident living in the vicinity attended to Zhang, who moved to sit on the pavement as he felt dizzy. Zhang was later found to have superficial facial lacerations. His medical expenses cost $126, which Zhang’s employer bore. Martin paid full compensation to Zhang’s employer on 21 April.The acts were captured on Zhang’s in-car camera and by an eyewitness who recorded a video.Martin had previously fractured his collarbone in a previous incident and thus felt aggrieved when Zhang drove close to him, said Martin’s lawyer Suppiah Thangaveloo. The lawyer highlighted three instances when Zhang came close to hitting Martin, including when Zhang reversed against Martin, and his sudden swing to the left.Thangaveloo pointed out that his client did not actually confront Zhang any further and took his bicycle to walk off, but Zhang confronted him with a flask. Martin reacted instinctively with a punch before moving off, said the lawyer, who asked for a fine of between $3,000 and $4,000.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeOther Singapore stories:Validity of overseas Malaysians’ passports expiring in 2021 extended by 2 years for freeTwo of four new COVID cases in Singapore are in communityPet shop manager who fought with SDA fined, SDA's case pendingChina's quick rollout of a law against foreign sanctions has left European and American companies shocked and facing \"irreconcilable\" compliance issues, two top business groups said Friday, despite Beijing saying the move would unlikely impact investment.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Hæv uden gebyrer med Bank Norwegian-kortet, og vælg selv mellem CashPoints eller cashback. Læs mere her.Beijing has repeated an offer to vaccinate people from Taiwan against Covid-19, as the coronavirus continues to spread on the island. The Taiwan Affairs Office, Beijing’s main body for cross-strait affairs, on Friday said that Taiwanese who fly to mainland China can voluntarily receive Covid-19 shots as long as they meet vaccination requirements and follow outbreak control measures. “[We] urge the authorities to earnestly listen to the voices of the people on the island and remove the man-made oA Hong Kong court has barred media tycoon Jimmy Lai Chee-ying and his companies from challenging the legality of the search warrants executed in a series of raids at his offices last year and refused their applications for an injunction against the police chief. The nine plaintiffs first filed a series of private legal actions against the commissioner of police last year to recover some materials seized by officers during investigations into allegations of fraud and national security law violatiION Orchard will be closed to the public from Saturday (12 June) for four days and reopen on 16 June after three cases working at the mall were found to have COVID-19 infection.Book en prøvetur og oplev Ceed Plug-in Hybrid med plads til hele familien. Kør lydløst rundt på strøm i dagligdagen og mærk begejstringenDemocrats erupted in outrage Friday over news that Donald Trump's Justice Department secretly surveilled lawmakers probing possible collusion with Russia, reaping the phone records of top political foes in what they called an unprecedented abuse of power.China’s rocket force has conducted firing exercises involving “carrier killer” DF-26 ballistic missiles. A missile brigade under the People’s Liberation Army Rocket Force recently held launch practice in an unspecified training field at night to improve its combat ability, China National Radio reported on Tuesday. In the exercise, the brigade practised the fast transfer of missiles to another location to launch a second wave of missiles, a drill to train the brigade’s fast-response capabilities,Turns out the comic books were wrong.En elektrisk tandbørste med kunstig intelligens? Oral-B har gjort din eltandbørste endnu smartere - og din tandbørstning sjovere.Agnes Chow hails from a generation of Hong Kong democracy activists who cut their teeth in politics as teenagers and are now being steadily silenced by China.A top official from the Chinese county that hosted a fatal ultramarathon last month has been found dead, authorities said Friday, as 27 people face punishment over the incident.President Vladimir Putin on Friday denied a US media report that Russia is set to deliver an advanced satellite system to Iran that will vastly improve its spying capabilities.Bedste sikkerhed i klassen. A+ forbrug 19,2 km/l, 117-118 g/km co2. Prisen gælder indregistrering senest 30/06/2021.Singapore will begin slowly easing a month-long partial lockdown from next week after the curbs succeeded in stemming a coronavirus outbreak, authorities said Thursday.A secret society member who brutally assaulted a police officer and caused him to suffer a traumatic brain injury with help from his twin brother was jailed for two years, nine months and four weeks on Friday (11 June).China on Thursday passed a new law to counter foreign sanctions, as it looks to build its defences against rising US and EU pressure over trade and human rights.*Tilbuddet gælder til og med søndag den 13. juni 2021. Gælder ikke deodoranter, i forvejen nedsatte varer, fast lav pris og gaveæsker.South Korea's youngest MP apologised Thursday after she provoked fury among BTS fans by using pictures of tattooed singer Jungkook to promote her campaign to liberalise the country's restrictive laws on inking.Lawyers for Huawei Technologies Co. executive Meng Wanzhou are seeking a publication ban on new evidence obtained from HSBC bank that they think will boost her Canadian court battle against extradition to the United States. They believe the material supports her claim that she is the victim of an abuse of process and she should be released, although the exact nature of the evidence has not been described. Her lawyer, Richard Peck, previously said the material, obtained as a result of a recent HoSecond Minister for Education Maliki Osman has taken to Facebook to express his shock and disappointment at alleged Islamophobic remarks made by a Ngee Ann Polytechnic (NP) lecturer.Sådan investeres i aktier på 5 minutter via din telefon.The Ministry of Health (MOH) on Thursday (10 June) confirmed 13 new COVID-19 cases in Singapore, bringing the country's total case count to 62,236.China’s nuclear arsenal is a growing threat to US security, less in its absolute size than in the growing risk of a mishap as Washington and Beijing butt heads over Taiwan and many other issues, experts told a US Congressional commission on Thursday. “Have the risks changed? Yes, it’s a more competitive US-China relationship, and the chances of a conflict over Taiwan – while I don’t believe they’re high right now, they certainly have increased,” said Phillip Saunders, director of the Centre forBlaming \"misogynistic perverts in sport and their boot lickers\", dual Olympic silver medallist Maddie Groves has pulled out of Australia's swimming trials for the Tokyo Games.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/cyclist-punched-lorry-driver-jalan-eunos-fined-101245415.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}