{"Type": "", "Time": "2021-06-12", "Headline": "Japanese PM Suga refers to Taiwan as country, China hits back", "Text": "Tokyo [Japan], June 11 (ANI): Japanese Prime Minister Yoshihide Suga referred to Taiwan as a country, drawing a sharp reaction from Beijing which regards the self-ruled island as its 'inalienable part'.In his first one-on-one parliamentary debate with opposition leaders Wednesday, Suga, naming Australia, New Zealand and Taiwan, said, \"Such three countries have been imposing strong restrictions on privacy rights\" to curb the novel coronavirus outbreak, Kyodo News reported.Self-governed Taiwan is usually called a \"region\" in Japan.Beijing claims full sovereignty over Taiwan, a democracy of almost 24 million people located off the southeastern coast of mainland China, despite the fact that the two sides have been governed separately for more than seven decades.Taipei, on the other hand, has countered the Chinese aggression by increasing strategic ties with democracies including the US, which has been repeatedly opposed by Beijing. China has threatened that \"Taiwan's independence\" means war.Suga's reference came as Tokyo and Beijing have already been at odds over several issues, including a territorial dispute in the East China Sea and the crackdown on Hong Kong.\"China expresses strong dissatisfaction with Japan's erroneous remarks and has lodged a solemn protest against Japan,\" Foreign Ministry spokesman Wang Wenbin told reporters in Beijing on Thursday.\"There is only one China in the world,\" Wang said, urging Japan to become more cautious in words and deeds on Taiwan affairs and to avoid sending wrong signals to the island's independence forces.Suga's government has been strengthening its commitment to democratic Taiwan. Recently, Japan donated over 1.2 million COVID-19 doses to Taiwan, as the island faces a spike in COVID-19 cases.China has also lambasted Japan for donating vaccines, labelling such a move as a \"political performance\".At his summit in Washington in April, Suga with US President Joe Biden acknowledged \"the importance of peace and stability across the Taiwan Strait.\" It marked the first time in 52 years that Japanese and U.S. leaders have mentioned Taiwan in a joint statement. (ANI)Kolkata, Jun 10 (PTI) A day after actor-MP Nusrat Jahan claimed that her marriage in Turkey with businessman Nikhil Jain in 2019 is not valid under Indian laws, her estranged husband alleged that she had avoided always his requests to get the marriage registered.The fact that the Congress doesn’t have an ideology that binds its organisation together has made matters worse.Oplev den storsælgende Niro og kør på strøm til hverdagIslamabad [Pakistan], June 11 (ANI): United States, China along with several other countries have declined to accept mangoes that Pakistan had dispatched to heads of over 32 countries as part of its \"Mango diplomacy\" initiative.New Delhi [India], June 11 (ANI): A group of public health experts, including doctors from AIIMS and members from the national task force on COVID-19, has recommended that there is no need to vaccinate people who had documented COVID-19 infection and underlined that mass, indiscriminate, and incomplete vaccination can also trigger the emergence of mutant strains.Earlier in the day, the BJP staged a protest in the islands seeking action against Sulthana who hails from Chetiath island in Lakshadweep.Få flere penge i hverdagen ved at samle din gæld. Indsend en ansøgning her og få et tilbud. Indfri lånet når du ønsker det.The traditional Hindu red dot on the forehead was seen on several pet dogs, who were melting the hearts of many viewers.Adhikari said that he is willing to work jointly with the State government as a Leader of the OppositionThe picture went viral in 2016 as well with the same claim that the MLA’s car was displaying the flag of Pakistan.En elektrisk tandbørste med kunstig intelligens? Oral-B har gjort din eltandbørste endnu smartere - og din tandbørstning sjovere.Given the variety of options, choosing the right phone for under Rs 50,000 this month is going to be a lot tougher for buyers.The two Delhi police constables have been asked to respond to the notice within 15 days.Malda (West Bengal) [India], June 11 (ANI): The Chinese national who was intercepted by security forces in West Bengal's Malda district had taken around 1,300 Indian SIMs to China using fake documents, said Border Security Force (BSF) on Friday.Bedste sikkerhed i klassen. A+ forbrug 19,2 km/l, 117-118 g/km co2. Prisen gælder indregistrering senest 30/06/2021.Mukul Roy also hinted at the return of other TMC-turncoats into the party.As per sources, Prashant Kishor will be meeting every leader who extended their support to Mamata Banerjee and MK Stalin.OnePlus Nord CE 5G is equipped with a 4,500 mAh battery that comes with support for 30T Plus Ultra-fast Warp charge technology.Folk født 1930-1980 søges til betalte spørgeundersNew Delhi [India], June 11 (ANI): The Southwest monsoon advanced further into parts of north Arabian Sea, Gujarat, Madhya Pradesh and Chhattisgarh, the India Meteorological Department (IMD) said on Friday.The senior citizen has claimed that metal objects are easily getting stuck on his body parts after taking the second dose of the COVID vaccine.The study further found that the desirable herd immunity which can break the chain of virus, can only be achieved by mass vaccination and not through the natural course of transmission of infection.Der findes alternativer til at betale negative renter. Vi guider dig til tre investeringsmuligheder, så du kan investere dig fra negative renter.Pakistan may end up enjoying ‘strategic space’ in Afghanistan — a potential return to the pre-9/11 situation.Despite new laws to combat the problem, a rape is reported every 15 minutes, leaving victims and families crying out for justice An activist holds a cut-out of India’s prime minister, Narendra Modi, at a protest over another gang-rape and murder of a young woman in Uttar Pradesh state last year. Photograph: Indranil Mukherjee/AFP/Getty It was a historic day for women in India. Mamata Banerjee and her party won a spectacular election victory in West Bengal, defeating the Hindu nationalist BharatiMumbai (Maharashtra) [India], June 10 (ANI): Maharashtra government on Thursday announced compensation of 5 lakh to the kin of the deceased in the collapse of a residential structure in New Collector compound, Malad West of Mumbai late on Wednesday night.", "Section": "", "Writers": "", "URL": "https://in.news.yahoo.com/japanese-pm-suga-refers-taiwan-004026955.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}