{"Type": "", "Time": "2021-06-12", "Headline": "Diver SWALLOWED by humpback whale and lives to tell the tale – ‘Completely inside’ | Weird | News | Express.co.uk", "Text": "When you subscribe we will use the information you provide to send you these newsletters. Sometimes they'll include recommendations for other related newsletters or services we offer. Our Privacy Notice explains more about how we use your data, and your rights. You can unsubscribe at any time.Michael Packard, 56, was on his second dive of the day looking for lobsters in Cape Code, a peninsula in the US state of Massachusetts, on the southeast coast. His vessel “Ja’n J” was sitting just off popular Herring Cove Beach - alongside a fleet of other boats fishing for striped bass.The method behind commercial lobster diving is collecting lobsters from the sandy bottom.And, 45ft (14 metres) deep, is where the father-of-two had his terrifying encounter with the humpback whale.He told Cape Cod Times: “All of a sudden, I felt this huge shove and the next thing I knew it was completely black.“I could sense I was moving, and I could feel the whale squeezing with the muscles in his mouth.”  At first, Mr Packard thought he had been swallowed by a great white shark.But he could not feel any teeth and did not notice any serious injuries.It was then that he realised he was inside a whale.He added: “I was completely inside; it was completely black. I thought to myself, ‘there’s no way I’m getting out of here. I’m done, I’m dead.’“All I could think of was my boys — they’re 12 and 15 years old.”READ MORE: Dog killed by swan in violent attack at local park  According to Mr Packard’s calculations, he spent 30 to 40 seconds inside the animal before it surfaced.The diver said: “I saw light, and he started throwing his head side to side, and the next thing I knew I was outside (in the water).”Mr Packard, who lives in Welfleet, was taken to Cape Cod Hospital in Hyannis.He was discharged on Friday with what he described as “a lot of soft tissue damage” but no broken bones.Despite the scare, Mr Packard intends to return to work as soon as he recovers.DON'T MISSNoise complaint silences church bells for first time in 110 years [UPDATE]UK weather: Heatwave is forecast for weekend as Euro 2020 kicks off [REVEAL]Boris urged not to delay unlocking restrictions on June 21 [INSIGHT] See today's front and back pages, download the newspaper, order back issues and use the historic Daily Express newspaper archive.", "Section": "", "Writers": "", "URL": "https://www.express.co.uk/news/weird/1448820/Diver-swallowed-humpback-whale-freak-accidents-lobster-cape-cod-ont", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}