{"Type": "", "Time": "2021-06-12", "Headline": "Neighbour saves unconscious man from fire in Bukit Batok flat, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE (THE NEW PAPER) - He was playing with his two children on Thursday morning (June 10) when the smell of burning filled the air.When he looked out of his Bukit Batok flat and saw smoke emanating from a neighbour's unit upstairs, Mr Muhammad Nasiruddin Md Khalid rushed over with his wife to help.Mr Nasiruddin, 32, told The New Paper he saw a man lying on the floor.He knocked on the window and door, hoping to wake the man while his wife ran to get a fire extinguisher from their house.When the flat's owner, Madam Tan Kim Keok, 74, returned from shopping and unlocked the front door, Mr Nasiruddin said he charged in with a wet cloth covering his nose and mouth, and dragged the unconscious tenant out.\"There was a lot of thick black smoke, so I pulled him out to the common corridor and tried to wake him up. He did but he was in a blur state.\"A spokesman for the Singapore Civil Defence Force (SCDF) said it was alerted to a fire at Block 283 Bukit Batok East Avenue 3 at 9.25am on Thursday.The spokesman said: \"The fire involved the contents of a bedroom in a unit on the seventh storey. Members of the public extinguished the fire using buckets of water prior to SCDF's arrival.\"Mr Nasiruddin and the 37-year-old tenant were conscious when taken to hospital.The cause of the fire is still under investigation, said SCDF.A police spokesman said investigations are ongoing.Mr Nasiruddin, a security officer, said being trained in firefighting and first-aid administration helped him stay calm during the incident.He added: \"Of course, my safety is important but under that situation, the right thing... was to save the man.\"Mr Raymond Seetoh, Madam Tan's son, said they are still evaluating the damages, including the burnt bedroom and scorched walls in the living room.Mr Seetoh, 44, said his mother is still in shock from the incident and would be staying with him for now.He added that he was grateful for his neighbours' help.\"Not many would have acted as bravely as (Mr Nasiruddin) did. I think that man deserves a medal.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/neighbour-saves-unconscious-man-from-fire-in-bukit-batok-flat", "Source": "google"}