{"Type": "", "Time": "2021-06-12", "Headline": "Man assaulted private hire car driver in road rage incident", "Text": "SINGAPORE — Upset at a private hire car driver who sounded his horn and made a gesture, a man drove quickly to catch up and confront him.Marco Paulo Goncalves Guimaraes, a 43-year-old Portuguese, was jailed three weeks and fined $1,000 on Thursday (10 June) after he pleaded guilty to one count of causing hurt to Desmond Wu Weiming, and one count of not wearing a mask while arguing with Wu.Guimaraes was also ordered to pay compensation of $122.20 to the private hire car driver by end July.A Singapore permanent resident, Guimaraes came to Singapore in 2004 and founded Football Management International in 2010. He began a career as a FIFA licensed players’ agent where he scouted for and helped to place promising players into European football clubs, according to his lawyer Marshall Lim from Invictus Law.Guimaraes was actively scouting for talent in Malaysia and Singapore to bring to Portugal to experience football, but the COVID-19 pandemic dealt a severe blow to his work, said Lim. He is struggling to manage the business and his club Algarve Clube de Futbol while supporting his wife and his two daughters, Lim said.On 11 June last year, Guimaraes was on his way to pick up one of his daughters from school when he got into the road rage incident. His wife was beside him in the front passenger seat.At about 1.10pm, Wu was driving along Punggol Drive, a two-lane road, when Guimaraes overtook him. Guimaraes’ car appeared to brake abruptly.When Wu passed by Guimaraes’ car, Wu sounded his horn and gestured at him. Guimaraes drove quickly to catch up with Wu and both cars stopped side-by-side at a loading bay at Block 670A Edgefield Plains.Guimaraes alighted and approached Wu’s car while not wearing a mask. Singapore was in Phase 1 of its reopening then and all were required to wear their masks in public spaces with some exceptions.The Portuguese then pushed the car door against Wu, causing it to hit Wu’s right shin. He then grabbed Wu’s right wrist and began arguing with him.After Wu emerged from his car, Guimaraes pushed him while hurling profanities at him. Wu recorded Guimaraes with his mobile phone, and the latter then wore a mask.Guimaraes then slapped Wu on the side of his head and pushed his right arm. He returned to his car and drove to a parking lot at a nearby loading bay, while Wu called the police.Wu parked his car behind Guimaraes’ and both alighted, with Guimaraes kicking Wu on his left shin.Wu sought medical treatment at a hospital and was diagnosed with bruises and swelling over both shins, and over his left ear.According to Lim, Guimaraes had been driving cautiously due to heavy traffic and had not been able to filter to the left lane as it was full of vehicles. This was when Wu had sounded his horn at Guimaraes. When Guimaraes managed to filter left, Wu “inexplicably sounded his vehicle horn at our client, despite our client having already gotten out of Mr Wu’s way”, said Lim.“Our client instructs that as Mr Wu drove past, he raised his hand, and our client perceived that Mr Wu had pointed his middle finger at him as he drove past. This was unwarranted conduct from Mr Wu, bearing in mind that our client had given way to Mr Wu, and did not respond to Mr Wu’s sounding of his horn at our client as he cautiously navigated Edgefield Plains.Asking for two weeks’ jail and a fine of $800, Lim said, “Our client therefore could not fathom what caused Mr. Wu to act in such a rude manner.”Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeOther Singapore stories:Validity of overseas Malaysians’ passports expiring in 2021 extended by 2 years for freeTwo of four new COVID cases in Singapore are in communityPet shop manager who fought with SDA fined, SDA's case pendingChina's quick rollout of a law against foreign sanctions has left European and American companies shocked and facing \"irreconcilable\" compliance issues, two top business groups said Friday, despite Beijing saying the move would unlikely impact investment.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Du kan få flere penge i hverdagen, hvis du samler dine lån og kreditter i et samlelån. Indsend en uforpligtende ansøgning i dag.Agnes Chow hails from a generation of Hong Kong democracy activists who cut their teeth in politics as teenagers and are now being steadily silenced by China.A top official from the Chinese county that hosted a fatal ultramarathon last month has been found dead, authorities said Friday, as 27 people face punishment over the incident.ION Orchard will be closed to the public from Saturday (12 June) for four days and reopen on 16 June after three cases working at the mall were found to have COVID-19 infection.Bedste sikkerhed i klassen. A+ forbrug 19,2 km/l, 117-118 g/km co2. Prisen gælder indregistrering senest 30/06/2021.Democrats erupted in outrage Friday over news that Donald Trump's Justice Department secretly surveilled lawmakers probing possible collusion with Russia, reaping the phone records of top political foes in what they called an unprecedented abuse of power.Singapore will begin slowly easing a month-long partial lockdown from next week after the curbs succeeded in stemming a coronavirus outbreak, authorities said Thursday.A Hong Kong court has barred media tycoon Jimmy Lai Chee-ying and his companies from challenging the legality of the search warrants executed in a series of raids at his offices last year and refused their applications for an injunction against the police chief. The nine plaintiffs first filed a series of private legal actions against the commissioner of police last year to recover some materials seized by officers during investigations into allegations of fraud and national security law violatiBook en prøvetur og oplev Ceed Plug-in Hybrid med plads til hele familien. Kør lydløst rundt på strøm i dagligdagen og mærk begejstringenBeijing has repeated an offer to vaccinate people from Taiwan against Covid-19, as the coronavirus continues to spread on the island. The Taiwan Affairs Office, Beijing’s main body for cross-strait affairs, on Friday said that Taiwanese who fly to mainland China can voluntarily receive Covid-19 shots as long as they meet vaccination requirements and follow outbreak control measures. “[We] urge the authorities to earnestly listen to the voices of the people on the island and remove the man-made oChina’s rocket force has conducted firing exercises involving “carrier killer” DF-26 ballistic missiles. A missile brigade under the People’s Liberation Army Rocket Force recently held launch practice in an unspecified training field at night to improve its combat ability, China National Radio reported on Tuesday. In the exercise, the brigade practised the fast transfer of missiles to another location to launch a second wave of missiles, a drill to train the brigade’s fast-response capabilities,Turns out the comic books were wrong.En elektrisk tandbørste med kunstig intelligens? Oral-B har gjort din eltandbørste endnu smartere - og din tandbørstning sjovere.The Ministry of Health (MOH) on Thursday (10 June) confirmed 13 new COVID-19 cases in Singapore, bringing the country's total case count to 62,236.President Vladimir Putin on Friday denied a US media report that Russia is set to deliver an advanced satellite system to Iran that will vastly improve its spying capabilities.A secret society member who brutally assaulted a police officer and caused him to suffer a traumatic brain injury with help from his twin brother was jailed for two years, nine months and four weeks on Friday (11 June).Sådan investeres i aktier på 5 minutter via din telefon.China on Thursday passed a new law to counter foreign sanctions, as it looks to build its defences against rising US and EU pressure over trade and human rights.Lawyers for Huawei Technologies Co. executive Meng Wanzhou are seeking a publication ban on new evidence obtained from HSBC bank that they think will boost her Canadian court battle against extradition to the United States. They believe the material supports her claim that she is the victim of an abuse of process and she should be released, although the exact nature of the evidence has not been described. Her lawyer, Richard Peck, previously said the material, obtained as a result of a recent HoSouth Korea's youngest MP apologised Thursday after she provoked fury among BTS fans by using pictures of tattooed singer Jungkook to promote her campaign to liberalise the country's restrictive laws on inking.Folk født 1930-1980 søges til betalte spørgeundersSecond Minister for Education Maliki Osman has taken to Facebook to express his shock and disappointment at alleged Islamophobic remarks made by a Ngee Ann Polytechnic (NP) lecturer.Blaming \"misogynistic perverts in sport and their boot lickers\", dual Olympic silver medallist Maddie Groves has pulled out of Australia's swimming trials for the Tokyo Games.China’s nuclear arsenal is a growing threat to US security, less in its absolute size than in the growing risk of a mishap as Washington and Beijing butt heads over Taiwan and many other issues, experts told a US Congressional commission on Thursday. “Have the risks changed? Yes, it’s a more competitive US-China relationship, and the chances of a conflict over Taiwan – while I don’t believe they’re high right now, they certainly have increased,” said Phillip Saunders, director of the Centre for", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/man-assaulted-grab-car-driver-in-road-rage-incident-094916663.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}