{"Type": "World", "Time": "2021-06-12", "Headline": "Biden says biggest vaccine donation 'supercharges' battle against COVID-19", "Text": "CARBIS BAY, England: US President Joe Biden said on Thursday (Jun 10) that adonation of 500 million doses of the Pfizer COVID-19 vaccineto the world's poorest countries would supercharge the battle with the virus and comes with \"no strings attached\".Biden, speaking alongside Pfizer Chief Executive Albert Bourla in the English seaside resort of Carbis Bay ahead of a G7 summit, thanked other leaders for recognising their responsibility to vaccinate the world.\"The United States is providing these half billion doses with no strings attached. No strings attached,\" Biden said. \"Our vaccine donations don't include pressure for favours, or potential concessions. We're doing this to save lives.\"Biden, keen to burnish his multilateral credentials on his first foreign trip as leader, cast the donation as a bold move that showed America recognised its responsibility to the world and to its own citizens.\"America will be the arsenal of vaccines in our fight against COVID-19, just as America was the arsenal of democracy during World War Two,\" Biden said.The largest ever vaccine donation by a single country will cost the United States US$3.5 billion but willspur further donations from other G7 leaders- including British Prime Minister Boris Johnson.G7 leaders want to vaccinate the world by the end of 2022 to try to halt the COVID-19 pandemic that has killed more than 3.9 million people, devastated the global economy and upended the normal lives of billions of people.Vaccination efforts so far are heavily correlated with wealth: The United States, Europe, Israel and Bahrain are far ahead of other countries. A total of 2.2 billion people have been vaccinated so far out of a world population of nearly 8 billion, based on Johns Hopkins University data.'SAVE LIVES'US drugmaker Pfizer and its German partner BioNTech have agreed to supply the US with the vaccines, delivering 200 million doses in 2021 and 300 million doses in the first half of 2022.The shots, which will be produced at Pfizer's US sites, will be supplied at a not-for-profit price. Around 100 countries will get the shots.Pfizer CEO Bourla said the eyes of the world were on the leaders of rich nations to see if they would act to solve the COVID-19 crisis and share with poorer nations.\"This announcement with the US government gets us closer to our goal and significantly enhances our ability to save even more lives across the globe,\" he said.While such a large donation of vaccines was welcomed by many, there were immediately calls for the richest nations of the world to open up more of their giant hoards of vaccines.Anti-poverty campaign group Oxfam called for more to be done to increase global production of vaccines.\"Surely, these 500 million vaccine doses are welcome as they will help more than 250 million people, but that’s still a drop in the bucket compared to the need across the world,\" said Niko Lusiani, Oxfam America’s vaccine lead.\"We need a transformation toward more distributed vaccine manufacturing so that qualified producers worldwide can produce billions more low-cost doses on their own terms, without intellectual property constraints,\" he said in a statement.Another issue, especially in some poor countries, is the infrastructure for transporting the vaccines which often have to be stored at very cold temperatures.IP WAIVERBiden has also backed calls for awaiver of some vaccine intellectual property rightsbut there is no international consensus yet on how to proceed.The new vaccine donations come on top of 80 million doses Washington has already pledged to donate by the end of June. There is also US$2 billion in funding earmarked for the COVAX programme led by the World Health Organization (WHO) and the Global Alliance for Vaccines and Immunization (GAVI), the White House said.GAVI and the WHO welcomed the initiative.Washington is also taking steps to support local production of COVID-19 vaccines in other countries, including through its Quad initiative with Japan, India and Australia.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,vaccine,United States,Joe Biden,medical health", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/joe-biden-500-million-covid-19-vaccine-donation-pfizer-14989940", "Source": "google"}