{"Type": "", "Time": "2021-06-12", "Headline": "Motorcyclist gets a shock after traffic police pulls him over in Woodlands... to give him a reward, Singapore News - AsiaOne", "Text": "Lee Joonmin was riding along Woodlands Road on Monday evening (June 7) when he saw the flash of a blue and red light in his motorcycle's rearview mirror.When he realised a traffic police officer was tailing him, the 23-year-old dispatch supervisor broke into a sweat.\"To my horror, I saw the [traffic police] officer was gesturing at me to pull over,\" Lee said in a Facebook post later that evening. It soon went viral with over 1,200 shares.He was stunned when the officer revealed why he was getting \"booked\". [embed]https://www.facebook.com/Chifferon/posts/4324023350982616[/embed]Speaking with AsiaOne, Lee said many thoughts raced through his mind as he dismounted his motorcycle, including \"Oh no, what did I do\", \"There goes my money\", \"Did I fail to signal?\"He recounted how there was a \"super awkward and longest sentence pause of [his] entire life\" before the officer told him what he was actually pulled over for.Lee was given a reward for being a safety role model to other motorcyclists on the road, as he was wearing protective riding gear.Only then did Lee breathe a sigh of relief and graciously accepted the reward — a bag filled with a mask, hand sanitiser, surface sanitiser, wet tissues, an EZ-link card and a pouch.\"I never expected this to happen to me,\" he said. \"[The officer] really had me there.\"Lee isn't the only person to have been pulled over by the traffic police for being a good noodle.Since the introduction of the \"Reward the Riders\" initiative in 2019, the traffic police have been recognising and rewarding numerous motorcyclists who wear protective gear and display good riding behaviour on the road.[embed]https://twitter.com/SingaporePolice/status/1177967230400659456[/embed]Despite the heat, the expensive riding gear and the social stigma that comes with wearing the full outfit, Lee said he chose to wear the protective wear as he knew the pain that came with traffic accidents.\"I crashed three whole times within my first month of riding,\" he sheepishly admitted. \"Never again after that!\"rainercheung@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/singapore/motorcyclist-gets-shock-after-traffic-police-pulls-him-over-woodlands-give-him-reward", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}