{"Type": "", "Time": "2021-06-12", "Headline": "China passes anti-sanctions law that 'can target individuals, families, organisations', China News - AsiaOne", "Text": "China’s top legislative body has passed an anti-sanctions law , providing legal backing for sweeping retaliation against any individuals, their families and organisations responsible for imposing foreign sanctions against the country.The legislation was passed on Thursday at the closing session of the National People’s Congress (NPC) Standing Committee, and was effective the same day.Tam Yiu Chung, Hong Kong’s sole delegate to the NPC Standing Committee, said that under the new law, the State Council and its agencies would be responsible for coordinating retaliatory measures.“These measures can be applied to organisations and individuals, as well as extended to the individuals’ spouses, relatives and the organisations that they belong to,” he said.[embed]https://youtu.be/z5NyDpsKY0A[/embed]Tam said that under Article 6 of the new law, Beijing’s retaliatory measures could include denial of visa applications or entry into China. In the case of visa holders, authorities could declare their document invalid and deport them.Individuals’ property or assets could be frozen or seized, and institutions could be restricted from conducting transactions with individuals or organisations targeted, he said.The law also specified that no one in the country could help other countries implement measures against China, and people must instead help Beijing’s authorities to execute retaliatory measures. Individuals and organisations affected by sanctions could make claims in mainland courts, Tam said.State media said the move was intended to provide a legal basis for China to respond to sanctions. China has issued counter-sanctions in response to sanctions against it from the United States, the European Union, Britain and Canada over Beijing’s political crackdown in Hong Kong and treatment of ethnic minority groups in Xinjiang .After the law was passed, Li Zhanshu, head of the NPC Standing Committee, said : “China will not give up its legitimate interest. And no one should have any illusion of letting China swallow the bitter fruit that harms our own interests.”Chinese foreign ministry spokesman Wang Wenbin said the passage of the new law showed China’s determination to protect its sovereignty and core interests, and would not affect its relations with other countries.[[nid:495641]]The anti-sanctions law was announced on Monday night by state media and underwent a second reading but skipped a third, in the same way the national security law for Hong Kong went through the legislative process.The new law is the strongest tool so far for China to respond to foreign sanctions, after the Ministry of Commerce in January issued a “blocking statute” requiring Chinese companies to report foreign restrictions on economic or trade activities. It had last September unveiled an unreliable entity list for foreign businesses.Washington has imposed a number of sanctions on China over its policies in Hong Kong and Xinjiang, including targeting Hong Kong’s leader Carrie Lam Cheng Yuet Ngor and Xinjiang ’s Communist Party chief Chen Quanguo, as well as other senior mainland and Hong Kong officials and the 14 vice-chairpersons of the NPC. Canada, Britain and the European Union also imposed sanctions on China.Tian Feilong, an associate professor at Beihang University’s law school, has been involved in the consultations over the new legislation. He said the draft of the law was first read in April, after the US Senate Committee on Foreign Relations backed an act to counter competition from China.He said discussion about the law started last year when Donald Trump was still US president, but China was waiting to see how Trump’s successor, Joe Biden , would approach relations with China.“The central leadership was already considering it last year, and the academic community has made suggestions,” he said. “The timing is based on Biden’s China policies.”[embed]https://youtu.be/UfQdGGczq9c[/embed]Tam said it was not specified in the legislation whether the new law would apply to Hong Kong and Macau through local legislation.“For a mainland law to apply in Hong Kong, it needs to be inserted into Annex III of the Basic Law … But the new law did not mention how the law would be applied outside the mainland,” he said. “I would not say that it could not be applied in Hong Kong either. Probably the mainland authorities need more time to study its application.”[[nid:518182]]Tam, who is also sanctioned by the US for the enactment of the national security law in Hong Kong, which critics say has undermined the city’s autonomy, said he supported the new law but had no plan to invoke any provision in it himself.“I have not yet considered how this law will help me,” he said. “I just think that from the macro level, it is good to have this law so that it’s not just individual agencies or the central government [making] retaliatory measures, but the responsibility of the State Council as a whole.“I support this law because as the Chinese saying goes, ‘Offend no one if none offends you, but retaliate if you are under attack.’”There have been concerns among foreign companies over the lack of transparency around the legislative process and the potential impact on businesses in China and Hong Kong, which analysts say will need to be wary of being linked to foreign entities under Chinese sanctions.Greg Gilligan, chairman of the American Chamber of Commerce in China, said it was difficult to comment on the law until details were available.“However, where there is any disagreement across borders, governments need to come together to reconcile this in a way that allows businesses to remain legally compliant within the jurisdictions in which they operate,” he said.This article was first published in South China Morning Post.", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/china/china-passes-anti-sanctions-law-can-target-individuals-families-organisations", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}