{"Type": "", "Time": "2021-06-12", "Headline": "Former student of Ngee Ann Polytechnic lecturer who made racist remarks to mixed-race couple recalls being subjected to Islamophobic comments in class - The Online Citizen Asia", "Text": "Source: Nurul Fatimah Iskandar (@_new_rule_) / InstagramOn the heels of the suspension of the Ngee Ann Polytechnic lecturer who was caught on video making racist remarks to an interracial couple from his teaching duties, a former student of his took to social media to share her own experience of being subject to Islamophobic remarks from him in front of a class.Ms Nurul Fatimah binti Iskandar, who was a student of Mr Tan Boon Lee for an Object Oriented Programming Module in 2017, said in an Instagram post on Wednesday (9 June) that the lecturer had “used our class period to have a full-on discourse about Islam”.“I was the only Muslim in class. He opened websites on the projector, pointing out things he didn’t agree with about the Quran and Prophet Muhammad s.a.w to the class,” she said.Based on Ms Nurul’s record of an Instagram Story posted on 28 July 2017, the date of the incident, among the comments Mr Tan had reportedly made were “Only animals will treat their children like how Allah does to His people” and “What type of Father tells you to worship him five times a day and threatens to send you to hell if you don’t?”.Such remarks, she said, were merely “the tip of the iceberg”.To worsen matters, Mr Tan had singled out Ms Nurul — who was sitting in the front of the class — and asked her if she agreed with him.“I could barely open my mouth amidst his continuous sweeping statements. I was barely 17, fresh out of 10 years of madrasah trying to assimilate into the new secular environment,” she lamented.The situation had “escalated so badly” that Ms Nurul ended up sitting outside on the floor of the corridor with her classmate, Merick while waiting for his “unsettling speech” to end.Merick had initiated the walk-out, according to Ms Nurul.Ms Nurul noted that she made a complaint regarding the incident with Mr Tan, but no action was taken.Touching on why she went public with her story after Mr Tan’s identity was revealed in the recent viral case, Ms Nurul said that she “can only imagine how many more times he had been racist and Islamophobic in the institution of education over the years”.“After his suspension is over, he might return to the classrooms. He should not be allowed back,” she stressed. “A racist Islamophobe has no place educating our youths.”Particularly taking into consideration Mr Tan’s position as a senior lecturer, it is crucial that such instances of bigotry are thwarted from the start to prevent “strife, prejudice, and racism” resulting from the spread of “sweeping misconceptions” about a particular faith, said Ms Nurul.“My ex-classmates did their best to help me find evidence. More people are coming out to testify. More people are showing support. We may still be far from utopia but the fact people are thinking, trying and taking action means we are definitely on the right path,” she concluded.A post shared by Nurul Fatimah Binti Iskandar (@_new_rule_)In the recent viral video, Mr Tan had publicly accused Mr Dave Parkash of “preying on Chinese girls” while the latter was on a night out with his girlfriend.Mr Dave clarified that he is half-Indian and half-Filipino, while his girlfriend — who recorded the incident — is half-Chinese and half-Thai.Undeterred by Mr Dave’s reply, the man continued his verbal abuse against Mr Dave, saying: “I got nothing against you staying in Singapore.””The only thing is you are preying on Chinese girl, I tell you the Chinese won’t like it,” while admitting that he himself is “racist”.The man also accused Mr Dave’s girlfriend of “disgracing me”, saying that the interracial couple should date people of their own race instead.“You don’t see a Chinese guy preying on an Indian girl,” he further said to Mr Dave.Mr Tan teaches at NP’s School of Engineering. He appears to have been awarded The Long Service Medal in 2019 under the annual National Day Awards, as listed on Prime Minister’s Office website.An NP spokesperson told Channel News Asia on Monday that the polytechnic is aware of the video and has suspended him from teaching duties.“We regret that the individual in question is a member of our staff,” said the spokesperson.They added that the polytechnic takes “a very serious view” of the matter, as the remarks are “highly offensive, disrespectful and go against our staff Code of Conduct and values as a community”.“We are investigating this matter internally, including considering the appropriate disciplinary action to be taken. Meanwhile, the staff in question has been suspended from his teaching duties,” the spokesperson added.The incident is currently under police investigations. The police confirmed on Sunday that reports had been lodged and that a 60-year-old man was assisting with investigations into the incident. © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/10/former-student-of-ngee-ann-polytechnic-lecturer-who-made-racist-remarks-to-mixed-race-couple-recalls-being-subjected-to-islamophobic-comments-in-class/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}