{"Type": "Sport", "Time": "2021-06-12", "Headline": "'Life goes on, it's just tennis,' says Nadal after French Open reign ends", "Text": "PARIS: Rafael Nadal shrugged off his epic loss to Novak Djokovic at the French Open insisting \"life goes on\" as the 13-time champion suffered just his third ever defeat in 108 matches in Paris over 16 years.In their 58th career clash, world number one Djokovic triumphed 3-6, 6-3, 7-6 (7/4), 6-2 in the semi-final and stays on course to capture a 19th major and become the first man in over 50 years to win all four Slams twice.Nadal, the defending champion and chasing a record-setting 21st Grand Slam title, refused to dwell on the consequences of his 4-hour 11-minute loss.\"I am sad to have lost in the most important tournament of the year for me, but life goes on, it is nothing more than a defeat on a tennis court,\" said 35-year-old Nadal.\"If everything goes well, tomorrow I will be at home with my family and friends, and then we will see what is next.\"Nadal said he plans to be back in 2022 although admitting that time is not on his side if he wants to re-establish his Paris dominance.Had he made Sunday's championship match, he would have been the oldest Roland Garros finalist in the modern era.\"Although it is a very important tournament for me, I am aware that you cannot win it 15 or 16 times,\" he added.\"Next year I will come again, God willing, with the belief and with the necessary work to be able to give myself another chance.\"In their 58th career meeting, and ninth at the French Open, Nadal had looked comfortably on course for victory when he raced to a 5-0 lead in the first set.But 2016 champion Djokovic, the man now responsible for two of Nadal's losses in Paris having also triumphed in the 2015 quarter-finals, hit back.\"DID NOT HURT HIM\"As the match progressed into the later heavier, humid and slower conditions, the world number one flourished.He claimed a titanic 92-minute third set which had seen him serve for it at 5-4 and then have to save a set point in the 12th game.In the fourth set, he was 0-2 down before racing away with the next six games for his second win in Paris over Nadal in nine meetings.That sequence also included defeats in the 2012, 2014 and 2020 finals.Djokovic will now be playing in his sixth Roland Garros final and 29th at the Slams.\"In the end, of course, if you win the third set you can say that was the key, because it changes the dynamic,\" said Nadal.\"At times, my ball did not hurt him. You have to give him credit, congratulate him, but I know I can play better on this court.\"When asked if he had faced the best Djokovic performance of their 15-year rivalry, he was adamant.\"No, that's what I feel. He has not faced my best self either.\"There were games on the limit, games that anyone could win, and today it was for him.\"Despite that, there is a degree of evidence that Nadal is beginning to lose more epics than he wins at the Slams.At the Australian Open in February, he lost to Stefanos Tsitsipas from two sets up in a five-set quarter-final defeat.Tsitsipas, who faces Djokovic in Sunday's final, is 13 years younger than Nadal.In the Wimbledon semi-finals in 2018, Nadal lost a final set 10-8 to Djokovic after quitting injured in the fifth set of his Australian Open semi against Marin Cilic earlier that same year.Even Gilles Muller of Luxembourg beat him at Wimbledon in 2017, courtesy of a 15-13 final set.\"It doesn't matter,\" added a rueful Nadal. \"That's tennis. The player who gets used to the conditions better is the player who deserves to win.\"It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Rafael Nadal,Novak Djokovic,French Open,Roland Garros", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/-life-goes-on--it-s-just-tennis---says-nadal-after-french-open-reign-ends-14999100", "Source": "google"}