{"Type": "", "Time": "2021-06-12", "Headline": "China invites Taiwanese to come and get vaccinated against Covid-19, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BEIJING (REUTERS) - China's government said on Friday (June 11) it welcomed Taiwanese to come and get vaccinated against Covid-19.It also called on Taiwan to remove obstacles and allow its people to receive Chinese vaccines which it says are highly effective.China claims democratically ruled Taiwan as its own territory and has repeatedly offered to send vaccines to the island, which is battling a spike in domestic infections but has expressed concern about the safety of Chinese shots and has not cleared them for use.China's Taiwan Affairs Office said in a statement that two Chinese-made vaccines had been granted emergency use authorisation by the World Health Organisation and its shots were in use or approved by more than 90 countries, showing their safety and efficacy.Taiwan people can come to China to get vaccinated against Covid-19, provided they strictly comply with China's pandemic control measures, the office said.It urged Taiwan's government to \"quickly remove artificial obstacles for mainland vaccines being sent to Taiwan and allow the broad mass of Taiwan compatriots to receive the safe and highly effective mainland vaccines\".About 62,000 Taiwanese had been vaccinated in China as of May 31, the office added, though many Taiwanese live and work there already.Only 3 per cent of Taiwan's 23.5 million people have received at least one shot, though millions of doses are on order. Japan donated 1.24 million AstraZeneca shots last week and the United States has pledged 750,000 doses, which have yet to arrive.Still, China's offer is not likely to be attractive to many Taiwanese. A poll by Taipei's National Chengchi University last month showed that most people would not be willing to get a Chinese vaccine.A Taiwan security official looking into Chinese activities told Reuters that the offer was another example of a Beijing influence campaign to sway public opinion on the island.\"This could be attractive for some people, but the problem is not many people can afford the costs,\" the official said, pointing to the expense and weeks in quarantine needed to travel between Taiwan and China.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/beijing-invites-taiwanese-to-go-to-china-to-get-vaccinated-against-covid-19", "Source": "google"}