{"Type": "", "Time": "2021-06-12", "Headline": "Cyclist fined for punching lorry driver in road rage incident along Jalan Eunos, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A cyclist who punched a lorry driver in a road rage incident was fined $5,600 on Thursday (June 10).Jeffery Todd Martin, 57, a Canadian and a Singapore permanent resident, pleaded guilty to one count each of voluntarily causing hurt and riding his bicycle without due regard for the safety of others.At about 10.20am on Feb 24, 2019, Martin was cycling in Jalan Eunos when a lorry overtook him.He later overtook the lorry, pointing at the driver as he did so, and stopped in the middle of the lane in front of the vehicle.This caused the lorry to stop amid moving traffic.Martin got off his bike and hit the driver's window, hurling vulgarities at the driver as he did so.The lorry driver, Chinese national Zhang Ping, 33, then moved his vehicle sharply towards Martin, forcing him to step away.Zhang alighted from the lorry, holding an orange flask as he approached Martin.Once confronted, Martin punched him in the face, causing Zhang to fall.Martin later cycled away as Zhang remained in a daze sitting on the road.Zhang suffered cuts on his lips as a result of the punch, and was given medical leave for two days.He was previously dealt with, and was jailed for a week for one count of a rash act endangering others.A 30-second video of the incident had gone viral after the incident in 2019, and Zhang had been arrested within 48 hours.The same video was played in court on Thursday.After playing the video for the court, Deputy Public Prosecutor Emily Koh said the prosecution would not be pushing for a custodial sentence, as the attack was one of low harm and culpability.District Judge Brenda Tan noted that prior to the punch, it was Zhang who had come out from the vehicle to confront Martin.She said that while the custodial threshold had not been crossed, a high fine was warranted.For voluntarily causing hurt, Martin could have been jailed for up to two years on top of the maximum $5,000 fine he received for the charge.For not riding his bicycle in an orderly manner with due regard for the safety of others, he could have been jailed for up to three months and fined up to $1,000.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/cyclist-fined-for-punching-lorry-driver-in-road-rage-incident-along-jalan", "Source": "google"}