{"Type": "Singapore", "Time": "2021-06-12", "Headline": "F&B businesses, industry associations 'disappointed' at possible Jun 21 dine-in resumption", "Text": "SINGAPORE: While the announcement of an impending easing of pandemic curbs brought relief to some business sectors, several players in the food and beverage industry expressed disappointment at having to wait a little longer.The COVID-19 multi-ministry task forceannounced on Thursday (Jun 10) that Singapore will exit the current Phase 2 (Heightened Alert) measures in two stages. Some activities including facials and saunas will be allowed to resume from Jun 14, while others such as dining-in at F&B establishments will only start from Jun 21, provided the COVID-19 situation remains under control.Ms Hazel Chua, a supervisor at Birdie Num Num Gastrobar, told CNA that after Thursday’s announcement, the eatery had to cancel and reschedule customers’ reservations. Many had indicated that they would visit the restaurant on the day of their original booking to do takeaways instead.A few regulars had also taken the initiative to reschedule their reservations after learning about the phased reopening, she added.“Maybe because we half-expected it already, we didn’t feel too much of a shock. Just told ourselves to take it easy, and (it is) just another week or so,” she said.Ms Chua estimates that business has dropped about 80 to 90 per cent in the past month.“We serve our own food, but there are a lot of people who come here and they drink beer … So I think they come here, mostly a lot for the environment as well. Although this time we adapted to it, we did takeaway for draft beers, we still saw the decline in our revenue for sure.”For the owner of French restaurant The Masses, there was a bit of “sadness” when he found out that dining-in may only begin on Jun 21.“But at the end of the day, I believe we have already pulled through that so-called one month,\" said Mr Dylan Ong. \"I think waiting on another week more, mainly it’s just to be sure.”The restaurant had been working with the expectation that dining-in would resume on Jun 14.F&B OPERATORS CONTINUING TO “HAEMORRHAGE”In a statement released on Facebook on Thursday, the Restaurant Association of Singapore’s president Andrew Kwan said that he was “disappointed” that the restrictions for dining-in would not be lifted from Jun 14 “as was keenly hoped for”.“Our F&B operators are continuing to haemorrhage with each extended day of ‘no dine-in’. Members shared that the weekly burn rates to cover manpower and rentals alone range from a few thousand to over half a million dollars,\" Mr Kwan said.“Every additional day of low-to-no revenues will be the proverbial straw that breaks the camel's back.”While Mr Kwan noted his appreciation for the Government’s extension of the Jobs Support Scheme, which subsidies local workers’ salaries, he urged other stakeholders like landlords to “step up” and “jointly share in the huge impact sustained by their tenants”.“Without the ability to generate regular revenues, tenants are simply unable to pay full, unmitigated rentals,” he said.Mr Kwan also requested priority vaccinations for staff in the F&B sector who are in daily contact with the public. “They are frontliners who are performing the mission critical role of feeding our population on a daily basis. We must protect them as they go about carrying out their tasks faithfully.”“HAWKERS WILL BE FEELING QUITE DISAPPOINTED”Hawkers had also been hopeful that dining-in would resume on Jun 14 and had been preparing for it, said chairman of the Federation of Merchants’ Associations Singapore’s (FMAS) hawker division Anthony Low.“From the past one month, quite a number of hawkers have been struggling. So (with) the extension for one more week, I believe many of the hawkers will be feeling quite disappointed,” he said.While the Government had provided support for rentals, table-cleaning and centralised dishwashing services for Phase 2 (Heightened Alert), hawkers were unsure if this support would cover the additional week from Jun 14.“We will try to put up the request, because even (an extension) of seven days without the table-cleaning fee ... would be at least some relief for us,” he said.Terry Neo, founder of Kopifellas, a chain of several food and drinks stalls, said that he had “mixed feelings” on the Jun 21 reopening.“We were definitely hopeful that we could start on the 14th, but at least on the other hand I’m glad that it’s only just one week more,” he said.“We’re just crossing our fingers because if things head south again then we probably will not even open up on the 21st.”Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,food and beverage", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/dining-in-restaurants-food-beverage-disappointment-covid-19-14993644", "Source": "google"}