{"Type": "", "Time": "2021-06-12", "Headline": "Football talent scout jailed for road rage incident near daughter's school in Punggol, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A football talent scout thought another man was making a rude gesture, and attacked the latter near his daughter's school in a road rage incident.For that, Marco Paulo Goncalves Guimaraes, 43, has been jailed for three weeks.The Portuguese man was also fined $1,000 for not wearing a mask.He pleaded guilty to the two charges on Thursday (June 10) and was ordered to compensate the victim.Guimaraes is a Fifa licensed players' agent who scouted for talent here and in the region to play in European football clubs.He came to Singapore in 2004 and founded the Football Management International company in 2010.On July 11 last year, at about 1pm, he went to pick his seven-year-old daughter from Oasis Primary School in Punggol.He drove along Edgefield Plains, the road just outside the school, intending to wait with other cars along the road for his daughter.But another driver honked at him along the road. After he gave way, he thought he saw the man make a rude gesture with his finger while driving past.Guimaraes then tailed the man in his car, confronting him without a mask on, at the loading bay of a nearby housing block.As the victim was alighting from his car, Guimaraes pushed the car door, causing it to hit the victim’s shin. He also grabbed the victim’s wrist and they began arguing. When the victim got out of his car, Guimaraes pushed him.The court heard that Guimaraes hurled vulgarities at the victim throughout the encounter and put on a mask only when the victim started taking a video with his phone.Guimaraes also slapped the victim at the side of his head and kicked him before the police arrived.On Thursday, the court was told that Guimaraes was deeply ashamed of his conduct and was pleading for leniency.For voluntarily causing hurt, he could have been jailed for up to two years, or fined up to $5,000, or both.For not wearing a mask without a reasonable excuse, he could have been jailed for up to six months, or fined up to $10,000, or both.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/football-talent-scout-jailed-for-road-rage-incident-near-daughters-school-in", "Source": "google"}