{"Type": "Singapore", "Time": "2021-06-12", "Headline": "Students from Singapore could be given priority in pilot scheme for possible air travel bubble with Australia", "Text": "SINGAPORE: Students from Singapore could be given priority to travel to Australia to pursue or complete their studies when the infrastructure for safe travel is in place, said Australian Prime Minister Scott Morrison on Thursday (Jun 10).Speaking at a joint press conference with Mr Morrison following the in-person leaders’ meeting that took place earlier on Thursday, Prime Minister Lee Hsien Loong said the two discussed how two-way travel between the countries can eventually resume in a safe and calibrated manner “when both sides are ready”.This can “start small” with an air travel bubble “when ready”, said Mr Lee in his statement, which was broadcast live on his Facebook page.“We need to prepare the infrastructure and processes to get ready to do this. It starts with mutual recognition of health and vaccination certificates, possibly in a digital form. When all the preparations are ready, we can start small with an air travel bubble to build confidence on both sides,” he added.There is still some time before Singapore and Australia “reach that milestone”, but the two countries will be “getting on with the job” of putting systems in place that will enable such a bubble to emerge between Singapore and Australia, similar to the one between Australia and New Zealand, said Mr Morrison.“But in addition to that ... giving priority to students from Singapore to be able to return to Australia to complete their studies and to engage in their studies,” he added.“And for the students from Singapore ... a first opportunity to see increased travel between Australia and Singapore realised, and for that to occur sooner rather than later.”This is the sixth Singapore-Australia Leaders’ Meeting. Mr Lee and Mr Morrison held their previous meeting in March last year by video conference because of the COVID-19 pandemic.Mr Morrison's trip to Singapore is the first official visit by a foreign leader since the start of the pandemic.TRAVEL BUBBLE CONDITIONSResponding to a question following the prime ministers' statements, Mr Morrison said Singapore is the first country outside of New Zealand that Australia wishes to engage in a travel bubble with.Adding that Australia’s system for digital vaccination certificates had just gone live, he said: “And we get it right in Singapore, which we know we can do, because of the very sophisticated systems that Singapore has.”“And with some encouragement from Prime Minister Lee, we really do want to focus on those students coming ... as part of the exercise piloting how these systems can work most effectively when we get to the next phase ... but the timing of that is still somewhere away.”“Quite a number” of students from Singapore study in Australia and some students came home due to the COVID-19 pandemic, said Mr Lee.These students in Singapore are unable to go back to Australia to resume their studies, and “there’s urgency for them”, he added.“Especially for those of them who have got clinical attachments or postings, and to be unable to take them up, it's very, very disruptive to their studies.”Mr Lee said he also suggested to Mr Morrison that these students could be one way to test the safe travel systems and “get a pilot going so that we can widen the project”, and later on implement a full travel bubble between Singapore and Australia.“There's no timetable, but we hope it can be done as soon as possible.”Vaccination rates and COVID-19 transmission rates will be considered when setting up the travel bubble, said Mr Lee during the press conference.“I would say that in Singapore, we are making good progress with our vaccination program. In Australia, they're also steadily vaccinating the population. And I think once the majority of the population is vaccinated, it becomes much easier for us to contemplate these openings,” he added.The prevailing transmission rates will “certainly be a factor”, said Mr Lee.“What we want to do is to get the preconditions infrastructure ready, the vaccine recognition, what are the standards, what are the conditions. Then the actual decision to do it, that is a political decision. But let's get everything teed up, so that we are in the position to make the political decision when we want to do so,” he added.Neither Singapore nor Australia has identified a benchmark vaccination rate that would influence the decision on an air travel bubble, said Mr Morrison, adding that this would be dependent on the advice of the medical community.DEFENCE AND FINTECH PARTNERSHIPSAddressing other areas of partnership between Singapore and Australia, Mr Lee noted that the two countries’ treaty on military training and training area development came into force in December 2020.“This was a milestone in our longstanding defence partnership,” he added.“Singapore greatly appreciates Australia’s generous and sustained support for SAF’s training. Over many years, in many air bases and camps all over Australia.”The bilateral digital economy agreement between the two countries also came into force in 2020, said Mr Lee.“This was the fruit of our forward looking, open and progressive attitudes towards trade and the future economy,” he added.Building on the agreement, the two leaders will commence discussions to develop a fintech bridge between the two countries, said Mr Lee in his opening remarks.Singapore and Australia are also exploring collaborations on low-emissions solutions to support climate change efforts, said Mr Lee.“This is another key domestic priority for both of us, and it includes a public-private partnership on low emissions fuels and technologies for shipping and port operations, based at Nanyang Technological University’s Eco Labs.“We are also exploring a broader partnership on a green economy agreement. This will facilitate trade and investment in environmentally sustainable goods and services, and strengthen environmental governance and our capacity to address climate change.”Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,Australia,travel,Scott Morrison", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/singapore-australia-travel-bubble-students-scott-morrison-14987498", "Source": "google"}