{"Type": "", "Time": "2021-06-12", "Headline": "Indoor mask-off activities to resume in gyms, fitness studios from June 21, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - As Singapore moves to phase three (heightened alert) from next Monday (June 14), gyms and fitness studios will have to wait a little longer to find out if they can resume their indoor operations.The multi-ministry task force (MTF) said on Thursday that if the coronavirus situation remains under control in the coming weeks, gyms and fitness studios will be allowed to resume indoor mask-off sports activities with safe management measures in place from June 21.These measures include social distancing of at least 2m between individuals and at least 3m between groups of up to five people. Indoor and outdoor sports classes can also be carried out in multiple groups of five, with a cap of 30 people, including the instructor.Participants will be allowed to unmask if they are doing strenuous activities, but are encouraged to remain masked where possible.Under the current heightened measures for phase two, which took effect on May 16, only low-intensity physical activities such as yoga and pilates can take place at public and private gyms and fitness studios.Organised programmes and classes for low-intensity activities have been allowed to carry out their sessions only in groups of two.Singapore Fitness Alliance president Sean Tan said the latest announcement was a pleasant surprise for the industry as many had not expected activities that did not require the wearing of masks to resume so soon.Tan, who is also the director of True Group, said: “In general the fitness industry has been elated with today’s announcement as we will reopen on June 21 with a masks-off policy, and that is a huge relief.“It underscores the Government’s belief that the fitness sector is an important one, and we can get back to getting people back in our gyms and studios to resume their fitness regimens.”He added that the extension of the Job Support Scheme (JSS) to help sectors that are required to remain closed till June 20 was helpful and was welcome by those in the industry.\nThe affected sectors will receive 10 per cent JSS support from June 21 to 30.When indoor activities in gyms and fitness studios are allowed to resume, staff from these places where clients are unmasked will be required to undergo regular Covid-19 testing. This is part of the regular fast and easy testing regimen for staff involved in \"higher-risk mask-off\" activities, which will be introduced in July to reduce transmission during phase three (heightened alert).Tan acknowledged that it was something the industry would have to abide by in order for businesses to reopen and believes that it would give members the confidence to return to gyms. But while the Government will cover the cost of testing over the next three months, he expressed concerns about the added costs for gyms and fitness studios beyond that as they have already seen their revenues heavily impacted by the pandemic.The operating costs for many outfits have already increased due to enhanced cleaning, disinfecting and sanitisation measures.He added: “We hope that the testing costs will not be prohibitive, and that there can be more support for these costs.\"Mass participatory sports events such as runs could also be allowed to resume from June 21, with a maximum of 250 participants if pre-event testing is implemented. If participants are not tested before the event, only 50 people will be allowed to take part.From next Monday, spectators will be allowed to return to sports events such as football's Singapore Premier League or mixed martial arts outfit One Championship's shows. The number of spectators will be capped at 250 attendees with pre-event testing, while no testing is required for events with 50 or fewer attendees.A spokesman from the Football Association of Singapore said: “As the SPL is only due to resume next month, the Football Association of Singapore will continue to monitor prevailing measures in place and will decide the conditions for re-entry of SPL fans into match venues closer to the League’s resumption period.”READ NEXT: Singapore to ease Covid-19 curbs and reopen in 2 phases from June 14: Everything you need to knowJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/indoor-mask-off-activities-allowed-in-gyms-fitness-studios-from-june-21-if-situation-remains", "Source": "google"}