{"Type": "", "Time": "2021-06-12", "Headline": "Police investigating 4 people for abusing enforcement officers, flouting safe distancing measures, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Four people are being investigated for abusing enforcement officers and safe distancing ambassadors (SDAs), and not complying with safe distancing measures.The three men and a woman, aged between 25 and 54, allegedly committed the offences in three separate incidents, said a police statement on Friday (June 11).One of them, Ng Chwee Hock, was charged on Friday for using insulting words against a public servant at Redhill Food Centre on Thursday.The 46-year-old's case will be heard again on July 9.\"Preliminary investigations revealed that (Ng) allegedly used abusive language towards the SDEO, when he was advised not to sit at the table in the food centre to consume his food and drinks,\" police said. SDEO refers to a safe distancing enforcement officer.Ng purportedly refused to comply even when police officers advised him to do so, and continued to verbally abuse the SDEO.Police told The Straits Times that he is currently under investigation for other unrelated offences.In another incident on May 26, police received a report from an SDA that a man taunted her while she was on duty in Crawford Lane.He allegedly approached the SDA, pulled down his mask and asked her to catch him.Another woman is said to have then approached the SDA, pushed her on her shoulder and stepped on her foot.Both the man and woman then fled the scene.Police said the identities of the man, who is 54, and the woman, who is 25, were established through investigations.They are assisting with investigations for using criminal force, voluntarily causing hurt and flouting safe distancing measures.The third incident occurred on May 27 when police were alerted to a dispute involving a group of men at a void deck in Yishun Street 11.Officers spotted the men allegedly gathering, with beer cans strewn across a table beside them.A 39-year-old, who wanted to leave as officers were interviewing the group, allegedly became rowdy and hurled vulgarities after he was told to stay put.He purportedly punched another man in the group when the latter tried to calm him down.He was arrested for using abusive language against a public servant and causing annoyance while drunk.The group will also be investigated for breaching safe distancing measures.Individuals found guilty of using abusive words against a public servant can be jailed for up to a year, or fined up to $5,000, or both.For breaching safe distancing measures, a first-time offender may be jailed up to six months, or fined up to $10,000, or both.Those convicted of using criminal force can be jailed up to three months, or fined up to $1,500, or both.For voluntarily causing hurt, an offender may be jailed up to three years, or fined up to $5,000, or both.The offence of causing annoyance while drunk carries a maximum punishment of six months' jail and a fine of $1,000.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/police-investigating-four-people-for-abusing-enforcement-officers-and", "Source": "google"}