{"Type": "", "Time": "2021-06-12", "Headline": "WP’s Jamus Lim says Progressive Wage Model is a “substantial progress” to improve welfare of locals; cautions other prices will increase - The Online Citizen Asia", "Text": "The Workers’ Party (WP) Member of Parliament (MP) for Sengkang GRC Jamus Lim took to Facebook on Wednesday (9 June) to share his views on the Government’s latest announcement of increasing the wages for cleaners in Singapore.On Monday (7 June), the Government revealed that the salaries of cleaners who are Singaporeans and Permanent Resident (PR) will go up each year over six years from 2023, under the Progressive Wage Model (PWM).Based on PWM, the increase will be for cleaners across all job levels and it will rise up to between S$1,570 and S$2,210 in 2023. The amount will subsequently increase by at least S$170 yearly until 2028.For example, a full-time general or indoor cleaner will be entitled for a monthly wage of S$1,570 in July 2023. This means the worker gets a pay hike of S$258, which is nearly 20 percent increase from the recommended salary of S$1,312 in 2022.Commenting about the PWM, Mr Lim said it is will affect the salary structures of about 30,000 workers.“This new policy specifies different wage progression paths for different categories. By 2028, the lowest-wage category will have a gross pay of S$2,420, which will be above the #workersparty universal minimum wage (MW) call of S$1,300 take-home full-time equivalent,” the MP noted.However, he expressed that his main issue with the PWM is on how slow it has been rolled-out, as well as its lack of guarantee that the minimum wage of those in the lowest-wage sector/category will hit the S$1,300 take-home amount.“In other words, we should get the minimum wage bit of the so-called minimum wage-plus (MW+) model—what Senior Minister Tharman called the PWM—right. Then tinker with productivity ladders, increments, whatnot. Don’t let the perfect be the enemy of the good.“So, I view this implementation of PWM as substantial progress (no pun intended) that will improve the welfare of Singaporeans and Permanent Residents. This, of course, has been the premise behind fighting for minimum wages all along,” stated Mr Lim.If that’s not all, the progressive salary increment of cleaners would also mean that other prices will go up, said the alternative party member.“From a town council perspective, future contract bids will be higher, which could affect town council finances and impact S&CC charges (fortunately, we are locked into contracts for around 3/4 #SengkangGRC divisions),” he explained.But, this is a good thing for the society because minimum wages help “correct imbalances in employer-employee bargaining power”, the politician said.“The small increase in prices that everyone pays vastly improves the lives of low wage, essential workers. Moreover, higher prices can beget quality. We often think of how, if workers raise their productivity, this will beget higher wages. But it could happen the other way round: when wages rise, it spurs investments that foster productivity, which in turn boosts quality,” he expressed.He continued, “I hope that we can implement the MW+ model to even more sectors, and phase in changes more quickly. Still, we should recognize this policy move for what it is: a genuine step in the right direction, along the lines of what the #workersparty has sought. #makingyourvotecount.” © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/10/wps-jamus-lim-says-progressive-wage-model-is-a-substantial-progress-to-improve-welfare-of-locals-cautions-other-prices-will-increase/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}