{"Type": "", "Time": "2021-06-12", "Headline": "'I can't meet my friends with benefits': Singaporeans spill about their sex lives during Phase 2 (Heightened Alert) , Lifestyle News - AsiaOne", "Text": "With schools moving to home-based learning, the dining-in prohibition, and social gatherings being capped at two people during Phase 2 (Heightened Alert), we've had fewer reasons to head out and more reasons to stay in.But has this led to more couples getting it on? Going off all the condom hoarding going on during last year's circuit breaker period, you might expect a spike in bedroom activity this time around too.Well, according to a straw poll conducted by AsiaOne of 16 sexually active adults between the ages of 18 and 44, that might not necessarily be the case — only 12 respondents said that they are still sexually active during this period. Of those who are sexually active, though, some have seen an improvement in their sex lives thanks to a surge in sexual activity.  One such individual is Damien*, who went from having sex once a week to getting at it daily.Attributing the change in behaviour to \"boredom\", Damien shared that in general, he has a neutral stance towards sex and does not feel like it is a crucial factor in the relationship. But with the increase in sex, his relationship with his partner has become stronger during this period, he said. [[nid:529380]]Another respondent whose sex life has improved is Sharon*, who feels like the pandemic has given her more opportunities to spend time with her partner.She shared that to her, sex is \"essential and intimate, as it's something you only share with someone you're in a relationship with\".Overall, the amount of sex she has with her partner hasn't changed and they're still doing it around twice a week. However, she said that with \"less face-to-face work and social obligations\", they have \"more time to focus on each other\", which translates to better sex.Unfortunately, not everyone shares the same sentiments. Around a quarter of our respondents noted deterioration in their sex lives ever since Phase 2 (Heightened Alert) kicked in.One such individual is Jazymn*, who cites her hectic work schedule and rising stress levels as a reason. While she and her partner still are sexually active, their quality of sex has dropped thanks to the stressors brought on by the pandemic.And couples aren't the only ones who are struggling. Lisa*, who is not in a relationship, told us that the pandemic has affected her sex life too.To her, sex is all about the \"fun and pleasure\". Prior to Phase 2 (Heightened Alert), she would have sex around thrice a week with her friends with benefits. Sadly, when the new restrictions kicked in, this meant less sex for her.\"I can't meet my friends with benefits as much,\" she said.While having less sex has left some of our respondents unsatisfied, others are pretty chill about the situation.Singles like H* and WN* don't think of sex as a huge priority and to H, \"sex is just a way to relieve stress\", so he isn't too fussed about how often he gets to engage in the act.For him, it all depends on \"the availabilities of [his] friends with benefits\".When asked about how his sex life has been affected during Phase 2 (Heightened Alert), WN, who is single, simply said: \"It depends on who I manage to get.\" And for some, the physical connection isn't the only thing that has gone through changes during this period — the emotional aspect of the relationship feels different too.[[nid:524562]]Take Felicia*, for example. She told us she still has sex with her partner once a week, and overall, their sex life has remained pretty much the same. However, when it comes to the emotional part of their relationship, she feels that the pandemic has actually helped to improve their connection and they've \"become closer\".Bob* is another individual who said that spending more time at home has not changed the amount of sex he gets, and he still does so once a week.However, his situation is quite the opposite of Felicia's.\"Spending more time together than usual results in more opportunities but less excitement,\" he admitted.Apart from that, there are other issues for him to deal with.\"My 'working spouse' appears to be a different person,\" he confessed when asked about how the pandemic has affected his relationship.But at the end of the day, it all boils down to adapting to the new norm and riding through these hard times.One such couple who have managed to do so is Nicholas* and his girlfriend. While they now have fewer opportunities to meet and spend time together, the decrease in sex does not bother them whatsoever.Instead, they make up for the lack of physical intimacy by gaming and meeting more often online.In these extraordinary, fluid times where things are always changing, it's important to be able to react and adapt to new and different situations. While it definitely isn't easy, it's heartening to know that we're not alone.*Not their real namesmelissateo@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/lifestyle/i-cant-meet-my-friends-benefits-singaporeans-spill-about-their-sex-lives-during-phase-2", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}