{"Type": "Singapore", "Time": "2021-06-12", "Headline": "Working from home to remain as default; Jobs Support Scheme extended for certain sectors", "Text": "SINGAPORE: Working from home will remain the default arrangement, even as Singapore transitions to Phase 3 (Heightened Alert) in the coming weeks.“Employers should ensure that employees who are able to work from home continue to do so,\" said co-chair of the COVID-19 multi-ministry task force Lawrence Wong on Thursday's (Jun 10) press conference.“We think that’s still necessary in order to minimise movement and to minimise risk,” he said.Companies should continue to stagger start times of employees and implement flexible working hours, said Mr Wong, who is also the Finance Minister.Workers also should not be cross-deployed to multiple worksites, added the Ministry of Health (MOH) in a press release on Thursday.The Government announced on May 14 thatworking from home will become the default for workplacesafter a spike in COVID-19 community infections. It was part of a slew of measures under Phase 2 (Heightened Alert) aimed at bringing down the number of cases.On when people will be allowed to resume working from offices, Mr Wong said on Thursday that authorities will take a \"phased approach\".\"The embers are still there, we do not want to encourage too much movement. We resume activities progressively but we do not want everything to happen all at the same time,\" he said.The Government will monitor the situation over the coming weeks, the minister said. Should cases remain \"generally low and under control\", vaccination rates rise and a \"good and comprehensive testing regime\" is in place, it may reconsider its position on working from home, he added.JOBS SUPPORT SCHEME EXTENDEDThe Jobs Support Scheme (JSS), which subsidies local workers' salaries, will be extended for certain sectors that are required to remain closed until Jun 20, said Mr Wong.This is part of the staggered reopening under Phase 3 (Heightened Alert), where some sectors will not be allowed to reopen until Jun 21.They will receive 10 per cent JSS support from Jun 21 to Jun 30.Activities reopening on Jun 21 include dining-in at F&B establishments, live performances, mask-off sports activities at gyms and fitness studios and in-person tuition and enrichment classes.For taxi and private-hire drivers, the COVID-19 Driver Relief Fund will be extended for three more months at S$300 per month per vehicle for two months and S$150 for per vehicle for the next one month.The continued support adds up to S$40 million and will help more than 50,000 taxi and private hire car drivers, said the Land Transport Authority. On top of this, taxi operators have pledged to continue providing rental waivers of at least S$12 million during this three-month extension of the support scheme.REGULAR TESTING FOR STAFF IN UNMASKED ACTIVITIESPeople who work in high-risk settings with unmasked customers will have to undergo regular COVID-19 testing, regardless of their vaccination status.This includes staff of dine-in F&B outlets, personal care and appearance services that require removal of masks such as facials, saunas and make-up services, and gym and fitness studios where clients are unmasked.Mandatory tests will be progressively rolled out to larger establishments first and extended to smaller businesses after. For dine-in F&B outlets, testing will be rolled out starting from next month.The capacity for the Fast and Easy Testing regime will be \"aggressively ramped up\" in the coming months, MOH said. Tests such as the antigen rapid test will be used.The cost of the tests will be covered by the Government for the next three months, said Mr Wong. This is in view of the heightened alert period and that people, especially those in high-risk settings, are tested frequently, he said.\"Beyond that, I think employers themselves will have to start thinking about incorporating these processes as part of their business continuity plans,\" he said.More details of the mandatory testing will be announced later, the Health Ministry said.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,Jobs Support Scheme,WFH", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/work-from-home-wfh-default-jss-extended-phase-3-heightened-alert-14986174", "Source": "google"}