{"Type": "Singapore", "Time": "2021-06-12", "Headline": "Man jailed for attacking wife after she rejected his request for a sexual favour", "Text": "SINGAPORE: A man was jailed two weeks on Friday (Jun 11) for assaulting his wife after she rejected his request for a sexual favour.Calvin Kok Chong Meng, 32, pleaded guilty to one charge of committing family violence against his wife when she had a personal protection order against him.A second charge of voluntarily causing hurt to his wife was taken into consideration.The court heard that the victim had obtained a personal protection order against Kok on Jan 18, 2017 after he hit her.On Mar 17, 2021, Kok had a couple of alcoholic drinks after returning home from work at around 11.30pm.At about midnight, he went into the room where his wife was sleeping and asked her for a sexual favour.When his wife rejected him, he got upset and began hitting her, according to court documents.The victim was underneath the blanket on the bed when Kok began slapping her several times on her thighs and arms.That same day, the victim sought medical attention for her multiple bruises, which included bruising over her head, face, neck, arms and thighs. She also lodged a police report.The prosecutor asked for two weeks' jail, noting that Kok's wife has since forgiven him and they are going for matrimonial counselling.Kok, who did not have a lawyer, requested for a lighter sentence with no jail, saying he would lose his job if he was imprisoned.He said he needed the job to support his family, including his daughter and grandmother. He asked for a chance to turn over a new leaf and said his wife was in court to mitigate for him if need be.The judge responded: \"Yes, but she was not willing to be intimate and you were violent towards her.\"She added that the High Court has indicated that jail terms must be imposed for cases like Kok's. Kok replied that he understood and promised not to reoffend in the future.For breaching a protection order, he could have been jailed up to six months, fined up to S$2,000, or both.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "court,crime,domestic violence", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/man-jailed-attacking-wife-after-refused-sexual-request-14992964", "Source": "google"}