{"Type": "", "Time": "2021-06-12", "Headline": "Ion Orchard to close for 4 days from June 12 due to Covid-19 cases; visitors to mall to get free swab tests, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Ion Orchard will be shut for four days from Saturday (June 12) for cleaning and disinfecting works after the Ministry of Health (MOH) confirmed a number of Covid-19 cases linked to the shopping mall.It is the first mall in the popular Orchard Road shopping belt to do so amid the pandemic. The mall will be closed from 7am on Saturday till 7am on Wednesday.On Friday, MOH reported that a 57-year-old woman who works as a promoter at Guardian in Ion Orchard had tested positive for Covid-19. Currently an unlinked case, she is the third worker at Ion Orchard to test positive for the virus, prompting MOH to close the mall until June 16.The other two cases linked to the mall are a retail assistant who works at the Four Leaves outlet there and a repair worker at Grandwork Interior.Ion Orchard confirmed that it was notified by the authorities to close for four days in light of the recent rise in Covid-19 cases. During the closure, the mall will carry out deep cleansing and disinfection of its premises in line with guidelines issued by the authorities.\"During this period, shoppers or members of the public will not be allowed to enter the mall,\" it said.However, both Ion Orchard Link and Ion Paterson Link, which are underground pedestrian networks, will remain accessible round the clock.Epidemiological investigations indicate ongoing transmission within the mall, according to a notice to tenants on Friday.MOH said special testing operations will be conducted for staff who had been working at the mall from May 28 to disrupt any undetected community transmission.Members of the public who had visited the shops or used the services and facilities at Ion from June 3 to Friday will also be offered free Covid-19 testing.Those who had only walked through the mall to connect to neighbouring buildings or Orchard MRT station need not be tested.The ministry said shoppers who visited the mall from June 3 to June 11 should monitor their health closely and minimise social interactions as far as possible, for two weeks from their date of visit. They are also encouraged to see a doctor immediately if they feel unwell.\nBoth Ion Orchard Link and Ion Paterson Link, which are underground pedestrian networks, will remain accessible round the clock. ST PHOTO: GIN TAY\n\nStaff were seen packing up at shops in Ion Orchard on Friday (June 11) evening. PHOTO: LIANHE ZAOBAO\nIon Orchard told The Straits Times it has implemented various cleaning measures since the coronavirus outbreak started. These include increasing the frequency of cleaning and disinfecting of key touch points in the mall's common areas such as lift buttons, hand-rails and auto-door panels. Hand sanitisers are also provided at the mall entrances, lifts and concierge counters.\"The safety and well-being of our shoppers, visitors, and working communities are of utmost importance to us. We will continue to monitor the situation and work closely with the authorities on the necessary precautionary measures,\" said the mall.\"For the period of the mall closure, our tenants will receive the necessary support, including rental waivers, to help them ride through this period.\"Tenants have up to 6pm on Saturday to remove the stocks from their store.Mr James Quan, who owns leather goods store Bynd Artisan, was informed of the closure at about 5pm on Friday. The 53-year-old was told that testing for the staff would be done in the mall's carpark.\"I think this is the right thing to do, to make sure that safety comes first and ensure that the coast is clear,\" he said. \"So I think it's better to just close for four days and hope everything will return to normal on June 16.\"Read the full MOH press release here.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/ion-orchard-to-be-closed-for-four-days-for-cleaning-disinfecting-works", "Source": "google"}