{"Type": "CommentaryCommentary", "Time": "2021-06-12", "Headline": "Commentary: The merits of Singapore’s new carbon trading marketplace", "Text": "Climate Impact X is a welcome addition to the country’s climate action initiatives that provide new economic opportunities, help price discovery and can aid future compliance, say energy researchers.SINGAPORE: Singapore took another big step in advancing the green agenda last month.The country on May 20 announced plans to position itself as a hub for carbon services.Climate Impact X (CIX) is a joint venture between the Development Bank of Singapore, Singapore Exchange, Standard Chartered Bank and Temasek Holdings.First envisioned by the Emerging Stronger Taskforce’s Alliance for Action on Sustainability, CIX will provide a marketplace for trading carbon credits commencing in late 2021.Singapore is well-suited to hosting a carbon marketplace. It is an ideal base for multinational companies working on projects that generate emission credits across the region.As a regional leader for commodities trading, Singapore also deals with many energy majors and traders who will form a large part of the clientele for carbon market ancillary services.There are already around 30 firms here offering carbon consulting services, which include low-carbon project development, consulting and verification for the registration of certified emissions-reduction credits, carbon footprint measurement, project financing and legal services.The launch of a carbon marketplace can attract more of such consultancies in a key growth industry.(What will CIX bring to the table of carbon trading and climate action? Find out on The Climate Conversations.)A WELCOME ADDITION TO SINGAPORE’S CLIMATE ACTION INITIATIVESCIX is a welcome addition to the suite of emission-cutting initiatives and institutions in Singapore that helps the country accelerate its peak and net-zero emissions timelines.Under the Paris Agreement, Singapore’snationally determined contributionis to peak emissions at 65 million tonnes of carbon dioxide equivalent around 2030. Singapore also seeks to halve peak emissions to 33 million tonnes by 2050 and achieve net zero emissions as soon as viable during the second half of the century.A key innovation of CIX includes provisions for trading nature-based solutions.It looks like the email address you entered is not valid.Nature-based climate solutions like mangroves, wetlands and forests can absorb vast amounts of carbon dioxide from the atmosphere.A recent study by researchers at the NUS Centre for Nature-Based Climate Solutions estimates reforestation in Southeast Asia can contribute to 3.4 gigatonnes of carbon dioxide emissions reductions per year. Reforestation, coupled with supply chain transparency and harmonised standards for carbon offsets, can translate into a ready source of carbon credits.As an exchange focused on such carbon credits, CIX will enhance the climate finance ecosystem within Singapore and expand the range of mechanisms for firms to manage and price their carbon externalities. Google, Microsoft and Amazon are said to be in talks to use CIX in their journey to become net-zero emitters.Moreover, it offers another way for Singapore to widen the international scope of its environmental management activities.THE RIGHT PRICE FOR CARBONCIX can aid with the adjustment of Singapore’s carbon tax – which came into effect in January 2019 – by expanding the array of tools used for pricing carbon in Singapore.This will permit the Singapore Government some freedom when discussing future, probably upward revision to the current tax, since local firms will have the ability to defray their “carbon costs” in other ways.The current tax rate of S$5 per tonne of CO2 can be contested for three reasons. First, the abatement costs are typically considered much higher, and ideally, carbon price would reflect the cost of abatement. A World Bank report published in May notes that a price of US$40 to US$80 (S$50 to S$100) per tonne of CO2 is needed to meet the 2 degrees Celsius goal.Second, the S$5 price tag might not fully capture carbon embedded in international supply chains and trade.This has spurred debate around the need for carbon border adjustment mechanisms – a tool for ensuring that domestic and imported goods price their embodied emissions equally, thereby discouraging trade with high-polluting countries that do not have effective carbon pricing mechanisms of their own.Third, Singapore’s carbon pricing is arguably not a sufficiently liquid mechanism because it changes infrequently.The Government has plans to increase the tax rate to between S$10 and S$15 per tonne by 2030. The tax level and trajectory post-2023 will be reviewed by 2022, in consultation with industry and expert groups in order to give businesses and opportunity to adjust to changes.There is wisdom in introducing market-based mechanisms to facilitate the price discovery process and allow emissions to be priced into commercial decisions.In the absence of such a mechanism, finding the right price for carbon is complex. It requires striking a balance between reducing the carbon footprint of industries and increasing the costs of doing business, which may negatively impact the competitiveness of Singapore’s economy.However, with the pandemic still evolving, the success of Singapore’s carbon services hub should not be assumed. Increased and quantifiable demand for carbon offsets also suggest an upward trend in emissions-intensive activities in the near term.GETTING COMPANIES TO PLAY BALLThe CIX is also a first step to getting companies to play ball on Singapore’s climate obligations.Demand for carbon offsets could arise from several sources. Companies currently paying carbon taxes may purchase credits to defray their carbon tax liability.Similarly, firms or other speculators may purchase credits to trade later for a premium, should this be allowed under the Carbon Pricing Act.Retail trade from individuals seeking socially responsible investment options can also be expected.Yet Singapore must not forget there are no industry-level mandatory reduction targets. Many carbon commitments by corporations in the region are currently voluntary, which may limit market participation.Regulation can steward strong market participation. With rapid global expansion of climate finance, compliance concerns have also grown because of “greenwash” – when companies over-inflate the environmental credentials of their projects.The devil is in the details. Regulators must provide robust mechanisms for project verification, monitoring and compliance enforcement not only to prevent greenwash, but also to ensure fair benchmarking across all projects.This could be industry initiated, where carbon credit and offset suppliers commit to co-develop and implement greenhouse gas quantification and reporting methodologies for their respective sectors. Regulators will then be able to assess the methodologies that improve transparency in carbon credit transactions.Having recognised the complexity of scaling up global carbon markets, the Global Institute on Finance’s Taskforce on Scaling Voluntary Carbon Markets has launched a consultation on creating “high-integrity” markets, due to end in late June. It seeks to establish “a threshold standard for high-quality credits, clear legal standards and uniting existing, fragmented carbon credit markets in one impactful, well-run system”.To ensure the integrity and quality of its credits, CIX will work with global partners including the Taskforce on Scaling Voluntary Carbon Markets and the Natural Climate Solutions Alliance.It will also use cutting-edge data analytics, such as satellite monitoring, machine learning and blockchain technology to ensure the environmental integrity of credits traded on CIX.Global rating agencies might be roped in to provide independent environmental ratings for nature-based projects which will issue carbon credits.It is important Singapore provides a well-run and trusted market for carbon offsets while expanding emissions-reduction efforts.However, to meet its own national targets, companies must ultimately commit to less carbon-intensive production models and not simply “pay to play” by exploiting offsets.Melissa Low is Research Fellow at the Energy Studies Institute, National University of Singapore. David Broadstock is Senior Research Fellow and Lead Energy Economist at the same institute.", "Section": "", "Writers": "", "MainKeyWord": "carbon market,carbon tax,emissions,climate change", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/commentary/climate-impact-x-carbon-market-trade-credits-offset-tax-net-zero-14986396", "Source": "google"}