{"Type": "", "Time": "2021-06-12", "Headline": "'It was completely black inside': Humpback whale gulps and spits out US fisherman, United States News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.NEW YORK (AFP) - It sounds like a real-life take on \"Pinocchio\" - a US lobster fisherman says he was scooped into the mouth of a humpback whale Friday (June 11) and yet lived to tell the story.\"I was in his closed mouth for about 30 to 40 seconds before he rose to the surface and spit me out,\" Michael Packard wrote on Facebook hours after his brush with the depths.\"A humpback whale tried to eat me,\" he added. \"I am very bruised up but have no broken bones.\" Packard's beyond-belief big fish yarn began, he told local paper Cape Cod Times, when he was diving for lobster off the coast of the northeastern state of Massachusetts.\"All of a sudden, I felt this huge shove and the next thing I knew it was completely black,\" he said after being released from the hospital.He was about 35 feet down (10m) and his first thought was that he had been attacked by a shark, but the lack of teeth and obvious wounds made him reconsider.Packard said he began to struggle - but unlike in the classic children's tale \"Pinocchio\" there was no need to build a fire to secure his escape.\"I saw light, and he started throwing his head side-to-side and the next thing I knew I was outside (in the water),\" Packard told the paper.The story says Packard's fishing mate Josiah Mayo \"saw the explosion of water as the whale surfaced and Packard was ejected,\" but doesn't include any quotes attributed to him.Jooke Robbins, director of humpback whale studies at the Center for Coastal Studies in Provincetown, Massachusetts, said she had no reason to doubt the account.\"I didn't think it was a hoax because I knew the people involved... So I have every reason to believe that what they say is true,\" she told AFP.Robbins said she had never heard of an \"accident\" of this type, but \"it may be that he (Packard) was just in the wrong place at the wrong time.\" \"When they (whales) fish... they rush forward, open their mouth and engulf the fish and the water very quickly,\" she said, adding they have large mouths, but throats so narrow they wouldn't be able to swallow a human.The whale, which according to Mayo's description was on the young side, \"may not be able to detect quickly enough that something is in the way.\" Even if all the details weren't yet known, one thing was clear for Robbins: \"It is important for people to be quite aware... And when they see a whale, keep a good distance. It's really important to give whales their space.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/united-states/whale-of-a-tale-us-fisherman-says-swallowed-by-humpback", "Source": "google"}