{"Type": "", "Time": "2021-06-12", "Headline": "Live shows, wedding solemnisations, worship services to be capped at 250 people with pre-event Covid-19 testing, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Live performances, wedding solemnisations, and congregational and other worship services will be capped at 250 people with pre-event testing from Monday (June 14), up from 100 people under the current restrictions.The cap remains at 50 people without pre-event testing, and those who are fully vaccinated will be exempt from pre-event testing, said the Ministry of Culture, Community and Youth in a statement on Friday (June 11) .Here are the details:From June 14, congregational and other worship services will be capped at 250 persons with pre-event testing (PET), and up to 50 persons without PET.Individuals who are fully vaccinated - meaning, two weeks after receiving the second dose of the Pfizer or Moderna vaccine - are exempt from PET.For services with more than 50 worshippers, they must be segregated into zones of no more than 50 each.Worshippers can participate in permitted religious activities in groups of no more than five people, up from the two previously.From June 21, a maximum of 30 persons are allowed to be involved in or support the conduct of live performance elements during the worship service. Of these, up to 10 persons are allowed to unmask at any given time, with up to five persons unmasked for singing or playing of wind or brass instruments.Persons should unmask only when required to perform their duties.Singing by worshippers, even with masks on, is still not permitted during phase three (heightened alert).From June 21, religious organisations may use places of worship to conduct religious rites and resume other religious activities (for example, pastoral services and religious classes for adults and children) so long as they are conducted in gatherings not exceeding 50 persons, subject to safe distancing and other safe management measures appropriate to the nature of the religious activity.This is also subject to the total premises cap of 150 persons.From June 14, the audience for live performances will be capped at 250 people with PET, and up to 50 persons without PET.Individuals who are fully vaccinated are exempt from PET.All performers must continue to be properly masked at all times on stage.From June 21, performers will be allowed to unmask on stage, including for singing and the playing of wind instruments.A maximum of 30 performers and crew will be allowed on stage and backstage at any given time, with a maximum of 10 unmasked performers. Of the 10 unmasked performers, a maximum of five can be unmasked for singing and playing of instruments that require intentional expulsion of air.From June 14, marriage solemnisations may take place in places of worship with up to 250 persons with PET, or up to 50 persons without PET, subject to safe capacity limits.Individuals who are fully vaccinated are exempt from PET.The cap excludes the solemniser and religious and supporting workers, though the numbers of these workers involved should be kept to a minimum.From June 21, in-person tuition and enrichment classes for participants aged 18 and below, and classes in singing and wind instruments, may resume.Unmasking will be allowed in classes for dance, singing, wind instruments, voice training, and speech and drama, subject to prevailing safe management measures.From June 14, museums can operate at a reduced capacity of 50 per cent. Tours within museum premises may be conducted for a maximum group size of 20 persons (excluding guide), with up to five persons allowed in any one sub-group. A 1m safe distance should be maintained between sub-groups.From June 21, limits on performers and crew at recordings of digital productions and their associated rehearsals will be raised.A maximum of 30 performers and crew are allowed on stage and backstage at any given time.This includes a maximum of 10 performers who can be unmasked at any given time. Of the 10 unmasked performers, no more than five may sing or play wind instruments at any given time.Arts and cultural organisations will no longer need to notify the National Arts Council and the Infocomm Media Development Authority of their plans before proceeding with their digital productions and associated rehearsals if they adhere to these safe management measures.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/live-shows-wedding-solemnisations-worship-services-to-be-capped-at-250-people-with-pre", "Source": "google"}