{"Type": "", "Time": "2021-06-12", "Headline": "Zoe Tay gifts bras to local female celebs and this is Stefanie Sun's reply, Entertainment News - AsiaOne", "Text": "[UPDATE: June 12]Article updated with Zoe Tay's response. Gift shopping for friends is usually a tricky business. You want it to be personal, but also thoughtful and practical.Well, local actress Zoe Tay has probably given one of the best gifts of all — bras.No joke, the Mediacorp Ah Jie sent a care package to two of her celebrity friends, Sharon Au and local songbird Stefanie Sun.The care package came with some bras, along with six bottles of fabric perfumes. The contents were shared on Instagram Stories by both celebrities and Stefanie had a rather cheeky response.The 42-year-old wrote: \"A sudden sweet surprise arrived. Ah Jie, you really think too highly of (my size) hor.\"As for Sharon, who is back in Singapore till August and is currently serving out her quarantine at an Orchard Road hotel, she recalled her rookie days in showbiz and how Zoe looked out for her.She shared: \"When I was a rookie in the industry and had to interview Zoe, she knew I was nervous and made extra effort to be affable and reassuring. Now I'm all grown up and she continues to care and encourage. \"This is why she is our Ah Jie forever. Thank you for the surprise Zoe.\"Sharon, 45, also previously shared that Zoe's presence at the hotel when she came to deliver the gift and some food caused quite the commotion.Based on the Instagram tags from the celebrities, it seems that the lingerie might have come from Amanda Fashion Gallery while the perfumes are from F'Diary.We reached out to Zoe's manager for clarification, and Zoe said she is not the brands' ambassador and is only supporting a friend's business.ALSO READ: Sharon Au's serving quarantine at Orchard hotel, Zoe Tay causes 'commotion' after sending food to herbryanlim@asiaone.com", "Section": "", "Writers": "", "URL": "http://www.asiaone.com/entertainment/zoe-tay-gifts-bras-local-female-celebs-and-stefanie-suns-reply", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}