{"Type": "", "Time": "2021-06-12", "Headline": "Singapore and Australia set to work towards travel bubble, Latest Singapore News - The New Paper", "Text": "Singapore and Australia will work towards an air travel bubble, and both nations will lay the groundwork for resuming two-way travel in a safe and calibrated manner, said the prime ministers of both countries yesterday.They also hoped that students from Singapore could be the first to travel under a pilot arrangement so that they can continue their studies, which have been disrupted by Covid-19 travel restrictions, before a full travel bubble is in place.The leaders were speaking to reporters after Prime Minister Lee Hsien Loong met his Australian counterpart Scott Morrison at the Istana for the sixth Australia-Singapore Annual Leaders' Meeting.This is the first official visit by a foreign leader to Singapore since the start of the Covid-19 pandemic, and Mr Morrison's second stop after New Zealand last month.At a joint press conference after their meeting, PM Lee said they discussed the fight against Covid-19 and resuming travel between the two countries.\"We discussed how two-way travel between Singapore and Australia can eventually resume, in a safe and calibrated manner, when both sides are ready,\" he said.PM Lee added that there is a need to prepare the infrastructure and processes for such travel.He said: \"It starts with mutual recognition of health and vaccination certificates, possibly in a digital form. When all the preparations are ready, then we can start small with an air travel bubble to build confidence on both sides.\"Echoing PM Lee, Mr Morrison said that while there is some time before Singapore and Australia can open up the air travel bubble, the two countries are working on putting systems in place to do so.The leaders also acknowledged the importance of open borders to post-pandemic recovery.On students getting the first opportunity to travel, they said such a move could be a good opportunity to test the systems, before widening travel.Mr Morrison said: \"We really do want to focus on those students coming, as a first wave, a first tranche - as part of the exercise of piloting how these systems can work most effectively when we get to the next phase.\"PM Lee said he raised this matter with Mr Morrison specifically because \"quite a number\" of Singaporeans study in Australia and there is urgency for them to go back to school, especially for those who have secured clinical attachments or postings.Mr Morrison said Singapore is the first country outside of New Zealand that Australia would wish to engage in a travel bubble with.\"And we want to get it right in Singapore, which we know we can do because of the very sophisticated systems that Singapore has,\" he added.PM Lee noted that Australia and Singapore have similar approaches to keeping the virus out of their populations and keeping their people safe.Both countries also strongly supported each other during the early stages of the pandemic.Get The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/singapore-and-australia-set-work-towards-travel-bubble", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}