{"Type": "", "Time": "2021-06-12", "Headline": "2 eateries closed, 77 park users fined for Covid-19 breaches as enforcement stepped up, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Two food and beverage establishments have been ordered to close after breaching safe management measures.Steamov Steamboat Buffet Restaurant in Beach Road will be closed for 30 days and The Starz Bistro in East Coast Road for 10 days, said the Ministry of Sustainability and the Environment (MSE) on Friday (June 11).Meanwhile, 77 people have been fined for breaching safe management measures (SMMs) in parks under tightened Covid-19 rules that came into effect on May 16. The curbs will gradually ease starting on June 14.Two retail outlets - Giant Supermarket at Bedok Shopping Complex and Cold Storage Supermarket at condominium Siglap V near East Coast Road - have been fined $1,000 each for not having staff to oversee their safe entry checkpoints.With dining in slated to resume from June 21, government agencies will step up enforcement at F&B establishments and take firm action against any breaches of Covid-19 rules, said the MSE.Such breaches include the failure to maintain a 1m safe distance between groups and to prevent them from intermingling, allowing group sizes larger than five people, serving and allowing the consumption of alcohol after 10.30pm, and providing live entertainment and games.\"Enforcement actions will include fines, closures even for first offence, and the revoking of food shop, public entertainment or liquor licences,\" said the ministry.It reminded patrons and operators of F&B establishments to strictly adhere to safe management measures as these places are high-risk settings where coronavirus transmission has taken place in recent weeks.MSE also said the National Parks Board will continue to temporarily close access to some parks and sections of beaches, lawns and facilities - such as hardcourts, shelters and carparks - when these areas get too crowded or where people remain non-compliant with safe management measures.NParks has advised  compliance with safe management measures on more than 6,000 instances to parkgoers who were not wearing masks, and on more than 800 occasions to people who had gathered in groups of more than two, added the ministry. These were verbally given by enforcement officers.The latest breach is Steamov Steamboat Buffet Restaurant's third offence. It had allowed customers to dine there at 9.30pm on May 28.The Starz Bistro had done so on May 22, and also allowed customers to consume alcohol after 10.30pm that day.MSE said the closure orders for both eateries will take effect when dining in is allowed to resume.It said that agencies have identified places where safe management measures are more frequently breached and have stepped up enforcement presence there.These hot spots includes parks and common areas of Housing Board estates such as hardcourts, basketball courts and pavilions.\"Where repeated breaches of SMMs have been observed, agencies will close off facilities to ensure the safety of the community,\" added the ministry.For example, a pavilion at Block 90 Pipit Road was cordoned off on May 31 after a group of more than 12 people were found gathering there for dance sessions on multiple occasions.\"We therefore urge members of the public to use these facilities responsibly,\" said MSE.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/2-eateries-closed-77-park-users-fined-for-covid-19-breaches-as-authorities-step-up", "Source": "google"}