{"Type": "Singapore", "Time": "2021-06-12", "Headline": "Door-to-door salesman who stole woman's S$200 bikini hanging outside flat gets fine", "Text": "SINGAPORE: A door-to-door salesman who stole a woman's S$200 bikini that was left outside her flat to dry was fined S$1,000 on Friday (Jun 11).Joash Kuan Yao Wei, 25, who has since quit his job, pleaded guilty to one count of theft. A second charge of possessing six bras and seven tank tops suspected to be stolen was taken into consideration.The court heard that Kuan was going door to door at an HDB block in Pasir Ris carrying out sales promotions at about 7pm on Oct 22, 2020.He went to the victim's home on the second floor and rang the doorbell several times. While doing so, he saw a bikini hanging on a bamboo pole outside the flat and formed the intention to steal it, said the prosecutor.As there was no response from the unit, Kuan took the black bikini and left. However, the victim, a 41-year-old woman, saw him take the bikini through the peephole of her door.She opened the door and shouted at him to stop, the court heard. Kuan stopped but threw the bikini at a nearby staircase before returning to the victim's flat.The victim later found her bikini and called the police. He was arrested and other stolen items were found in his Ang Mo Kio flat, including six bras and several tank tops.The prosecutor asked for a fine and said Kuan has no previous convictions.When the judge asked Kuan why he stole those things, he replied: \"Uh, why did I steal? I stole because got the urge to.\"\"Are you seeing any professional for help with regard to your urge to steal this?\" asked the judge.Kuan said he was not, but intends to. He added that he has quit his sales job and is currently doing odd jobs.He could have been jailed up to three years and fined for theft.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "court,crime", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/salesman-stole-woman-bikini-court-14993588", "Source": "google"}