{"Type": "Asia", "Time": "2021-06-12", "Headline": "Indian state sharply raises COVID-19 death toll prompting call for wide review", "Text": "BENGALURU: An Indian state has raised its COVID-19 death toll sharply higher after the discovery of thousands of unreported cases, lending weight to suspicion that India's overall death tally is significantly more than the official figure.Indian hospitals ran out of beds and life-saving oxygen during a devastating second wave of coronavirus in April and May and people died in parking lots outside hospitals and at their homes.Many of those deaths were not recorded in COVID-19 tallies, doctors and health experts say.India has the second-highest tally of COVID-19 infections in the world after the United States, with 29.2 million cases and 359,676 deaths, according to health ministry data.But the discovery of several thousand unreported deaths in the state of Bihar has raised suspicion that many more coronavirus victims have not been included in official figures.The health department in Bihar, one of India's poorest states, revised its total COVID-19 related death toll to more than 9,429 from about 5,424 on Wednesday.The newly reported deaths had occurred last month and state officials were investigating the lapse, a district health official said, blaming the oversight on private hospitals.\"These deaths occurred 15 days ago and were only uploaded now in the government portal. Action will be taken against some of the private hospitals,\" said the official, who declined to be identified as he is not authorised to speak to the media.Health experts say they believe both coronavirus infections and deaths are being significantly under-counted across the country partly because test facilities are rare in rural areas, where two-thirds of Indians live, and hospitals are few and far between.Many people have fallen ill and died at home without being tested for the coronavirus.\"WIDESPREAD PROBLEM\"As crematoriums struggled to handle the wave of deaths over the past two months, many families placed bodies in the holy Ganges river or buried them in shallow graves on its sandbanks.Those people would likely not have been registered as COVID-19 victims.\"Under-reporting is a widespread problem, not necessarily deliberate, often because of inadequacies,\" Rajib Dasgupta, head of the Centre of Social Medicine and Community Health at New Delhi's Jawaharlal Nehru University, told Reuters.\"In the rural context, whatever states may say or claim, testing is not simple, easy or accessible,\" Dasgupta said.Overall, India's cases and deaths have fallen steadily in the past weeks after a surge from mid-March.The official total of cases stood at 29.2 million on Thursday after rising by 94,052 in the previous 24 hours, while total fatalities were at 359,676, according to data from the health ministry.The New York Times estimated deaths based on death counts over time and infection fatality rates and put India's toll at 600,000 to 1.6 million.The government dismissed those estimates as exaggerated. But the main opposition Congress party said that other states must follow Bihar's example and conduct a review of deaths over the past two months.\"This proves beyond a doubt government has been hiding COVID deaths, \" said Shama Mohamed, a spokeswoman for Congress, adding that an audit should also be ordered in the big states of Uttar Pradesh, Madhya Pradesh and Gujarat.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,India", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/india-record-covid-19-highest-deaths-revise-numbers-bihar-14985578", "Source": "google"}