{"Type": "", "Time": "2021-06-12", "Headline": "Forum: Bring forward well-deserved wage adjustments for cleaners, Forum News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.It is heartening to read that the Government has accepted the tripartite committee's proposal to increase the wages of cleaners, with a view to narrowing the income disparity between cleaners and other workers (Cleaners to see their wages increase over 6 years from 2023, June 8).However, the timeline of the wage increase does not seem to be in sync with the speed with which Covid-19 has exacted a toll on this group of workers.As we have seen, there has been a huge increase in cleaning demand since the onset of Covid-19, and many workers are deployed in high-risk areas like hospitals and the airport, where they are subject to a much higher risk of infection.While cleaners are slated to get 3 per cent annual wage increases from last year to next year under previous updates to the Progressive Wage Model, I wonder if the latest updates can be tweaked to bring forward the well-deserved wage adjustment.Otherwise, it is not obvious how the lives of these lower-wage workers are being uplifted if they have to wait for two years before they can see any significant sign of the fruit of their hard work.Karen Yip Lai KhamJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/opinion/forum/forum-bring-forward-well-deserved-wage-adjustments-for-cleaners", "Source": "google"}