{"Type": "", "Time": "2021-06-12", "Headline": "Enhanced Jobs Support Scheme to continue for sectors allowed to reopen only from June 21, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - With some sectors facing an additional week of closure up till June 20, the current enhancements to the Jobs Support Scheme (JSS) will be extended for affected businesses such as food establishments that cannot yet resume dining in.Businesses that had to suspend many, if not all, of their operations because of the tightened measures during phase two (heightened alert) were given JSS support of 50 per cent from May 16 to June 13. This will be extended till June 20, the Ministry of Health said on Thursday (June 10). The sectors affected include food establishments, gyms and sport facilities, performing arts organisations and arts education centres.They will get 10 per cent JSS support from June 21 to June 30, the ministry added. The scheme provides wage support to employers for the first $4,600 of gross monthly wages paid to each local employee.In addition, the Ministry of Finance said that selected retail outlets, museums, art galleries and historical sites, affected personal care services, cinema operators, and family entertainment centres will continue to receive 30 per cent of JSS support up till June 20. This will be reduced to 10 per cent from June 21 to June 30. The payouts will be disbursed in September.The Ministry of Finance had announced on May 28 that the additional support measures, including wage subsidies and one-off payments for individuals and rental reliefs, will cost a total of $800 million.Singapore will reopen its economy in two phases from June 14, with food and beverage establishments, gyms and fitness studios to reopen from June 21, as they have been identified as higher risk.\"These are predominantly the activities where people are engaged in interactions without their masks on,\" said Finance Minister Lawrence Wong at a multi-ministry task force on Covid-19 conference on Thursday.\"If you look at it, it's F&B, it's gyms, fitness - these are the higher-risk settings, and that's why we decided to wait for a full incubation cycle of low, stable numbers, and then we will be able to resume these activities on June 21.\"READ NEXT: Singapore to ease Covid-19 curbs and reopen in 2 phases from June 14: Everything you need to knowJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/enhanced-job-support-scheme-to-continue-for-sectors-allowed-to-reopen-only-from-june-21", "Source": "google"}