{"Type": "", "Time": "2021-06-12", "Headline": "COVID-19: Dine-in at F&B places can resume from 21 June", "Text": "SINGAPORE — Dining in at food and beverage establishments can resume from 21 June, provided the COVID-19 situation remains under control in the coming weeks, the multi-ministry taskforce (MTF) on the pandemic said on Thursday (10 June).The measure was unveiled by the MTF at a virtual media conference as it announced that Singapore will gradually move back to Phase 3 (Heightened Alert) in two steps, with one set of measures taking effect from 14 June and another from 21 June.F&B establishments are reminded to strictly observe at least one metre safe distancing between groups of diners of no more than five persons per group so as to mitigate the risk of transmission between unmasked persons, the Ministry of Health said separately in a statement.“We will be significantly stepping up enforcement and will take firmer enforcement action for any breaches. Patrons are reminded to keep their masks on at all times, except when eating or drinking,” MOH said.MTF co-chair Lawrence Wong, who is also Finance Minister, acknowledged that F&B operators would be disappointed by the prospect of having to wait one more week before they can re-open. \"I would ask all of them to make use of the one week to really go through their processes, their protocols, make sure that their restaurant layouts comply fully with the rules...because we know that these are high risk settings.\"Singapore is currently in Phase 2 (Heightened Alert) reopening, which started on 16 May and will end on 13 June.The MTF also announced the following measures taking effect from 21 June, on condition of the pandemic situation remaining under control:Wedding receptions will be allowed to resume with up to 100 attendees including the wedding couple but excluding vendors, with pre-event testing (PET) required for all attendees. For wedding receptions up to 50 attendees, PET is required only for all members of the wedding party of up to 20 attendees including the wedding couple.The unmasking and singing/playing of wind instruments for live performances will be allowed, subject to relevant safe management measures, which will be released by the National Arts Council (NAC). Singing and playing of wind instruments may also resume for live performances at congregational and worship services.Gyms and fitness studios may resume indoor mask-off sports activities, with safe distancing of at least two metres between persons and at least three metres between groups of up to five persons. Sports classes – both indoors and outdoors – will be capped at 30 persons, including the instructor, with groups of no more than five persons each. Class participants may unmask if they are engaging in strenuous activities, although they are strongly encouraged to remain masked where possible to reduce the risk of transmission. SportSG will announce more details later.In-person tuition and enrichment classes for those aged 18 and below will be allowed to resume with enhanced safe management measures. The Ministry of Education will announce more details later.Higher-risk arts and culture classes such as singing, and wind instruments will also be allowed to resume. The NAC will announce more details later.Wong told reporters that, going forward, the government would take more \"aggressive localised actions\", such as snap lockdowns, in order to avoid having to impose general nationwide restrictions like another circuit breaker. \"We think that's the way to live with the virus, while enabling most activities to resume.\" Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeOther stories:Singaporean woman, 86, dies from COVID-19; linked to TTSH clusterMan who wanted to get married in China breached SHN to appeal to ICAGurmit Singh, actor in COVID-19 jingle, fined $800 for speedingChina's quick rollout of a law against foreign sanctions has left European and American companies shocked and facing \"irreconcilable\" compliance issues, two top business groups said Friday, despite Beijing saying the move would unlikely impact investment.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Du kan få flere penge i hverdagen, hvis du samler dine lån og kreditter i et samlelån. Indsend en uforpligtende ansøgning i dag.Beijing has repeated an offer to vaccinate people from Taiwan against Covid-19, as the coronavirus continues to spread on the island. The Taiwan Affairs Office, Beijing’s main body for cross-strait affairs, on Friday said that Taiwanese who fly to mainland China can voluntarily receive Covid-19 shots as long as they meet vaccination requirements and follow outbreak control measures. “[We] urge the authorities to earnestly listen to the voices of the people on the island and remove the man-made oA Hong Kong court has barred media tycoon Jimmy Lai Chee-ying and his companies from challenging the legality of the search warrants executed in a series of raids at his offices last year and refused their applications for an injunction against the police chief. The nine plaintiffs first filed a series of private legal actions against the commissioner of police last year to recover some materials seized by officers during investigations into allegations of fraud and national security law violatiION Orchard will be closed to the public from Saturday (12 June) for four days and reopen on 16 June after three cases working at the mall were found to have COVID-19 infection.Book en prøvetur og oplev Ceed Plug-in Hybrid med plads til hele familien. Kør lydløst rundt på strøm i dagligdagen og mærk begejstringenDemocrats erupted in outrage Friday over news that Donald Trump's Justice Department secretly surveilled lawmakers probing possible collusion with Russia, reaping the phone records of top political foes in what they called an unprecedented abuse of power.China’s rocket force has conducted firing exercises involving “carrier killer” DF-26 ballistic missiles. A missile brigade under the People’s Liberation Army Rocket Force recently held launch practice in an unspecified training field at night to improve its combat ability, China National Radio reported on Tuesday. In the exercise, the brigade practised the fast transfer of missiles to another location to launch a second wave of missiles, a drill to train the brigade’s fast-response capabilities,Turns out the comic books were wrong.Bedste sikkerhed i klassen. A+ forbrug 19,2 km/l, 117-118 g/km co2. Prisen gælder indregistrering senest 30/06/2021.Agnes Chow hails from a generation of Hong Kong democracy activists who cut their teeth in politics as teenagers and are now being steadily silenced by China.A top official from the Chinese county that hosted a fatal ultramarathon last month has been found dead, authorities said Friday, as 27 people face punishment over the incident.President Vladimir Putin on Friday denied a US media report that Russia is set to deliver an advanced satellite system to Iran that will vastly improve its spying capabilities.En elektrisk tandbørste med kunstig intelligens? Oral-B har gjort din eltandbørste endnu smartere - og din tandbørstning sjovere.Singapore will begin slowly easing a month-long partial lockdown from next week after the curbs succeeded in stemming a coronavirus outbreak, authorities said Thursday.A secret society member who brutally assaulted a police officer and caused him to suffer a traumatic brain injury with help from his twin brother was jailed for two years, nine months and four weeks on Friday (11 June).China on Thursday passed a new law to counter foreign sanctions, as it looks to build its defences against rising US and EU pressure over trade and human rights.Sådan investeres i aktier på 5 minutter via din telefon.South Korea's youngest MP apologised Thursday after she provoked fury among BTS fans by using pictures of tattooed singer Jungkook to promote her campaign to liberalise the country's restrictive laws on inking.Lawyers for Huawei Technologies Co. executive Meng Wanzhou are seeking a publication ban on new evidence obtained from HSBC bank that they think will boost her Canadian court battle against extradition to the United States. They believe the material supports her claim that she is the victim of an abuse of process and she should be released, although the exact nature of the evidence has not been described. Her lawyer, Richard Peck, previously said the material, obtained as a result of a recent HoSecond Minister for Education Maliki Osman has taken to Facebook to express his shock and disappointment at alleged Islamophobic remarks made by a Ngee Ann Polytechnic (NP) lecturer.Folk født 1930-1980 søges til betalte spørgeundersThe Ministry of Health (MOH) on Thursday (10 June) confirmed 13 new COVID-19 cases in Singapore, bringing the country's total case count to 62,236.China’s nuclear arsenal is a growing threat to US security, less in its absolute size than in the growing risk of a mishap as Washington and Beijing butt heads over Taiwan and many other issues, experts told a US Congressional commission on Thursday. “Have the risks changed? Yes, it’s a more competitive US-China relationship, and the chances of a conflict over Taiwan – while I don’t believe they’re high right now, they certainly have increased,” said Phillip Saunders, director of the Centre forBlaming \"misogynistic perverts in sport and their boot lickers\", dual Olympic silver medallist Maddie Groves has pulled out of Australia's swimming trials for the Tokyo Games.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/covid-dine-in-fb-places-resume-5-per-group-21-june-mtf-074352478.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}