{"Type": "", "Time": "2021-06-12", "Headline": "Umno chief meets Malaysian King, proposes ending emergency and reconvening Parliament, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.KUALA LUMPUR - The president of Umno - the biggest party in Malaysia's ruling Perikatan Nasional (PN) government - has proposed the ongoing state of emergency come to an end in August and for Parliament to reconvene, in his audience with the King on Friday (June 11).“This is to ensure the country’s democratic system is defended,” Datuk Seri Ahmad Zahid Hamidi told reporters following an hour-long meeting with Sultan Abdullah Ahmad Shah.“It’s obvious that the government in the past could deal with Covid-19 issues without declaring an emergency,” Mr Ahmad Zahid said. The King has been meeting political party leaders at the national palace since Wednesday to discuss the pandemic and the government’s handling of it.Mr Zahid's stance came a day after former Prime Minister Mahathir Mohamad, during his own meeting with the King, proposed the setting up of a National Operations Council (NOC) under the state of emergency. He offered to lead the council.Dr Mahathir said the NOC, which governed the nation for two years after the May 13, 1969 race riots, allowed Malaysia's second prime minister, Tun Abdul Razak Hussein, to \"solve political problems at the time\" by bringing in opposition parties to form a wider Barisan Nasional ruling coalition that had a stronger majority.The King is meeting all political party leaders to hear their views about the Covid-19 crisis in the country and the state of emergency that was imposed in January, with his consent, to allow the government to curb the spread of the pandemic. It is due to end in August.The crisis has worsened during the emergency period, with the country imposing its third lockdown which was due to end on June 14. The government on Friday announced that this would be extended by another two weeks to June 28 .The King is also meeting the leaders of the Malaysian Indian Congress, which is also part of the PN government, and Parti Bersatu Sabah.Besides Tun Mahathir, he has met Prime Minister Muhyiddin Yassin, opposition leader Anwar Ibrahim, who is also head of Parti Keadilan Rakyat, as well as other opposition leaders such as the Democratic Action Party's Mr Lim Guan Eng and Amanah's Mr Mohamad Sabu.Friday is the final day for the face-to-face audience granted to political leaders, and an online meeting has been scheduled with Sarawak's ruling party Gabungan Parti Sarawak on Monday.The King will be meeting the country's eight other rulers in a special conference on June 16 to discuss the emergency and Covid-19 crisis.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/umno-chief-zahid-meets-king-proposes-ending-emergency-and-reconvening-parliament", "Source": "google"}