{"Type": "", "Time": "2021-06-12", "Headline": "Man falls 15m into ship's cargo hold, suffers head injury and fractures, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - A man who fell about 15m into the cargo hold of a ship was rescued by the Singapore Civil Defence Force (SCDF) on Thursday (June 10) afternoon.He suffered a head injury and fractures on his limbs.In a post on Facebook, the SCDF said it received a call for assistance at about 5pm at Jurong Port.It said that when SCDF officers arrived, the man was being treated by the company's emergency response team.It did not specify the company.The rescuers, along with emergency medical services personnel from Jurong and Jurong Island fire stations, went below the deck to assess and stabilise the condition of the man.SCDF said firefighters and members of SCDF's Disaster Assistance and Rescue Team worked with the company's emergency response team to carefully secure the man onto a stretcher before pulling him out of the cargo hold.It added: \"The final stage of the rescue operation involved the delicate manoeuvring of the stretcher within the confines of a narrow hatch.\"The man was later taken to the National University Hospital.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/man-falls-15-metres-into-ships-cargo-hold-suffers-head-injury-and-fractures", "Source": "google"}