{"Type": "World", "Time": "2021-06-12", "Headline": "Australia to refit ageing submarines as doubts over new French fleet grow", "Text": "CANBERRA: Australia will refurbish its ageing Collins-class submarine fleet, The Australian newspaper reported on Friday (Jun 11), as doubts over Canberra's A$50 billion (US$38.8 billion) deal for 12 new submarines built by French shipbuilder Naval Group grow.Australia in 2016 selected Naval Group to build a new submarine fleet to replace its more than two-decades-old Collins submarines and significantly expand its military to protect strategic and trade interests in the Asia Pacific.The deal, one of the world's most lucrative defence deals, has been beset by issues and delays due to Canberra's requirement that the majority of the manufacturing and components be sourced locally.As a result, Australian defence officials to last month said they were undertaking \"contingency planning\".Casting further doubt over the deal with Naval Group, The Australian reported the Minister for Defence Peter Dutton will order a refit of existing Collins-class submarines.\"Clearly there have been problems with the arrangements with Naval Group,” Dutton told The Australian.\"There has been concern on both sides in relation to the programme and I need to make sure that we have the best capacity available to us.\"Australian first discussed replacing its trouble-plagued Collins class submarines nearly a decade ago. The Collins submarines were due to be retired in the next few years.The first of Australia's six Collins-class submarines reaches the end of its lifespan in 2026. This is several years before the first of the new fleet, a diesel-electric version of Naval Group's 5,000-tonne Barracuda nuclear-powered submarine, is scheduled to be delivered. The final new submarine will be operational during the 2050s.Australia's Prime Minister Scott Morrison will meet with French President Emmanuel Macron next week and the two are expected to discuss the submarine deal.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Australia,submarines", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/collins-class-submarines-australia-navy-france-defence-14991762", "Source": "google"}