{"Type": "", "Time": "2021-06-12", "Headline": "More in S'pore opting for Pfizer Covid-19 vaccine despite longer wait than for Moderna, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Slots at vaccination centres offering the Pfizer-BioNTech Covid-19 vaccine are being taken up more quickly than those for Moderna, after vaccination bookings were made available for those aged 12 to 39 on Friday (June 11).As people can opt for either of the two available vaccines here, some have preferred the Pfizer-BioNTech vaccine because its side effects are said to be less severe, among other reasons. It is also the only one here approved for those under the age of 18.At the media conference by the multi-ministry task force tackling Covid-19 on Thursday (June 10), Health Minister Ong Ye Kung said those who choose to go to vaccination centres that offer the Moderna vaccine are much likelier to get an earlier slot, since students under 18 can take only the Pfizer-BioNTech jab. The vaccination drive for 400,000 students aged 12 and above began on June 3.Checks by The Straits Times on Friday afternoon showed that the earliest slot available for the Moderna vaccine is June 12, compared with June 21 for the Pfizer-BioNTech vaccine. All vaccination centres tagged \"more slots available\" on a Covid-19 vaccination appointment booking page seen by ST offer the Moderna vaccine.Ms Germaine Koh, 22, a student at Nanyang Technological University, chose the Pfizer jab after observing the side effects of those around her who had been vaccinated.She said: \"My parents took Moderna and they had slight fevers after taking the jab, but some others who took Pfizer said that they had little to no side effects.\"Some, such as university student Isabel Dyason, 22, chose vaccination centres that offer the Pfizer-BioNTech vaccine even though they were farther away from home. Ms Dyason, who lives in Tampines, booked her first jab on June 25 at Bedok Community Centre.The shorter waiting period between doses for the Pfizer-BioNTech vaccine - 21 days against Moderna’s 28 days - also appeals to some, while others said they chose it because more vaccination centres are offering it.There were also those who thought the two vaccines are equally safe and effective, and chose their vaccination centres based on convenience.Ms Goy Shi Yi, 32, a communications manager, said: \"I wanted to get it done early and as soon as possible, because the situation may worsen very quickly as we've seen from all the recent clusters.\"She booked a slot for Saturday at Radin Mas Community Club, which is just a few bus stops from her home.\"I did read up on the differences between Moderna and Pfizer, but from what I see, they have similar efficacy levels and side effects. Side effects like fever aren't of much concern to me. If we're talking about rashes or some blood clots, then perhaps I'd be more worried,\" she added.A study, conducted by the United States Centres for Disease Control and Prevention and published in the Journal of the American Medical Association in April, found that those who received the Moderna vaccine more frequently reported side effects - such as redness over the injection site, muscle aches and fevers - than those who received the Pfizer-BioNTech vaccine.After the second dose, 74.8 per cent of Moderna recipients reported reactions such as fever, headache and fatigue, compared with 64.2 per cent of those who received the Pfizer-BioNTech vaccine.Associate Professor Hsu Li Yang of the National University of Singapore Saw Swee Hock School of Public Health said the reasons for the difference are still unknown.However, in terms of severe or life-threatening side effects, the two vaccines are similar and the risks are very low.\"In fact, the risk of anaphylaxis (severe allergic reaction) to the Moderna vaccine is about half or less than half of the Pfizer vaccine,\" he added.Dr Ling Li Min, an infectious diseases expert from Rophi Clinic, said: \"Experts conclude that both vaccines are similar and equally good when it comes to efficacy, and that side effects depend more on the person than the shot itself.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/covid-19-more-opting-for-pfizer-vaccine-despite-longer-wait-than-for-moderna", "Source": "google"}