{"Type": "", "Time": "2021-06-12", "Headline": "Tennis: Djokovic defeats 13-time champion Nadal in epic French Open semi-final, Tennis News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.PARIS (AFP) - Novak Djokovic handed 13-time champion Rafael Nadal only his third defeat in 16 years and 108 matches at the French Open on Friday (June 11) to reach his sixth Roland Garros final in an epic showdown which even beat the country’s Covid-19 curfew.In their 58th career clash, Djokovic triumphed 3-6, 6-3, 7-6 (7/4), 6-2 and stays on course to capture a 19th major and become the first man in over 50 years to win all four Slams twice.Djokovic, the 2016 champion in Paris who had also beaten Nadal at the 2015 tournament, will face Stefanos Tsitsipas in Sunday’s final in what will be his 29th championship match at the Slams.Tsitsipas had earlier become the first Greek to reach a Grand Slam final with a 6-3, 6-3, 4-6, 4-6, 6-3 victory over Germany’s Alexander Zverev.Nadal, 35, who would have been the oldest finalist at the French Open in the modern era, remains tied on 20 majors with Roger Federer.“It was a privilege to face Rafa in such an incredible match,” said Djokovic after four hours and 11 minutes of intense action.“Tonight it was my greatest ever match in Paris.” It was his second win in eight meetings in Paris with Nadal, a sequence which also included three losses in finals.It was Nadal’s first defeat in 14 semi-finals in the French capital.“Probably it was not my best day today, even if I fought,” said Nadal.“Sometimes you win, sometimes you lose. I had a big chance. There were some crazy points but there was fatigue there.”Djokovic finished with 50 winners; Nadal committed 55 unforced errors under the relentless assault.Djokovic had two break points in the opening game of the first set which stretched to 10 minutes but was unable to convert.Nadal made him pay, sprinting away for a 5-0 lead before the top seed got on the board.Djokovic clung on, retrieving one break to get to 2-5 but Nadal eventually prevailed after one hour on court even if he required seven set points to edge ahead.As a sign of the tension of the occasion, Nadal complained to chair umpire Eva Asderaki-Moore that he needed more time to collect his towel.Djokovic aired his bemusement at the amount of clay on the baselines.The old rivals exchanged breaks in the second and third games of a big-hitting second set but it was Djokovic who repeated the feat for a 4-2 lead before levelling the tie.Twice in the third set Djokovic edged ahead, only to be reeled back in by Nadal who broke back in the 10th game as the world number one served for the set.Djokovic then had to save a set point with an ice-cool drop shot in the 12th game.“You cannot play better clay court tennis than this. It’s perfect,” tweeted Andy Murray.A 92-minute third set ended with Djokovic taking the tiebreak.In a further twist on a dramatic evening, the 5,000 spectators inside Court Philippe Chatrier were allowed to watch the conclusion of the match despite it passing the 11pm Covid-19 curfew.“In agreement with the national authorities, the match will come to an end in your presence,” said a stadium announcer told delighted fans.Nadal then broke in the first game of the fourth set but Djokovic levelled for 2-2 and broke again for 4-2.He finished it off on a second match point when Nadal hit wide and long.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/tennis/tennis-djokovic-defeats-13-time-champion-nadal-in-epic-french-open-semi-final", "Source": "google"}