{"Type": "", "Time": "2021-06-12", "Headline": "Melvin Yong takes over as Case president from Lim Biow Chuan, Consumer News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Assistant secretary-general of the National Trades Union Congress (NTUC) Melvin Yong has been elected unopposed as the new president of the Consumers Association of Singapore (Case).He takes over the reins from Mr Lim Biow Chuan, who had helmed the organisation for the past nine years.Mr Yong, who is also MP for Radin Mas and the executive secretary of the National Transport Workers' Union, will head the consumer watchdog for the term 2021 to 2024, Case said in a media release on Friday (June 11).The new central committee was also elected and appointed to office, following its 48th annual general meeting on Friday, Case added.Thanking Mr Lim for his contributions, Mr Yong, 49, said: \"As Case commemorates its 50th anniversary this year, it is timely that we take stock of our achievements and consider how we can continue to be relevant and respond to the needs of consumers.\"I will work closely with the new central committee, management and staff to look into how we can better protect and empower consumers in this new digital age.\"Mr Lim, 58, who is MP for Mountbatten, has served as Case president since 2012, and was a vice-president from 2006 to 2012.Some of his notable contributions included advocating for the enactment of provisions under the law to protect consumer rights. For example, after receiving complaints against timeshare companies for pressure sales tactics, he advocated for legislation to better protect consumers against errant timeshare companies.Mr Yong, who was elected vice-president in November 2019, had overseen the conceptualisation and development of two key projects, Price Kaki and Fuel Kaki, which allow consumers to compare prices of groceries and fuel.The Price Kaki application has seen more than 72,000 downloads since it was launched in September 2019, while the Fuel Kaki website has seen an average of more than 25,000 visitors every month since it was launched in January this year.Mr Lim told The Straits Times that he is still involved in other committees because of his position as a former president. They include the multilateral healthcare insurance committee and the data protection advisory committee.He said that he will continue to help out while Mr Yong adjusts to the new role.\"It is time for a leadership change, and it is always good for the key leader to be refreshed after a number of years. It is good to look at things with fresh eyes and a new perspective. Sometimes, you can't see your own weaknesses,\" Mr Lim added.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/consumer/melvin-yong-takes-over-as-case-president-from-lim-biow-chuan", "Source": "google"}