{"Type": "", "Time": "2021-06-12", "Headline": "China brands COVID-19 lab-leak theory as 'absurd,' Blinken urges transparency", "Text": "By David Brunnstrom, Tom Daly and Michael MartinaWASHINGTON/BEIJING (Reuters) -U.S. Secretary of State Antony Blinken stressed the need for cooperation and transparency over the origins of COVID-19 in a call with Chinese counterpart Yang Jiechi on Friday and raised other contentious topics, including China's treatment of Uyghur Muslims, Hong Kong and Taiwan.Yang, China's top diplomat, expressed to Blinken Beijing's serious concern that some people in the United States were spreading the \"absurd story\" about the coronavirus escaping from a Wuhan laboratory, Chinese state media said.Yang, head of the Central Foreign Affairs Commission of China's ruling Communist Party, also told Blinken that Washington should handle Taiwan-related issues \"carefully and appropriately,\" state broadcaster CCTV reported.The call came ahead of a G7 summit in Britain attended by U.S. President Joe Biden that is expected to be dominated by Washington-led efforts to counter China's growing influence.The world's two largest economies are deeply at odds over issues ranging from trade and technology to human rights and the coronavirus. Washington should work with Beijing to put ties \"back on track,\" Yang said.Yang, who had a fiery exchange with Blinken in Alaska in March during the Biden administration's first high-level meeting with its Chinese counterparts, said Beijing firmly opposed what he called \"abominable actions\" over the pandemic, which he said were being used to slander China, CCTV said.The State Department said the diplomats also discussed North Korea policy and that Blinken expressed U.S. concerns over the deterioration of democratic norms in Hong Kong and what Washington describes as the genocide of Muslim Uyghurs in China's Xinjiang region.Blinken also called on China to stop its pressure campaign against Taiwan and to release \"wrongfully detained\" U.S. and Canadian citizens, it said in a statement.'RESPECT FACTS AND SCIENCE'The State Department said the discussion on North Korea - an issue on which the United States is keen for more Chinese action to press its ally and neighbor to give up its nuclear weapons - focused on the need for Beijing and Washington \"to work together for the denuclearization of the Korean Peninsula.\"It said the two diplomats also continued discussions on shared global challenges, including Iran and Myanmar, and the climate crisis.\"Addressing the COVID-19 pandemic, the Secretary stressed the importance of cooperation and transparency regarding the origin of the virus, including the need for WHO Phase 2 expert-led studies in China,\" it said, referring to the World Health Organization.Bonnie Glaser, an Asia expert at the German Marshall Fund of the United States think tank, said that although the agenda included potential areas of cooperation, the conversation appeared dominated by contentious issues.She said Yang's call for Washington to work with Beijing to put ties \"back on track\" indicated China was still putting the onus on the United States for the problems in the relationship.\"That's a non-starter, but demonstrates that the Chinese are sticking to their tried-and-true diplomatic approaches, even though they are not successful.\"A report on the origins of COVID-19 by a U.S. government national laboratory concluded the hypothesis of a viral leak from a Wuhan lab was plausible and deserved further investigation, the Wall Street Journal said on Monday.\"We urge the United States to respect facts and science, refrain from politicizing the issue ... and focus on international cooperation in the fight against the pandemic,\" Yang said.His comments on Taiwan followed a visit to the Chinese-claimed island last weekend by three U.S. senators on a U.S. military aircraft. They met Taiwanese President Tsai Ing-wen and announced the donation to Taiwan of 750,000 doses of COVID-19 vaccine, drawing a sharp rebuke from China's defense ministry.In addition to coinciding with Biden's first overseas trip as president to attend the G7 summit, the call comes as Washington has been pushing policies to address challenges from China.In the past eight days, Biden updated an executive order banning U.S. investment in companies linked to China's military and rolled out steps aimed at China to shore up U.S. supply chains. His trade representative Katherine Tai held a call with Taiwan, the Pentagon wrapped up a China policy review, and the Senate passed a sweeping package of China-focused legislation.Eric Sayers, a visiting fellow at the conservative American Enterprise Institute, said all that amounted to good timing for the administration to have an exchange with Beijing.\"The White House should feel more confident taking these calls and letting Beijing run down their stale talking points,\" Sayers said.(Reporting by Beijing Newsroom and Doina Chiacu, David Brunnstrom and Michael Martina in Washington; Writing by Tom Daly; Editing by Alex Richardson, Mark Heinrich, Angus MacSwan, Paul Simao and Daniel Wallis)China's quick rollout of a law against foreign sanctions has left European and American companies shocked and facing \"irreconcilable\" compliance issues, two top business groups said Friday, despite Beijing saying the move would unlikely impact investment.It is compulsory to have your car insured in Singapore. Why not make the most of it by looking for the best car insurance plan in town when your policy is up for renewal? While it can be tempting to simply renew your existing car […] The post 5 Best Car Insurance Plans in Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Få flere penge i hverdagen ved at samle din gæld. Indsend en ansøgning her og få et tilbud. Indfri lånet når du ønsker det.Beijing has repeated an offer to vaccinate people from Taiwan against Covid-19, as the coronavirus continues to spread on the island. The Taiwan Affairs Office, Beijing’s main body for cross-strait affairs, on Friday said that Taiwanese who fly to mainland China can voluntarily receive Covid-19 shots as long as they meet vaccination requirements and follow outbreak control measures. “[We] urge the authorities to earnestly listen to the voices of the people on the island and remove the man-made oA Hong Kong court has barred media tycoon Jimmy Lai Chee-ying and his companies from challenging the legality of the search warrants executed in a series of raids at his offices last year and refused their applications for an injunction against the police chief. The nine plaintiffs first filed a series of private legal actions against the commissioner of police last year to recover some materials seized by officers during investigations into allegations of fraud and national security law violatiION Orchard will be closed to the public from Saturday (12 June) for four days and reopen on 16 June after three cases working at the mall were found to have COVID-19 infection.Book en prøvetur og oplev Ceed Plug-in Hybrid med plads til hele familien. Kør lydløst rundt på strøm i dagligdagen og mærk begejstringenDemocrats erupted in outrage Friday over news that Donald Trump's Justice Department secretly surveilled lawmakers probing possible collusion with Russia, reaping the phone records of top political foes in what they called an unprecedented abuse of power.China’s rocket force has conducted firing exercises involving “carrier killer” DF-26 ballistic missiles. A missile brigade under the People’s Liberation Army Rocket Force recently held launch practice in an unspecified training field at night to improve its combat ability, China National Radio reported on Tuesday. In the exercise, the brigade practised the fast transfer of missiles to another location to launch a second wave of missiles, a drill to train the brigade’s fast-response capabilities,Turns out the comic books were wrong.Bedste sikkerhed i klassen. A+ forbrug 19,2 km/l, 117-118 g/km co2. Prisen gælder indregistrering senest 30/06/2021.Agnes Chow hails from a generation of Hong Kong democracy activists who cut their teeth in politics as teenagers and are now being steadily silenced by China.A top official from the Chinese county that hosted a fatal ultramarathon last month has been found dead, authorities said Friday, as 27 people face punishment over the incident.President Vladimir Putin on Friday denied a US media report that Russia is set to deliver an advanced satellite system to Iran that will vastly improve its spying capabilities.En elektrisk tandbørste med kunstig intelligens? Oral-B har gjort din eltandbørste endnu smartere - og din tandbørstning sjovere.Singapore will begin slowly easing a month-long partial lockdown from next week after the curbs succeeded in stemming a coronavirus outbreak, authorities said Thursday.A secret society member who brutally assaulted a police officer and caused him to suffer a traumatic brain injury with help from his twin brother was jailed for two years, nine months and four weeks on Friday (11 June).China on Thursday passed a new law to counter foreign sanctions, as it looks to build its defences against rising US and EU pressure over trade and human rights.Sådan investeres i aktier på 5 minutter via din telefon.South Korea's youngest MP apologised Thursday after she provoked fury among BTS fans by using pictures of tattooed singer Jungkook to promote her campaign to liberalise the country's restrictive laws on inking.Lawyers for Huawei Technologies Co. executive Meng Wanzhou are seeking a publication ban on new evidence obtained from HSBC bank that they think will boost her Canadian court battle against extradition to the United States. They believe the material supports her claim that she is the victim of an abuse of process and she should be released, although the exact nature of the evidence has not been described. Her lawyer, Richard Peck, previously said the material, obtained as a result of a recent HoSecond Minister for Education Maliki Osman has taken to Facebook to express his shock and disappointment at alleged Islamophobic remarks made by a Ngee Ann Polytechnic (NP) lecturer.Folk født 1930-1980 søges til betalte spørgeundersThe Ministry of Health (MOH) on Thursday (10 June) confirmed 13 new COVID-19 cases in Singapore, bringing the country's total case count to 62,236.China’s nuclear arsenal is a growing threat to US security, less in its absolute size than in the growing risk of a mishap as Washington and Beijing butt heads over Taiwan and many other issues, experts told a US Congressional commission on Thursday. “Have the risks changed? Yes, it’s a more competitive US-China relationship, and the chances of a conflict over Taiwan – while I don’t believe they’re high right now, they certainly have increased,” said Phillip Saunders, director of the Centre forBlaming \"misogynistic perverts in sport and their boot lickers\", dual Olympic silver medallist Maddie Groves has pulled out of Australia's swimming trials for the Tokyo Games.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/china-u-top-diplomats-hold-122123006.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}