{"Type": "", "Time": "2021-06-12", "Headline": "Malaysia to extend lockdown by two weeks, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Malaysia will extend its lockdown by another two weeks to June 28, as new coronavirus infections are still averaging 6,871 daily.Senior Minister for Security Ismail Sabri Yaakob said yesterday that the National Security Council made the decision on the Health Ministry's recommendation.\"The decision was taken after taking into account daily cases are still over 5,000,\" he said.He did not say which period of time the average daily figure of 6,871 was based on.Datuk Seri Ismail Sabri added that regulations such as bans on inter-district travel and social activities and cuts to workplace staff capacity would continue from the existing lockdown that began on June 1 and was set to expire after next Monday.\"I hope there is no more confusion on the enforcement of standard operating procedures (SOP). I don't want the public to be affected by misinterpretation of the SOPs by the authorities,\" he said.The lockdown, which allows only 17 economic sectors to operate, was imposed after a looser movement control order (MCO) last month failed to curb Malaysia's worst coronavirus wave, with both public and private healthcare resources overrun by a record number of active cases. Instead, May has been the deadliest month so far, logging more than a third of the 3,768 fatalities recorded in total.The Health Ministry reported 6,849 new cases yesterday, the highest this week, bringing the total to 646,411, with a record 912 currently warded in intensive care units.Malaysia's lockdown, dubbed a full MCO (FMCO), would have ended its first phase next Monday had the Health Ministry's risk assessment - based on infection rates and hospital capacities - deemed that the curbs were successful in reducing infection numbers.The ministry said on Wednesday that the rate of transmission had dipped just below 1.0 to 0.96, indicating that the number of new patients daily was decreasing slowly.Once Malaysia ends the FMCO, a second phase lasting four weeks will follow, with more economic sectors that do not involve mass gatherings allowed to reopen.Should the situation continue to improve, Malaysia will see a further easing to something similar to last month's MCO, in which most economic activities - subject to SOPs and health protocols - were allowed, while social activities remained banned.However, Malaysia's long-term exit strategy from MCO restrictions largely revolves around achieving herd immunity before the end of the year.After a slow start, the national Covid-19 immunisation programme has steadily increased the rate of doses administered daily, with 157,949 receiving jabs on Thursday. Over 2.8 million people, or nearly 12 per cent of the adult population, have had at least one dose.\"Vaccination has picked up pace... and it will increase to between 200,000 and 250,000 in July and then hit 300,000 to 400,000 daily,\" said Prime Minister Muhyiddin Yassin yesterday.Malaysia needs to dispense about 200,000 doses daily to inoculate a targeted 80 per cent by the end of the year.The Premier called on the public to register for their vaccines, with 13 million, or about 54 per cent of eligible residents, indicating their interest so far.Malaysia yesterday started to deploy four mobile vaccine trucks to inoculate some 7,200 residents of public housing projects in Kuala Lumpur, as the country races to speed up its vaccination drive.The three-day programme, which will run until tomorrow, involves four areas in the Kuala Lumpur federal territory.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/malaysia-to-extend-lockdown-by-two-weeks", "Source": "google"}