{"Type": "", "Time": "2021-06-12", "Headline": "Ride-Hailing Firm Didi Reveals $1.6 Billion Loss Before IPO - Bloomberg", "Text": "Chinese ride-hailing company Didi revealed a $1.6 billion net loss for 2020 as it moves ahead with plans for a U.S. initial public offering.The company in its first public filing for the IPO listed the offering as $100 million, a placeholder that will change when the company discloses terms for the share sale. Didi filed Thursday under the business name Xiaoju Kuaizhi Inc., with Goldman Sachs Group Inc., Morgan Stanley and JPMorgan Chase & Co. leading the offering.LISTEN: Fion Li, Bloomberg's Team Leader for Asia Deals, discusses Didi's IPO plan with Juliette Saly and Doug Krizner on Bloomberg Daybreak Asia.Didi, one of the largest investments in SoftBank Group Corp.’s portfolio, accelerated its listing plans after its business rebounded as the coronavirus pandemic ebbed in China. The company has been considering seeking a valuation of as much as $70 billion to $100 billion in the IPO, Bloomberg News reported in April.In recent months, Didi has been trading at a valuation of about $95 billion on the secondary market, said people familiar with the matter who asked not to be identified because the information was private. The company last raised funding at a $62 billion value last year, according to PitchBook. A representative for Didi declined to comment on the company’s valuation.SoftBank’s Vision Fund, Uber Technologies Inc. and Tencent Holdings Ltd. are currently among Didi’s biggest shareholders with a combined stake of about 41%, its filing shows. Didi co-founder Will Wei Cheng holds 7% of the shares.SoftBank’s 21.5% stake could be worth $15 billion or more at the targeted valuation range, although that stake could be diluted in the offering. The Japanese company invested more than $10 billion in Didi, Bloomberg News has reported.While Didi has expanded into 15 countries, most of its revenue still comes from its China mobility business.Didi reported revenue of $21.6 billion in 2020. In the first quarter of this year, as China recovered from the pandemic, revenue more than doubled from the year before to hit $6.4 billion. The company also turned a profit for the quarter, reporting net income of $837 million.The murder of two passengers by Didi drivers in the summer of 2018 sparked public outrage and the mass deleting of the company’s app. Didi’s founders Cheng and Jean Qing Liu called the deaths the company’s darkest moment.“In the summer of 2018, two tragic safety incidents occurred on our ‘Hitch’ platform,” they wrote in a letter to investors included in the filing. “These shook us to our core. We felt an immense sense of sadness and responsibility and began a period of deep self-reflection.”The company cited safety concerns among the risks to its business, saying failure to ensure safety could cause it to lose customers. The company said in its filing that, after the deaths, it suspended the Hitch Carpooling service for more than a year to develop procedures to protect riders and drivers.Other potential risks for Didi line up with those of their ride-hailing competitors around the world. Rivals could undercut Didi’s customer prices or poach drivers with better earning potential, the company said in the filing, and its business model would suffer if their army of drivers were re-classified as employees.The company also cited the possibility of antitrust fines or regulations, as well as the chance its share price could drop because of negative sentiment in the U.S. about Chinese companies.An IPO would cap a remarkable turnaround for a company that first ran afoul of regulators and then faced the effects of the pandemic. Didi seeks to tap the same investor enthusiasm that propelled this year’s tech debuts by Chinese video service Kuaishou Technology and South Korean e-commerce pioneer Coupang Inc.Didi’s IPO would also mark a monumental year for Chinese tech IPOs. Kuaishou raised more than $6 billion via a Hong Kong debut in January, while ByteDance Ltd. itself is expected to put in motion a listing later this year.Didi was founded in 2012 by former Alibaba Group Holding Ltd. staffer Cheng. It clashed with Uber in China for years until the U.S. firm retreated in 2016, selling its operation in the country to Didi.The company is looking for capital to invest in technology, grow its presence in some international markets and introduce new products, according to the filing. It is planning to make its debut in Western Europe this year, Bloomberg News reported in February, and it’s invested heavily in so-called community buying, one of the hottest e-commerce growth areas in China.Didi, which remains the dominant player in China, is also looking to leverage that lead to expand into adjacent arenas from autonomous driving to electric vehicles.The company said in Thursday’s filing that it plans to list its American depositary shares under the symbol DIDI, although it didn’t specify on which exchange.— With assistance by Coco Liu", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-10/chinese-ride-hailing-firm-didi-reveals-1-6-billion-loss-in-ipo", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}