{"Type": "", "Time": "2021-06-12", "Headline": "MOM orders unloading work on vessel at Jurong Port to stop after man falls from 15m height, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The Ministry of Manpower (MOM) has instructed Jurong Port to stop all unloading works on board a vessel after a dock worker fell from a height of 15m while working on it.Responding to queries from The Straits Times, MOM said on Friday (June 11) that it is investigating the incident on Thursday in which the worker, a 48-year-old Malaysian national, fell while he was unloading steel pipes from the vessel.He sustained multiple fractures and was taken to National University Hospital, where he is currently in intensive care, MOM added.\"MOM is investigating the incident and has instructed the occupier to stop all unloading works on board the vessel,\" said MOM, adding that the occupier and man's employer is Jurong Port.A spokesman for Jurong Port said the man is in a stable condition and the company is also investigating the incident.In a Facebook post on Thursday night, the Singapore Civil Defence Force (SCDF) said it received a call for assistance at about 5pm.It said that when SCDF officers arrived at the port, the man was being treated by the company's emergency response team.The rescuers, along with emergency medical services personnel from Jurong and Jurong Island fire stations, went below the deck to assess and stabilise the condition of the man.SCDF said firefighters and members of SCDF's Disaster Assistance and Rescue Team worked with the company's emergency response team to carefully secure the man onto a stretcher before pulling him out of the cargo hold.It added: \"The final stage of the rescue operation involved the delicate manoeuvring of the stretcher within the confines of a narrow hatch.\"In April, a 45-year-old Jurong Port worker, a Malaysian, was injured when he was struck by hoisted materials being unloaded from a vessel at the port.The latest incident comes after an SMRT technician was killed and his co-worker injured when a car jack supporting a bus they were working on gave way in a workshop at SMRT's Ang Mo Kio bus depot on Sunday.MOM said that there were close to 3,300 workplace injuries between January and March this year, compared with over 3,100 workplace injuries in the same period last year.\"Our workers' lives are of utmost importance, and we urge everyone to make workplace safety a priority to prevent the occurrence of future injuries and fatalities,\" said the ministry.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/unloading-work-on-vessel-at-jurong-port-stopped-mom-investigating-after-man-falls-from-15m", "Source": "google"}