{"Type": "", "Time": "2021-06-12", "Headline": "F&B staff, workers in higher-risk settings with unmasked customers to undergo regular Covid-19 testing, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Staff who work in higher-risk settings with unmasked customers will have to undergo regular Covid-19 testing, with the Government covering the cost of these tests for the next three months.These include workers at dine-in food and beverage (F&B) establishments, saunas and gyms and fitness studios where clients are unmasked.Mandatory fast and easy testing (FET) will start from July for those working at dine-in F&B establishments, as dining in with a maximum group size of five will be allowed to resume from June 21.This expanded testing regime was announced on Thursday (June 10) by the multi-ministry task force tackling Covid-19, alongside the relaxation of measures in two stages.FET uses tests such as antigen rapid tests, which can produce results in about 30 minutes and can be done on-site.All workers will have to undergo testing, regardless of their vaccination status.The Ministry of Health said FET capacity will be ramped up aggressively in the coming months, with mandatory testing progressively rolled out to larger establishments first and extended to smaller businesses later on.Finance Minister Lawrence Wong, who co-chairs the multi-ministry task force on Covid-19, said that the Government is working out the details of this new testing regime, such as the frequency of testing and whether it can be self-administered, and more information will be announced later on.The regime is part of measures which Singapore is taking to minimise virus transmission and the risk of large clusters breaking out, as it reopens in a \"cautious and controlled\" manner, he said.The Government will cover the cost of testing over the next three months, Mr Wong noted, adding: \"We are doing that during this period because it is important to get everyone tested regularly and put this in place.\"Beyond that, employers will have to start thinking about incorporating these processes as part of their BCPs (business continuity planning).\"Measures which F&B operators have to take in line with safe distancing rules include ensuring that their restaurants have \"good ventilation\" and groups of diners are seated at least 1m apart.Rostered routine testing is already being done in a number of higher-risk settings in Singapore, including migrant worker dormitories, construction worksites, shipyards, air and sea ports, hospitals and nursing homes.Individuals, whether vaccinated or not, are tested once every seven days or once every 14 days, depending on their risk level.READ NEXT: Singapore to ease Covid-19 curbs and reopen in 2 phases from June 14: Everything you need to knowJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/staff-in-higher-risk-settings-with-unmasked-customers-to-undergo-regular-covid-19", "Source": "google"}