{"Type": "", "Time": "2021-06-12", "Headline": "Heart inflammation cases in young men higher than expected after mRNA vaccines: US CDC, United States News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.WASHINGTON (REUTERS) - A higher-than-expected number of young men have experienced heart inflammation after their second dose of the mRNA Covid-19 shots from Pfizer/BioNTech and Moderna, according to data from two vaccine safety monitoring systems, the US Centres for Disease Control and Prevention (CDC) said on Thursday (June 10).The CDC and other health regulators have been investigating heart inflammation cases after Israel’s Health Ministry reported that it had found a likely link to the condition in young men who received Pfizer’s Covid-19 vaccine.The agency said it is still assessing the risk from the condition and has not yet concluded that there was a causal relationship between the vaccines and cases of myocarditis or pericarditis.While some patients required hospitalisation, most have fully recovered from their symptoms, the CDC said.More than half of the cases reported to the US Vaccine Adverse Event Reporting System (VAERS) after people had received their second dose of either the Pfizer/BioNTech or Moderna vaccines were in people between the ages of 12 and 24, the CDC said. Those age groups accounted for less than 9 per cent of doses administered.“We clearly have an imbalance there,” Dr Tom Shimabukuro, deputy director of the CDC’s Immunisation Safety Office, said in a presentation to an advisory committee to the US Food and Drug Administration meeting on Thursday.The overwhelming majority of the cases have occurred within a week of vaccination, Shimabukuro said.There were 283 observed cases of heart inflammation after the second vaccine dose in those aged 16 to 24 in the VAERS data. That compares with expectations of 10-to-102 cases for that age range based on US population background incidence rates, the CDC said.Shimabukuro said there was a predominance of males in younger age groups among the reported heart inflammation cases.The median age of patients who experienced the inflammation after a second vaccine dose was 24, according to the VAERS data.Just under 80 per cent of the cases were in men.Shimabukuro also said the Vaccine Safety Datalink (VSD) - another safety monitoring system – showed an increased incidence of heart inflammation in 16 to 39 year olds after their second shot when compared to the rate observed after the first dose.Pfizer said it supports the CDC’s assessment of the heart inflammation cases, noting that “the number of reports is small given the number of doses administered.”About 130 million people in the United States have received both doses of one of the mRNA vaccines.“It is important to understand that a careful assessment of the reports is ongoing and it has not been concluded that the mRNA Covid-19 vaccines cause myocarditis or pericarditis,” the company said in a statement.Moderna said it also has not established a causal association with the condition and its vaccine. It said it is actively working with public health and regulatory authorities to further assess the issue.The CDC said it will hold a meeting of its Advisory Committee on Immunisation Practices next week to further evaluate the evidence and assess the risk of myocarditis following mRNA vaccination for Covid-19.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/united-states/heart-inflammation-cases-in-young-men-higher-than-expected-after-mrna-vaccines", "Source": "google"}