{"Type": "", "Time": "2021-06-15", "Headline": "Ceiling falls on firefighters in Outram Park shophouse blaze, two taken to hospital, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Parts of a ceiling fell on firefighters as they were fighting a blaze on Tuesday morning (June 15).Two of them were taken to hospital and a third had minor injuries.The Singapore Civil Defence Force (SCDF) was alerted to the shophouse fire at 31 Teo Hong Road in Outram Park at about 11.15am.They saw thick smoke rising from the shophouse, and entered the smoke-filled premises with breathing apparatus sets.Two firefighters were on the third storey of the shophouse when parts of the ceiling fell on them.Both, regulars in full protective equipment, had to be immediately evacuated and were checked on by a paramedic.One was taken conscious to Singapore General Hospital (SGH), while the other was treated on-site for minor scratches.Another firefighter, a full-time national serviceman (NSF), was also taken to SGH for heat exhaustion.The NSF has been discharged, but the regular officer is to be warded overnight for observation.The fire, which had engulfed the ceiling on the third storey and attic of the shophouse, was extinguished at about 1.15pm.The SCDF used three water jets, and also deployed a platform ladder as part of its operations.In a Facebook post, the SCDF said the people in the shophouse had evacuated by themselves, and 20 of their neighbours were evacuated by the SCDF as a precautionary measure.Damping down operations, which involve spraying water on burnt surfaces to prevent any fires from restarting, were ongoing.The SCDF thanked the public for their support and get-well wishes for the officers involved in the incident.It said: “Your kind words are uplifting and keep their spirits high. Thank you.”The cause of the fire is under investigation.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/ceiling-falls-on-firefighters-in-outram-park-shophouse-blaze-two-taken-to-hospital", "Source": "google"}