{"Type": "", "Time": "2021-06-15", "Headline": " 'Phenomenal' Sterling sets tone for England  - Sports - The Jakarta Post", "Text": "Please Update your browser\n          Your browser is out of date, and may not be compatible with our website. A list of the most popular web browsers can be found below.\n          Just click on the icons to get to the download page.Log in with your social accountGareth Southgate says \"phenomenal\" Raheem Sterling has set the tone for England's Euro 2020 campaign after the Manchester City forward silenced his doubters in Sunday's 1-0 victory against Croatia.Southgate's side made a positive start to their bid to win the European Championship thanks to Sterling's second-half strike at Wembley.With England labouring to break down resolute Croatia, it was Sterling who latched onto Kalvin Phillips' exquisite pass to fire home from 10 yards.Sterling's first goal in a major tournament after a series of flops on the biggest international stages could not have come at a more vital moment.Failure to win their Group D opener, which looked a distinct possibility until Sterling scored, would have been a setback for England.Sterling would also have endured fresh questions about his form if England had flopped after his lacklustre end to the season with City.When Sterling was named in Southgate's starting line-up, there were some who claimed it was a mistake to pick him instead of Jack Grealish.The critics pointed to Sterling's tame display in City's Champions League final defeat against Chelsea and his long spells on the bench for the Premier League champions.But Southgate is a firm believer in Sterling's qualities and his faith was rewarded as the 26-year-old tore into Croatia to prove his point.Ignoring the sweltering temperatures, Sterling set the tempo in England's high-energy opening, then came to the rescue when they were running out of ideas after the interval.\"He's been a reliable performer for us for a long period of time,\" Southgate said.\"We can't have all the burden of scoring on Harry Kane's shoulders. We need the wide players to chip in.\"I'm delighted for him as he went quite a few tournament matches without scoring before today. He set the tone with his pass to Phil (Foden) early on today.\"His work without the ball was phenomenal, positionally and his desire to track.\"'Block the noise out' The 'Football's coming home' anthem belted out by England's fans during the post-match lap of honour carried extra meaning for Sterling.Linked with a move away from City after scoring once in his last 16 appearances at the end of this season, Sterling found comfort in his return to north London, where he grew up just a few miles from Wembley.\"It's a great feeling for me playing at Wembley, not far from where I grew up as a young boy and seeing the stadium being built,\" Sterling said.\"There are a lot of different reasons I haven't scored for my club and that's totally irrelevant now.\"I'm here with England, I'm enjoying my football and that's the most important thing.\"I just tried to focus and come into this tournament with a clear head. I know what I can bring to the team and it's as simple as that.\"Sterling won the man of the match award, but Leeds midfielder Phillips pushed him close.Phillips was a surprise choice by Southgate, but the 25-year-old seized his chance with a stylish performance.Deployed by Leeds in a midfield holding role, Southgate urged Phillips to have a more forward-thinking mindset and he responded with the dynamic burst that set up Sterling's winner.\"Kalvin is a fabulous boy to work with, so unassuming. His contribution to the goal summed his day up,\" Southgate said.\"He's technically good and we knew the athleticism in midfield was going to be important.\"All the attributes are there. High performance, low maintenance. We like that a lot.\"Next up is Friday's grudge match against Scotland and Southgate warned his players not to rest on their laurels.\"You can get a bit of a glow from the win and go a bit soft,\" Southgate said.\"We've got to make sure we're ready for what is going to be an incredible game against Scotland.\"© 2016 - 2021 PT. Bina Media Tenggara", "Section": "", "Writers": "", "URL": "http://www.thejakartapost.com/news/2021/06/14/phenomenal-sterling-sets-tone-for-england-.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}