{"Type": "Business", "Time": "2021-06-15", "Headline": "Australia's top exporting state calls for reset in China ties", "Text": "MELBOURNE: Australia's biggest exporting state on Tuesday (Jun 15) urged Canberra to stop antagonising China, the country's top trade partner, in remarks that came amid escalating criticism of Beijing led by the United States, Australia's main ally.\"This isn't about kowtowing to other countries and giving in,\" Western Australian Premier Mark McGowan said at Australia's biggest oil and gas industry conference, being held in Perth. \"There needs to be a national reset in that relationship.\"Ties with China worsened last year when Australia called for an independent investigation into the origins of the novel coronavirus, which sparked trade reprisals from China, hitting Australian goods ranging from barley and coal to lobster and wine.Relations had already soured after Australia banned Chinese tech giant Huawei from the country's 5G network in 2018.Beseeching the federal government to stop talk of conflict and trade retaliation, McGowan asked: \"How is it in our interests to be reckless with trading relationships that fund and drive our prosperity and our nation forward?\"McGowan's comments came two days after Group of Seven leaders meeting in Britain chided China over a wide range of issues, sparking an angry response from Beijing. Attending the G7 meeting as a guest, Australian Prime Minister Scott Morrison met with US President Joe Biden and UK Prime Minister Boris Johnson to discuss Indo-Pacific security.Western Australia's top exports, iron ore and liquefied natural gas (LNG), have so far escaped China's trade reprisals, with China heavily dependent on Australia's iron ore for its steel industry and increasingly reliant on gas for power generation as it looks to cut emissions from coal.Western Australia exported A$104 billion (US$80 billion) worth of goods to China in 2020, making up 71 per cent of Australia's goods exports to China.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "business and finance,China,Australia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/business/australia-s-top-exporting-state-calls-for-reset-in-china-ties-15017364", "Source": "google"}