{"Type": "", "Time": "2021-06-15", "Headline": "Snaking queues form at Bukit Merah Block 125A for Covid-19 swabbing, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Long queues formed at the temporary Covid-19 testing area set up at Block 125A Bukit Merah View on Tuesday (June 15), after the site was opened to residents.Set up on Monday, the site was intended for the mandatory testing of about 85 stallholders at 116 Bukit Merah View after a new cluster formed at the nearby 115 Bukit Merah View Market and Food Centre.As it turned out, many residents, including the elderly, had gone on Monday for testing but were turned away.On Tuesday, the temporary testing site at Block 125A opened up to residents after Tanjong Pagar GRC MP Joan Pereira made an appeal to the Ministry of Health (MOH). The site is open to residents until Thursday.When The Straits Times (ST) visited Block 125A's multi-purpose function hall at 10am on Tuesday, two queues had formed. One was for people who had made an appointment beforehand.The second queue, for people who had not made an appointment, snaked past the estate's playground and spilled over to the nearby blocks. About 120 people, mostly elderly residents, were in this queue. The estimated wait time was one to two hours.Residents in the second queue were told to come back within the next two days as appointments for Tuesday have been fully booked.Madam Shanthi Nadesan, 58, started queueing at 10am. She had waited for at least an hour when she spoke to ST.  She said she had made an appointment at Raffles Medical to get tested but decided to forgo it and have it done at Block 125A instead. “I spoke to the MP, Ms Joan Pereira, and she said I don’t have to go so far, I can just come here. But I didn’t expect to have to wait so long,” said the former school librarian, who has yet to be vaccinated.Bukit Merah resident Simon Lee, 65, had been in the queue since 9.40am and was given a swab test about an hour later. \"They said we could just walk in, so since we are free, we just decided to queue,\" the taxi driver said.Mr Lee, who was in the queue with his mother-in-law, wife and daughter, said he was not bothered by the waiting time. \"It shows that everyone is disciplined. When called upon, we would do our part to be tested,\" he said.A resident who wanted to be known only as Madam Teoh, 71, said she was prepared to wait for two hours to get tested. “I rather come here because it’s close to where I live,” said the retiree, who lives at the nearby Block 120. “Even if I don’t queue today, I will have to queue tomorrow too,” said Madam Teoh, who visited the Bukit Merah Market and Hawker Centre every day before its temporary closure.Undergraduate Germaine Tan, 21, who made an appointment for a swab test at 10.30am, joined the queue for those with bookings about five minutes before her scheduled timing. She still had to wait in line, with about 20 others ahead of her. “It’s quite organised, because there’s someone ushering the queue, so it’s not so bad,” said the third-year undergraduate from the Singapore Institute of Management. Residents and members of the public who had visited either 115 Bukit Merah View Market and Food Centre or shops at 116 Bukit Merah View between May 25 and June 12 were urged to go for a free Covid-19 swab test.Staff and tenants who had been working at 115 Bukit Merah View Market and Food Centre from May 25 have been quarantined and would be swabbed during quarantine.Staff and tenants who had been working in the nearby 116 Bukit Merah View from May 25 also had to go for their mandatory swabbing to disrupt any wider, undetected community transmission.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/snaking-queues-form-at-bukit-merah-block-125a-for-covid-19-swabbing", "Source": "google"}