{"Type": "", "Time": "2021-06-15", "Headline": "Singapore woman caught without mask faces even more charges | The Star", "Text": "\n                    Tuesday, 15 Jun 2021\n                Phoon seen in widely shared video clips taken at Marina Bay Sands (left) and Clarke Quay Central.- SCREENGRABS FROM FACEBOOKSINGAPORE (The Straits Times/ANN): More charges, including those involving the Immigration and Checkpoints Authority, are expected to be handed to a woman who was caught on video refusing to wear a mask at Marina Bay Sands (MBS) integrated resort amid the Covid-19 outbreak, a district court heard on Tuesday (June 15).The prosecutor mentioned the additional charges on Tuesday in asking for a three-week adjournment. Details about these charges were not revealed in court.Phoon Chiu Yoke, 53, currently faces seven charges over various offences, including failing to wear a mask at public places such as MBS, Bras Basah Complex and outside the State Courts building.The Singaporean, who was not represented by a lawyer, told District Judge Janet Wang on Tuesday that she wants to apply for these charges to be dropped.Stressing that she is a former naval officer, Phoon said that she had been \"an eyewitness or plaintiff\" in earlier cases linked to the Singapore Armed Forces (SAF) and that it would be difficult for her to have a fair hearing due to these cases.\"I am not privy to discuss all these cases in court here without causing embarrassment or being prejudicial to the SAF and to the Government of Singapore... (I) am applying for all these charges to be dropped,\" she said.\"Due to all these cases in the past, I should be granted immunity as a citizen.\"Judge Wang replied that the earlier cases are not relevant to her current set of charges.At an earlier hearing on May 25, the court ordered that Phoon be remanded at the Institute of Mental Health for two weeks for psychiatric assessment.Arguing against the order at the time, Phoon also said she was a former naval officer, with a history of good conduct.She added that she had returned from holiday and was unaware of the laws requiring her to wear a mask.She first appeared in court last year after she allegedly failed to wear a mask over her nose and mouth \"at all times\" at Newton hawker centre between 7.20pm and 8pm on May 8 during the circuit breaker period.She left Singapore for Britain soon after that alleged offence. She returned to Singapore on June 28 last year and had to serve a 14-day stay-home notice at MBS until July 12.The court earlier heard that she allegedly left her hotel room at MBS between 8.07pm and 8.23pm on June 28.Phoon is said to have loitered around various places in the hotel and is accused of failing to wear a mask while doing so.Following this, she allegedly failed to wear a mask in public places on multiple occasions between Dec 2 last year and May 24 this year, at MBS and outside the State Courts building, as well as at Clarke Quay Central and Bras Basah Complex.She was arrested on May 25 this year.On Tuesday, her case was adjourned to July 6. She remains out on bail of $8, 000.First-time offenders who breach laws under the Covid-19 (Temporary Measures) Act can be jailed for up to six months and fined up to $10, 000.Repeat offenders can be jailed for up to a year and fined up to $20, 000. - The Straits Times/Asia News Network\nTags / Keywords:\nSingapore\n                                                                ,\n                                                                                                woman\n                                                                ,\n                                                                                                mask\n                                                                ,\n                                                                                                charges\n                                                                ,\n                                                                                                Phoon Chiu Yoke\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/15/singapore-woman-caught-without-mask-faces-even-more-charges", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}