{"Type": "", "Time": "2021-06-15", "Headline": "Dickson Yeo, man who spied for China, to remain behind bars", "Text": "SINGAPORE — Dickson Yeo, the Singaporean man who was jailed in the US for spying for China and was arrested by the Internal Security Department (ISD) upon his return to Singapore last year will be continue to be held in detention under the Internal Security Act.In a statement on Tuesday (15 June), the department said its investigations have established that Yeo \"worked for the intelligence apparatus of a foreign state and had carried out various taskings given to him by his foreign handlers in exchange for monetary gains\".From 2016 until his arrest in the US in 2019, Yeo was asked to source for information and provide reports on issues, including information relating to Singapore, and had approached various people in Singapore to try to get information for his reports, said the ISD.He also set up a front company in Singapore as a cover, not only for information-gathering activities but also for his foreign handlers to recruit others.\"He had also tried, but failed, to secure employment in the Singapore government sector to further his information-gathering activities,\" the department added.The ISD said its investigations are still ongoing and Yeo's continued detention is necessary \"to facilitate probes into the full extent of his activities\".\"The Singapore Government takes a very serious view of anyone who enters into a clandestine relationship with a foreign government and engages in activities at the behest of the foreign power that is inimical to our national security and interests, including bilateral relations,\" the department added.Yeo was a doctoral candidate at the National University of Singapore's Lee Kuan Yew School of Public Policy (LKYSPP) when he was recruited by Chinese intelligence officers after a 2015 trip to Beijing to give a presentation on the political situation in Southeast Asia.He was first arrested by American counterintelligence officers in November 2019. He pleaded guilty in July last year to one charge of operating illegally as a foreign agent, and admitted to working between 2015 and 2019 for Chinese intelligence “to spot and assess Americans with access to valuable non-public information, including US military and government employees with high-level security clearances”.A few days after he entered his plea, LKYSPP said it had terminated Yeo’s PhD candidature with immediate effect. Yeo had enrolled as a PhD student there in 2015 and was granted a leave of absence in 2019.In October last year, Yeo was jailed for 14 months in the US for passing to the Chinese government valuable, but unclassified, military and political information that he had duped a number of Americans into giving him. Prosecutors said that Yeo was motivated by monetary gain and a shared desire with China to weaken the global standing of the US. Among the information Yeo handed over to China were reports on a military aircraft program, US troop withdrawal in Afghanistan and on a US Cabinet member, who was not identified in court documents.“I take full responsibility for what I have done,” Yeo reportedly said during sentencing. “I am sympathetic to China’s position, but it was not my intention to harm anyone.”In a statement announcing his arrest upon his return to Singapore in December last year, Singapore's Ministry of Home Affairs said, “Singapore will not allow our nationals to be subverted or used by any foreign actors for activities prejudicial to our security and national interests.\"We will deal firmly with such individuals in accordance with our laws,” the ministry added.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeRelated story:Dickson Yeo, Singaporean who spied for China, arrested by ISDSingaporean pleads guilty in US to working for Chinese intelligenceSingapore man sentenced to prison for spying for China in USReigning champions Portugal begin their defence of the trophy against Hungary at Euro 2020 in Budapest on Tuesday as World Cup holders France take on Germany in a hotly-anticipated clash between two of the continent's heavyweights.An ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces.US President Joe Biden will seek the EU's backing on Tuesday to face the rise of China, but Brussels wants a swift end to lingering trade rows and a clean break from Donald Trump.Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Spain opened their Euro 2020 campaign with a goalless draw against Sweden in Seville on Monday after their preparations were badly affected by Covid-19, while Patrik Schick scored one of the championship's great goals in the Czech Republic's 2-0 win over Scotland.The Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the \"systemic challenges\" posed by its policies.Here are three growing businesses that should be cheap enough to add to your investment watchlist. The post 3 Undervalued Gems That You Can Add to Your Watchlist appeared first on The Smart Investor.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.The Copa America that almost never was opened Sunday in Brazil, overshadowed by the desperate search for a last-minute host, sponsor withdrawals and Covid-19 -- including outbreaks on three teams.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.The first crew for China's new space station prepared to blast off this week for the latest step in Beijing's ambitious programme to establish itself as a space power.With its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Major US indices finished at fresh records Monday as global equity markets began the week cautiously ahead of a much-anticipated Federal Reserve meeting.Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.The WHO warned Monday that Covid-19 was moving faster than the vaccines, and said the G7's vow to share a billion doses with poorer nations was simply not enough.A man who smuggled six animals from a pet shop Johor Bahru into Singapore through his car's spare tyre compartment was jailed for 24 weeks on Monday (14 June).", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/dickson-yeo-singaporean-spied-china-remain-behind-bars-040547816.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}