{"Type": "", "Time": "2021-06-15", "Headline": "NParks to step up patrols, put up more signs to prevent manhandling of intertidal creatures, Environment News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The National Parks Board (NParks) said on Tuesday (June 15) that it will be taking extra steps to prevent beachgoers from manhandling marine creatures in intertidal areas, following an influx of people to Changi Beach during low tide last weekend.These include putting up more signs and stepping up patrols by NParks staff, volunteers and nature groups, said Mr Ryan Lee, group director of NParks' National Biodiversity Centre, in response to media queries.\"We will raise awareness on the detrimental effects of touching, collecting or trampling on marine wildlife in their natural habitats,\" he added.Touching wildlife causes unnecessary stress to these creatures. Soft-bodied organisms may also be vulnerable to injury from being poked and prodded.Crowds armed with pails, tongs and shovels were seen flocking to the intertidal areas of Changi Beach at low tide on Sunday (June 13).They were also seen gathering in groups of more than two - which had been the Covid-19 safe management requirement then.But they were not there to pick up rubbish.Instead, posts circulating on social media showed families poking and digging up marine creatures such as anemones, crabs and jellyfish and placing them in buckets.It was not immediately clear from the photographs and videos if the creatures were being harvested as seafood.Animals not typically consumed, such as sea anemones, were also seen in the buckets.Mr Lee said NParks was concerned by the large number of visitors over the weekend to the intertidal area in Changi Beach, and the collection of shellfish and other invertebrates.However, other than certain rare species, invertebrates - marine and land creatures without backbones, including shellfish and crabs - are not protected under the Wildlife Act.The Act, which came into effect in 2020, is meant to extend greater protection to Singapore's native wildlife.The Straits Times understands that conservationists had, during consultations on the scope of the law, raised the need to include such creatures under the Wildlife Act.Queried on this, NParks told ST that other than certain rare species, it would be challenging for the Act to cover all invertebrates as this would include common pests, such as ants and cockroaches.As for the Parks and Trees Act - another piece of legislation governing the use of Singapore's nature areas - Mr Lee said the intertidal area of Changi Beach is not covered under it.ST understands that while NParks manages Changi Beach Park, the beaches are not under its purview.Under the Parks and Trees Act, wildlife, including invertebrates, cannot be collected in Singapore's nature reserves and parks, including Sisters' Islands Marine Park, Sungei Buloh Wetland Reserve, Labrador Nature Reserve's rocky shore and Chek Jawa Wetlands.Mr Lee said Singapore's parks are shared spaces for all to enjoy.He added: \"We request park visitors to be socially responsible and to keep our green spaces safe for everyone.\"National University of Singapore marine biologist Neo Mei Lin, who studies giant clams – invertebrates threatened with extinction in Singapore and covered under the Wildlife Act – said NParks’ proposed efforts are welcome and greatly needed, especially for seashores easily accessible to the public. But she added: “I still firmly believe that we need to include underappreciated invertebrates under the Act, even if this is done in a phased manner of first including the more endangered ones. Otherwise, the law gives the impression that it’s okay to mistreat these creatures, while at the same time criminalising those who pluck plants in our public parks.”Last weekend's incident was the latest in a string of cases involving marine life affected by human recreational activities in Singapore.In May, an eagle ray was reeled in at East Coast Park and dragged to shore, thrashing all the way.It followed another incident earlier in May involving a critically endangered hawksbill turtle, found dead within a drift net in the waters off Pulau Hantu, one of Singapore's southern islands.Another drift net found draped over corals off Lazarus Island was later retrieved by marine biologists from the National University of Singapore.The net had \"whipped\" the corals - leaving marks on their soft tissue - and also ensnared crabs, one of which had been found alive but without four of its legs.Drift nets are kept vertical by floats at the top and weights at the bottom, and they trap everything in their path.While the Fisheries Act bars the use of trawl nets, poison or explosives to catch fish, it is not clear if drift nets are allowed.ST has reached out to the Singapore Food Agency for comment.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/environment/nparks-to-step-up-patrols-put-up-more-signs-to-prevent-manhandling-of", "Source": "google"}