{"Type": "", "Time": "2021-06-15", "Headline": "ICC prosecutor presses full probe into Duterte’s ‘crimes against humanity’, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.MANILA – The outgoing chief prosecutor of the International Criminal Court is seeking a full probe into allegations of “crimes against humanity” against Philippines President Rodrigo Duterte, whose bloody drug war has left thousands dead since 2016.In a 57-page report to the ICC’s judges, Ms Fatou Bensouda said “there is a reasonable basis to believe” that security forces and state-sanctioned “vigilantes” killed 12,000 to 30,000 drug suspects from July 1, 2016, to March 16, 2019.These extrajudicial killings “appear to have been committed” as part of Mr Duterte’s brutal drug war, said Ms Bensouda.She said security officials themselves “paid police officers and vigilantes bounties” to execute people suspected of being involved in the drug trade.“State officials at the highest levels of government also spoke publicly and repeatedly in support of extrajudicial killings and created a culture of impunity for those who committed them,” she said.Ms Bensouda, who retires on Tuesday (June 15), said the investigation should include the years when Mr Duterte was mayor of Davao City and had unleashed the same bloody war on the narcotics trade there.She said a full investigation would unearth evidence “sufficiently grave” to warrant the filing of formal charges against Mr Duterte.The ICC has jurisdiction over Mr Duterte, she insisted, even if the Philippines officially withdrew from the ICC in 2019 after multiple complaints were filed against him.The ICC cannot force Mr Duterte to appear before it in The Hague.Mr Duterte has repeatedly denied links to the killings, insisting that most resulted from rivalries among drug gangs.He has also backed police accounts that most of those killed fought it out as they were being arrested.Mr Duterte has frequently ridiculed Ms Bensouda, who is from Gambia, and angrily rejected the investigation.Ms Bensouda's term of office ends on Tuesday, and \"any authorised investigation in the Philippines will fall to my able successor, Mr Karim Khan, to take forward\", she said.Britain's Mr Khan takes over from her as ICC prosecutor on Wednesday.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/international-criminal-court-prosecutor-requests-probe-into-philippines-killings", "Source": "google"}