{"Type": "", "Time": "2021-06-15", "Headline": "Singaporean Dickson Yeo, who spied for China, continues to be held under ISA | The Star", "Text": "\n                    Tuesday, 15 Jun 2021\n                Dickson Yeo. - STSINGAPORE (The Straits Times/ANN): A Singaporean man who had worked for China's intelligence services since 2016 has been detained for two years under the Internal Security Act (ISA) for being a threat to Singapore.Dickson Yeo, 40, had acted as a paid agent of a foreign state, said the Internal Security Department (ISD) on Tuesday (June 15).He was arrested by the ISD on Dec 30 last year (2020), after he was deported to Singapore from the United States upon completion of a 14-month jail term for spying for China in the US. Yeo was issued an Order of Detention under the ISA on Jan 29.\"ISD's investigations established that Yeo had worked for the intelligence apparatus of a foreign state and had carried out various tasks given to him by his foreign handlers in exchange for monetary gains,\" said the department.\"Yeo admitted to being fully aware that his foreign handlers were working for the intelligence apparatus of the foreign state.\"ISD said that Yeo was tasked to source information and provide reports on issues of interest to his foreign handlers, including information relating to Singapore.He had approached various individuals in Singapore to try and obtain information for the purpose of writing his reports. Yeo had set up a front company in Singapore as a cover for his information-gathering activities, as well as recruitment for his foreign handlers.\"He had also tried, but failed, to secure employment in the Singapore Government sector to further his information-gathering activities. Yeo had carried out these activities over a period from 2016 until his arrest in the US in 2019,\" said ISD.The department said investigations are ongoing and that Yeo's continued detention is necessary to allow ISD to find out the full extent of his activities.During a trip to Beijing in 2015, Yeo was recruited by Chinese agents who claimed to represent think-tanks. He was studying for a doctorate at the Lee Kuan Yew School of Public Policy at the National University of Singapore at that time.He was arrested by the ISD on Dec 30 last year, after he was deported to Singapore from the United States upon completion of a 14-month jail term for spying for China in the US.US court documents show he admitted to being offered money in exchange for political reports and information, initially on South-east Asia, before focusing on the US.He also made numerous trips to meet the Chinese agents he was in contact with, trawled social networking sites to find targets and was also directed to set up a fake consulting firm, Resolute Consulting - the same name as a renowned US firm.He then got a post as a visiting scholar at George Washington University in Washington and travelled to the US to continue his efforts.Living in the Washington area from January 2019 to July 2019, Yeo exploited networking opportunities in the area to spot and assess individuals from whom he could extract information.He was questioned by immigration officers at the John F. Kennedy airport in New York, when he returned to the US in November 2019.Spooked, he booked a flight to return the next day, when he was approached by Federal Bureau of Investigation agents. He agreed to be interviewed and was taken into custody.News of Yeo's arrest and guilty plea was announced last July and he was sentenced last October.He maintained before the court that he was supportive of the Chinese cause and claimed that he did not betray Singapore.When announcing his arrest upon returning to Singapore, ISD said Yeo had revealed to US investigators that his previous intelligence taskings targeted other states apart from the US.\"The Singapore Government takes a very serious view of anyone who enters into a clandestine relationship with a foreign government and engages in activities at the behest of the foreign power that is inimical to our national security and interests, including bilateral relations,\" said the ISD on Tuesday. - The Straits Times/Asia News Network \nTags / Keywords:\nSingapore\n                                                                ,\n                                                                                                China\n                                                                ,\n                                                                                                spy\n                                                                ,\n                                                                                                Dickson Yeo\n                                                                ,\n                                                                                                ISA\n                                                                ,\n                                                                                                detenttion\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/15/singaporean-dickson-yeo-who-spied-for-china-continues-to-be-held-under-isa", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}