{"Type": "", "Time": "2021-06-15", "Headline": "Indonesia warns COVID-19 cases may not peak until July as hospitals fill", "Text": "Jun 14, 2021 7:41 PM PHTIndonesia expects a new wave of coronavirus infections will peak in early July, as the highly transmissible delta variant becomes more dominant in some areas and with the occupancy of hospitals in Jakarta hitting 75%, officials said.COVID-19 infections in the world's fourth most populous country have been on the rise in recent weeks since holidays at the end of the Muslim fasting month, when millions flouted restrictions to travel across the archipelago.The delta variant was now \"more dominant\" in areas like Jakarta and other parts of Java, Health Minister Budi Gunadi Sadikin told a news conference on Monday, June 14.At least 60 cases of the variant had been detected in Kudus, Central Java, where hospitals were more than 90% full, said Wiku Adisasmito, spokesperson for the country's COVID-19 task force.On Sunday, June 13, Jakarta Governor Anies Baswedan said hospital occupancy rates in the city of 10 million had hit 75% and infections jumped by 50% in the past week and if the situation got worse authorities might have to consider reimposing coronavirus restrictions.\"The capital is in need of extra attention,\" Anies said in a statement posted on Facebook. \"If the condition gets out of control, we will enter an acute phase.\"Authorities plan to increase hospital capacity by 40% in Jakarta, while hotels will be converted into isolation centers, chief economics minister Airlangga Hartarto said on Monday.Indonesia has officially reported more than 1.9 million coronavirus infections and 53,116 deaths although recent seroprevalance studies show the true scale of the spread could be 30 times higher.On Sunday, Indonesia recorded almost 10,000 new COVID-19 cases, the highest number since February.Low rates of testing, contact tracing and genomic sequencing have made it harder to determine to what extent new variants might be driving new infections, but epidemiologists say it is likely a significant contributing factor. – Rappler.com", "Section": "", "Writers": "", "URL": "https://www.rappler.com/world/asia-pacific/indonesia-coronavirus-updates-june-14-2021", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}