{"Type": "World", "Time": "2021-06-15", "Headline": "UK's Johnson delays COVID-19 lockdown easing for England by 4 weeks", "Text": "LONDON: British Prime Minister Boris Johnson confirmed Monday (Jun 14) that the next planned relaxation of coronavirus restrictions in England will be delayed by four weeks, until Jul 19, as a result of the spread of the Delta variant.In a press briefing, Johnson voiced his confidence that he won't need to delay the plan to lift restrictions on social contact further, as millions more people get fully vaccinated against the virus.He said that by Jul 19, two-thirds of the British population will have been double-vaccinated.“I think it is sensible to wait just a little longer,” he said. \"Now is the time to ease off the accelerator, because by being cautious now we have the chance in the next four weeks to save many thousands of lives by vaccinating millions more people.”Accompanying the decision to delay the easing, Johnson said the government has brought forward the date by which everyone over the age of 18 will be offered a first dose of vaccine, from the end of July to Jul 19.\"It’s unmistakably clear the vaccines are working and the sheer scale of the vaccine rollout has made our position incomparably better than in previous waves,” he said.Under the government’s plan for coming out of lockdown, all restrictions on social contact were set to be lifted next Monday. Many businesses, particularly those in hospitality and entertainment, voiced their disappointment ahead of the official announcement.The Delta variant first found in India is estimated by scientists advising the government to be between 40 per cent and 80 per cent more transmissible than the previous dominant strain. It now accounts for more than 90 per cent of infections in the UK.When Johnson first outlined the government's four-stage plan for lifting the lockdown in England in February, he set Jun 21 as the earliest date by which restrictions on people gathering would be lifted. However, he stressed at the time that the timetable was not carved in stone and that all the steps would be driven by “data not dates” and would seek to be “irreversible\".The speed at which new coronavirus infections have been rising had piled the pressure on Johnson to delay the reopening so more people can get vaccinated.On Monday, the British government reported 7,742 new confirmed cases, one of the highest daily numbers since the end of February. Daily infections have increased threefold over the past few weeks but are still way down from the nearly 70,000 daily cases recorded in January.Many blame the Conservative government for the spike in infections, saying it acted too slowly to impose the strictest quarantine requirements on everyone arriving from India, which has endured a catastrophic resurgence of the virus.Across Europe, many countries, including France, have tightened restrictions for British travelers to prevent the Delta variant from spreading. Others, like Spain, are allowing British tourists to arrive without being required to take a test if they have been fully vaccinated.Despite concerns about the Delta variant, the UK's vaccine rollout has won plaudits as one of the world's speediest and most coherent. As of Monday, around 62 per cent of the British population had received one shot, while about 45 per cent had got two jabs.The rapid rollout of vaccines and a strict months-long lockdown helped drive down the number of virus-related deaths in the UK in recent months. Despite that, the country has recorded nearly 128,000 virus-related deaths, more than any other nation in Europe.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,United Kingdom,Britain", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/uk-britain-lockdown-extend-covid-19-virus-15014652", "Source": "google"}