{"Type": "", "Time": "2021-06-15", "Headline": "Aamir Khan reveals that he’d love to play Viswanathan Anand’s role in his biopic; chess master says, “I promise you would not have to gain weight for the role” : Bollywood News - Bollywood Hungama", "Text": "SEARCHLANGUAGEFOLLOW US ONFEEDBACKListen to this storyAamir Khan is known for his perfectionist streak and his intelligence. Hence, it’s not a surprise that his favourite pastime is playing chess, a game that tests your intelligence and sharp brain. The superstar has a very strong bond with chess grandmaster Viswanathan Anand and they have even played a few games at different occasions. Yesterday, both of them came together with Arijit Singh and others to play chess and have a fun chat.During the course of this chat, Samay Raina, the host and fellow chess enthusiast asked Aamir Khan, “If there’s an amazing biopic on Viswanathan Anand in the pipeline, would you be interested to take the lead role?” To which Aamir Khan smiled and rhetorically said, “Is that a question?” He added, “That’s one of the easiest questions to answer.”Aamir Khan then elaborated, “It would not only be an honour and pleasure to play Vishy (as he is fondly called), but it’ll also be highly exciting to get into his mind. When I play a character, I try to understand the person’s mind. And Vishy being a real person, I’ll obviously spend a lot of time with him to understand his mind and how his mind works. I would also speak to his wife and his family to further understand how his mind works. And then hopefully, I’ll surprise Vishy when I play him on screen. So I’d look forward to that if and when that happens.”Hearing this answer, Viswanathan Anand stated, “And I promise I won’t put you in a situation where you have to gain weight for the role.” Viswanathan’s smart reply had everyone in splits.Aamir Khan is meanwhile shooting for Laal Singh Chaddha. Bollywood Hungama had reported earlier in the day that the superstar resumed filming for this film today, in Mumbai. Directed by Advait Chandan, it is the official remake of Tom Hanks’ critically acclaimed film, Forrest Gump (1994).Also Read: Aamir Khan to resume shooting for Laal Singh Chaddha todayCatch us for latest Bollywood News, New Bollywood Movies update, Box office collection, New Movies Release , Bollywood News Hindi, Entertainment News, Bollywood News Today & upcoming movies 2020  and stay updated with latest hindi movies only on Bollywood Hungama.Skip this step for now5000 characters remaining", "Section": "", "Writers": "", "URL": "https://www.bollywoodhungama.com/news/bollywood/aamir-khan-reveals-hed-love-play-viswanathan-anands-role-biopic-chess-master-says-promise-not-gain-weight-role/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}