{"Type": "", "Time": "2021-06-15", "Headline": "Endowus Hires Ex-Deutsche Bank Managing Director", "Text": "Singapore-based digital wealth platform Endowus has hired a former Deutsche Bank executive and private banking veteran to bolster its investment capabilities.Wei Mei Tan joins Endowus as chief advisory officer and a member of its investment committee, according to a statement.Tan will be tasked with driving growth, providing leadership for advisory and investment solutions as well as building portfolio strategies and fund selection. Wealth VeteranTan joins from Deutsche Bank where she was most recently a managing director and global co-head of advisory and investment solutions responsible for building the wealth advisory platform. At Credit Suisse, she also successfully launched advisory platform CS Invest before leaving last as its APAC head of portfolio solutions. Tan has over 20 years of experience in financial services having previously also worked at UBS for six years as its APAC head of mandate specialists, advising ultra-high net worth clients on asset allocation and portfolio construction. Previously, she also worked in investment banking at Credit Suisse and J.P. Morgan after beginning her career at Temasek Holdings in portfolio management. «As an industry veteran, I believe [Tan’s] wealth of experience in client advisory and investment solutions will be essential in our next stage of growth and in meeting the needs of our clients,» said Samuel Rhee, Endowus chairman and chief investment officer, who is also the ex-CEO and CIO for Morgan Stanley Investment Management in Asia.All Money ManagementAccording to Endowus, it is the only digital wealth platform that allows Singaporean users to access all sources of investment monies including pension and retirement schemes Central Provident Fund (CPF) and Supplementary Retirement Scheme (SRS). In April this year, the firm also announced its first external fundraising of S$23 million ($17.3 million) from Lightspeed Venture Partners and Softbank Ventures Asia. + More on this topic", "Section": "", "Writers": "", "URL": "https://www.finews.asia/people/34694-endowus-hires-ex-deutsche-bank-managing-director", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}