{"Type": "", "Time": "2021-06-15", "Headline": "What is Critical Race Theory?: An Explainer - The Independent Singapore News", "Text": "Scholars and academics take issue with Lianhe Zaobao articleAuthorDateCategorySingapore—Racism has become a hot-button issue not only in Singapore but in many other parts of the world, and notably in the United States.One framework that seeks to explain the complex issues surrounding racism is Critical Race Theory, an academic concept started in the late 1970s in the US.In Singapore, Critical Race Theory (CRT) has been a topic of conversation of late, especially after it was mentioned in a June 9 editorial regarding racism in the Chinese daily Lianhe Zaobao, as well as a response to the editorial in the form of an open letter signed by over 200 Singapore scholars and academics.The signatories found the editorial, “Expanding public space to promote racial harmony”, problematic in it the way it characterises racism.The letter added that in the Zaobao editorial, CRT is misrepresented as “promoting hatred of white people (鼓吹仇视白人)” in the US “and by extension, of Chinese people in Singapore”.This misrepresentation had been “typically made by far-right commentators” in the US “who do not engage with the actual writings and concepts of CRT, and it is not befitting of a major newspaper of record such as Lianhe Zaobao to parrot such claims”.Canadian educator Sylvia Duckworth sought to provide a clear definition of what CRT is in this social media post from last month.She explained that CRT is an academic framework or practice that takes a look at how systems, policies, and the law maintain systemic racism.“It is called CRITICAL Race Theory because it asks you to look critically at systems to better understand the origins of racial inequities. This knowledge can then be used to mitigate and stem the inequities at the root cause (i.e. the system, policy, or law).”While CRT has been taught at the tertiary level in the US, proponents are advocating for it to be taught in high school as well. Dr Angel Jones, a CRT scholar, has underlined the importance of learning about CRT, as it gives individuals the tools to identify systems of oppression in order to challenge them.“CRT encourages students to become more civically engaged by equipping them with the tools they need to think critically about issues of race and racism.”Prof Duckworth added that with CRT, situations are analysed in a way that de-centres the “typical white narrative,” giving the example of younger students being taught “the truth behind the Christopher Columbus and Thanksgiving narratives (with a Colonizer/Colonized context) and then discuss how and why this differs from the history that is normally taught”.She also argued that CRT should not be feared, since a deeper understanding of racist systems and policies gives rise to solutions to dismantle them.“Only those who fear a loss of power will feel threatened,” she added.The writers of the open letter to Lianhe Zaobao noted the difference in the US and Singapore histories regarding racial issues, adding that “there is certainly room for debate on the exact ways concepts from CRT may apply in the Singapore context”.However, the authors pointed out that CRT’s framework is useful for understanding structural and historical racism in Singapore.  Hence, the problem with the Zaobao editorial.“By arguing that Critical Race Theory is to be blamed for stoking racial tensions, the article promotes a narrative of Chinese victimisation that implicitly rationalises these acts of verbal and physical violence against minorities. People who discuss issues of racism critically, especially people from minority groups, are now cast as aggressors, while the people responsible for racist acts of violence are cast as victims seeking redress. “Characterising critical conversations about racism as simply a case of imported ideology erases the lived experiences of racial minorities in Singapore. Moreover, assuming that Chinese Privilege is a direct importation of White privilege is not helpful, and distracts us from creating the space necessary to having meaningful and constructive conversations about racism in Singapore.”/TISG Read: Playwright Alfian Sa’at unpacks ‘ironic racism’ and the @sharonliew86 accountPlaywright Alfian Sa’at unpacks ‘ironic racism’ and the @sharonliew86 accountFollow us on Social MediaSend in your scoops to news@theindependent.sg Send in your scoops to news@theindependent.sg ", "Section": "", "Writers": "", "URL": "https://theindependent.sg/what-is-critical-race-theory-an-explainer/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}