{"Type": "", "Time": "2021-06-15", "Headline": "Philippines: Int'l court probe of drug killings is insulting - The Washington Post", "Text": "MANILA, Philippines — Philippine President Rodrigo Duterte will never cooperate with a possible International Criminal Court investigation into the thousands of killings under his anti-drugs crackdown, his spokesman said Tuesday, calling an international inquiry insulting to the country’s justice system.But human rights activists welcomed the possible investigation as a long-awaited step toward justice and accountability. A leading Duterte critic, jailed opposition Sen. Leila de Lima, said the Philippine leader may now be harboring fears of “being dragged in chains to the Hague” to be tried as “an enemy of mankind.”Outgoing ICC chief prosecutor Fatou Bensouda said Monday that a preliminary examination found reason to believe crimes against humanity had been committed during Duterte’s crackdown on drugs between July 1, 2016, and March 16, 2019.The dates cover the period between when Duterte launched his police-enforced crackdown shortly after winning a six-year presidential term and when he withdrew the Philippines from the court. Critics said at the time he was trying to avoid accountability.More than 6,000 mostly poor drug suspects have been killed, according to government pronouncements, but human rights groups say the death toll is considerably higher and should include many unsolved killings by motorcycle-riding gunmen who may have been deployed by police.Duterte has denied condoning extrajudicial killings of drug suspects although he has openly threatened suspects with death and has ordered police to shoot suspects who dangerously resist arrest.In comments late Monday, Duterte again threatened drug dealers who he said were endangering the country’s young people.“My personal guideline: Do not destroy my country. I will kill you,” Duterte said. “That’s the way it is. I will kill you to end the problem.”The ICC’s Bensouda said she has sought authorization to open a formal investigation. The court’s judges have 120 days to decide on her request.Duterte’s spokesman, Harry Roque, blasted Bensouda’s move as “legally erroneous,” saying the ICC, as an international court of last resort, could only intervene if a country’s judiciary and prosecutorial system fail to work and investigate domestic crimes. Roque cited many pending murder and other cases involving the government’s campaign against illegal drugs which were being tried by Philippine courts.“It’s an insult to all Filipinos for a foreigner like Bensouda and fellow Filipinos to say that our legal institution in the Philippines are not working and not dispensing justice,” Roque told a news conference. “How dare you say that the Philippine legal system is not working.”Roque said political “enemies” of Duterte and his administration filed the complaints before the ICC, adding “we will never cooperate because we are no longer a member.”Bensouda, however, stressed the court has jurisdiction over crimes alleged while the Philippines was still a member of the court.Rights activists welcomed Bensouda’s conclusion. Amnesty International said her announcement “is a much-awaited step in putting murderous incitement by President Duterte and his administration to an end.”Duterte said Monday that past investigations into the antidrug campaign, including by de Lima when she led the Commission on Human Rights and later the Department of Justice, did not produce any incriminating evidence.De Lima has said that witnesses were scared of the backlash if they openly testified against Duterte, who carved a political name as a city mayor with an extra-tough approach to crime before rising to the presidency.Duterte on Monday again maintained that those killed had fought back and endangered police. He said law enforcement officers were not fools who would kill for the sake of killing.A retired police officer, Arthur Lascanas, publicly stated in 2017 that when Duterte was mayor he had paid him and other members of a hit squad to kill criminals and opponents. Duterte’s team have denied the allegations.The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/world/philippines-intl-court-probe-of-drug-killings-is-insulting/2021/06/15/63304eea-cdaf-11eb-a224-bd59bd22197c_story.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}