{"Type": "Asia", "Time": "2021-06-15", "Headline": "Myanmar junta media accuse Karen armed group of killing 25 workers", "Text": "Myanmar's junta-controlled media on Monday (Jun 14) accused an ethnic armed group of killing 25 construction workers in the east of the country after abducting a group of 47 people last month.Reuters was unable to reach the Karen National Defence Organisation (KNDO) for comment on the accusation. The junta spokesman did not answer calls to seek further comment.Reuters was unable to independently verify details of the incident or the identities of those reported killed.Conflicts in Myanmar's borderlands have reignited in several places since the army seized power on Feb 1 and overthrew elected leader Aung San Suu Kyi.The Global New Light of Myanmar newspaper and army controlled Myawaddy Television showed pictures of what appeared to be 25 dead bodies laid in a forest clearing.They said the men had been working on the Uhu Creek Bridge in the Myawaddy District, near the border with Thailand, and were abducted from the construction site on May 31 in a group that also included 10 children and six women.The Global New Light of Myanmar said a total of seven bodies were found on Jun 11, one burnt and the others with hands tied behind their backs. It said the other 18 bodies were found on Jun 12.\"Officials from the bridge construction site checked the dead bodies with their identities to inform parents and relatives,\" it said.Fighting has intensified in eastern Myanmar since the coup and clashes have driven thousands of people from their homes.The KNDO, which has been fighting for greater autonomy for the Karen people since 1947, is among the ethnic armed groups that have strongly opposed the military takeover.The junta's forces have killed more than 860 people since the coup, according to the Assistance Association for Political Prisoners activist group. The junta has said the number is much lower.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Myanmar", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/myanmar-junta-karen-ethnic-armed-group-killing-15010430", "Source": "google"}