{"Type": "", "Time": "2021-06-15", "Headline": "China Nuclear Plant Issue Prompts Board Meeting Call From EDF - Bloomberg", "Text": "The Taishan Nuclear power plant in back in 2013.Photographer: Peter Parks/AFP/Getty ImagesThe French utility that partly owns a nuclear power plant near Hong Kong is seeking more information on a gas buildup in a reactor, even as its Chinese partner insists the facility is operating safely.Electricite de France SA, which has a 30% stake in the Taishan nuclear plant in South China, has called for an extraordinary board meeting with majority owner China General Nuclear Power Corp., or CGN, to discuss the increased concentration of inert gases at the Unit 1 reactor in Guangdong.Paris-based EDF’s call for more information on the issue -- first detected in October -- comes after CGN said Sunday that environmental indicators at and around the facility are normal. It’s premature to say whether the reactor will have to be halted, spokespeople for EDF said.A spokesperson for Shenzhen-based CGN referred to earlier statements on the issue when asked to comment on EDF’s request. Shares of the firm’s Hong Kong-listed unit fell as much as 3.5% in Tuesday trading as other uranium-related stocks dropped.Data from the joint company that operates the facility, TNPJVC, suggest the coating on “a few fuel rods” has deteriorated, leading to increased gas within the primary loop of the reactor, EDF told reporters Monday.The system is designed to collect and treat these gases before they are released outside the plant, and the gas buildup and emissions have remained within Chinese regulatory limits, which are in line with average international standards, EDF said.China’s National Nuclear Safety Administration said in April the plant’s Unit 1 had experienced an operational incident that was categorized as minor, and not of safety significance.EDF, the world’s largest operator of nuclear power stations, has faced fuel rod leaks at its French plants in the past. Such leaks don’t necessarily require a halt if gas emissions remain within regulatory limits, the spokespersons said. In France, the deterioration of fuel rods was caused either by a default in the fuel assemblies, or because they were damaged by a stray element in the reactor, they said.The Taishan plant, about 130 kilometers (80 miles) west of Hong Kong, has two units with a combined capacity of 3.3 gigawatts that came online in 2018 and 2019, making them the most powerful reactors in operation. They were designed by Framatome, a subsidiary of EDF, which also supplied their atomic fuel. Each reactor contains 241 fuel assemblies, which consist of 265 rods each, according to the French utility.Framatome warned the U.S. government of an “imminent radiological threat” at the plant, CNN reported Monday, citing unnamed U.S. officials and documents the news network says it has reviewed.The unit is “supporting resolution of a performance issue with the Taishan Nuclear Power Plant,” Framatome said in an email, adding that “according to the data available, the plant is operating within the safety parameters.”Several high-level meetings have taken place in Washington, as well as discussions between the U.S. and French governments and contact between the U.S. and Chinese administrations, as a result of Framatome’s concerns, CNN reported.U.S. officials do not believe the situation poses a severe safety threat to the public or workers at the plant, CNN said.The Taishan issue is arising amid a power shortage in Guangdong, the country’s industrial hub, that has caused more than 20 cities to ration electricity to some companies and factories. Unit 1 was operating normally and Unit 2 was reconnected to the grid last week after an overhaul, CGN said.Issues at the China facility are also a new setback for EDF, which is facing construction delays and cost overruns at similar atomic projects in France and the U.K. It’s been showcasing the Taishan reactors to convince these two countries to build more such nuclear plants, and other nations such as Poland and India to adopt the technology.China is the world’s third-biggest nuclear power market, after the U.S. and France, and has the most new reactors under construction. It’s never had a serious nuclear accident on domestic soil.— With assistance by Alfred Cang, and Krystal Chia", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-14/edf-flags-fuel-issue-at-chinese-nuclear-plant-near-hong-kong", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}