{"Type": "", "Time": "2021-06-15", "Headline": "Subsidies to help S'pore F&B businesses offset delivery costs extended by another month, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - As shifting consumer preferences continue to boost the demand for food deliveries, Enterprise Singapore (ESG) is extending its subsidies package for food and beverage (F&B) businesses using such services by an additional month.\"This will support F&B businesses as we gradually move back to phase three (heightened alert), and encourage them to continue with food delivery sales in the longer run,\" said ESG in a statement on Sunday (June 13).The Food Delivery Booster Package, which subsidises part of F&B businesses' food delivery costs, will be extended to July 15.The package, which started on May 16, was initially meant to run till June 15 to help F&B businesses affected by tightened restrictions under phase two.Along with the extension, seven more food delivery platforms and third-party logistics players have been added to the pool which F&B businesses can work with, bringing the total to 13.The new additions are food delivery platform Bungkus, and third-party logistics companies Chope, GrabExpress, pandago, DLVRD, Milkrun and YY Circle. The initial pool of six are food delivery platforms Deliveroo, foodpanda and GrabFood, and third-party logistics companies Lalamove, Zeek Logistics and Pickupp.Under the extension, ESG will continue to provide funding for 5 percentage points of the commission cost charged by food delivery platforms as well as 20 per cent funding of delivery costs for those who use third-party logistics partners.From Monday, some Covid-19 restrictions will be loosened, with social gatherings of up to five persons allowed. However, dining in eateries will be allowed only from June 21, assuming the pandemic situation remains under control.Noting that dine-in restrictions in the past few weeks have been challenging for the F&B sector, Minister of State for Trade and Industry Low Yen Ling said the extension of the booster package \"seeks to alleviate the painful effects of disruption and offer a longer runway of support even after dine-in services resume on June 21\".Since being reintroduced last month, the booster package has benefited more than 10,000 F&B establishments, said Ms Low.However, she also highlighted that \"food delivery is becoming part and parcel of the new normal\".Preliminary estimates by ESG show that the daily average number of online food deliveries supported by the booster package was close to 20 per cent higher under phase two (heightened alert) than during the circuit breaker last year.According to ESG, the percentage of sales from online food delivery increased from an average of 12.5 per cent from January to March 2020 to 22.5 per cent in the same period this year.With the uncertainty of the pandemic, ESG said the booster package is also meant to encourage businesses to continue with food delivery sales as part of their long-term strategy so that they can be more resilient amid future business disruptions.Asian gastropub Slake managed to diversify its revenue streams after using an ESG grant to develop an online storefront, which enabled it to tap ESG’s booster package.After a marketing campaign  boosted  its sales and social media presence, Slake is  now looking into converting its Siglap kitchen into a cloud kitchen and setting up a second one later this year. Mirroring ESG's sentiment, Ms Low said: \"Consumers are increasingly savvy in searching online for the best food and deals to be sent to their doorsteps. We hope the extended Food Delivery Booster Package will place our F&B establishments on a firm footing for a resilient recovery as they gain new skills and platforms critical for long-term growth.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/subsidies-to-help-spore-fb-businesses-offset-delivery-costs-extended-by-another-month", "Source": "google"}