{"Type": "World", "Time": "2021-06-15", "Headline": "At NATO, Biden says defence of Europe a 'sacred obligation'", "Text": "BRUSSELS: US President Joe Biden told fellow NATO leaders on Monday (Jun 14) the defence of Europe, Turkey and Canada was a \"sacred obligation\" for the United States, a marked shift from his predecessor Donald Trump's threats to withdraw from the military alliance.Arriving in Brussels from the weekend's G7 summit in England, Biden again sought to rally Western allies to support a US strategy to contain China's military rise as well as showing unity in the face of Russian aggression.\"Article Five is a sacred obligation,\" Biden said, referring to the transatlantic alliance's collective defence pledge. \"I want all Europe to know that the United States is there,\" he said after arriving in his black presidential limousine.\"NATO is critically important to us,\" said Biden, who is seeking to mend ties after Trump's denigration of the nuclear-armed alliance over the past four years and what Trump said were its \"delinquent\" members.Allies are expected to brand China a security risk to the Western alliance for the first time, a day after the Group of Seven rich nations issued a statement on human rights in China and Taiwan that Beijing said slandered its reputation.Biden said both Russia and China were not acting \"in a way that is consistent with what we had hoped\", referring to Western efforts since the mid-1990s to bring both countries into the fold of liberal democracies.Allied leaders are concerned about Russia's recent military build-up near Ukraine, as well as its covert and cyber attacks to undermine Western states, although Moscow denies any wrongdoing. China is no longer seen as a benign trading partner.NATO Secretary-General Jens Stoltenberg said China's growing military presence from the Baltics to Africa meant NATO had to be prepared. \"China is coming closer to us. We see them in cyber space, we see China in Africa, but we also see China investing heavily in our own critical infrastructure,\" he said, a reference to ports and telecoms networks.\"We need to respond together as an alliance.\"Diplomats said the NATO summit's final communique would not call China an adversary - and Stoltenberg said China was not an enemy - but would demonstrate concern, calling it a \"systemic\" challenge to Atlantic security as it joins Russia with military drills, launches cyber attacks and rapidly builds up its navy.G7 nations meeting in Britain over the weekend scolded China over human rights in its Xinjiang region, called for Hong Kong to keep a high degree of autonomy and demanded a full investigation of the origins of the coronavirus in China.China's embassy in London said it was resolutely opposed to mentions of Xinjiang, Hong Kong and Taiwan, which it said distorted the facts and exposed the \"sinister intentions of a few countries such as the United States\".\"China's reputation must not be slandered,\" the embassy said on Monday.British Prime Minister Boris Johnson, arriving at the summit, said there were both risks and rewards with Beijing.\"When it comes to China, I don't think anybody around the table wants to descend into a new Cold War with China,\" he said.DEEP ECONOMIC TIESSince Russia's 2014 annexation of Crimea, NATO has modernised its defences but has only recently begun to look more seriously at any potential threat from Chinese ambitions.From Chinese investments in European ports and plans to set up military bases in Africa to joint military exercises with Russia, NATO is now agreed that Beijing's rise deserves a strong response, although envoys said that would be multi-faceted.Allies are mindful of their economic links with China. Total German trade with China in 2020 was over 212 billion euros ($256.82 billion), according to German government data, making Beijing the top trade partner in goods.Total Chinese holdings of U.S. Treasuries as of March 2021 stood at $1.1 trillion, according to US data, and total US trade with China in 2020 was $559.2 billion.Biden will meet Russian President Vladimir Putin on Tuesday in Geneva.Lithuanian President Gitanas Nauseda said that Russia was trying to \"swallow\" Belarus and that NATO needed to be united in deterring Moscow.\"Belarus is losing the last elements of the independence, and those trends are very dangerous,\" Nauseda said on arrival.Leaders are also set to commit to reducing NATO militaries' climate impact, and to lowering the bar for any retaliation to cyber attacks. Space, Afghanistan and political reforms to make NATO more responsive in a multipolar world are on the agenda.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "NATO,Joe Biden,China,Russia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/at-nato-biden-says-defence-of-europe-a-sacred-obligation-15012516", "Source": "google"}