{"Type": "", "Time": "2021-06-15", "Headline": "Five times as many as estimated may have died of Covid-19 in India", "Text": "\nRevised death tolls suggest that more than a million may have died during India's brutal second coronavirus wave, which is now ebbing\nAs India’s devastating Covid-19 second wave continues to subside, data has emerged that suggests undercounting of its virus death toll by up to five times during the spring.Officially, India has reported 374,000 fatalities from the virus but successive modelling studies by epidemiologists had already predicted the toll is much higher.Approximately 1.2 million Indians had already died by May 15, according Dr Bhramar Mukherjee, a Professor of Public Health and Epidemiology at the University of Michigan, who has been tracking India’s pandemic.Now, new analysis of government mortality data from the southern state of Andhra Pradesh shows over 130,000 deaths in May, nearly five times the number of fatalities for the same month in 2018 and 2019.In the central state of Madhya Pradesh, April and May saw nearly three times as many deaths as in previous years.  The authorities in both states refused to comment on whether the additional deaths were due to the virus but across India, there have been repeated reports of state governments undercounting Covid-19 fatalities.Politically, India is governed via a federal system and this has encouraged state governments to underreport Covid-19 fatalities in political point-scoring and to reduce panic among citizens. In many states, Covid-19 fatalities were often only reported if the victim had no other co-morbidities, and instead fatalities were marked as being related to a variety of other causes, including heart attacks or diabetes.A succession of investigations by the Indian and international media found the number of daily Covid-19 burials at individual cremation sites were also exceeding city-wide death tolls. In India’s capital of Delhi, families of Covid-19 victims reported that they were having to wait for up to 24 hours to cremate their bodies.On Wednesday, Bihar, one of India’s poorest states, revised its total Covid-19 death toll from 5,424 to 9,429 following an investigation, after partially decomposed bodies of dozens of alleged virus victims were found floating in the River Ganges.The true Covid-19 death toll could be higher still in Bihar, though, as even pre-pandemic, only one-third of fatalities were registered. This figure is believed to have dropped further with people wary of visiting hospitals out of fear of contracting the virus themselves. There has also been a slight increase in deaths from other chronic diseases, such as cancer or kidney disease, as some patients were unable to access life-saving treatment during the height of Covid-19 admissions.However, there are increasingly encouraging signs that India’s devastating second wave is starting to ebb. On Monday, the number of new daily cases dropped to 70,421, after exceeding 400,000 in mid-May.In the city of Ahmedabad, in one of India’s worst-hit states of Gujarat, doctors reported that the occupancy of Covid-19 beds had fallen from 98 percent on March 23 to just two percent on June 12.Protect yourself and your family by learning more about Global Health Security We rely on advertising to help fund our award-winning journalism.We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future.Thank you for your support.Need help?Visit our adblocking instructions\npage.", "Section": "", "Writers": "", "URL": "https://www.telegraph.co.uk/global-health/science-and-disease/five-times-many-estimated-may-have-died-covid-19-india/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}