{"Type": "", "Time": "2021-06-15", "Headline": "\n                                    EDF examines gas buildup at Chinese nuclear plant -\n                        Nikkei Asia\n                        ", "Text": "French energy group cites potential issues with fuel rods and sealsSINGAPORE/PARIS (Reuters) -- French power group EDF has begun examination of a potential issue linked to a build-up of inert gases at its nuclear power station in China, though the company and its Chinese partner said the plant was operating safely.CNN reported on Monday that the U.S. government had spent the past week assessing a report of a leak at the Taishan power plant in Guangdong province run by a joint venture between EDF and China General Nuclear Power Group (CGN).The U.S. news network reported that Framatome, the EDF business that designed the plant's reactor and remains involved in its operations, had warned of an \"imminent radiological threat\".EDF said the build-up of noble gases krypton and xenon, which it said had affected the primary circuit of reactor No.1 of the Taishan plant, was a \"known phenomenon, studied and provided for in the reactor operating procedures\".A group spokesman said this could be because of an issue with fuel rods and seals. Measurements of inert gases were below maximum levels authorised in China, the spokesman said, adding that it was too early to say whether the reactor would have to be shut down.Krypton and xenon do not tend to react with other substances but they do have radioactive qualities and are therefore subject to constant monitoring.EDF has called for a meeting with CGN to go over the findings, though no date has yet been set.State-run CGN, the majority owner of the joint venture, said operations at the plant met safety rules and the surrounding environment is safe.\"Regular monitoring data shows the Taishan station and its surrounding environment meet normal parameters,\" it said in a statement on its website late on Sunday.Framatome said it was supporting efforts to resolve the situation.\"According to the data available, the plant is operating within the safety parameters\", the company said in a statement, adding that it was working with experts to assess the situation.TNPJVC, the joint venture behind the plant, is 70% owned by CGN and 30% by EDF.The International Atomic Energy Agency, the U.N. atomic watchdog, said: \"At this stage, the agency has no indication that a radiological incident occurred,\" and that it was in contact with officials in China about the issue.France's nuclear watchdog ASN had no immediate comment. The U.S. State Department and U.S. Nuclear Regulatory Commission referred queries to the Energy Department and the White House did not respond immediately to questions from Reuters.The Taishan reactor is the first French-designed Evolutionary Power Reactor (EPR) to become operational. The technology is also being deployed in France, Finland and at the Hinkley Point C project in Britain.Power from the plant serves the Guangzhou and Shenzhen areas, Guangdong province's major manufacturing hubs, which have faced power shortages in recent weeks due to hot weather and lower than normal hydropower supplies from neighbouring Yunnan province.CNN said the warning by Framatome included an accusation that the Chinese safety authority was raising the acceptable limits for radiation detection outside the Taishan plant to avoid having to shut it down.A Reuters call for comment to the National Nuclear Safety Administration went unanswered during a public holiday.Sign up to our newsletters to get our best stories delivered straight to your inbox.Discover the all new Nikkei Asia appDiscover the all new Nikkei Asia appStay ahead with our exclusives on Asia; the most dynamic market in the world.Stay ahead with our exclusives on AsiaGet trusted insights from experts within Asia itself.Get trusted insights from experts within Asia itself.\n                Stay ahead with our exclusives on Asia; the most dynamic market in the world.\n            \n                Get trusted insights from experts within Asia itself.\n            Offer ends January 31stYou need a subscription to... \n            You need a subscription to:\n        \n        Nikkei Asian Review, now known as Nikkei Asia, will be the voice of the Asian Century.\n    ", "Section": "", "Writers": "", "URL": "https://asia.nikkei.com/Business/Energy/EDF-examines-gas-buildup-at-Chinese-nuclear-plant", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}