{"Type": "", "Time": "2021-06-15", "Headline": "\n            F365 Says: Dominant Spain suffer from familiar flaw        ", "Text": "Home  F365 Says  F365 Says: Dominant Spain suffer from familiar flawDate published: Monday 14th June 2021 10:54                 - Ian Watson Spain’s lack of potency is nothing new but Luis Enrique must find a fresh and swift solution… Luis Enrique is unlikely to panic after seeing his Spain side fail to make their dominance pay against Sweden. With one win from their last six major tournament openers, La Roja are used to starting slowly.Another familiar failing, though, will keep Enrique awake tonight after this stalemate in Seville. Spain’s positive approach play, once again, was wasted by their forward line.Never did Spain look more like a team of midfielders. With 75 per cent possession, the hosts passed and passed, 953 times to be precise – 231 more passes than any other team in the group stage so far – but with Sweden content to sit back and watch the merry-go-round, Enrique’s men struggled to proportionately test Robin Olsen.That is not to say Spain did not create chances. Rather, the ones they did were hopelessly wasted. And the hosts did not muster enough opportunities to be so profligate.This was always the fear for Spain. Despite their previous pedigree and the obvious talent within Enrique’s ranks, the lack of potency in attack has kept them off many people’s list of genuine contenders to win the tournament.17 – Spain had 17 shots in tonight's draw against Sweden, their highest tally in a major tournament game (European Championships + World Cup) without scoring since having 25 attempts against Switzerland in a group stage match at the 2010 World Cup. Stalemate. #EURO2020 #ESP #SWE pic.twitter.com/BbvT0vopUn— OptaJoe (@OptaJoe) June 14, 2021The absence of firepower and concerns over the heart of their defence were seen the primary flaws in Enrique’s plan, but the forward line must be a far greater concern for Enrique than the raw partnership between Pau Torres and Aymeric Laporte.Alvaro Morata, handsome-yet-hapless, is the obvious poster boy for Spain’s striking woes. The Atletico Madrid striker, who spent the season on loan at Juventus, was trusted by Enrique to lead the line but Morata proved his many doubters right once more.He wasted Spain’s biggest chance, one that arrived courtesy of Sweden’s only defensive slip of the night. The otherwise-excellent Marcus Danielson missed Jordi Alba’s hopeful pass to allow Morata a clear shot but with time and space to pick his spot, the striker inexplicably rolled the ball wide of the target.Morata’s subsequent subdued slump towards Enrique’s hook was inevitable to anyone who saw the forward endure a miserable season and a half at Chelsea. No club among Chelsea, Real Madrid, Atletico, Juventus has yet trusted Morata to lead their line for more than two consecutive seasons before deciding to source their goals elsewhere.For Enrique, consecutive games at Euro 2020 would be too many. Morata is certainly not the only striker for whom confidence is key, but few are as extreme as the 28-year-old. Morata has failed to score in his last four Spain appearances and he has only two goals in eight appearances since earning another shot in Enrique’s squad at the back end of last year.Gerard Moreno is the most obvious replacement, but Ferran Torres was moved inside for a brief attempt at leading the line after Morata was withdrawn on 66 minutes. Torres lasted only eight minutes more before being replaced by Moreno. And the Villarreal striker was guilty too of wasting a glorious late chance when he directed a close-range header straight at Olsen.When Enrique assesses his options for the crucial clash with Poland on Saturday night, Moreno offers the most in-form alternative to Morata. His 30 goals in 46 games in all competitions for Villarreal make a most compelling case.Enrique could be forgiven for looking enviously at Sweden’s biggest threat, Aleksander Isak. The Real Sociedad striker was constant threat to Spain. The 21-year-old’s power and technique created Sweden’s two best opportunities, with Spain lucky to avoid being on the end of a Swedish smash and grab.There were some positives for Enrique. Chief among them, Pedri. The Barcelona youngster became Spain’s youngest-ever player at the European Championships and his influence grew as the game wore on. Which it certainly did for many neutral observers.Even Pedri, though, was perhaps not as direct as he had been for Barca last season and a lack of leaders around the 18-year-old is another concern for Enrique, especially while Sergio Busquets sits out.The greatest worry, though, remains Spain’s inability to profit from their possession.\n                                                                                                                                                    Patrik Schick was sublime and Lyndon Dykes wasn't. That was the difference.                                                                    \n                                                                                                                                                    No longer is the English game \"all about heart\". Foden is king of a new breed that would suit other countries.                                                                    \n                                                                                                                                                    None of those players or officials should have been asked to play on so soon after fearing for Christian Eriksen's life...                                                                    \n                                                                                                                                                    It took 'The End' of Italian football to create it, but boy, was it worth it. That really was quite something.                                                                    \n                                                                                                                                                    Page said the draw with Switzerland 'felt like a win'. A passive point might not look so good later on...                                                                    \n                                                                                                                                                    Edu and Arteta are throwing the net wide this summer as they look to make six Arsenal signings.                                                                    \n                                                                                            It's Group of Death day at Euro 2020 and there's some extraordinary attacking quality on show...                                                                                    \n                                                                                            France v Germany is the headline but this midweek we see Ronaldo, that Denmark recovery and more.                                                                                    \n                                                                                            England played more like Germany than John Nicholson can ever remember as they controlled v Croatia.                                                                                    \n                                                                                            Kalvin Phillips and Raheem Sterling were all kinds of mint. And so, too, was Gareth sodding Southgate.                                                                                    \n                                                                                            Patrik Schick was sublime and Lyndon Dykes wasn't. That was the difference.                                                                                    Update your browser to view this website correctly.Update my browser now×", "Section": "", "Writers": "", "URL": "https://www.football365.com/news/opinion-euro-2020-spain-sweden-morata-moreno-isak", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}