{"Type": "", "Time": "2021-06-15", "Headline": "Private-sector economists raise Singapore's 2021 growth forecast to 6.5% from 5.8%: MAS survey, Economy News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Private-sector analysts have raised their forecast for Singapore's economic growth this year to above the Government's 4 per cent to 6 per cent range, despite the latest round of tighter Covid-19 restrictions.The Republic's gross domestic product (GDP) may expand by 6.5 per cent this year, higher than the 5.8 per cent estimated in March, according to the latest quarterly survey released by the Monetary Authority of Singapore (MAS) on Monday (June 14).This comes after the economy grew by 1.3 per cent in the first quarter, when survey respondents had forecast a 1.1 per cent contraction.Survey respondents expect the economy to grow 15 per cent year on year in the April to June quarter, a robust jump off Singapore's worst-ever quarter on record last year when GDP plunged 13.2 per cent.The forecast for growth next year has also been raised to 4 per cent from 3.8 per cent tipped in the March survey.Analysts said that the Covid-19 restrictions rolled out in Singapore in recent weeks are not expected to weigh too heavily on the overall recovery picture. CIMB Private Banking economist Song Seng Wun pointed to the momentum seen from the stronger-than-expected performance in the first quarter, and noted that most sectors in Singapore have still been able to operate despite the tighter measures under the heightened alert phase. It is largely the consumer-facing sectors like retail and food and beverage which have been hit, he added.OCBC Bank head of treasury research and strategy Selena Ling highlighted that the low base seen last year in addition to the expectation that tighter measures will be gradually lifted also contributed to the view that any adverse performance during this period is only a “temporary speed bump to growth recovery”. “Moreover, the vaccination pace has been stepped up and vaccine supply is expected to resolve in the coming period,” she said. Effective containment of the Covid-19 outbreak topped the list of factors that could see the economists raising their growth outlook for Singapore.They also flagged the stronger-than-expected manufacturing sector performance, driven in part by robust global demand for electronics, as a big upside factor.The prospect of reopening borders to international travel could also be a boon to the economy.At the same time, deterioration in the pandemic situation and tighter public health measures as a result was the top downside risk to the growth outlook.The economists polled were also concerned about geopolitical risks, including those stemming from United States-China tensions, and a slower-than-expected labour market recovery, which could weigh on private consumption.Ms Ling said: “The main downside risk is if the borders don’t reopen, then manpower costs will continue to be the extra whammy for the construction and other labour-intensive sectors.”This is in addition to the periodic setbacks that new Covid-19 variants and resurgence in infections that could disrupt economic activities, she added. The survey predicts a lower unemployment rate of 2.7 per cent at year-end, down from the 2.9 per cent forecast in March.The key manufacturing sector is expected to provide an important boost to Singapore's economy, with economists hiking their 2021 growth forecast for the sector to 8.3 per cent, way above the 4.7 per cent predicted in March.The forecast for non-oil domestic exports growth was also raised, to 7.5 per cent from 6.9 per cent, reflecting upbeat sentiments for global trade.Meanwhile, predictions for construction, accommodation and food services - sectors which have been weighed down by Covid-19 restrictions - were lowered slightly for the full year.Inflation, measured by the consumer price index for all items, is expected to come in at 1.4 per cent for the year, higher than the median forecast of 0.9 per cent in March.The median forecast for core inflation, which excludes volatile accommodation and private transport costs, was raised to 0.8 per cent from 0.7 per cent previously.The survey was sent out on May 25. It reflects the views of 24 respondents and not MAS' own forecasts.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/economy/economists-raise-singapores-2021-gdp-growth-forecast-to-65-from-58-mas-survey", "Source": "google"}