{"Type": "", "Time": "2021-06-15", "Headline": "Landlord who exposed himself to female tenant jailed, fined", "Text": "SINGAPORE — A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.Over about seven months, the victim would turn around to catch 56-year-old Chan Eng Hui in the buff while he made eye contact with her. Chan, who has been dealt with for previous incidents of indecent exposure in 2009 and 2010, was found guilty of four charges of insulting the modesty of a woman and two of using criminal force on her.The victim’s age and nationality was not revealed in court. She cannot be named to protect her identity.The victim moved into the flat on 1 April 2018, renting a bed space from him for $250 a month. She moved out in January 2019. Initially, the victim said she was on “talking terms” with Chan, but stopped talking to him after a female tenant informed her that Chan had appeared naked in her room.Between 10 and 12 May 2018 while both were in the flat, Chan held her hand and said “Go, go, let’s just go eat.”She rejected him and said “You can just talk and not get touchy”, before going into her room. She did not consent to the touch and felt annoyed by what she perceived to be a disrespectful act.In the same period, Chan grabbed her as she walked past a sofa in the living room, in an attempt to pull her in his direction. In response, the victim flung his hand away and told him not to get touchy before entering her room.From end-June to mid-July 2018, while both were in the flat at around 6.30am, the victim was walking out of the kitchen when she saw Chan standing inside the toilet naked with the door open. He was touching his private parts as he made eye contact with her.Even as the victim asked him what he was doing, Chan continued touching his private parts. Chan’s wife had been sleeping then.From the moment Chan began exposing himself to her, the victim would use weapons to protect herself and lock the door before sleeping.A few days later, in the evening, while the victim was washing something in the kitchen, she turned around to see Chan naked again, standing in front of the washing machine. After they made eye contact, Chan smiled and said he wanted to shower in the toilet. Furious, the victim scolded him. The same act happened between September and October, while the victim was at the kitchen wash basin, prompting the victim to throw a bowl towards him.Between 1 August and 20 September 2018, at around 6.30am, the victim was leaving the flat when she turned around to see Chan naked. The victim then shouted at him, “You pervert. You like… you enjoy letting people see, is it? Then you should let everyone take a look at you.”Two audio recordings recorded by the victim and submitted to court captured an exchange between Chan and the victim. In one recording, the victim says, “Why did you don’t wear your pant when you appeared behind me suddenly?” Chan is heard replying, “You have not agreed to me for so long. You see that fish, you think I can control myself. When you don’t give the fish to the cat, what do you think it will feel? I am a man, you think I am made of wood, is it? You don’t have feeling, but I am a man, I have feeling?”After 30 December 2018, Chan changed the lock of her bedroom door so that the victim was unable to lock the door. The woman would then use a chair to block the door.In his defence, Chan claimed that he was wearing his shorts at all times.The victim eventually reported the matter to the police on 23 December 2018. When asked why she did not do so earlier, she said that she worried it would be troublesome as she was working here, and was concerned that the incident would affect her work permit.In finding Chan guilty, District Judge Lau Qiuyu described him as “evasive” and his evidence “externally inconsistent”. While Chan initially argued that he was in a boyfriend-girlfriend relationship with the victim, he later claimed that they were just friends and he found acts of intimacy repulsive.DJ Lau added that she was unable to accept his claim that he did not intentionally expose himself to the woman. Chan had claimed that the exposure was accidental as the wind had blown open the toilet door while he was urinating. For another incident, Chan claimed that he had slipped on washing powder and that he hit himself, causing him to stroke his private parts in pain.When asked for his mitigation, Chan said he had nothing to say. He told the court that he was unable to pay the fine. He will serve two weeks' jail in default of the fine. Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:Of 25 new COVID cases in Singapore, 19 local including 1 dorm residentMan who smuggled 3 dogs and 3 cats from pet shop in JB jailed 24 weeksE-scooter, PAB riders must pass online theory test from 1 Jan 2022The Ministry of Health (MOH) on Tuesday (15 June) confirmed 14 new COVID-19 cases in Singapore, taking the country's total case count to 62,315.Reigning champions Portugal begin their defence of the trophy against Hungary at Euro 2020 in Budapest on Tuesday as World Cup holders France take on Germany in a hotly-anticipated clash between two of the continent's heavyweights.Search for private jet membership. The affordable price makes these private jet offers hard to resistA nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.The Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.Board certified internal medicine and obesity specialist reveals what happens after drinking just 1 diet soda. Click here to watch video.Dickson Yeo, the Singaporean man who was jailed in the US for spying for China and was arrested by the Internal Security Department upon his return to Singapore in December will be continue to be detained under the Internal Security Act.US President Joe Biden arrived Sunday in Brussels for two days of summits with leaders from the NATO military alliance and the European Union.The Copa America that almost never was opened Sunday in Brazil, overshadowed by the desperate search for a last-minute host, sponsor withdrawals and Covid-19 -- including outbreaks on three teams.Research best security system. Protect yourself and your home with wireless alarm systems.Asset sales in a liquidation process at Hyflux Ltd., Singapore’s highest-profile distressed company, would likely bring in less than S$200 million, a person familiar with the matter said, a fraction of the amount creditors are claiming.An ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces.In a room warmed by an open wood stove, Baima says her family converted their white-brick house into a hotel as China's Communist leadership ushers tens of millions of tourists to the politically sensitive region of Tibet.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.The WHO warned Monday that Covid-19 was moving faster than the vaccines, and said the G7's vow to share a billion doses with poorer nations was simply not enough.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Spain opened their Euro 2020 campaign with a goalless draw against Sweden in Seville on Monday after their preparations were badly affected by Covid-19, while Patrik Schick scored one of the championship's great goals in the Czech Republic's 2-0 win over Scotland.US President Joe Biden will seek the EU's backing on Tuesday to face the rise of China, but Brussels wants a swift end to lingering trade rows and a clean break from Donald Trump.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Major US indices finished at fresh records Monday as global equity markets began the week cautiously ahead of a much-anticipated Federal Reserve meeting.Purchases of new private units in Singapore declined about 30% to 891 in May from 1,268 in April, Urban Redevelopment Authority figures showed.The inflation outlook among Americans is at its highest level ever, while many are upbeat about their employment situation, a New York Federal Reserve survey released Monday said.The report covering May showed one-year inflation expectations jumped 0.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/landlord-exposing-himself-female-tenant-jailed-fined-055722920.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}