{"Type": "", "Time": "2021-06-15", "Headline": "Students to gradually return to school from 28 June: MOE", "Text": "SINGAPORE — Students will be progressively brought back to school following the June school holidays, with all levels expected to return from 6 July, said the Ministry of Education (MOE) on Monday (14 June).Institutes of Higher Learning (IHLs) will also gradually increase the number of students allowed back on campus for face-to-face learning, said the ministry in a media release. From 28 June, students from Primary 4 to 6 and Secondary 3 to 5, along with all students from junior colleges as well as the Millennia Institute, will return to school. Secondary 1 and 2 students will be on Home-Based Learning (HBL) until 30 June and will return to school on 1 July. Primary 1 to 3 students will be on HBL for the first week of the new term, during which schools will continue to provide instructions and support for students to access online and hardcopy HBL materials.As 5 July is the Youth Day school holiday, all levels of students will return to school the following day.Graduating students taking centre-based classes – for subjects such as third languages, art and music programmes – will resume in-person lessons from Week 1 of Term 3, while non-graduating students will continue with HBL. All students taking centre-based classes will return for in-person lessons from Week 2 of Term 3.To help with care arrangements, MOE kindergartens and school-based Student Care Centres will also resume full operation from 28 June. For Special Education school students, their return to school will be staggered from 28 June based on students' needs, with all students expected to be back at school from 6 July.MOE also plans to resume in-person co-curricular activities (CCAs) from Week 2 of Term 3, starting with low-risk activities. \"Given the need to minimise intermingling of students from different schools in line with the gradual resumption of student activities, the National School Games for Junior and C Divisions as well as the remaining games for A Division will be cancelled,\" the ministry added.For IHLs, small-group classes or consultations that were previously held online will be allowed to resume from 21 June. Students will continue to return for essential in-person sessions such as labs and practicals, while in-person examinations will also continue to be held with no more than 50 persons per venue.Classes and lectures with more than 50 persons will continue to be held online. All schools and IHLs will also ensure that the appropriate safe management measures are in place for the students' return.\"Students should have their TraceTogether token or app with them throughout the school day to facilitate accurate contact tracing, should the need arise,\" said MOE.All tuition and enrichment classes for students aged 18 and below will also be allowed to resume in-person lessons from 21 June. Sports, along with arts and culture classes can take reference from SportSG and the National Arts Council's latest guidelines, said the ministry.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:Of 25 new COVID cases in Singapore, 19 local including 1 dorm residentCOVID: Social gathering size can increase to 5 per group from 14 June – MTFCOVID: Dine-in at F&B places can resume at max 5 per group from 21 JuneWork-from-home remains default arrangement in Singapore's Phase 3 (HA)4 COVID ART test kits on sale at 3 Singapore pharmacies from 16 June: MTFDickson Yeo, the Singaporean man who was jailed in the US for spying for China and was arrested by the Internal Security Department upon his return to Singapore in December will be continue to be detained under the Internal Security Act.Reigning champions Portugal begin their defence of the trophy against Hungary at Euro 2020 in Budapest on Tuesday as World Cup holders France take on Germany in a hotly-anticipated clash between two of the continent's heavyweights.An ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces.Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.US President Joe Biden will seek the EU's backing on Tuesday to face the rise of China, but Brussels wants a swift end to lingering trade rows and a clean break from Donald Trump.Spain opened their Euro 2020 campaign with a goalless draw against Sweden in Seville on Monday after their preparations were badly affected by Covid-19, while Patrik Schick scored one of the championship's great goals in the Czech Republic's 2-0 win over Scotland.The Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.Here are three growing businesses that should be cheap enough to add to your investment watchlist. The post 3 Undervalued Gems That You Can Add to Your Watchlist appeared first on The Smart Investor.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the \"systemic challenges\" posed by its policies.The Copa America that almost never was opened Sunday in Brazil, overshadowed by the desperate search for a last-minute host, sponsor withdrawals and Covid-19 -- including outbreaks on three teams.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.With its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.The first crew for China's new space station prepared to blast off this week for the latest step in Beijing's ambitious programme to establish itself as a space power.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.Major US indices finished at fresh records Monday as global equity markets began the week cautiously ahead of a much-anticipated Federal Reserve meeting.Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/students-gradually-return-school-28-june-moe-085012541.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}