{"Type": "", "Time": "2021-06-15", "Headline": "Singapore’s Gen-Z Are Borrowing Too Freely, Central Bank Worries - Bloomberg", "Text": "Would that be by cash, card or a handful of equal payments over a few months?Starrie Lee, 23, opted for the latter when she bought a computer monitor online in May. In just a few clicks, the analyst for a technology consultancy split her purchase over three installments using a Singapore-based “Buy Now, Pay Later,” or BNPL, service known as Rely. She is scheduled to pay off her roughly S$500 ($380) bill in July.“As someone who does strict budgeting on my monthly expenses, using BNPL gives me more flexibility and reasonableness in managing my cash flow,” Lee said. “It prevents me from overspending.”Many officials in Singapore, though, aren’t convinced Gen Z consumers like Lee are spending wisely. The growing popularity of BNPL services among young Singaporeans is unnerving regulators and politicians who fear BNPL apps prey on 20-somethings who may be financially naive.“Young adults without sufficient financial awareness can have access to credit lines before they have the necessary earning capacity,” said Cheryl Chan, a Member of Parliament from the ruling People’s Action Party, in an email. “This is an unhealthy trend.”Among those sounding the alarm is the Monetary Authority of Singapore, the city-state’s de-facto central bank, which has launched a media campaign warning the payment methods may lead to debt and consumer credit risk.The Rely service.Photographer: Wei Leng Tay/BloombergIn one  article in the Straits Times newspaper, the MAS encouraged people to avoid borrowing for shopping sprees. “You should always spend within your means and not see BNPL schemes as a way to buy items that are more expensive than you can afford,” the report said. “Do not be a hostage to your spending habits.”BNPL services, also known as point-of-sale loans, allow buyers to spread out the cost of a purchase over a few months without interest fees, making even big-ticket items seem within reach. Already popular in the West, the services are gaining ground in Singapore and other parts of Southeast Asia.Globally, the market for these payment services is expected to grow to about $33.6 billion by 2027 from $7.3 billion in 2019, according to consulting firm Coherent Market Insights.Most Singapore users are between 20 and 35, according to local BNPL companies, indicating that younger people are moving away from the traditional mindset against debt that many Southeast Asians hold. Retailers like Sephora and Zara accept the installment payments, with merchants paying BNPL companies a fee for each transaction.A promoter for Atome app outside a Zara store in Singapore.Photographer: Wei Leng Tay/Bloomberg“People want to have the latest fashion and look like they’re on trend,” Anton Ruddenklau, partner and head of financial services at  KPMG LLP in Singapore said. “That is a big driver for people purchasing goods and then deciding to smooth the payments over time.”The Covid-19 pandemic has accelerated the rise of BNPL services in the city-state by forcing merchants and consumers online, allowing shoppers to search quickly for the best deals and easily opt to use the payment method.“A lot of our users are obviously being impacted by the coronavirus – either they were furloughed or it’s just created more uncertainty for someone’s income or budget,” said Ed Chin, founder of local BNPL startup OctiFi. “So a product like ours essentially creates more flexibility for them.”Some of Southeast Asia’s technology giants have waded into the business. Ride-hailing firm Grab Holdings Inc.’s PayLater service launched in 2019 and is available in Singapore and other countries in the region. Traveloka Indonesia PT is continuing to expand its BNPL offering, with a focus on Thailand and Vietnam.While most BNPL services are typically used for smaller-value purchases, 27% of Singaporeans said they were financially worse off due to a BNPL purchase, according to a 2020 report from financial comparison platform Finder, and 9% said they had paid penalties for missing payments.Unlike traditional credit cards which require comprehensive checks and paperwork to verify an individual’s identity and credit worthiness, BNPL services allow users above 18 years old to create an account and begin shopping after entering personal information and linking at least a valid debit card. Late-fee charges typically range from S$5 to S$60.The Atome app.Photographer: Wei Leng Tay/BloombergOne startup, Atome, launched in 2019 and works with more than 2,000 retailers across the region. The company’s average transaction sizes in Singapore are typically around S$150, according to Chief Executive David Chen. “A credit card is a product that encourages spending but BNPL is not, as once you are overdue, we freeze the account,” said Chen. The company conducts fraud, credit and risk assessment checks, he added, and observes repayment behavior history and incidence of late or missed payments.The services currently fall outside MAS regulations on credit that apply to banks and finance companies, Chairman  Tharman Shanmugaratnam wrote in a recent  reply to questions posed in parliament. The regulator will consider measures such as verifying BNPL users’ incomes and creating a centralized system to check on advances taken between credit cards and BNPL platforms.MAS cannot yet share a timeline for the conclusion of its review, a spokesperson said in an email.In the meantime, the central bank is counting on its media blitz to have an impact. The regulator has worked with an online youth magazine to highlight the risks of overspending via BNPL services. “If not careful, one could chalk up debt across multiple installment plans and get into financial distress, especially for someone without a stable income,” MAS warned.Still, the services could take off further among Southeast Asia’s growing youth population. The alternative payments method provides greater access to liquidity for the under-banked in emerging markets, according to OctiFi’s Chin. Eager to capture market share, Atome, OctiFi and Rely have plans to expand across the region.As they do, they will be targeting consumers like Chang Wei Yue, a 26-year-old public relations executive who recently finished paying off a S$2,000 purchase of invisible braces. “It was super hassle-free and it put me at ease knowing I didn’t have to pay the full sum right up front,” she said.— With assistance by Chia Woon Eunice Chua", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-14/singapore-s-gen-z-are-borrowing-too-freely-central-bank-worries", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}