{"Type": "", "Time": "2021-06-15", "Headline": "Coronavirus outpacing vaccine effort, says WHO, after G7 doses pledge | Coronavirus | The Guardian", "Text": "Tedros Adhanom Ghebreyesus joins other health figures in criticising G7 countries for offering too little, too lateThe World Health Organization has warned that Covid-19 is moving faster than the vaccines, and said the vow by G7 countries to share a billion doses with poorer nations was simply not enough.“This is a big help, but we need more, and we need them faster. Right now, the virus is moving faster than the global distribution of vaccines,” World Health Organization (WHO) chief Tedros Adhanom Ghebreyesus told journalists. “More than 10,000 people are dying every day ... these communities need vaccines, and they need them now, not next year.”Global health leaders also warned the pledge was too little, too late, with more than 11bn shots needed.Faced with outrage over disparities in jab access, the Group of Seven industrialised powers pledged during a weekend summit in Britain to take their total dose donations to more than a billion, up from 130m promised in February.While people in many wealthy nations have some sense of normalcy thanks to their vaccination rates, the shots remain scarce in poorer parts of the world. In terms of doses administered, the imbalance between the G7 and low-income countries, as defined by the World Bank, is 73 to one.Many of the donated G7 doses will be filtered through Covax, a global body charged with ensuring equitable vaccine distribution.Run by the WHO, the Gavi vaccine alliance and the Coalition for Epidemic Preparedness Innovations (CEPI), it has so far shipped more than 87m vaccine doses to 131 countries – far fewer than anticipated.The WHO wants at least 70% of the world’s population vaccinated by the next G7 meeting in Germany next year. “To do that, we need 11bn doses. The G7 and G20 can make this happen,” said Tedros.Medical charity Doctors Without Borders questioned how sincere the G7 was in pursuing vaccine equity.“We need to see more clarity around the actual number of doses donated, and exactly how long it’s going to take to translate their pledges into real impact and access,” Hu Yuanqiong at the charity said.As well as dose sharing, the G7 pandemic battle plan includes commitments to avert future pandemics – slashing the time taken to develop and license vaccines to under 100 days, reinforcing global surveillance and strengthening the WHO.But observers voiced scepticism of their willingness to follow through on the last point especially.“I will believe [that] point when the contributions to WHO are increased,” tweeted Ilona Kickbusch, founding director and chair of the Global Health Centre in Geneva.Others stressed the need to quickly resolve the issue of Covid vaccine patent protections, to boost production.Fully-fledged negotiations towards a possible suspension of intellectual property protections for Covid vaccines, as well as other medical tools needed to battle the pandemic, have just begun at the World Trade Organization after months of contentious debate.G7 leaders “say they want to vaccinate the world by the end of next year, but their actions show they care more about protecting the monopolies and patents of pharmaceutical giants,” said Max Lawson, Oxfam’s head of inequity policy.Human Rights Watch agreed. “Focusing on vaccines and making charitable donations are not enough,” Aruna Kashyap, its senior counsel for business and human rights. “The G7’s failure to unequivocally support a temporary waiver of global intellectual property rules is deadly status quo.”WHO and its partners also highlighted the desperate need for funds to overcome the pandemic.More than $16bn is still needed this year to fully fund efforts to speed up production and access to Covid-19 diagnostics, treatments and vaccines.That figure represents less that one percent of annual global defence expenditure, the WHO’s emergencies director Michael Ryan said, adding: “Surely we can afford one percent of that to save lives and bring this pandemic to an end.”", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/world/2021/jun/15/coronavirus-outpacing-vaccine-effort-says-who-after-g7-doses-pledge", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}