{"Type": "", "Time": "2021-06-15", "Headline": "$150-billion prize in sight for global talks on minimum corporate tax | Business Standard News", "Text": "Topics\ncorporate tax cut | Corporation Tax | Multinational corporations\n\nWilliam Horobin | Bloomberg \t\t\t\t\t\t\t\t  \t\t\t\t\t\t\t\t  \t\t\t\t\t\t\t\t  \t\t\t\t\t\t\t\t  \t\t\t\t\t\t\t  \t  \t\t\t\t\t\t\t  \n\n\t\t\t\t\t\t\t  Last Updated at June 15, 2021 00:43 IST\nhttps://mybs.in/2Zf9sRIA global minimum corporate tax would generate around $150 billion in extra revenue for governments across the world, according to the official overseeing frenetic talks to get a deal between 139 countries in coming weeks.\r\n“This is not an anecdotal amount,” Pascal Saint-Amans, director of the center for tax policy at the Organization for Economic Cooperation and Development (OECD), said on BFM Business television on Monday. “In some ways, this is the end of the work on regulating globalisation for greater tax justice.”\n\r\nAfter seven years of technical work on an overhaul of international taxation, negotiators at the OECD will meet in Paris June 30 with the aim of making a proposal before a meeting of the Group of 20 industrialised nations in July. That follows an agreement between the Group of Seven to set a floor on corporate tax rates of “at least 15 per cent” instead of the current average of 6 per cent to 7 per cent.\r\nThe $150 billion estimate by Saint-Aman takes into account the OECD deal on minimum tax, as well as a revised version of existing US measures on taxing foreign profits known as GILTI.\r\nAlongside negotiations on a global minimum rate, the OECD is also working on a system to divide up between governments the rights to tax multinationals, particularly tech firms. The G7 proposed applying new rules to the “largest and most profitable” businesses, but that has raised concerns that Amazon.Com would not be included because of its thin margins.\r\nSaint-Amans said those concerns are a “false debate,” because the OECD plans to segment its operations to isolate the online retailer’s high-margin cloud services operations. “The draft agreement foresees that cloud profits would be part of the solution and shared out between states,” Saint Amans said.\r\nHe added that political momentum to stop firms parking profits in tax havens, and a need for governments to repair finances after the pandemic, mean that a G-20 deal is possible.\r\n“It’s a month already that we’ve had little sleep, and the next two weeks will be very important,” Saint-Amans said. “Common sense is difficult for the international community, but I think we can get there.”   \nBusiness Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the country and the world.  Your encouragement and constant feedback on how to improve our offering have only made our resolve and commitment to these ideals stronger.  Even during these difficult times arising out of Covid-19, we continue to remain committed to keeping you informed and updated with credible news, authoritative views and incisive commentary on topical issues of relevance.\r\nWe, however, have a request.\r\n\r\nAs we battle the economic impact of the pandemic, we need your support even more, so that we can continue to offer you more quality content. Our subscription model has seen an encouraging response from many of you, who have subscribed to our online content. More subscription to our online content can only help us achieve the goals of offering you even better and more relevant content. We believe in free, fair and credible journalism. Your support through more subscriptions can help us practise the journalism to which we are committed.\r\n\r\nSupport quality journalism and subscribe to Business Standard.\r\n\r\nDigital Editor\r\nPREVIOUS STORYNEXT STORYCopyrights © 2021 Business Standard Private Ltd. All rights reserved.Upgrade To Premium Services Business Standard is happy to inform you of the launch of \"Business Standard Premium Services\"As a premium subscriber you get an across device unfettered access to a range of services which include:Premium Services In Partnership with Dear Guest,Welcome to the premium services of Business Standard brought to you courtesy FIS.\n         Kindly visit the Manage my subscription page to discover the benefits of this programme.\n\n         Enjoy Reading!\n         Team Business Standard\n      ", "Section": "", "Writers": "", "URL": "https://www.business-standard.com/article/international/150-billion-prize-in-sight-for-global-talks-on-minimum-corporate-tax-121061500038_1.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}