{"Type": "", "Time": "2021-06-15", "Headline": "Care groups see spike in mental health crises in Singapore amid heightened alert curbs, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Calls to the Samaritans of Singapore's (SOS) mental health helpline spiked 40 per cent on May 16, the day Singapore started heightened alert restrictions.Following the announcement of restrictions on May 4, SOS experienced a 12 per cent increase in the volume of calls that week compared with the week before, SOS chief executive Gasper Tan told The Straits Times.Seven out of 10 mental health organisations and professionals ST spoke to saw spikes of between 20 and 60 per cent in queries and incidents like mental health crises because of the Covid-19 pandemic and the social restrictions that have been used to contain the virus' spread.Those increased restrictions and the subsequent loss of support from outside the home compounded stress factors such as fears about the virus, difficult living situations, and fears about job loss and the future, say social workers.Caregivers Alliance Limited (CAL), a non-profit organisation that helps the caregivers of those with mental health issues, said that it saw a \"disturbing increase\" in attempted and completed suicides between May last year and April this year among people being cared for.CAL's head of communications, Ms Tricia Lee, said: \"We have seen a rise in crisis cases as the mental health appointments or daycare programmes of caregivers' loved ones were halted. The social restrictions in some cases caused rising tension within families, increasing the risk of relapse (into a mental health crisis).\"Many students also found home-based learning stressful and missed the social interactions of schooling, support organisations said.Mr Cho Ming Xiu, founder and executive director of Campus PSY, a mental health organisation for youth, said that it has seen a 40 per cent increase in the number of young people seeking emotional support via e-mail, and a 20 to 30 per cent increase across various social media platforms.Despite Singapore's experience with the circuit breaker last year, the speed at which heightened alert measures came into effect made the situation difficult for many.\"With the sudden limitations of movement, many of our callers found themselves struggling to adjust and adapt to the newly implemented restrictions,\" said SOS' Mr Tan.\"Many had to cancel their plans and return to working from home or home-based learning arrangements, which contribute to a state of loss and helplessness.\"The accumulation of these stressors may be overwhelming and with no one to speak to, they reach out to SOS.\"However, the experience of last year's circuit breaker helped some organisations prepare for the sudden onset of restrictions, which included a ban on dining in eateries and reduced group sizes for social meetings from five to two.To meet the intensified need for support, CAL has increased its number of helplines from one to six since April last year, as well as the frequency of its Caregivers-to-Caregivers programmes. These programmes provide fully funded training and support to caregivers of people with mental health issues, such as dementia.Silver Ribbon Singapore, a charity that provides free counselling services, said it saw a 20 per cent increase in calls, but social worker Phay Yan Deng, 29, said the organisation was more prepared to provide support online this time round.He said that during the circuit breaker period, it was \"initially slightly overwhelmed as many things were quite new to us\".\"In the past, we provided emotional support only face to face\", whereas most of its work, from referral to actual sessions, is now done online, he said.However, while organisations may be better prepared, Silver Ribbon's executive director, Ms Porsche Poh, said it is not helpful to assume that people should be able to cope with heightened alert restrictions just because they have been through it before.\"They might have limited social support, or face a new set of challenges during this phase,\" she said.National Care Hotline: 1800-202-6868\nInstitute of Mental Health's Mental Health Helpline: 6389-2222\nSamaritans of Singapore: 1800-221-4444\nTouchline: 1800-377-2252\nCare Corner Counselling Centre: 6353-1180Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/care-groups-see-spike-in-mental-health-crises-in-singapore-amid-heightened-alert", "Source": "google"}