{"Type": "", "Time": "2021-06-15", "Headline": "Singapore start-up Carro raises $360 million from SoftBank and others", "Text": "SINGAPORE — Singapore-based start-up Carro announced Tuesday that it raised $360 million in a Series C funding round led by SoftBank's Vision Fund 2.The start-up operates an online marketplace where users can buy, sell or lease pre-owned and new cars. It also sells financing options, insurance and maintenance services for those vehicles.Carro did not disclose its exact valuation. However, the company said it is the newest Southeast Asian start-up to cross the $1 billion mark — referred to as unicorns.Other investors in the newest funding round include several Indonesia-based funds such as EV Growth.Founder and CEO Aaron Tan told CNBC's \"Squawk Box Asia\" that there is definite interest to take the company public over the next 18 to 24 months.\"I would say that 'where' depends on what is good at that point in time,\" he said Tuesday, when asked where Carro may potentially list. \"We like to think that the U.S., especially the New York stock exchange, or the Nasdaq, would probably be a good bourse to list the company potentially.\"Carro said the new funds would be used to strengthen its market position and expand on products and services sold across Singapore, Indonesia, Malaysia and Thailand. It would also be used to speed up development of the company's artificial intelligence technology that is used to facilitate transactions on the site.Some of Southeast Asia's largest start-ups are currently preparing to go for public listing as well.Singapore-based ride-hailing company Grab announced in April that it would go public through a \"blank check\" merger valued at $39.6 billion — the special purpose acquisition company deal is expected to be completed by the fourth quarter. Elsewhere, newly merged Indonesian tech giant GoTo Group is also in talks to go public.Venture capital firm 500 Startups recently told CNBC that Grab and GoTo initial public offerings could spawn more start-ups in the region.Got a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. © 2021 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by ", "Section": "", "Writers": "", "URL": "https://www.cnbc.com/2021/06/15/singapore-start-up-carro-raises-360-million-from-softbank-and-others.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}