{"Type": "", "Time": "2021-06-15", "Headline": "G7 Tax Deal Targets Tech Giants Including Amazon and Facebook | GOBankingRates", "Text": "\nMany of the offers appearing on this site are from advertisers from which this website receives compensation for being listed here. This compensation may impact how and where products appear on this site (including, for example, the order in which they appear). These offers do not represent all available deposit, investment, loan or credit products.The G7 reached a “historic commitment” regarding the global tax system last week, part of which would seek to rectify large tech companies’ corporate tax avoidance via tax havens.See: G7 Leaders Support 15% Minimum Corporate Tax Agreement\nFind: G7 Finance Ministers Meeting Ends With Heat on Facebook, Google and Amazon with Global Minimum Tax“We need a tax system that is fair across the world. We endorse the historic commitment made by the G7 on 5 June,” the G7 said in a statement. “We will now continue the discussion to reach consensus on a global agreement on an equitable solution on the allocation of taxing rights and an ambitious global minimum tax of at least 15 per cent on a country-by-country basis, through the G20/OECD inclusive framework and look forward to reaching an agreement at the July meeting of G20 Finance Ministers and Central Bank Governors. With this, we have taken a significant step towards creating a fairer tax system fit for the 21st century, and reversing a 40-year race to the bottom. Our collaboration will create a stronger level playing field, and it will help raise more tax revenue to support investment and it will crack down on tax avoidance.”Tech giants who responded to the agreement include Nick Clegg, Facebook vice president for global affairs, who said in a tweet that the company “has long called for reform of the global tax rules and we welcome the important progress made at the G7. Today’s agreement is a significant first step towards certainty for businesses and strengthening public confidence in the global tax system.” He added, “We want the international tax reform process to succeed and recognize this could mean Facebook paying more tax, and in different places.”See: Companies Like Amazon Might Finally Be Forced to Pony Up Taxes — What This Could Mean for You\nFind: Cloud Outages Shut Consumers out of Amazon, Target, PayPal and MoreAmazon said the agreement “marks a welcome step forward” in efforts to “bring stability to the international tax system,” according to CNBC. “We hope to see discussions continue to advance with the broader G20 and Inclusive Framework alliance.”Treasury Secretary Janet Yellen, who attended the G7 meeting, applauded the decision, calling it “a significant, unprecedented commitment” that “would end the race-to-the-bottom in corporate taxation, and ensure fairness for the middle class and working people in the U.S. and around the world,” according to a statement.See: What Are the World’s Best Tax Havens?\nFind: Treasury Secretary Yellen Confident $1.9 Trillion Bill Will Help Bring Country ‘Back to Full Employment’ Next YearAsked at a press conference whether Amazon and Facebook would be affected, Yellen said she believes they “will qualify by almost any definition.”“And essentially what we’ve agreed, is that we will reallocate taxing rights for a portion of the excess or residual profits of those companies to jurisdictions where they have market activity on the basis of the distribution of that activity,” she added. More From GOBankingRatesEvery day, get fresh ideas on how to save and make money and achieve your financial goals.Sponsored Links by Zergnet Advertiser Disclosure: Many of the offers appearing on this site are from advertisers from which this website receives compensation for being listed here. This compensation may impact how and where products appear on this site (including, for example, the order in which they appear). These offers do not represent all available deposit, investment, loan or credit products.We're here to help you Live Richer.Sign up to receive our daily weekday newsletter with the latest finance and lifestyle content.For our full Privacy Policy, click here.", "Section": "", "Writers": "", "URL": "https://www.gobankingrates.com/money/economy/g7-tax-deal-targets-tech-giants/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}