{"Type": "", "Time": "2021-06-15", "Headline": "Steady stream of visitors as Jewel reopens, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Jewel Changi Airport reopened yesterday after a month-long closure, drawing a steady flow of visitors that businesses there hope will help ring up sales.Patrons - mostly families with young children - began arriving at 10am, when shops and eateries in the mall reopened.Some tenants, like burger joint Shake Shack, were encouraged by the initial turnout and expect sales to pick up over the weekend.Others, however, said they foresee business to be slow, given the continued ban on dining in and the dearth of tourists at the mall.To help businesses affected by the closure, Jewel will fully waive rental fees for this week, said Ms Hung Jean, chief executive of Jewel Changi Airport Development.The mall had earlier waived rental fees for the period of closure, between May 13 and June 13.Additional rental assistance will also be given to tenants for the week of June 21 to June 27.Jewel did not say how much additional assistance it will provide.Said Ms Hung: \"We are cognisant that it will take time to ramp up footfall at Jewel as Singapore cautiously moves into phase three (heightened alert) with a gradual easing of restrictions.\"Besides stepping up precautionary measures, Jewel is offering free parking from 10am to 11pm daily to attract visitors. The mall is open 24 hours, but most shops operate from 10am to 10pm.Shake Shack Singapore's operations director Cami Soh said the free parking, which will last until July 11, will go some way towards getting people back into the mall and is also good for deliverymen.While she could not share any sales figures, Ms Soh said she was happy with how the first day of reopening had gone.\"Initially we thought that people would be afraid of coming to Jewel after the outbreak, but we are seeing crowds... We think we will do even better over the next few days,\" she added.Ms Soh said she expects sales to pick up even further once dining in is allowed to resume. This is slated to take place from next Monday.Shaw Theatres is reopening its 11 cinema halls in Jewel. For now, they can have a maximum of only 50 people at each screening.Mr Mark Shaw, director of Shaw Organisation, which operates the Shaw Theatres chain, said what has hurt the firm's bottom line is the lack of concession sales due to the ban on dining in.\"All cinemas are very dependent on selling soft drinks and popcorn. Obviously we're slightly disappointed that (dining in) hasn't reopened together with the theatres, (but) we are quite confident that Jewel's management and their marketing teams will be on point and get it out there that Jewel is open for business.\"Caerus Holding, which manages the local outlets of Luke's Lobster and confectionery chain Lady M, said sales have slowed as it was hit by not just Jewel's closure but also the temporary closure of Westgate, where it has a Lady M outlet.Said its chief operating officer Geraldine Liew: \"While we're definitely glad about the declining community cases and the return of dining in, we do foresee lower mall traffic.\"The manager of an eatery in Jewel, who declined to be named, said he was glad to be back at work. But reopening brings with it another set of challenges - ensuring patrons comply with safe distancing measures.The eatery has had to run on a team of just five people for fear of another closure or lockdown, and the 35-year-old said he was worried the team may not be able to cope with an influx of visitors.Customers told The Straits Times that they felt reassured by the measures put in place at the mall, which had been closed after the recent Covid-19 outbreak at Changi Airport.Mrs Chua Zi Yun, 30, who was at Jewel with her husband and their two sons, aged three and one, said it was the same as visiting any other shopping mall.\"They have already cleaned the place and sanitised everything, and it is not open to the terminal buildings where they are receiving foreigners, so I think it is quite safe,\" said the civil servant.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/steady-stream-of-visitors-as-jewel-reopens", "Source": "google"}