{"Type": "", "Time": "2021-06-15", "Headline": "The New Global Minimum Tax Could Bring in $150 Billion: Bloomberg", "Text": "A leading-edge research firm focused on digital transformation.\n            Good\n            \n\nSubscriber\nAccount active\n            since\n            \nFree subscriber-exclusive audiobook!“No Rules Rules: Netflix and the Culture of Reinvention”Get it now on Libro.fm using the button below.The Group of 7 summit didn't just give leaders toasted marshmallows and sea shanty serenades: It also provided crucial momentum for a new tax measure that could revolutionize international taxation.The global minimum corporate tax rate is a measure that's gained increased prominence amidst tax talks. It would impose a non-binding minimum rate on multinational companies, a disincentive to those companies fleeing one country for another with lower taxes.That tax could also bring in $150 billion, according to a Bloomberg report which cited Pascal Saint-Amans, who directs the Organization for Economic Cooperation and Development (OECD)'s center for tax policy. Presumably speaking about an annual figure, Saint-Amans told the French channel BFM Business that it is \"not an anecdotal amount.\"\"In some ways,\" Saint-Amans said, \"this is the end of the work on regulating globalization for greater tax justice.\" The figure he put forward also includes \"a revised version of existing US measures on taxing foreign profits known as GILTI,\" according to Bloomberg.The G7 summit represented a major diplomatic and political step forward for the tax measures, as leaders agreed to a minimum rate of at least 15%. That's what the US had reportedly proposed, a rate lower than the anticipated proposal of 21%, but still in line with the Treasury Department's proposal.Saint-Amans also addressed concerns that companies like Amazon could dodge the tax due to low profit margins, saying that the OECD would specifically look at its higher-margin cloud services.Big tech companies and governments are already lining up behind the measure, lauding the historical step. But there's still a long road ahead before it's enacted. The measure will go to the G20 next, and then to the OECD. Countries like the US would also have to craft legislation to officially enact the tax once it's agreed upon, which may prove tricky. As Insider previously reported, the GOP's likely opposition to the measure could potentially sink it. \"Why would we want to commit to doubling our global minimum tax? That's a very bad policy,\" Sen. Pat Toomey, the ranking Republican on the Senate Banking Committee, previously told Insider. There's already domestic partisan turmoil over proposed changes to US tax law. President Joe Biden wants to raise the corporate tax rate from 21% to 28% to offset infrastructure spending, a proposal that's already drawn Republican resistance. That increase is a red-line for the GOP.But, according to the figure cited by Saint-Amans, leaving behind the global minimum proposal could also leave billions of dollars in potential revenue behind.", "Section": "", "Writers": "", "URL": "https://www.businessinsider.com/new-global-minimum-tax-could-bring-in-150-billion-bloomberg-2021-6", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}