{"Type": "", "Time": "2021-06-15", "Headline": "Here's what it's like to be swallowed whole by a humpback whale", "Text": "If you ever wondered what it would be like for a human to be swallowed by a humpback whale Finding Nemo style, 56-year-old lobster diver Michael Packard can now tell the tale.Packard joined his son, Jacob, for a Reddit Ask Me Anything yesterday, where he answered all pressing questions about what happened when he was fully swallowed by a whale while off the coast of Provincetown, Massachusetts while working last Friday.Read moreMan, do the Cubs need to shut upPickup Trucks Keep Getting Bigger, More DangerousHow to Make Your Air Conditioner More Effective and Efficient When Temperatures SoarLet's Talk About <em>In the Heights</em> and the Erasure of Dark-Skinned Afro-Latinx FolksHEAR ME OUT: The infield fly rule is dumb and needs to be done away withAccording to Packard, he was forty-five feet below the surface when he felt a shove, then he was consumed by darkness. In the AMA he says his initial thought was that it was a shark, but “due to the lack of teeth and the size of it [he] soon realized that what [he] was in was a whale.”Packard was inside the whale’s mouth for 30-40 seconds with limited mobility while the whale struggled to spit him out. While inside the whale’s mouth the diver lost his regulator. Thankfully he found it quickly, or he most likely would have suffocated in the pitch black. Convinced he was going to die that day, the father of two shared that his potential final thoughts were about his wife and kids.Humpback whales are not known for going after humans and Packard was likely swallowed by accident while the whale scoured for krill or small fish. Even if the whale was really determined to swallow Packard whole, it’s fist-wide throat would have prevented it. When it comes to how it the creatures’ mouth felt wrapped around his body, it’s understandably difficult for Packard to describe.“It was full of water, and I could feel the muscles of its mouth convulsing around me, it was a really strange feeling to be sure,” Packard says. “Can’t draw a meaningful comparison.”Packard’s friends swiftly rushed him to the Cape Cod hospital after the whale released him not too far from the boat, where he was treated for bruising and a dislocated knee. At the hospital, Packard says all the doctors and nurses stopped by to see him and hear his unbelievable story.“One nurse came in with a notepad, she asked me for lottery numbers!” Packard says.The series Deadliest Catch shows that trapping and fishing can be gruesome, and it’s common for lobster divers to get swept out to sea or die from the spins. However, Packard will not let his brush with death keep him from the work he’s dedicated fifteen years of his life to for too long.“Speaking as Jacob, I don’t even need to ask this,” his son says. “I have no doubt in my mind he will do everything he can to keep diving, it’s his life and passion.”A doctor at the hospital that treated Michael Packard after the alleged whale encounter told The New York Post he should have been more injured.The Marine Area Command for Australia's New South Wales Police Force said an 18-year-old was \"critically injured\" by the whale.Top Surgeon and Author of the Best Selling Book \"Dr. Gundry's Diet Evolution\" Discovers Link Between Gut Health and the Rising Number on the Scale.The dogs had been trapped in the 400-foot-wide sinkhole in the central Mexican state of Puebla for four days.The women of \"Red Table Talk\" explored the ancient practice of vaginal steaming this week. Here's what an expert thinks of the ancient practiceHelena Christensen is bringing back #ThrowbackThursday with a re-creation of a swimsuit photo that the model took three decades ago.HIV-1 indicators may be more subtle than you think. Take a look at HIV-1 warning signs and symptoms.\"My boobs grew,\" the model wrote in reference to the 30 year difference.\"It's about digitally altering your body and enhancing your body in ways that dieting and plastic surgery can't even do for you.\"Simone Biles just cannot be stopped! On Wednesday, the 24-year-old Olympic athlete shared a picture of her new Health magazine cover where she gracefully leaped into the air while wearing a orange crop tank and black biker shorts from clothing brand Athleta, with a colorful top draping from her arms.The Price Of Dental Implants May Actually Surprise You. Research Dental Implants For SeniorsThe songstress has declared this \"big girl summer.\"At prices this low, you can snag a few.The English star was a vision in yellow Versace.Registered investment advisors are fiduciaries. Obligated to act in the best interest of their clients. Continuously.  Completely.Jazz Jennings, 20,  became famous in 2007 when she appeared on '20/20' with Barbara Walters. Now, the transgender activist joined Yahoo! for Pride Evolution, a one-hour discussion on the celebration of Pride, to discuss her journey.On Monday, Lizzo shared several photos of herself wearing a Kente cloth patterned bikini by Black-owned U.K. based swimwear brand Ashanti Swimwear. She also included a video where she posed for fans in bright green sunglasses.\"The expectations that I put on myself were pretty, pretty gnarly,\" the actor says of his famous family.Read This Before Going Solar in Texas (It's Genius)Easy-to-clean glass and airtight technology is a match made in kitchen heaven: 'Give away your Tupperware and don’t ask for it back,' said a fan.The Too Faced Sexy Eyes Rain or Shine 3-piece set combines one of the world's bestselling mascaras with a foolproof primer that keeps you fresh-faced for 24 hours.Save big on Nintendo, Apple, Xbox, Sony — save up to a whopping 90 percent!This new car cloth can easily remove all the car scratches and dents from your car.Steph Curry's sister is tackling the topic of mental health with her new podcast.The actor, who is gay, celebrated Pride with a steamy underwear shot.What to buy — and what to skip — on Amazon Prime Day.", "Section": "", "Writers": "", "URL": "https://www.yahoo.com/lifestyle/heres-swallowed-whole-humpback-whale-154400974.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}