{"Type": "", "Time": "2021-06-15", "Headline": "Best Vaccine Card Holder 2021: Vaccination Passport Sleeves for Travel - Rolling Stone", "Text": "\n\t\t\tWelcome,\t\tSimilar to a business card holder, these vaccination card holders keep your Covid-19 vaccine ID card safe and secureLifestyle & Market Editor\n\t\t\t\tVIDA\t\t\t\n\n\t\tProducts featured are independently selected by our editorial team and we may earn a commission from purchases made from our links; the retailer may also receive certain auditable data for accounting purposes.\t\nWith more and more people across the country getting vaccinated, life as we knew it before-Covid (BC) is slowly returning to normal. One of the biggest trends expected to take place right now is travel, with a number of destinations and countries opening up to tourists again.A number of these countries are requiring proof of vaccination in order to enter, leading to what some have dubbed “vaccine passports.” Similar to carrying around your passport and ID, you may be asked to keep your vaccination card on-hand, to show proof at border crossings or airports that you have received the Covid-19 vaccine.Keep in mind, not all countries are requiring proof of vaccination. Some are requiring proof of a negative test, rather than proof of vaccination. Other countries still have a quarantine procedure in place, whether you’re vaccinated or not. Consult the CDC website for the latest requirements.\nIn addition to showing your vaccination card, keep in mind that airlines are still requiring masks for travel. We’ve rounded up a few of the best masks for flights and traveling here. As for your vaccine passport, brands are starting to make dedicated carrying cases and sleeves just for your vaccine card. Similar to a business card holder or a passport holder, these vaccination card holders are an easy way to keep your Covid-19 vaccine ID card safe and secure (I.e. preventing it from crinkling, ripping or getting wet).Accessories brand VIDA makes some of our favorite face masks for travel, and now they’ve introduced a handsome vaccination card holder too. The holder measures 4 x 4.5 inches with enough room to slide in your vaccine passport and a couple cards too. It’s all made with an eco-friendly vegan leather with a clear face to protect your card while keeping it visible. A metal clip lets you attach the holder to your bag or keychain. Choose from five colors.VIDA says 5% of profits from their vaccine card holder collection goes to Stop the Spread, an organization working to provide Covid relief to hard-hit neighborhoods across the country.\nVIDA\nBuy:\nVIDA Vaccine Card Holder\nat\n$20\n\nWith people dubbing their vaccination card as a “vaccine passport,” it makes sense to pick up this passport sleeve and vaccine card holder-in-one. Made from a durable vegan leather, the travel document holder has a slot for your passport and a clear sleeve for your vaccine card. Everything is double-stitched for durability, while the holder folds flat to tuck easily into your pockets or bag.Amazon\nBuy:\nCiana Vaccine Card and Passport Holder\nat\n$9.99\n\nLooking for a more stylish pick? This deal gets you a two-pack of chic-looking vaccine card protectors, made from a waterproof material with a clear, vinyl window.The sleeve easily fits a 4 x 3-inch vaccine card, while the included key ring and swiveling claw clip lets you attach the card holder to a lanyard, keychain or clip it to your bag. LifeJoy says the material is durable and tear-resistant, making it great for traveling (we like that the PVC looks and feels like real leather too).Amazon\nBuy:\nLifeJoy CDC Vaccine Card Protector\nat\n$12.97\n\nIf you’re fine with folding your vaccine card in half, consider picking up one of these portable card holders, which affix to the back of your phone. An adhesive backing makes it easy to stick onto your phone, while the holder itself has enough room for your vaccination card, credit cards and ID. It’s enough to let you ditch your wallet for a night out or not have to fumble around for your card at the airport. This current deal gets you a three-pack of phone card holders for under $10. Amazon\nBuy:\nCard Holder for Phone (Three-Pack)\nat\n$5.97\n\n\n\t\tIn This Article:\n\t\t\t\tcoronavirus,\t\t\t\tcovid-19,\t\t\t\tRS Recommends,\t\t\t\ttravel accessories \n\t\t\tWant more Rolling Stone? Sign up for our newsletter.\nNewsletter SignupHave a Tip?\n\t\t\tWelcome,\t\tFollow UsAlerts & Newsletters\r\n\t\t\t\t\t© 2021 Penske Media Corporation\t\t\t\t", "Section": "", "Writers": "", "URL": "https://www.rollingstone.com/product-recommendations/lifestyle/best-vaccine-card-holders-1184090/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}