{"Type": "World", "Time": "2021-06-15", "Headline": "Israel's new government begins, Netanyahu era ends", "Text": "JERUSALEM: The first Israeli government in 12 years not led by Benjamin Netanyahu got down to business on Monday (Jun 14), with the former prime minister shying away from a handover ceremony with successor Naftali Bennett.The right-wing leader's record run in office ended on Sunday with parliament approving, by a razor-thin majority of 60-59, a new administration led by Bennett, a nationalist whose views mirror Netanyahu's on many issues.In Tel Aviv, thousands turned out to welcome the result, after four inconclusive elections in two years.\"I am here celebrating the end of an era in Israel,\" said Erez Biezuner in Rabin Square.\"We want them to succeed and to unite us again,\" he added, as flag-waving supporters of the new government sang and danced around him.A combative Netanyahu, 71, said that he would be back sooner than expected.\"If we are destined to go into the opposition, we will do so with our heads held high until we can topple it,\" he told parliament before Bennett was sworn in.The traditional handover ceremony was not scheduled at the prime minister's office, where Netanyahu was expected to meet Bennett later on Monday to brief him on state matters.The last time Netanyahu was unseated as Israel's leader, in 1999, he ended his first term in office with a glass of wine in his hand and affable words of welcome to then Labor Party leader Ehud Barak, who defeated him at the polls.\"Sour, grumpy, not stately – Trump-like until the final moment,\" Yossi Verter, a political affairs commentator, wrote in the left-leaning Haaretz newspaper.Asked why there would be no such scene now, Topaz Luk, a senior aide to Netanyahu, told Army Radio: \"That's just what happens.\"Netanyahu, he said, was \"filled with motivation to topple this dangerous government as quickly as possible\". Luk declined to disclose Netanyahu's comeback strategy, pointing only to the new administration's slim margin of support in parliament.Luk said that the incoming government was receiving briefings from Netanyahu's diplomatic and security advisers to ensure an orderly handover.After holding its first meeting late on Sunday, Bennett's new Cabinet was invited for a traditional group photograph, showcasing incoming governments, at the official residence of President Reuven Rivlin.UNSEATING NETANYAHUWith little in common other than a desire to unseat Netanyahu, the patchwork coalition of right-wing, centrist, left-wing and Arab parties largely plans to avoid sweeping moves on hot-button issues such as policy towards the Palestinians, and to focus instead on domestic reforms.Palestinians were unmoved by the change of administration, predicting that Bennett, a former defence chief who advocates annexing parts of the occupied West Bank, would pursue the same right-wing agenda as Netanyahu.Under the coalition deal, Bennett, a 49-year-old Orthodox Jew and high-tech millionaire, will be replaced as prime minister in 2023 by centrist Yair Lapid, 57, a popular former television host.United States President Joe Biden congratulated Bennett and Lapid, saying he looked forward to strengthening the \"close and enduring\" relationship between the two countries.Addressing parliament on Sunday, Bennett put Biden on notice that he would follow in Netanyahu's footsteps in opposing any US return to the 2015 Iran nuclear deal abrogated by former president Donald Trump.Netanyahu was Israel's longest-serving leader, and had served consecutive terms as prime minister since 2009.He used his global stature to resist calls for Palestinian statehood, describing it as a danger to Israel's security. He sought to bypass the Palestinian issue by forging diplomatic deals with regional Arab states, on the back of shared fears of Iran and its nuclear programme.But he was a divisive figure at home and abroad, weakened by repeated failure to clinch a decisive election victory, and by a corruption trial in which he has denied any wrongdoing.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Israel,Benjamin Netanyahu,Naftali Bennett", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/israel-netanyahu-era-ends-new-government-begins-bennett-15011528", "Source": "google"}