{"Type": "", "Time": "2021-06-15", "Headline": "Suu Kyi's trial starts; charges include corruption, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.YANGON • The trial of deposed Myanmar leader Aung San Suu Kyi started yesterday, more than four months after a military coup, with junta witnesses testifying that the Nobel Peace laureate flouted coronavirus restrictions and illegally imported walkie-talkies.Near daily protests have rocked Myanmar since the Feb 1 coup. The mass uprising has been met with a brutal military crackdown that has killed more than 850 civilians, said a local monitoring group.The junta has brought an eclectic raft of charges against Ms Suu Kyi, including claims that she accepted illegal payments of gold and violated a colonial-era secrecy law.The court yesterday heard a major from the police force testify that Ms Suu Kyi, 75, broke coronavirus restrictions during last year's elections that her National League for Democracy (NLD) party won in a landslide, her lawyer Min Min Soe told AFP.Another police major testified on separate charges accusing her of illegally importing and possessing walkie-talkies, she added.Ms Suu Kyi \"paid keen attention\" throughout the hearing, another member of her legal team, Khin Maung Zaw said in a statement. Journalists were barred from the proceedings in the special court in the capital Naypyitaw, but an AFP reporter said there was a heavy police presence outside.Ms Suu Kyi's lawyers - who have struggled to gain access to their client - have said they expect the trial to wrap up by July 26. \"We are hoping for the best but prepared for the worst,\" Khin Maung Zaw said ahead of the hearing.A separate trial is scheduled to start today over sedition charges she faces alongside ousted president Win Myint and another senior member of the NLD. If convicted of all charges, Ms Suu Kyi faces more than a decade in jail.Last Thursday, she was hit with additional corruption charges over claims that she illegally accepted US$600,000 (S$796,000) in cash and around 11kg of gold.Her lawyer Khin Maung Zaw has dismissed the new charges - which could see Ms Suu Kyi hit with another lengthy prison term - as \"absurd\".Meanwhile, the former head of Myanmar's Covid-19 immunisation programme has been arrested and faces charges of high treason for colluding with opponents of the military authorities, state media reported yesterday.Myanmar's healthcare system and coronavirus prevention measures have collapsed since the army seized power on Feb 1.On Sunday, reported Covid-19 cases surged to their highest since shortly after the coup.Doctors and other medical workers have been at the forefront of a civil disobedience movement (CDM), leading strikes that have paralysed official and private business. Dozens have been arrested and hundreds more are wanted.The Global New Light of Myanmar said Dr Htar Htar Lin had been arrested last Thursday, and she was also accused of working with the underground National Unity Government (NUG).\"According to her confession, she not only joined the CDM and formed the CDM core group together with other CDM doctors and staff but also colluded with terrorist NUG,\" it said.Separately, a United States journalist detained in Myanmar since March was released yesterday, after charges against him were dropped, his lawyer said.US citizen Nathan Maung \"was released this morning from Insein prison as the police withdrew the charges against him\", and was to fly back to the US today, his lawyer Tin Zar Oo told AFP. She said that Mr Maung, who founded local outlet Kamayut Media, had faced charges under a colonial-era law that criminalises encouraging dissent against the military.AGENCE FRANCE-PRESSE, REUTERSJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/suu-kyis-trial-starts-charges-include-corruption", "Source": "google"}