{"Type": "", "Time": "2021-06-15", "Headline": "Euro 2020 - Luis Enrique's Spain dominate Sweden, but scoreless draw feels like two points dropped for La Roja", "Text": "You have come to the all new Global edition, for other ESPN editions, click here.Alvaro Morata is off target once again for Spain as they share the points with Sweden in Group E. (1:01)Spain and Sweden share the spoils in a scoreless draw, after one of the most one-sided encounters you'll see in a while. Not because one team (Sweden) was poor and because the other (Spain) was good, but simply because they opted for radically different approaches, both of which worked in their own way. And having taken different paths, they ended up in the same place; although for Sweden, it felt like a win, and for Spain, it felt like two points dropped.La Roja manager Luis Enrique does his things way. Always has. At AS Roma. At Celta Vigo. At Barcelona. It's not arrogance; it's studying the options, applying reason and doing what you think is right. Knowing that, whatever the outcome, you'll walk out with your head held high and your conscience clear.You saw it when he called up 24 players for the Euros, none of them from Real Madrid. He didn't need more bodies, he didn't need more Real Madrid guys, be they aging legends (Sergio Ramos), defensive Swiss Army knives (Nacho) or former prodigies (Isco, Marco Asensio).It's not about what you've done; it's about what Luis Enrique thinks you will do. Hence, the starting XI he sent out against Sweden had a grand total of 229 caps, as compared with the opposition's 593. Eight of Spain's XI had 20 or fewer caps, as compared to just one Swede.- Euro 2020 on ESPN: Stream LIVE games and replays (U.S. only)\n- European Soccer Pick 'Em: Compete to win $10,000\n- Euro 2020 bracket and fixture scheduleThe experience in the lineups was reflected in what the Luis Enrique and his opposite number, Janne Andersson, asked their players to do. The latter set up deep and narrow and looked for the break. Luis Enrique exhumed some 2021 version of Tiki Taka, right down to the endless suffocating possession of the ball and, at every turnover, a concerted manhunt to regain it.The result was a first half that saw Spain hog the ball and set passing records (the most in the first half of any Euro match since they started counting in 1980) while approaching 80% possession. And along the way, they created three clear-cut chances: a Dani Olmo header (saved by Robin Olsen); a snatched shot by Koke (who should have hit the target); and after a Marcus Danielson mistake, a horrendous Alvaro Morata finish that went wide.Watching all this from his Marcelo Bielsa-like perch on a pitch-side water cooler, Luis Enrique ought to have been happy. It wasn't just the chances created. It's the fact that Sweden struggled to get out of their half, with their wide men, Emil Forsberg and Sebastian Larsson pinned all the way back and their strikers, Alexander Isak and Marcus Berg far enough away they could have formed their own autonomous region (Isaksberg has a nice ring to it).But football is a weird, low-scoring sport. And so it happens that the best opportunity of the first 45 minutes actually fell to Sweden on one of the very few occasions that they turned up in Unai Simon's sights. Isak, the gifted beanpole who, if you squint really hard, might remind you of a certain Zlatan Ibrahimovic, found himself beating Aymeric Laporte and smacking the ball goalward. It hit Marcos Llorente, then the post, and nested in Simon's arms. Danger averted.If you thought this might have prompted a half-time change from Luis Enrique, you don't know your Luis Enrique. He prowled the sideline Jedi-like in his white button-down and white sneaker combo, arms folded, chin scratched. Yoda preached patience. So would he.The point of this kind of possession football isn't just to pick and prod until you find the blemish in the opposition armour. It's also to wear them down mentally and physically. When you defend as deep as Sweden did, you can't switch off and you rarely get a breather.So he kept turning the screws until he got a scare. A Swedish counter at the hour mark saw Forsberg set up Isak, who squirmed through three opponents and whipped a low ball across the goal for Berg, who with all the graceful footwork of a lamppost, whiffed it entirely.More chin-scratching. More changes. And more doubling down with more passing. On came Thiago Alcantara, perhaps Spain's best passer, and Pablo Sarabia. Off went Rodri (no need for a holding midfielder when there's nothing to hold but empty space) and Morata, whose feast-or-famine meter was leaning decidedly to the latter.Andersson countered with some chess of his own, replacing both his big strikers for two speed merchants in Robin Quaison and Viktor Claesson. He too seemed to double down: You want to pass us to death even further? Fine. We'll clear it long to our roadrunners.Another roll of the dice for Luis Enrique. That patience thing? Gone. Off came his wingers, Olmo and Ferran Torres, on came the tricky Mikel Oyarzabal and another striker in Gerard Moreno. And to be fair, the chances came too, many from crosses, like the one Olsen snuffed out from Moreno. The Villarreal hero managed to get off three shots in less than 20 minutes -- and a very solid penalty appeal when he was manhandled by Danielson -- but to no avail.The Swedish barricades held. It wasn't pretty -- they somehow managed just 315 touches, the lowest in recorded history of the tournament -- but Spain's balling yielded nothing and they still carved out two crystal-clear chances. In the cold, hard world of group-stage major tournament football, a draw against the top seed in the opening game means you have a foot in the knockout rounds. All it takes now is a win over either Poland or Slovakia to be sure.Andersson made no bones about it: \"I'm not at all ashamed of this point. If we want to take points from these types of teams, we have to play this way.\"Dan Thomas is joined by Craig Burley, Shaka Hislop and others to bring you the latest highlights and debate the biggest storylines. Stream on ESPN+ (U.S. only).And Luis Enrique?He'll be second-guessed to high heaven. That's what happens when you opt to be unconventional -- at least by the canons of the modern game -- and don't win. But maybe that's a bit unfair. Not just because they could have scored three in the first half alone, but because the framework did what it was supposed to do: minimise risk and maximise opportunity. Sweden's chances were excellent, but they were also down to the individual skills of Isak, one of the best young centre-forwards in the game.If there is a fault, perhaps, it's in the personnel. If the opposition is going to park the bus, maybe, rather than a bouncer like Rodri, what you need is a guy who can hotwire it and get it out of the way, like Thiago. Olmo and Torres are fine players, but perhaps the style they play at club level is a little too removed from what Luis Enrique wants to do, especially when there's no space in which to run. And then there's Morata. When he's off, he's off. Moreno isn't just coming off a 30-goal season, he's also unselfish and a workaholic. And he's riding a hot streak right now.But there's plenty on which to build. Llorente and Jordi Alba were excellent out wide. Pedri showed zero stage fright. Koke moved the ball well. Just a bit of fine tuning is all that's needed.Not that it matters what I think or you think or the massed ranks of the Spanish media think. Luis Enrique is going to do his own thing.", "Section": "", "Writers": "", "URL": "https://global.espn.com/football/uefa-european-championship/story/4408994/luis-enriques-spain-dominate-sweden-but-scoreless-draw-feels-like-two-points-dropped-for-la-roja", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}