{"Type": "", "Time": "2021-06-15", "Headline": "Man shocked to find he was charged $183.60 for parking at Benoi Road", "Text": "Click here to submit a story or submit it to our WhatsApp.Click here to submit a story or submit it to our WhatsApp.A driver was shocked to find he was charged $183.60 after parking at NTUC LearningHub at Benoi Road on June 9.A Stomper alerted Stomp to a post shared by Facebook user Farizul Ariffin.In his post, he said he had tapped his Autopass Card on the reader but it showed that there was a double entry.Farizul said he was confused and spoke to the parking attendant because he had not even entered the carpark yet.The attendant opened the gantry for the driver to pass and Farizul said he parked there until evening while he finished his course.\"But when in the evening I want to go home, I was surprised when the display [showed] my charge was $183.60,\" he said.\"I [asked] the same parking attendant why I'm being [charged] like this?\"He said I have done double-entry park.\"He added that he felt \"disgusted\" with the situation and that he had no option but to be forced to pay.He then printed out the statement and topped up his card's value to pay for the parking fee.In the comments, he added that he had previously been charged $12 and $1.20 when he had parked at the same carpark on two separate occasions.He did not realise this prior to printing out the transaction statement.\"How many of us user[s] of vehicle[s] in Singapore are aware [of] the charge,\" he asked.Get more of Stomp's latest updates by following us on Facebook, WhatsApp, Twitter, Instagram and YouTube.View the discussion thread.View the discussion thread.Download the new STOMP app today.SPH Digital News | The Straits TimesAll rights reserved | Terms & Conditions | Data Protection Policy | Advertise with usSPH Digital News / STOMP / Copyright (c) 2019 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E.", "Section": "", "Writers": "", "URL": "https://stomp.straitstimes.com/singapore-seen/man-shocked-to-find-he-was-charged-18360-for-parking-at-ntuc-learninghub", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}