{"Type": "", "Time": "2021-06-15", "Headline": "Taiwanese flying to US, China for vaccines as island's Covid-19 situation worsens, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.TAIPEI - Mr Miles Hu plans to get his Covid-19 vaccination in the United States later this month, joining other anxious Taiwanese who are seeking the jabs elsewhere because of the slow rate of vaccination at home.\"I'm pretty sure Taiwan won't have enough vaccines for everyone until year-end, so I decided to combine a work trip with the vaccination,\" said the 40-year-old who manages tech investments.Mr Hu told The Straits Times that he will be travelling to Los Angeles, and plans to book an appointment to get vaccinated at a pharmacy near his Airbnb lodging.Many American states do not require residency for free Covid-19 vaccines.While Mr Hu believes that Taiwan has \"done a very good job, better than the vast majority of places\", with its Covid-19 measures in the past year, he says the government never had a solid plan to ensure that there were enough vaccines for the population of 23.7 million.After largely keeping Covid-19 contained for a little over a year, infections in Taiwan have grown 10-fold in the past month. The island reported 135 cases on Tuesday (June 15) and eight deaths, bringing the total to 13,241 cases and 460 fatalities.Taiwan has ordered some 20 million shots from Moderna, AstraZeneca and the Covax global sharing scheme for lower-income places. But the imports have been arriving in small batches that are barely enough for high-risk groups like medical workers and their families.The island has so far received only 726,600 doses of the AstraZeneca vaccine and another 150,000 doses of the Moderna vaccine.Health Minister Chen Shih-chung said on May 29 that the government aims to have at least 60 per cent of the population receive their first jabs by October.Earlier this month, Japan donated 1.24 million AstraZeneca doses to Taiwan and the US has promised to donate 750,000 shots.But with only some 3 per cent of the population vaccinated as at last week, many are getting worried or frustrated, while at the same time, struggling to adapt to a soft lockdown - schools as well as entertainment and recreation facilities are shut, and working from home is encouraged.Those who have foreign citizenship are the luckier ones. Ms Winnie Huang and her partner, both Taiwanese who also hold US citizenship, flew to Taiwan in early May 2020, when Covid-19 cases were skyrocketing in the US.\"I feel lucky to be able to travel to Taiwan while the rest of the world is under lockdown,\" said 27-year-old Ms Huang.The couple were able to work remotely for a year, and flew back to the US in late April to get vaccinated - just when a string of local cluster infections broke out in northern Taipei.As Taiwan continues to extend its second-highest alert level, talk of \"vaccine tour groups\" spread quickly online.According to local media, screenshots of messages detailing the itinerary of a \"21-day Pfizer Tour\" were leaked to reporters in late May. The itinerary began on June 1 in Los Angeles, taking the tour group to get their first jab on June 2, and touring Las Vegas, San Francisco, San Diego before the second dose back in Los Angeles. The trip reportedly cost NT$350,000 (S$16,800).The government quickly announced that such tours are illegal, and agencies will be fined up to NT$150,000 and potentially be stripped of their licence.Some Taiwanese have also headed to China for their jabs. China has opened up vaccination to those from Taiwan, Hong Kong, Macau and other places in the world, but people from Taiwan will have faster access through \"green channels\", said Mr Xu Zhen-wen, a Taiwanese businessman in China.The head of a Taiwan business association on the mainland said after their two-week quarantine in China, Taiwanese people can register for free vaccination through an app or at the local Taiwan Affairs Office chapter.Once approved, they can get their free jabs at \"green channels\" set up in hospitals, clinics, and vaccination centres across China, \"as a way to fast-track vaccination procedures for Taiwanese in China\", said Mr Xu.Mr Kao Ren-mao, 42, and his wife flew to Shanghai in May to get vaccinated. They received their first jab of China's Sinopharm vaccine last Thursday and are waiting for their second one.\n\nA screenshot showing that Mr Kao Ren-mao has received his first Sinopharm vaccine shot. PHOTO: MR KAO REN-MAO\nMr Kao told The Straits Times that he knows at least a dozen more Taiwanese who opted to do the same, complaining that \"the Taiwanese government is taking too long to vaccinate everyone\".\"I wanted to bring the whole family but most of them couldn't leave work for over a month,\" said Mr Kao, who works for a transportation company based in China's Hefei city, but has been working remotely in Taiwan for a year.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/taiwanese-flying-to-us-china-for-vaccines-as-covid-19-situation-worsens", "Source": "google"}