{"Type": "Asia", "Time": "2021-06-15", "Headline": "Billionaire admits cheating to beat Indian chess champ", "Text": "NEW DELHI: A young Indian billionaire has admitted to cheating in a shock win over five-time chess world champion Viswanathan Anand, saying it was for \"fun and charity\".Online brokerage firm founder Nikhil Kamath took on Anand during an online charity event on Sunday (Jun 13) and caused quite a stir when he came out on top in a 30-minute rapid game.The next day he admitted to using \"computers\" and the help of \"people analysing the game\" to gain the upper hand.\"It is ridiculous that so many are thinking that I really beat Vishy sir in a chess game, that is almost like me waking up and winning a 100mt race with Usain Bolt,\" Kamath tweeted.\"In hindsight, it was quite silly as I didn't realise all the confusion that can get caused due to this. Apologies.\"Anand, acclaimed as the greatest player India has produced, played - and beat - a number of celebrity guests including cricketer Yuzvendra Chahal and Bollywood actor Aamir Khan during the event.The 51-year-old grandmaster appeared to play down the whole affair.\"Yesterday was a celebrity simul for people to raise money It was a fun experience upholding the ethics of the game,\" he wrote on Twitter.\"I just played the position (on the) board and expected the same from everyone.\"India's chess federation saw the incident as violating the spirit of the game.\"We don't expect anybody to get help from computers, at the national and state level we are following the protocols,\" the federation's secretary Bharat Chauhan told local media.\"(Kamath) was doing it for charity, he shouldn't have done. This is really bad,\" he added.Anand won his first world title aged 30, and enjoyed great rivalries with the likes of Russian champions Gary Kasparov, Vladimir Kramnik and Soviet-born Israeli Boris Gelfand.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "chess,sports,Viswanathan Anand,India", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/billionaire-admits-cheating-to-beat-indian-chess-champ-15018572", "Source": "google"}