{"Type": "", "Time": "2021-06-15", "Headline": "Vaccine inequality: Biden and the G-7 make an ‘unforgivable moral lapse’ - The Washington Post", "Text": "You’re reading an excerpt from the Today’s WorldView newsletter. Sign up to get the rest, including news from around the globe, interesting ideas and opinions to know, sent to your inbox every weekday.President Biden and the other leaders of the Group of Seven nations styled themselves as champions in the war against the coronavirus. In a White House statement last week, Biden said the new commitments made by his administration — including a plan to distribute 500 million doses of the Pfizer-BioNTech vaccine to poor and lower-middle-income nations by June 2022 — would “help supercharge the global fight against the pandemic.” British Prime Minister Boris Johnson, who promised about 100 million new doses from his country, said the G-7 nations were rejecting “selfish, nationalistic approaches” by taking a “big step toward vaccinating the world.”But public health advocates and international organizations are adamant that the steps outlined this past weekend in Cornwall are not big enough. For months, the United States, Britain and Canada practiced vaccine hoarding, amassing stockpiles that helped get more than 50 percent of their populations at least partially inoculated, even as poorer nations elsewhere had yet to even distribute doses to their medical workers on the front lines of the pandemic. European governments have also stymied efforts to waive international property protections on some of the Western coronavirus vaccines, a move that proponents say would make it cheaper and easier for countries in the developing world to manufacture their own.The G-7’s communique pledged to “support manufacturing in low-income countries,” but offered few details on how and did not articulate any support for a waiver. The bloc’s leaders touted a pledge of 1 billion new doses, but an analysis by Bloomberg News tabulated that only about 613 million “truly new doses” were promised at the summit, as G-7 nations folded numerous commitments they had already made into the new figure. That included funding commitments to the World Health Organization’s Covax facility, which is aimed at vaccinating poorer nations but has struggled to get going.“The COVAX vaccination campaign got off to a slow start as richer nations locked up billions of doses through contracts directly with drug manufacturers,” noted the Associated Press. “The alliance has distributed just 81 million doses globally, and large parts of the world, particularly in Africa, remain vaccine deserts.”What the G-7 mustered is a start, but much more may be required. The WHO’s director general, Tedros Adhanom Ghebreyesus, said that to vaccinate 70 percent of the world’s population by the next G-7 meeting, the world needed 11 billion doses. “We welcome the generous announcements made about donations of vaccines, but we need more & now,” he tweeted.“One billion doses is just a drop in the ocean compared with the desperate need worldwide. It translates into 500 million fully vaccinated people, which won’t make a dent in the pandemic,” Lawrence Gostin, a professor of global health law at Georgetown University, told my colleague Emily Rauhala. “What’s especially galling is that our six allies combined only matched President Biden’s pledge. Yet the UK and Europe have ample doses to vaccinate all their vulnerable people. … What must happen next is to pledge ongoing vaccine donations at scale, fund vaccine infrastructure and delivery, and building manufacturing capacity in regional hubs.”Already, some critics are branding the weekend a failure. “They know what is needed and they know what they have offered is not enough,” John Denton, secretary general of the International Chamber of Commerce, which is based in Paris, told the Sydney Morning Herald. “They know the financing is also inadequate and they know that the failure to ensure the equitable access to vaccines globally is going to undermine their own economic recovery.”The International Monetary Fund’s managing director, Kristalina Georgieva, said that donating many more doses to poorer countries was not only “a moral imperative, but it is a necessity for the economic recovery to stick, because we can’t have the world split into two tracks without negative consequences.”Denton referred to his organization’s own analysis that found that the global economy would lose trillions of dollars if the vaccine gap between wealthy nations and those with lesser means isn’t more swiftly closed. “What is irritating here is that it is still seen as acts of charity when they are actually acts of economic self-interest,” he said.Former British prime minister Gordon Brown has for months led the call for wealthy nations to shoulder the full burden of vaccinating the world. In a Guardian op-ed, he was scathing about what emerged from the G-7. “The 2021 G7 will go down in history as another turning point where history failed to turn,” Brown wrote. “Long after this weekend summit is over and the handshakes, photocalls and communiques fade from memory, it will be remembered only for failing to honor Boris Johnson’s pre-summit promise to vaccinate the entire world: an unforgivable moral lapse when every three months Covid-19 is destroying 1 million lives.”In response to such criticism, Johnson insisted that he and his allies “are going flat out and we are producing vaccines as fast as we can, and distributing them as fast as we can.”Johnson and Biden still face numerous challenges in grappling with the pandemic in their own countries as new, transmissible variants of the virus start to spread. In the United States, as my colleagues reported, some states with lower rates of vaccination are seeing increased rates of infections. That may offer a preview of summer surges that could take hold “if the unvaccinated continue to behave as though they’re vaccinated,” said Michael Saag, an infectious-disease doctor at the University of Alabama at Birmingham.On Monday, Johnson’s government announced a four-week delay to the planned lifting of Britain’s remaining coronavirus restrictions, amid a spike in cases probably related to the more transmissible delta variant first identified in India. “I am confident we will not need more than four weeks and we will not go beyond July 19,” Johnson said. “But now is the time to ease off the accelerator.”Coronavirus maps: Cases and deaths in the U.S. | Cases and deaths worldwideVaccines: Younger teens | Tracker by state | Guidance for vaccinated people | How long does immunity last? | County-level vaccine dataWhat you need to know: Variants | Symptoms guide | Masks FAQ | Your life at home | Personal finance guide | Follow all of our coverage and sign up for our free newsletterGot a pandemic question? We answer one every day in our coronavirus newsletterAre you still deciding whether you’ll get a covid-19 vaccine? Let us know. The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/world/2021/06/15/vaccines-g7-shortfall/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}