{"Type": "Singapore", "Time": "2021-06-15", "Headline": "Teachers contacting parents and students who have not responded to COVID-19 vaccination invite: MOE", "Text": "SINGAPORE: Teachers are reaching out to parents and students who have not responded to invitations to take the COVID-19 vaccination to offer assistance if needed, said Second Minister for Education Maliki Osman on Monday (Jun 14).\"It could be an issue where the parents do not know how to (sign up). It could be an issue that they are not quite familiar with the online system,\" he said, speaking to reporters at a vaccination centre at ITE College West.\"It could also be parents have some concerns about safety. So for that, we are asking our teachers to reach out to them.\"Giving updates on thestudent vaccination exercise, Dr Maliki said that 345,000 text messages and invites have been sent out to eligible parents and students.As of Sunday, 300,000 students have registered and booked their slots for their vaccination. Of these students, 101,000 have received their first dose, he added.Among students from the graduating cohorts, who were the first batch of students to receive invites, 90 per cent have registered for the vaccination and 75 per cent of them have received their first doses, said Dr Maliki.Some parents may face challenges taking their children to the vaccination centres, such as those who are working and have younger children to care for, said Dr Maliki.\"For those groups, we assure them that all they need to do is when school reopens, they can get in touch with the schools, get in touch with the teachers, and the schools are ready to help facilitate bringing some of the students together perhaps to a vaccination centre, or creating better transportation facilities for them to do so,\" he added.\"We are still reaching out to all those who have not signed up, who have not registered, and we look forward to them understanding the support that's available for the students to be getting their vaccinations.\"Monday was also the first day of vaccinations for ITE students. About nine in 10 of them have registered for the vaccination exercise, said Dr Maliki.At ITE College West, about 280 students took their first dose of the COVID-19 vaccine on Monday morning.There are 28,000 ITE students across Singapore, and they can register for the vaccination directly through their schools for the centre set up in their respective colleges, said Dr Maliki.All three ITE College vaccination centres are open, and the fourth MOE vaccination centre at Raffles City Convention Centre will start operations on Tuesday.The Education Ministry hopes all students can receive their second dose by the end of August, \"but that all depends\" on the response rate, said Dr Maliki.\"It's very encouraging today. By and large, we have about 80 to 90 per cent of responses for the different categories, and we hope more will step forward,\" he added.Responding to a question about whether vaccinated and non-vaccinated students will be subject to different measures when they return to school, Dr Maliki said: \"The last thing we want is for students to be identified as 'you have been vaccinated' and 'you have not been vaccinated', because we do not want a situation where one becomes stigmatised for not being vaccinated.\"Certainly, we have to respect decisions by parents, whether they would like their children to be vaccinated or not. We hope that the environment is one where everyone in the school feels safer, now that the majority would have had their vaccination by the time they resume school at the end of June.\"Dr Maliki added that schools will continue to adhere to safe management measures like practising hygiene and cleanliness standards, safe distancing and the wearing of masks.\"We will continue to take guidance from the MTF (multi-ministry task force) with regard to the measures that we put in place at the national level and schools will respond accordingly,\" he said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,education,MOE,Ministry of Education", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/covid-19-vaccination-for-students-moe-not-responded-to-invites-15011120", "Source": "google"}