{"Type": "", "Time": "2021-06-15", "Headline": "The Guardian view on Biden, China and Europe: the US is back – for now | Editorial | The Guardian", "Text": "Democratic unity is welcome against authoritarian might. That doesn’t mean signing up to everything on the US agendaLast modified on Tue 15 Jun 2021 15.17 EDTIt is 50 years next month since Henry Kissinger embarked on the secret mission to Beijing that led to a rapprochement: “It is the conviction of President Nixon that a strong and developing People’s Republic of China poses no threat to any essential US interest,” the national security adviser assured leaders there. Half a century on, the thaw is over. The thread running through Joe Biden’s first foreign trip as president is the need for democratic alliances against growing authoritarian might, and though attention now turns to his meeting with Vladimir Putin on Wednesday, the administration’s real focus has been on China. While Beijing’s record on the pandemic, trade, human rights and other specific areas has rightly raised deep concern internationally, the underlying issue is its rise, and the decline of US power.“The US is ill and very ill indeed,” foreign ministry spokesman Zhao Lijian declared in Beijing on Tuesday. Washington’s waning power was exemplified by Donald Trump, with his erratic pronouncements and conduct, veneration of autocrats and contempt for allies. Yet if Mr Biden has largely defined himself in opposition to his predecessor, he often sounds strikingly similar on China. His approach too is shaped by domestic politics: talking tough on Beijing offers some prospect of political unity in a deeply divided country, should help to ward off Republican attacks on that front, and recognises that the business world is shifting.The US knows it must work with China on the climate crisis – with the critical Cop26 talks due this autumn – and says it does not want a cold war. Mr Biden has shunned his predecessor’s racism. But the overall hawkish tone struck on China, including briefings around the “lab leak” pandemic theory, has a cold war feel and broader repercussions – with people of east Asian descent, who have nothing to do with decisions in Beijing, facing hostility and attacks.In Europe, as elsewhere, Mr Biden has an opportunity created by the backlash against Chinese policies and “wolf warrior” diplomacy. There are signs that China’s push for influence is faltering: the European parliament froze an investment deal following tit-for-tat sanctions over Beijing’s treatment of the Uyghurs; Lithuania quit the “17+1” mechanism for dialogue with central and eastern Europe last month; and plans for a Chinese university campus in Hungary are on hold.Nato leaders this week declared China a security risk, “present[ing] systemic challenges to the rules-based international order”. But the ongoing differences on handling Beijing are evident. Emmanuel Macron was swift to add that “China has little to do with the North Atlantic” and that it was important “we don’t bias our relationship”. Similarly, Angela Merkel reportedly expressed concern that the G7 is “not about being against something, but for something”. Strategic instincts as well as commercial interests work against buying into the US agenda wholesale.Many anticipate that a new German chancellor will turn the country’s China policy in a more critical direction. But while the US is right that democratic countries must pull together on important issues, decisions cannot and should not be by American diktat. European countries are right to be wary of dancing to the US tune – not least because they wonder what kind of leader could be in charge four years from now.As Mr Biden has recognised, the US-China competition will be shaped in large part by the performance of the US: how it looks at home, as well as whether projects such as the G7 infrastructure initiative materialise in any significant way. (The G7’s failure to reach a better deal on vaccine-sharing does not bode well.) While favourable perceptions of the US and confidence in its president soared after he took office, only 17% of those surveyed in 12 countries saw American democracy as a good example for other countries to follow. America is back, we were told this week. But we are in a multilateral world now, and its position will depend not only on pursuing economic and technical superiority, but healing its politics and society too.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/commentisfree/2021/jun/15/the-guardian-view-on-biden-china-and-europe-the-us-is-back-for-now", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}