{"Type": "", "Time": "2021-06-15", "Headline": "5 charts that explain how serious England's COVID problem is now", "Text": "Boris Johnson delayed the end of lockdown until 19 July after being warned unlocking on Monday could have heaped unsustainable pressure on the NHS and led to thousands more coronavirus deaths. The Delta variant of the virus, first identified in India, has changed the outlook of the pandemic.Here are five charts, shared by England's chief medical officer Prof Chris Whitty, that demonstrate how serious the situation is right now and why a delay to ending restrictions was deemed necessary.While one dose of a vaccine leads to an estimated 57% to 85% reduction in Delta variant hospital admissions, it provides much less protection – a 26% to 40% reduction – for symptomatic disease.\"You do need two doses of the vaccine to provide a strong degree of protection,\" Prof Whitty said at Monday's Downing Street press conference.As of Sunday, 43.1% of UK adults – more than 20 million people – still needed to receive a second dose and therefore would have been at higher risk of symptomatic COVID if restrictions had been lifted on Monday.Infections in both the North West, the region where case numbers are highest, and England as a whole have increased 64% in a week.Prof Whitty explained: \"The rates of hospitalisations at the moment are low in all parts of the country but – and this is the important ‘but’ on this test – what we are seeing is a rapid rise [in infections], particularly in the North West of the country. \"But the rest of the country is following.\"Watch: Lockdown restrictions – what is changing, what is staying the same and why?The now-dominant Delta variant is said to be 60% more transmissible than the previously dominant Alpha variant.Prof Whitty went on: \"A relatively small number of doubling times and you start getting into really quite large numbers. If you’re doubling from 1,000 to 2,000 to 4,000 in less than two weeks, clearly things can take off very rapidly.\"To put it simply, COVID-19 cases are spreading across the whole country because of the Delta variant.The map above highlights widespread \"brown\" areas where infection numbers are increasing, with \"grey\" areas of decreasing cases notably sparse.“The link between people getting an infection and being hospitalised has been substantially weakened,\" Prof Whitty said.\"A much smaller proportion of those infected are going into hospital – but it has not been completely stopped.\"With a 50% increase in hospital admissions in England in a week, Prof Whitty said this would \"probably accelerate\" given the increased case numbers.“Although we do not think an immediate overwhelming of the NHS is likely,\" he went on, \"if this continues on an exponential path and if that accelerated further [due to lockdown being lifted on 21 June] then we would run into trouble in a relatively small number of doubling times.”Prof Whitty said that \"while the Alpha variant is going down, the Delta variant is going up exponentially\" and \"this is the reason why the assessment of risk has fundamentally shifted\".He warned infection numbers will be even higher by the new unlocking target date of 19 July. Crucially, however, the continuation of social distancing and more double jabs should prevent a \"high peak\".Read more:COVID booster jabs in the autumn 'may not be needed', says vaccine expertHave your say: How confident are you COVID restrictions will finally be lifted on 19 July?Prof Whitty said: \"At the end of the period the prime minister is talking about, we will have a situation where a much higher proportion of people have been double-vaccinated coming up to school holidays.\"We all want to stress that at that stage, rates will be higher than they are at the moment. But the next four weeks will reduce significantly the risk of a very high peak which could cause significant problems in terms of pressure on the NHS, the knock-on effects of that, and direct deaths from COVID.\"Watch: Tuesday's daily politics briefingGetting the COVID-19 vaccine in Singapore is easy. According to the Ministry of Health (MOH), as of 17 May 2021, 3.4 million doses have been administered. Here's a guide on how to find a vaccination centre near you.European stock markets rose Tuesday after a mixed showing in Asia, as investors braced for news from a key Federal Reserve interest-rate meeting.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.In the wake of one of the biggest password leaks in history, Apple has unveiled a new biometric-based feature that could one day replace passwords across all Apple devices.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.Board certified internal medicine and obesity specialist reveals what happens after drinking just 1 diet soda. Click here to watch video.A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.A French nuclear firm said Monday it was working to resolve a \"performance issue\" linked to a gas build-up at a plant it part-owns in southern China following a US media report of a potential leak there.The nominee to be the top US diplomat for East Asia promised Tuesday that President Joe Biden would keep building relations with Taiwan, but balked at backing an overhaul of delicate arrangements on the issue with China.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.If you’re wondering whether Ethereum is a good long term investment, keep reading.Looking for travel insurance? Save more with these promo codes and discounts from insurers such as FWD, MSIG, AXA, and more! To find out if your travel insurance covers COVID-19, read this article for the latest updates. No matter your travel itinerary, travel insurance is […] The post Travel Insurance Promotions and Discounts appeared first on SingSaver Blog - We Compare, You Save.Every PC user must read this in 2021 - Do it now.Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the challenges posed by its policies.Toshiba apologised to shareholders Monday and said it would remove two directors after a probe found the Japanese conglomerate had sought government help to try and influence a boardroom vote.New research has identified TEN favorite stocks for the upcoming yearWith its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Asset sales in a liquidation process at Hyflux Ltd., Singapore’s highest-profile distressed company, would likely bring in less than S$200 million, a person familiar with the matter said, a fraction of the amount creditors are claiming.A 20-year-old male polytechnic student on internship with a hospital secretly recorded a staff relieving herself at Jurong Medical Centre in January, a court heard.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/charts-explain-england-covid-problem-113646855.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}