{"Type": "", "Time": "2021-06-15", "Headline": "Euro 2021: Eriksen had cardiac arrest but test results normal, Danish team doctor says", "Text": "Denmark's Christian Eriksen suffered a cardiac arrest when he collapsed during his side's Euro 2020 opening match against Finland, his team's doctor confirmed on Sunday, but the reason remained unclear.\"He was gone; we did cardiac resuscitation, it was a cardiac arrest. We got him back after one defib (defibrillation),\" Morten Boesen told a news conference, adding that Eriksen remained in hospital for further tests after his collapse on Saturday.\"The exams that have been done so far look fine,\" Boesen added. \"We don't have an explanation to why it happened.\"Eriksen, 29, collapsed suddenly in the 42nd minute of the match while running near the left touchline after a Denmark throw-in. As a hush fell over the 16,000-strong crowd, his team mates gathered around him while he was treated on the pitch and then carried off on a stretcher.The Danish players had been in contact with Eriksen via a video conference, said Peter Moller, director of Danish football association DBU.Coach Kasper Hjulmand said Eriksen had told him he did not remember much from Saturday's collapse and that he was eager to get back on to the pitch.\"He would like for us to play on,\" Hjulmand said. \"He said he feels like he could go out and play again. Christian feels best when he's got a football close to his feet.\"Hjulmand quoted the midfielder as saying: \"I think you are feeling worse than I am. I feel as if I'm about to go training now, boys.\"\"Christian is in good spirits and it's a huge relief for the players after all this uncertainty,\" Hjulmand said. \"There is no doubt that we have been on the ropes.\"Messages of support for Eriksen, who plays for Inter Milan, have poured in.The Group B game was halted and eventually restarted an hour and 45 minutes later. Finland went on to win 1-0 with their only attempt of the game.Former Danish internationals Peter Schmeichel and Michael Laudrup have criticized governing body UEFA over their handling of the collapse. The players were given the option to finish the game on Saturday evening or on Sunday.\"Looking back, I honestly don't think that we should have been back on the pitch,\" Hjulmand said. \"I have thought about whether I could have done things differently.\"Got a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services.ʩ 2021 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by ", "Section": "", "Writers": "", "URL": "https://www.cnbc.com/2021/06/13/eriksen-had-cardiac-arrest-but-test-results-normal-danish-team-doctor.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}