{"Type": "", "Time": "2021-06-15", "Headline": "China's 'Bat Woman,' at the Center of a Pandemic Storm, Speaks Out", "Text": "To a growing chorus of U.S. politicians and scientists, she is the key to whether the world will ever learn if the virus behind the devastating COVID-19 pandemic escaped from a Chinese lab. To the Chinese government and public, she is a hero of the country’s success in curbing the epidemic and a victim of malicious conspiracy theories.Shi Zhengli, a top Chinese virologist, is once again at the center of clashing narratives about her research on coronaviruses at a state lab in Wuhan, the city where the pandemic first emerged.The idea that the virus may have escaped from a lab had long been widely dismissed by scientists as implausible and shunned by others for its connection with former President Donald Trump. But fresh scrutiny from the Biden administration and calls for greater candor from prominent scientists have brought the theory back to the fore.Sign up for The Morning newsletter from the New York TimesScientists generally agree that there is still no direct evidence to support the lab leak theory. But more of them now say that the hypothesis was dismissed too hastily, without a thorough investigation, and they point to a range of unsettling questions.Some scientists say Shi conducted risky experiments with bat coronaviruses in labs that were not safe enough. Others want clarity on reports, citing U.S. intelligence, suggesting that there were early infections of COVID-19 among several employees of the Wuhan Institute of Virology.Shi has denied these accusations and now finds herself defending the reputation of her lab and, by extension, that of her country. Reached on her cellphone last week, Shi said at first that she preferred not to speak directly with reporters, citing her institute’s policies. Yet she could barely contain her frustration.“How on earth can I offer up evidence for something where there is no evidence?” she said, her voice rising in anger during the brief, unscheduled conversation. “I don’t know how the world has come to this, constantly pouring filth on an innocent scientist,” she wrote in a text message.In a rare interview over email, she denounced the suspicions as baseless, including the allegations that several of her colleagues may have been ill before the outbreak emerged.The speculation boils down to one central question: Did Shi’s lab hold any source of the new coronavirus before the pandemic erupted? Shi’s answer is an emphatic no.But China’s refusal to allow an independent investigation into her lab, or to share data on its research, make it difficult to validate Shi’s claims and has only fueled nagging suspicions about how the pandemic could have taken hold in the same city that hosts an institute known for its work on bat coronaviruses.Those in favor of the natural origins hypothesis, though, have pointed to Wuhan’s role as a major transportation hub as well as a recent study that showed that just before the pandemic hit, the city’s markets were selling many animal species capable of harboring dangerous pathogens that could jump to humans.The Chinese government has given no appearance of holding Shi under suspicion. Despite the international scrutiny, she seems to have been able to continue her research and give lectures in China.The stakes in this debate extend into how scientists study infectious diseases. Some scientists have cited the lab leak scenario in pushing for greater scrutiny of “gain of function” experiments that, broadly defined, are intended to make pathogens more powerful to better understand their behavior and risks.Many scientists say they want the hunt for the virus’ origins to transcend politics, borders and individual scientific achievements.“This has nothing to do with fault or guilt,” said David Relman, a microbiologist at Stanford University and co-author of a recent letter in the journal Science, signed by 18 scientists, that called for a transparent investigation into all viable scenarios, including a lab leak.The letter urged labs and health agencies to open their records to the public.“It’s just bigger than any one scientist or institute or any one country — anybody anywhere who has data of this sort needs to put it out there,” Relman said.‘Transparency matters.’Many virologists maintain that the coronavirus most likely jumped from an animal to a human in a setting outside a lab. But without direct proof of a natural spillover, more scientists and politicians have called for a full investigation into the lab leak theory.Proponents of a lab investigation say that researchers at Shi’s institute could have collected — or contracted — the new coronavirus from the wild, such as in a bat cave. Or the scientists may have created it, by accident or by design. Either way, the virus could then have leaked from the laboratory, perhaps by infecting a worker.China has sought to influence investigations into the virus’ origin, while promoting its own unproven allegations.Beijing agreed to allow a team of World Health Organization experts to visit China but limited their access. When the WHO team said in a report in March that a lab leak was extremely unlikely, its conclusion was seen as hasty. Even the head of the WHO, Dr. Tedros Adhanom Ghebreyesus, said: “I do not believe that this assessment was extensive enough.”Last month, President Joe Biden ordered intelligence agencies to investigate the origin question, including the lab theory. On Sunday, the leaders of the world’s wealthiest large democracies, at the Group of 7 summit, urged China to be part of a new investigation into the origins of the coronavirus. Biden told reporters that he and other leaders had discussed access to labs in China.“Transparency matters across the board,” Biden said.‘Scientists have a motherland.’In less polarized times, Shi was a symbol of China’s scientific progress, the “Bat Woman” at the forefront of research into emerging viruses.She led expeditions into caves to collect samples from bats and guano, to learn how viruses jump from animals to humans. In 2019, she was among 109 scientists elected to the American Academy of Microbiology for her contributions to the field.“She’s a stellar scientist — extremely careful, with a rigorous work ethic,” said Dr. Robert C. Gallo, director of the Institute of Human Virology at the University of Maryland School of Medicine.The Wuhan Institute of Virology employs nearly 300 people and is home to one of only two Chinese labs that have been given the highest security designation, Biosafety Level 4. Shi leads the institute’s work on emerging infectious diseases, and over the years, her group has collected over 10,000 bat samples from around China.Under China’s centralized approach to scientific research, the institute answers to the Communist Party, which wants scientists to serve national goals.“Science has no borders, but scientists have a motherland,” Xi Jinping, the country’s leader, said in a speech to scientists last year.Shi herself, though, does not belong to the Communist Party, according to official Chinese media reports, which is unusual for state employees of her status. She built her career at the institute, starting as a research assistant in 1990 and working her way up the ranks.Shi, 57, obtained her Ph.D. from the University of Montpellier in France in 2000 and started studying bats in 2004 after the outbreak of severe acute respiratory syndrome, or SARS, which killed more than 700 people around the world. In 2011, she made a breakthrough when she found bats in a cave in southwestern China that carried coronaviruses that were similar to the virus that causes SARS.“In all the work we do, if just once you can prevent the outbreak of an illness, then what we’ve done will be very meaningful,” she told CCTV, China’s state broadcaster, in 2017.But some of her most notable findings have since drawn the heaviest scrutiny. In recent years, Shi began experimenting on bat coronaviruses by genetically modifying them to see how they behave.In 2017, she and her colleagues at the Wuhan lab published a paper about an experiment in which they created new hybrid bat coronaviruses by mixing and matching parts of several existing ones — including at least one that was nearly transmissible to humans — in order to study their ability to infect and replicate in human cells.Proponents of this type of research say it helps society prepare for future outbreaks. Critics say the risks of creating dangerous new pathogens may outweigh potential benefits.The picture has been complicated by new questions about whether U.S. government funding that went to Shi’s work supported controversial gain-of-function research. The Wuhan institute received around $600,000 in grant money from the U.S. government, through an American nonprofit called EcoHealth Alliance. The National Institutes of Health said it had not approved funding for the nonprofit to conduct gain-of-function research on coronaviruses that would have made them more infectious or lethal.Shi, in an emailed response to questions, argued that her experiments differed from gain-of-function work because she did not set out to make a virus more dangerous but to understand how it might jump across species.“My lab has never conducted or cooperated in conducting GOF experiments that enhance the virulence of viruses,” she said.‘Speculation rooted in utter distrust.’Concerns have centered not only on what experiments Shi conducted but also on the conditions under which she did them.Some of Shi’s experiments on bat viruses were done in Biosafety Level 2 labs, where security is lower than in other labs at the institute. That has raised questions about whether a dangerous pathogen could have slipped out.Ralph Baric, a University of North Carolina expert in coronaviruses who signed the open letter in Science, said that although a natural origin of the virus was likely, he supported a review of what level of biosafety precautions were taken in studying bat coronaviruses at the Wuhan institute. Baric conducted NIH-approved gain-of-function research at his lab using information on viral genetic sequences provided by Shi.Shi said that bat viruses in China could be studied in BSL-2 labs because there was no evidence that they directly infected humans, a view supported by some other scientists.She also rejected recent reports that three researchers from her institute had sought treatment at a hospital in November 2019 for flulike symptoms, before the first COVID-19 cases were reported.“The Wuhan Institute of Virology has not come across such cases,” she wrote. “If possible, can you provide the names of the three to help us check?”As for samples that the lab held, Shi has maintained that the closest bat virus she had in her lab, which she shared publicly, was only 96% identical to SARS-CoV-2, the virus that causes COVID-19 — a vast difference by genomic standards. She rejects speculation that her lab had worked on other viruses in secret.Shi’s research on a group of miners in Yunnan province who suffered severe respiratory disease in 2012 has also drawn questions. The miners had worked in the same cave where Shi’s team later discovered the bat virus that is close to SARS-CoV-2. Shi said that her lab did not detect bat SARS-like coronaviruses in the miners’ samples and that she would publish more details in a scientific journal soon; her critics say she has withheld information.“This issue is too important not to come forward with everything you have and in a timely and transparent manner,” said Alina Chan, a postdoctoral research fellow at the Broad Institute of MIT and Harvard who also signed the Science letter.Many scientists and officials say China should share employees’ medical records and the lab’s logs of its experiments and its viral sequence database to evaluate Shi’s claims.Shi said she and the institute had been open with the WHO and with the global scientific community.“This is no longer a question of science,” she said on the phone. “It is speculation rooted in utter distrust.”‘I have nothing to fear.’The pandemic was a moment that Shi and her team had long braced for. For years, she had warned of the risks of a coronavirus outbreak, building up a stock of knowledge about these pathogens.In January 2020, as Shi and her team worked frantically, they were exhausted but also excited, said Wang Linfa, a virologist at the Duke-National University of Singapore Medical School who was in Wuhan with Shi at the time.“All the experiences, reagents and the bat samples in the freezer were finally being used in a significant way globally,” said Wang, Shi’s collaborator and friend for 17 years.Shi published some of the most important early papers on SARS-CoV-2 and COVID-19, which scientists around the world have relied on.But soon, the speculation about Shi and her lab began to swirl. Shi, who is known among friends for being blunt, was baffled and angry — and sometimes let it show.In an interview with Science magazine in July, she said that Trump owed her an apology for claiming the virus came from her lab. On social media, she said people who raised similar questions should “shut your stinky mouths.”Shi said what she saw as the politicization of the question had sapped her of any enthusiasm for investigating the origins of the virus. She has instead focused on COVID vaccines and the features of the new virus, and over time, she said, has calmed down.“I’m sure that I did nothing wrong,” she wrote. “So I have nothing to fear.”This article originally appeared in The New York Times.© 2021 The New York Times CompanyGetting the COVID-19 vaccine in Singapore is easy. According to the Ministry of Health (MOH), as of 17 May 2021, 3.4 million doses have been administered. Here's a guide on how to find a vaccination centre near you.European stock markets rose Tuesday after a mixed showing in Asia, as investors braced for news from a key Federal Reserve interest-rate meeting.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.In the wake of one of the biggest password leaks in history, Apple has unveiled a new biometric-based feature that could one day replace passwords across all Apple devices.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.Board certified internal medicine and obesity specialist reveals what happens after drinking just 1 diet soda. Click here to watch video.A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.A French nuclear firm said Monday it was working to resolve a \"performance issue\" linked to a gas build-up at a plant it part-owns in southern China following a US media report of a potential leak there.The nominee to be the top US diplomat for East Asia promised Tuesday that President Joe Biden would keep building relations with Taiwan, but balked at backing an overhaul of delicate arrangements on the issue with China.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.If you’re wondering whether Ethereum is a good long term investment, keep reading.Looking for travel insurance? Save more with these promo codes and discounts from insurers such as FWD, MSIG, AXA, and more! To find out if your travel insurance covers COVID-19, read this article for the latest updates. No matter your travel itinerary, travel insurance is […] The post Travel Insurance Promotions and Discounts appeared first on SingSaver Blog - We Compare, You Save.New research has identified TEN favorite stocks for the upcoming yearSingtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the challenges posed by its policies.Toshiba apologised to shareholders Monday and said it would remove two directors after a probe found the Japanese conglomerate had sought government help to try and influence a boardroom vote.Every PC user must read this in 2021 - Do it now.With its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Asset sales in a liquidation process at Hyflux Ltd., Singapore’s highest-profile distressed company, would likely bring in less than S$200 million, a person familiar with the matter said, a fraction of the amount creditors are claiming.A 20-year-old male polytechnic student on internship with a hospital secretly recorded a staff relieving herself at Jurong Medical Centre in January, a court heard.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/chinas-bat-woman-center-pandemic-181409897.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}