{"Type": "CNA Insider", "Time": "2021-06-15", "Headline": "India’s second COVID-19 wave sparks selfless acts, but the battle is far from over", "Text": "With hospitals pushed to the limit, good Samaritans have stepped forward to save lives. But beating the second wave — and preventing a third — will take a lot more, experts tell the programme Insight.MUMBAI: People feared they would die if they stepped out of their homes. In the streets, people were weeping beside the dead. Oxygen and hospital beds were in dire shortage.As new cases in India exceeded 400,000 and deaths exceeded 4,000 on some days last month, even the rich and connected were not spared from the devastating second wave of the COVID-19 pandemic.But the virus did not kill the spirit of generosity.In Mumbai, kidney dialysis patient Rozy Saldhana and her husband had basic medical facilities including an oxygen cylinder set up at home for emergencies. Despite her kidney failure, the 52-year-old did not hesitate to give the cylinder to someone else who needed it.Her husband, Pascol, had received a call from his friend, a school principal. The husband of a teacher needed oxygen but could not get hold of a cylinder.WATCH: In India, dialysis patient saves dying COVID-19 victims (3:22)When Saldhana — who has been on dialysis for five years — heard about it, she told her husband to give their cylinder to the man. “Don’t worry about me. I’m fit enough,” her husband recollected her saying.She did not stop there. She told her husband to sell all her jewellery and buy oxygen to help more people. He received 80,000 rupees (S$1,450) from the sale and did as his wife had asked.Over in Delhi, a Sikh voluntary organisation called Khalsa Help International has set up makeshift hospital facilities in several locations to treat patients. Its free oxygen support service has saved thousands of lives since late April.Its founder, Gurpreet Singh Rummy, said the group has not refused anyone. It has served more than 15,000 people, of whom around 8,000 to 10,000 had arrived in a critical state and would have died without oxygen support, he said.“Whether you’re coming in a rickshaw or a Mercedes-Benz, we treat all equally. Our only priority is the level of oxygen,” he told theprogramme Insight.We don’t discriminate on the basis of religion, caste, creed or if one is rich or poor. Our service is for everyone.While getting supplies is not easy, he told Reuters that the organisation’s volunteers “travel hundreds of kilometres” to fetch oxygen, and “you can’t expect such zeal from most government bodies”.It looks like the email address you entered is not valid.THE PATH TO CATASTROPHEHealthcare experts said a highly transmissible strain, complacency and large gatherings were among the reasons behind the second wave.Last year, India was quick to impose a lockdown from late March. While it caused suffering to migrant workers within the country, it helped contain case numbers, noted Rajesh Parikh, the director of medical research at Jaslok Hospital, one of Mumbai’s top hospitals.But India failed to take advantage of the respite to ramp up facilities and oxygen production, he said.From October, most safety protocols had been abandoned, and millions of people travelled between states. Large gatherings in the form of Diwali celebrations and weddings made a comeback.“One of the confounding factors in the second wave has been large gatherings, whether it’s for the Kumbha Mela, a religious gathering, or the political rallies which occurred throughout West Bengal,” said Parikh. These “undoubtedly” amplified the second wave.The authorities also incorrectly estimated that India’s population had “possibly acquired herd immunity”, cited K Srinath Reddy, the president of the Public Health Foundation of India.Antibody surveys were done in a “patchy” and “piecemeal” fashion across the country, with “markedly varying results”, noted the professor. The best results showed widespread detection of antibodies, hence the belief that “most of India” had herd immunity.“The public wanted to believe it. The businessmen wanted to believe it because they wanted to put the economy back on the rails. The small traders wanted to believe it because they’d suffered a lot,” said the cardiologist and epidemiologist.“The politicians wanted to believe it because they wanted to go back to election rallies … Even people who wanted to organise religious festivals wanted to believe that good news, because that’s their business as well.”WATCH: The full episode — India’s COVID catastrophe: What went wrong? (48:05)Meanwhile, a new viral strain — called the Delta variant, or B.1.617 previously — emerged and spread more quickly than doctors expected.“We’ve seen that (if) even one person in the family is infected, the entire household comes down with the infection in the next 10 or 12 days,” said Mumbai-based infectious diseases expert Trupti Gilada-Baheti.VACCINATION A MATTER OF URGENCYThe outcome is immeasurable grief across India. Pune resident Arun Gaikwad, a 47-year-old Indian Air Force officer, lost his wife and half her family in the span of 15 days in March and April.They had held prayers for his late father-in-law, and one of his brothers-in-law had a cold. In the following days, nearly everyone who had gathered, including Gaikwad’s teenage daughter and son, tested positive for COVID-19.When his wife developed breathing difficulties, he rushed to several hospitals before locating one 40 kilometres away with a ventilator bed available. Two days after she was admitted, she died of cardiac arrest. Two brothers-in-law and his mother-in-law also died.New cases have declined since last month after lockdowns were imposed. But to prevent a resurgence, doctors say the country must urgently vaccinate its people.In a population of over 1.3 billion people, over 240 million doses of vaccine have been administered so far.India must ensure that there are enough vaccines and ramp up its vaccination drive in both cities and villages, said Gilada-Baheti, who works at the Unison Medicare and Research Centre.“To keep ourselves from a very disastrous third wave, we’ll have to vaccinate a substantial number of a population at phenomenal speed,” said the doctor, who is also a consultant at Prince Aly Khan Hospital and at Masina Hospital.Effective control measures would also ease the mental strain on healthcare professionals. “Every day in the ward or the ICU is like a battle,” said Gilada-Baheti. “Every day we see victories, and we see losses … It’s heartbreaking.”Watch this episode ofInsight here. The programme airs on Thursdays at 9pm.", "Section": "", "Writers": "", "MainKeyWord": "Covid-19,coronavirus,CNA Insider", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/cnainsider/india-second-covid-19-wave-sparks-selfless-acts-battle-hospitals-15013398", "Source": "google"}