{"Type": "", "Time": "2021-06-15", "Headline": "Americans who helped Ghosn escape Japan plead guilty | Automotive Industry News | Al Jazeera", "Text": "A US Army Special Forces veteran and his son pleaded guilty in Tokyo on Monday to charges that they illegally helped former Nissan Motor Co Ltd Chairman Carlos Ghosn flee Japan.A United States Army Special Forces veteran and his son have pleaded guilty in Tokyo to charges that they illegally helped former Nissan Motor Co Ltd Chairman Carlos Ghosn flee Japan hidden in a box on board a private jet in December 2019.Chief Judge Hideo Nirei, one of the three judges presiding over their first court appearance, on Monday asked Michael Taylor and his son Peter whether there was any mistake in the charges submitted by the Tokyo Prosecutors’ Office.“No your honour,” the older Taylor replied. “No,” said his son.Extradited to Japan from the US in March, they are being held at the same jail in Tokyo where Ghosn was imprisoned. They could face up to three years in prison.Wearing black jackets and pants, white shirts and plastic slippers, the duo were led into the court with ropes threaded through handcuffs and tied around their waists.Prosecutors accused them of helping Ghosn evade punishment and escape to Lebanon from western Japan’s Kansai airport, receiving $1.3m for their services, some of which was paid to an advertising company owned by the younger Taylor. The Americans asked Ghosn for another $500,000 for legal fees after Japan sought their arrest, prosecutors said.They also described the younger Taylor as a frequent visitor to Lebanon and said planning for the escape began about six months before Ghosn fled.Their statement also said Ghosn’s wife Carole sought help from Michael Taylor, with Ghosn later contacting him from Tokyo with a phone he had hidden from the Japanese authorities.A third man, George-Antoine Zayek, recruited by the Taylors, travelled to Japan later in 2019 to find a way through airport security, settling on the private jet terminal at Kansai airport as the best route out, the prosecutors said.Zayek remains at large.The luggage that does not fit through the security scanning machine there is inspected by hand. That check, however, can be waived by the pilot.The Taylors’ lawyers in the US waged a months-long battle to prevent their extradition to Japan, arguing they could not be prosecuted for helping someone “bail jump” and that they could face relentless interrogations and torture.Suspects in Japan are interrogated in the absence of their lawyers and are often denied bail before trial.Japan’s conviction rate is 99 percent.At the time of Ghosn’s escape, he was awaiting trial on charges that he understated his compensation in Nissan’s financial statements by 9.3 billion yen ($85m) over a decade and enriched himself at his employer’s expense through payments to car dealerships.Ghosn – who denies any wrongdoing – remains a fugitive in his childhood home, Lebanon, which has no extradition treaty with Japan.Greg Kelly, a former Nissan executive charged with helping Ghosn hide his earnings, is also standing trial in Tokyo. He denies the charges against him.The Taylors will make their next appearance in court, the same room where Kelly’s trial is being held, on June 29, when their lawyers will deliver a statement and the Americans will be cross-examined.Father-son duo hoped Biden administration would block extradition, but US authorities handed them over.Former top lawyer says he was surveilled and demoted after he questioned the probe, Bloomberg reports.A Dutch court rejected the fugitive former auto chief’s wrongful dismissal claim against Nissan-Mitsubishi.On Monday morning, a delegation of French investigators began questioning Carlos Ghosn, the former chairman of Renault.We use cookies to give you the best possible experience. Learn more about how we use cookies. By clicking ‘Accept’ you agree to these cookies. To decline, click here.", "Section": "", "Writers": "", "URL": "https://www.aljazeera.com/amp/economy/2021/6/14/americans-who-helped-ghosn-escape-japan-plead-guilty", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}