{"Type": "Singapore", "Time": "2021-06-15", "Headline": "NParks 'committed' to intensify efforts to educate public on sensitive marine life", "Text": "SINGAPORE: The National Parks Board (NParks) is \"concerned\" by the large number of visitors over the weekend to the intertidal area at Changi Beach, and the collection of shellfish and other invertebrates, it said in a statement to CNA on Wednesday (Jun 15).A post shared in the Singapore Wildlife Sightings Facebook group on Sunday showed these beach visitors digging up sea creatures during an intertidal walk.The visitors were also seen collecting these creatures, including crabs, fish and anemone, in a pail.An intertidal zone is the coastal area that is submerged at high tide, but exposed at low tide.\"Regarding the collection of shellfish, other than certain rare species, invertebrates are currently not protected under the Wildlife Act,\" said Ryan Lee, Group Director of the National Biodiversity Centre at the National Parks Board, in response to CNA's queries.Imposing restrictions on all invertebrates would also mean taking into account common pests like cockroaches.\"Under the Parks and Trees Act, however, flora and fauna, including invertebrates, cannot be collected in our nature reserves and parks, and these include Sisters’ Islands Marine Park, Sungei Buloh Wetland Reserve, Labrador Nature Reserve’s rocky shore and Chek Jawa Wetlands,\" added Mr Lee.\"Offences, including the picking of shellfish, carry fines of up to $5,000 in NParks-managed parks, and up to $50,000 in nature reserves.\"The Parks and Trees Act and its regulations only extend to marine and foreshore areas that are managed or maintained by NParks.While the act does not include the intertidal area in Changi Beach, Mr Lee said NParks is \"committed to encouraging community stewardship\" of Singapore's natural habitats and biodiversity.\"As such, NParks will intensify our outreach efforts to educate the public to care for the sensitive marine life in intertidal areas,\" he said.\"More signage will be put up, and we will step up patrols by our staff and stakeholders including nature groups and other volunteers. We will raise awareness on the detrimental effects of touching, collecting or trampling on marine wildlife in their natural habitats.\"He also encouraged the public to help conserve our marine habitats by participating in NParks' Intertidal Watch citizen science programme.Should the public wish to visit intertidal zones, Mr Lee noted that they should follow safe management measures (SMMs) in line with the latest advisory for Phase 3 (Heightened Alert).\"The unusually large number of visitors was probably because the low day tides coincided with the school break over the weekend,\" he said.\"The public can refer to the NParks website for the latest advisories for gardens, parks and nature reserves in response to the COVID-19 situation.\"In response to queries on what the public should observe on intertidal walks, Kua Kay Yaw, chairman of the Marine Conservation Group at Nature Society (Singapore), told CNA that \"the best thing to do is go on intertidal walks with a nature guide\".\"Intertidal walks are definitely a healthy and enjoyable activity, and a good way for people to appreciate nature. Removal of any wildlife would deprive the next person from seeing them. Take photos as souvenirs instead,\" said Mr Kua.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "marine life,Changi Beach,marine creatures", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/nparks-changi-beach-intertidal-marine-life-15018692", "Source": "google"}