{"Type": "", "Time": "2021-06-15", "Headline": "Indonesian Olympic gold medalist shuttler Markis Kido passes at 36 - People - The Jakarta Post", "Text": "Log in with your social account                    The Jakarta Post\n                    \n            \n                        Markis Kido at a press conference in Bali in 2015. The badminton player passed away from a heart attack on June 14.  (Kompas.com/Courtesy of badmintonindonesia.org) \n                    Indonesian badminton player Markis Kido passed away at 36 on Monday night, reportedly from a heart attack while playing badminton.“One of Indonesia’s badminton heroes has passed, a gold medalist at Beijing Olympics 2008, Markis Kido,” an official release from the Indonesian Badminton Association (PBSI) said, as quoted by kompas.comHendra Setiawan, Markis’ partner during the Beijing Olympics, expressed his grief in a social media post.“I want to show my gratitude for being an incredible partner to me, during wins and losses. Thank you for partnering with me from point zero for 14 years. Thank you Kido and farewell,” Hendra said.After joining PBSI national training in 2002, Markis and Hendra were deemed one of the best pairs Indonesia had ever seen. The pair won the 2007 World Championship and the 2010 Asian Games, besides their hugely celebrated Beijing Olympics 2008 win.By the end of 2012, the two split and Markis paired with shuttler Markus Fernaldi Gideon, while Hendra paired with M. Ahsan. Markis and Gideon’s top achievement was winning the French Open 2013 and Indonesian Masters 2014. Markis also paired with his sister Pia Zebadiah Bernadet in mixed doubles tournaments and won the Vietnam Open 2012 and Thailand Open 2013.\n                                        Fatigued, unable to focus, students unsure about universities reopening soon\n                                    \n                                        Ita Martadinata: Remembering the victims of the May 1998 tragedy\n                                    \n                                        Ghosting: Is the phenomenon of shutting people out acceptable?\n                                    \n                                        'Ruqyah': The mainstream business of Islamic exorcism\n                                    © 2016 - 2021 PT. Bina Media Tenggara", "Section": "", "Writers": "", "URL": "http://www.thejakartapost.com/life/2021/06/15/indonesian-olympic-gold-medalist-shuttler-markis-kido-passes-at-36.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}