{"Type": "Singapore", "Time": "2021-06-15", "Headline": "9 new COVID-19 cases linked to Bukit Merah View market cluster; closure extended to 2 weeks", "Text": "SINGAPORE: Nine of the 14 new COVID-19 cases reported in Singapore on Tuesday (Jun 15) were linked to the Bukit Merah View Market and Food Centre cluster.This brings the total number of cases in the cluster to 25.The market, which was slated to reopen on Wednesday after being closed since Sunday, will now be shut for two weeks until Jun 26.Explaining the decision, the Ministry of Health (MOH) said that the detection of more cases among employees at the market and their close contacts suggests there is \"ongoing spread with wider transmission\".Among the nine new cases linked to the market cluster was a pre-school teacher at KidsCampus (Chai Chee). She is a family member of one of the earlier cases in the cluster, known as Case 64218. MOH said she was not quarantined as Case 64218 had not reported her as a contact.Other new cases linked to the cluster included three food stall vendors and a sales executive at Halnaz Frozen Goods, who occasionally goes to the company's shop at the market.The remaining cases linked to the market were a supervisor at Keong Hong Construction, a cleaner employed by SATS Facility Management and two retirees.UNLINKED CASESFour other cases were unlinked to previous infections.They included a foreign domestic worker from the Philippines who developed a sore throat, cough and loss of smell on Jun 14. The 41-year-old received her first dose of vaccination on May 21.A 30-year-old Singaporean woman who works as a sales representative at Imperva Singapore also tested positive. She developed a fever and runny nose on Jun 14 and sought treatment at a clinic on the same day.Another case involved a 35-year-old Singaporean man who is unemployed. He also developed symptoms of COVID-19.The remaining unlinked case was a 36-year-old Singaporean woman. The homemaker had a fever on Jun 8, followed by loss of taste and smell on Jun 10 but she did not seek treatment until Jun 14.Her family member and household contact - a 35-year-old Singaporean man who works as a senior executive at NETS - also tested positive on Jun 14. He developed symptoms the day before.No new infections were reported in migrant workers' dormitories.There were also no imported cases reported on Tuesday, the first such instance since Jun 29, 2020.NEW LOCATIONS VISITED BY COMMUNITY CASESSupermarket outlets at Clementi and Tanglin Halt Road, as well as several shopping malls, were among the new locations added to the list of public places visited by COVID-19 community cases during their infectious period.The full list of new locations is as follows:MORE CASES DISCHARGEDSeventeen more COVID-19 cases have been discharged from hospitals or community isolation facilities, taking the total recoveries to 61,911, said MOH.A total of 137 cases are still in hospital, most of whom are stable or improving, with two in critical condition in the intensive care unit. Another 233 are isolated and cared for at community facilities.As of Tuesday, Singapore has reported a total of 62,315 COVID-19 cases and 34 fatalities from the disease.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,Ministry of Health,coronavirus", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/moh-covid-19-bukit-merah-view-market-cluster-june-15-15016746", "Source": "google"}