{"Type": "", "Time": "2021-06-15", "Headline": "Razor-sharp Schick's scorcher stuns Scotland, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Scotland 0Czech Republic 2GLASGOW • Scotland's long-awaited return to a major international tournament was ruined by Patrik Schick's slick finishing as the Czech Republic won their Euro 2020 opener 2-0 at Hampden Park to move top of Group D yesterday.Schick's header just before half-time opened the scoring, but it was his stunning strike from just inside the Scottish half after the break that will live in the memory as one of the all-time great European Championship goals.After a 23-year wait to qualify for a major tournament, the hosts' hopes of making more history by getting out of the group for the first time now look slim.Steve Clarke's men face England next on Friday at Wembley before hosting 2018 World Cup finalists Croatia next Tuesday.Playing in front of fans for the first time since November 2019 with 12,000 in attendance, Scotland made a nervous start.Liverpool left-back Andy Robertson was his side's biggest threat with a series of rampaging runs without any end product.A cagey game of few chances burst into life after Schick's towering leap put the visitors in front three minutes before half-time.Scotland were slow to react after initially clearing a corner and the Bayer Leverkusen forward flicked home Vladimir Coufal's cross.45.4mPatrik Schick set the record for the farthest goal scored at the European Championship since 1980 with his 45.4m effort.After the break, Scotland were inches away from levelling when Jack Hendry's dipping effort came back off the bar before Tomas Vaclik clawed away a mishit clearance from Tomas Kalas.However, the home side were stunned by a moment of brilliance from Schick on 52 minutes as he spotted goalkeeper David Marshall off his line and bent in an incredible shot from just inside the centre circle.On the wonder strike, Schick, who could have had a treble, said it was planned and not a fluke as he had observed the Scotland No. 1's tendency to come out of his area.\"I saw him (off his line), I checked in the first half when this situation would come. I was checking where he was standing,\" he added.Beating old rivals England would make amends for the Tartan Army's disappointment, but another tournament looks to be ending in familiar fashion.Captain Robertson said: \"It's a tough lesson for us that at the highest level, at the best tournaments, you have to take your chances. The Czechs did that, we didn't.\"AGENCE FRANCE-PRESSEJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/razor-sharp-schicks-scorcher-stuns-scotland", "Source": "google"}