{"Type": "", "Time": "2021-06-15", "Headline": "Billionaire admits cheating against Anand in charity simul | chess24.com", "Text": "Try our early versions of the new Playzone before we roll them out to everyonePlay a game against a human or computer opponentFind other players, chat, and watch games in progressCompete for trophies in the ultimate multiplayer challengeSee who's on top and how you compare!Play better chess with our structured learning pathsDrill with the power of MoveTrainer™Top players share their secrets through interactive lessonsBrowse expert analysis at leisure with our chess game viewerImprove your tactical skills with puzzles adapted to your levelUse our database, engine and live training toolJoin the first ever all-in-one chess coaching & learning platformKeep up to date with all that's going on in the chess worldTell your stories or join the debate in the area where you set the agenda!Browse expert analysis at leisure with our chess game viewerWho's who in chess? Bios, ratings, games and moreAn A-Z guide to all the chess terms you need to knowLive broadcasts from top eventsWatch live & on demandTop players share their secrets through interactive lessonsTop players share their secrets through interactive lessonsBrowse expert analysis at leisure with our chess game viewerGet more features, get more chessPurchase a voucher codechess24 T-shirts, hoodies, mugs and more!Perfect for a chess fanIndia’s youngest billionaire Nikhil Kamath blundered a pawn on move 1 but then went on to crush 5-time World Chess Champion Vishy Anand in a “Checkmate COVID” charity simul. Nikhil said afterwards that he just got lucky, while the World Champion politely noted, “Today was not the chess of people who just know how the pieces move”. Outrage followed, with Nikhil eventually admitting computer and other help, though his apology implied Vishy was aware his opponent was going to have assistance. The Indian legend made it clear he wasn’t.\r\n\r\nSamay Raina and Tania Sachdev talked to Vishy Anand, Nikhil Kamath and the other players after the games | image: Chesscom India/YouTubeIn what should have been a purely positive event, the Akshaya Patra Foundation and Chesscom India held a Checkmate COVID event with Vishy Anand, where the 15th World Chess Champion played a simultaneous, live-streamed simul against five players. Although Nikhil Kamath, a 34-year-old billionaire who co-founded brokerage firm Zerodha, is sometimes described as a “chess champion”, his opening move, meeting 1.Nf3 with 1…e5?, blundered a key pawn and suggested otherwise.\r\n\r\n From there on, however, Nikhil started to play like a chess god, until he’d actually beaten one of the greatest players of all time.\r\n\r\n1. ♘f3\n e5\n 2. ♘xe5\n d6\n 3. ♘f3\n ♘c6\n 4. d4\n ♘f6\n 5. d5\n ♘e5\n 6. ♘c3\n ♗e7\n 7. e4\n O-O\n 8. ♗e2\n c6\n 9. O-O\n cxd5\n 10. exd5\n a6\n 11. ♖e1\n b5\n 12. a3\n h6\n 13. ♘d4\n ♗d7\n 14. ♗f4\n ♖c8\n 15. ♗f3\n ♕b6\n 16. ♗xe5\n dxe5\n 17. ♘c6\n ♗c5\n 18. ♕e2\n ♖fe8\n 19. ♘xe5\n ♖xe5\n 20. ♕xe5\n ♗xf2+\n 21. ♔f1\n ♗xe1\n 22. ♕xe1\n b4\n 23. axb4\n ♕xb4\n 24. ♖a2\n ♗b5+\n 25. ♘e2\n ♕d6\n 26. ♔g1\n ♖xc2\n 27. ♘c3\n ♗d7!\n 28. ♕e3\n ♗g4\n 29. ♗xg4\n ♘xg4\n 30. ♕e8+\n ♔h7\n 31. ♕e4+\n g6\n 32. ♕xg4\n ♕c5+\n 33. ♔h1\n ♖c1+\n 34. ♘d1\n ♕xd5\n 0-1\nIt didn’t take any deep forensic analysis to know that Nikhil had cheated - it was enough to look, for instance, at the final brilliancy, where Nikhil sacrificed a knight on g4.\r\n\r\nNikhil wrapped up the game with 32…Qc5+! 33.Kh1 Rc1+ 34.Nd1 Qxd5!, hitting the rook on a2 as well as the pinned knight.\r\n\r\nA well-known way to beat cheats online is to “flag them” on the clock, since using a computer to make moves costs time and they often don't have the basic skills to simply blitz out the moves in a won position. Vishy could easily have done that here, but understandably, in a charity simultaneous event with nothing at stake, he simply resigned and allowed his opponent his moment of glory, or rather, infamy.Afterwards Nikhil in no way admitted what he’d done and just talked about luck. Vishy was diplomatic, but his, “today was not the chess of people who just know how the pieces move”, was something more than the usual politeness after playing against amateur players.\r\n\r\nThe reaction online was fast.\r\n\r\n  Nikhil Kamath’s account was banned and finally he decided it was time to confess, though his admission of cheating was in the worst traditions of apologies/non-apologies.\r\n\r\n He implied that no-one would have treated the game seriously and apologised for causing “confusion” rather than for cheating itself. He even implied Vishy Anand would take playing a game against a chess engine as “a learning experience”.\r\n\r\nI had help from the people analyzing the game, computers and the graciousness of Anand sir himself to treat the game as a learning experience. This was for fun and charity. In hindsight, it was quite silly as I didn’t realise all the confusion that can get caused due to this. Apologies…Vishy Anand made it very clear he expected everyone to play ethically and in no way condoned what Nikhil had done.\r\n\r\n It’s fair to say no-one was impressed by Nikhil’s “apology”.\r\n\r\n      All in all, it’s one of the strangest cases of online cheating we’ve ever witnessed, but perhaps some good will come of it if it once again helps to publicise just how unacceptable cheating by using a chess engine during a game is. No other celebrity is likely to come up with such a brilliant idea to make themselves look smart again in a hurry!\r\n\r\nBe the first to comment!By clicking ‘Register’ you agree to our terms and conditions and confirm you have read our privacy policy, including the section on the use of cookies.Forgotten your password? No problem! You can reset your password hereAfter submitting this form you'll receive an email with the reset password link. If you still can't access your account please contact our customer service.We respect your privacy and data protection guidelines. Some components of our site require cookies or local storage that handles personal information.Show OptionsHide OptionsLearn more about the details...\n                    Using chess24 requires the storage of some personal data, as set out below. You can find additional information in our Cookie Policy, Privacy Policy, Disclaimer and Terms of Website Use. Please note that your data settings can be changed at any time by clicking on the Data Settings link in the footer at the bottom of our website.                Back...", "Section": "", "Writers": "", "URL": "https://chess24.com/en/read/news/billionaire-admits-cheating-against-anand-in-charity-simul", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}