{"Type": "", "Time": "2021-06-15", "Headline": "UEFA in hot water as Eriksen's horror collapse raises more questions - CGTN", "Text": " Share CopiedTeammates run to Denmark's Christian Eriksen, who collapsed on the pitch during their Euro 2020 clash with Finland at Parken Stadium in Copenhagen, Denmark, June 12, 2021. /CFPWhen Danish star Christian Eriksen fell face first to the ground just before halftime during their Euro 2020 opener against Finland on Saturday, an eerie silence descended on Copenhagen's Parken Stadium.  The whole footballing world was holding its breath. There was reason to fear the worst as medics attempted to resuscitate Eriksen by performing CPR on the 29-year-old on the pitch. His teammates, who were visibly distressed, formed a protective shield around him as the life-saving treatment was screened live. While Eriksen was later revealed to be brought back from death and stable in the nearest hospital, the game restarted after a 90-minute delay and the Finns earned a shocking 1-0 win.  UEFA clarified in a statement that the decision to continue was made \"following the request made by players of both teams,\" but Denmark's players begged to differ. Teammates form a protective shield around Christian Eriksen (hidden) during their Euro 2020 clash with Finland at Parken Stadium in Copenhagen, June 12, 2021. /CFPDuring a press conference on Monday, they expressed dissatisfaction at the position the whole team was put in after Eriksen's collapse when they met the media for the first time since the match against Finland. \"We had two choices from UEFA, to go out and play the match immediately or play the next day at noon,\" declared Denmark striker Martin Braithwaite. \"None of those choices were good. We took the lesser of two evils to finish the match. Many of the players were not in a condition to play this match.\" \"Had we wished there was a third option because you don't want to go and play football in that way, but UEFA says we had two options â play immediately or the following day at noon. Those were the options we had,\" he added. The sentiment was echoed by Denmark goalkeeper Kasper Schmeichel. \"We were put in a spot I don't think we should have been put in,\" he said. \"It probably required that someone above us had said that it was not the time to make a decision and maybe should wait for the next day.\" People leave well wishes at a graffiti for Danish player Christian Eriksen on a wall at the fanzone in Copenhagen, Denmark, June 14, 2021. /CFPLater on Monday, the governing body defended itself from claims that Denmark players were put under pressure to play. \"UEFA is sure it treated the matter with utmost respect for the sensitive situation and for the players,\" read a statement. \"It was decided to restart the match only after the two teams requested to finish the game on the same evening.\" Jonas Baer-Hoffman, general secretary of international players' union FIFPRO, was not impressed. He insisted the decision to resume the match should not have been made in the immediate aftermath of the incident. \"It would have been better to cancel the game in that evening. Take a bit of time, take a breath, look at it with a bit more distance, look at what are the options to carry on with the game or not, and if the game can't be replayed then I think also that would not be very important in comparison to what happened there to Christian,\" Baer-Hoffman was quoted as saying by ESPN. \"The players were probably not given a real option in terms of taking a good decision that was in that moment in balance with where they were mentally,\" he observed. \"There's a lot of lessons that need to be drawn from this,\" he said, adding that they would be conducting a review with UEFA.Netherlands fans hold a message of support for Christian Eriksen prior to their Euro 2020 opener against Ukraine at the Johan Cruijff ArenA in Amsterdam, the Netherlands, June 13, 2021. /CFPNetherlands' defender Daley Blind admitted that he considered withdrawing from their Euro 2020 opener after seeing his friend Eriksen collapse. He eventually decided to take to the field and broke down in tears after being substituted midway through the second half of the 3-2 win over Ukraine on Sunday. \"I definitely thought about not taking part. The images on television and the incident had a big impact and I didn't sleep very well because of them. I really had to overcome a big hurdle to do this,\" Blind was quoted as saying by Sky Sports. \"I had to persuade myself to play but I'm proud that I did and that's why my emotion came bursting out at the end of the game.\" Denmark's team doctor Morten Boesen confirmed on Sunday Eriksen had suffered a cardiac arrest. \"He was gone, and we did cardiac resuscitation,\" Boesen told a press conference. \"How close were we? I don't know. We got him back after one defib (defibrillation), so that's quite fast,\" he added. Meanwhile, Martin Schoots, the agent of Eriksen, told Italian newspaper Gazzetta dello Sport on Monday that his client is in \"good spirits\" and had been lifted by \"all the love around him.\" \"Half the planet has been in touch with us, everyone is worried. Now, he must simply rest. His wife and parents are with him,\" said Schoots before adding Eriksen would remain under observation in hospital until at least Tuesday.It remains unclear whether Christian Eriksen would continue his football career. /CFPFormer English footballer Fabrice Muamba, who also collapsed on the pitch in an FA Cup match in 2012 due to cardiac arrest, was more concerned about Eriksen's future. \"It's too early to know about his physical health, but I can share something of the mental battle which, in many ways, is the toughest part of the journey ahead,\" Muamba told The Times. \"My advice is to take a step back and take all the time he needs because it will definitely affect him mentally, and his family.That worry plays in your head, whatever the doctors tell you. It's not easy to get over.\"Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3", "Section": "", "Writers": "", "URL": "https://news.cgtn.com/news/2021-06-15/UEFA-in-hot-water-as-Eriksen-s-horror-collapse-raises-more-questions-116JEhVx8SA/index.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}