{"Type": "", "Time": "2021-06-15", "Headline": "Cases surged 50% in past week | The Star", "Text": "\n                    Tuesday, 15 Jun 2021\n                Towards immunity: People walking from a waiting area to receive the Sinovac vaccine during a mass inoculation exercise for the public at the Patriot Candrabhaga Stadium in Bekasi on the outskirts of Jakarta. — APJAKARTA governor Anies Baswedan has warned that the Indonesian capital may return to a strict restriction regime as coronavirus cases surged 50% in the past week amid a rise of infections of the Delta variant.Active cases in Jakarta rose to 17, 400 cases on Sunday from 11, 500 on June 6.“The capital is in a state that needs extra attention. If the current situation gets out of hand, we would enter an emergency phase, and if that happened, we would have to take drastic steps like we did in September and February.“We do not want that to recur, ” Anies said in a statement yesterday morning.The Delta variant, first detected in India, has started to dominate cases in Indonesian cities, including Jakarta and Kudus in Central Java province, a senior government official, who did not want to be named, told The Straits Times on Sunday night.Health Ministry spokesman Siti Nadia Tarmizi told ST that the genome sequencing tests on 34 samples collected from Kudus showed that 28 of them were of the Delta variant. She did not elaborate.Bed occupancy rate for isolation wards reserved to treat Covid-19 patients also increased to 75% on Sunday, from 45% a week ago.On track: People lining up on the track at for their shots. — APOne out of four Covid-19 patients in Jakarta, however comes from outside the city, mostly the surrounding satellite towns.Anies urged residents to strictly comply with health protocols in order to avoid another round of strict social distancing restrictions.Currently, dining-in in eateries is allowed with limited capacity, and non-essential staff are partially required to work from home.The governor also stressed that the positivity rate in Jakarta increased to 17% on Sunday, from 9% the previous week.The positivity rate indicates the percentage of positive Covid-19 cases detected out of the total tests conducted.The threshold set by the World Health Organisation (WHO) for adequate testing is a 5 per cent positivity rate.Anies pointed out that the testing rate in Jakarta rose to eight times what the World Health Organisation recommended, from four times in the previous week.He ordered all his personnel on Sunday night to take stricter measures and to step up enforcement of the health protocols on individuals as well as in places. — The Straits Times/ANN\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/15/cases-surged-50-in-past-week", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}