{"Type": "", "Time": "2021-06-15", "Headline": "China’s ‘Bat Woman’ virologist speaks out over Covid lab leak theory | The Independent", "Text": "Shi Zhengli calls claims that Covid-19 came from her Wuhan facility ‘filth on an innocent scientist’Find your bookmarks in your Independent Premium section, under my profileChinese virologist Shi Zhengli is seen inside the P4 laboratory in Wuhan, capital of China’s Hubei province, on 23 February, 2017. Dr Shi has dismissed questions around whether Covid-19 may have originated in her lab as ‘filth’. A top Chinese virologist facing scrutiny amid theories the Covid pandemic could have originated in her lab has dismissed the concerns as “filth” being poured on an “innocent scientist”.In the midst of the coronavirus pandemic, Shi Zhengli, a scientist at the Wuhan Institute of Virology (WIV), has been praised for helping her country curb the spread of the virus, while also being at the centre of swirling conspiracy theories over its origins. Addressing the claims, the virologist, who has been dubbed “bat woman” by some, told The New York Times there was “no evidence” to support the allegations against her lab. “How on earth can I offer up evidence for something where there is no evidence?” she said. In a text message, she also reportedly wrote: “I don’t know how the world has come to this, constantly pouring filth on an innocent scientist.”The idea that Covid-19 could have escaped from a lab has long been dismissed by members of the scientific community, while others have derided such theories due to their connection with former President Donald Trump.However, calls from his successor, President Joe Biden, for a transparent investigation into the origins of Covid-19 have brought the theory back under the spotlight. And with World Health Organization (WHO) director-general Tedros Adhanom Ghebreyesus saying during a G7 briefing on the pandemic that “every hypothesis should be open” in the bid to understand the origins of Covid-19, it seems all lines of inquiry are on the table. Scientists still generally appear to agree that there is no clear evidence to support the possibility of a lab leak leading to the spread of Covid-19. However, calls for a thorough and transparent investigation have been backed by members of the scientific community, particularly in the wake of reports citing American intelligence of several employees of the WIV falling ill as the pandemic began to take root. Dr Shi has denied that several of her colleagues were ill before the outbreak’s emergence, according to The Times. The Chinese government has also not given any indication that Dr Shi’s lab is under any degree of suspicion in connection with the coronavirus outbreak. The virologist has been able to continue her work and give lectures in the country. In a recent letter in the journal Science, 18 scientists called for a transparent investigation to look into all possible scenarios, including the possibility of a lab leak. The letter also stresses the importance of a “dispassionate science-based discourse” on the origins of the Covid-19 pandemic, with researchers noting the rise of “anti-Asian sentiment in some countries” in the midst of the pandemic. “In this time of unfortunate anti-Asian sentiment in some countries, we note that at the beginning of the pandemic, it was Chinese doctors, scientists, journalists, and citizens who shared with the world crucial information about the spread of the virus – often at great personal cost,” the letter states.“We should show the same determination in promoting a dispassionate science-based discourse on this difficult but important issue,” researchers write.Speaking with the Times, David Relman a microbiologist at Stanford University who co-authored the letter, said: “This has nothing to do with fault or guilt.”“It’s just bigger than any one scientist or institute or any one country – anybody anywhere who has data of this sort needs to put it out there,” he said.Join thought-provoking conversations, follow other Independent readers and see their repliesChinese virologist Shi Zhengli is seen inside the P4 laboratory in Wuhan, capital of China’s Hubei province, on 23 February, 2017. Dr Shi has dismissed questions around whether Covid-19 may have originated in her lab as ‘filth’. AFP via Getty ImagesWant to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.Log inNew to The Independent?Want an ad-free experience?Subscribe to Independent Premium.", "Section": "", "Writers": "", "URL": "https://www.independent.co.uk/asia/china/covid-wuhan-lab-leak-china-b1865627.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}