{"Type": "", "Time": "2021-06-15", "Headline": "People Digest: HQ Capital MD steps down; Endowus gets chief advisory officer", "Text": "Photo: Internet Archive/ IllustrationBy Quynh NguyenJune 15, 2021Private equity firm HQ Capital managing director in Hong Kong Lucian Wu has stepped down from his role after a seven-year stint. In a separate development, Singapore-based wealth management platform Endowus has appointed banking veteran Wei Mei Tan as its chief advisory officer.Private equity firm HQ Capital managing director in Hong Kong Lucian Wu has stepped down from his role after a seven-year stint, AVCJ reported.HQ Capital is a part of the Germany-based HQ Group. Wu joined HQ Capital in 2014 with 32 years of experience in the finance sector, according to the investment firm’s website.In this role, he led HQ Capital PE’s secondary market activities in Asia. He has participated in secondary transactions representing over $500 million in total deal volume.Prior to HQ Capital, Wu had stints at Paul Capital, Henderson Private Capital, Jardine Fleming and Electra Partners Asia, according to Informaconnect.During that time, he successfully deployed and harvested capital across multiple market cycles, geographies, direct and secondary investment strategies.HQ Capital was formed in 2015 by combining independent alternative investment managers Auda, Real Estate Capital Partners and Equita. Through Auda and Real Estate Capital Partners, HQ Capital has been active in global private equity and in US real estate since 1989.Last year, HQ Capital held the final close of its eighth fund-of-funds, raising $750 million in committed capital. The Auda Capital VIII (ACAP VIII) surpassed its original target of $600 million, becoming HQ Capital’s largest global platform fund, the firm said in a statement.Singapore-based wealth management platform Endowus has appointed banking veteran Wei Mei Tan as its chief advisory officer.In this role, Tan, who brings with her over 20 years of financial market experience, will help drive strategic initiatives as well as build portfolio strategies and fund selections, according to a report by Tech In Asia.This appointment comes after the wealth management platform raised $17 million in a Series A funding round led by Lightspeed Venture Partners and SoftBank Ventures Asia in March.Before joining Endowus, Tan was in senior leadership roles at Credit Suisse and UBS Wealth Management. She also served as global co-head of advisory and investment solutions at Deutsche Bank.Founded in 2018, Endowus is led by Samuel Rhee, You Ning Sun and Gregory Van, former investment bankers and fund managers from Morgan Stanley Asset Management, Goldman Sachs, UBS and others.The firm bills itself as Singapore’s first and only Central Provident Fund (CPF) digital advisor, allowing users to invest their CPF and Supplementary Retirement Scheme (SRS) money, as well as cash.CPF and SRS are compulsory retirement savings schemes mandated by the Singapore Government for future retirement purposes for Singaporean citizens and permanent residents (PRs).endowus HQ Capital Private Equity\n                                                ACAP VIII surpassed its original target of $600 million. \n                                                People\n                                                OYO Hotels and Homes has appointed Alfian Lim as its new country head for Indonesia. \n                                                Already have an account? Sign in here\n0\nYou have one free story left this month.\nYou have 0 free stories left this month.\nThis is your last free story of the month.\nRegister to continue reading our free content.\n© Copyright DEALSTREETASIA 2014-2021 All rights reserved.Forgot your password?We will never share your information with third parties.If you don’t already have an account click the button below to create your account.OR\n                            Unlock your competitive advantage in a\n                            rapidly evolving landscape. Our packages\n                            come with exclusive access to archive\n                            content, data, discount on summit tickets & more.\n                            Be a part of our growing community now.\n                        In Singapore, we are looking to double our reporting team by this year-end to comprehensively cover the fast-moving world of funded startups and VC, PE & M&A deals. We want reporters who can tell our readers what is really happening in these sectors and why it matters to markets, companies and consumers. The ability to write precisely and urgently is crucial for these roles. Ideal candidates must have to ability to work in a collaborative, dynamic, and fast-changing environment. We want our new hires to be digitally savvy and ready to experiment with new forms of storytelling. Most importantly, we are looking for hard-hitting reporters who work well in a team. Collaboration and collegiality are a must.Following vacancies can be applied for (only in Singapore).Following vacancies can be applied for (only in Singapore).   In Singapore, we are looking to double our reporting team by this year-end to comprehensively cover the fast-moving world of funded startups and VC, PE & M&A deals. We want reporters who can tell our readers what is really happening in these sectors and why it matters to markets, companies and consumers. The ability to write precisely and urgently is crucial for these roles. Ideal candidates must have to ability to work in a collaborative, dynamic, and fast-changing environment. We want our new hires to be digitally savvy and ready to experiment with new forms of storytelling. Most importantly, we are looking for hard-hitting reporters who work well in a team. Collaboration and collegiality are a must.Following vacancies can be applied for (only in Singapore).Following vacancies can be applied for (only in Singapore).   ", "Section": "", "Writers": "", "URL": "https://www.dealstreetasia.com/stories/hq-capital-endowus-246041/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}