{"Type": "", "Time": "2021-06-15", "Headline": "Joe Biden, NATO call on Vladimir Putin to stop 'aggressive military activities'; China declared as security challenge-World News , Firstpost", "Text": "\n                        The US president is on an eight-day visit to Europe in which he is seeking to rally allies to speak with a single voice on countering Russia and China\n                    \n                            President Joe Biden at the White House in Washington. Image credit: AP Photo/Evan Vucci\n                        Brussels: President Joe Biden used his first appearance at a NATO summit since taking office to call on Russian President Vladimir Putin to step back from provocative actions targeting the U.S. and its allies on Monday. NATO leaders joined the United States in formally accusing Moscow and Beijing of malign actions.Biden's sharp words for Russia and his friendly interactions with NATO allies marked a sharp shift in tone from the past four years and highlighted the renewed U.S. commitment to the 30-country alliance that was frequently maligned by predecessor Donald Trump.Biden, wearing a NATO lapel pin, said that in his extensive talks with NATO leaders about his planned meeting with Putin on Wednesday, all were supportive of his plans to press the Russian leader to halt Russian-originated cyber attacks against the West, end the violent stifling of political dissidents and stop interfering in elections outside its borders.“I’m going to make clear to President Putin that there are areas where we can cooperate, if he chooses,\" Biden told reporters as he ended his day at NATO headquarters. “And if he chooses not to cooperate and acts in a way that he has in the past relative to cybersecurity and other activities, then we will respond, we will respond in kind.\"Biden is on an eight-day visit to Europe in which he is seeking to rally allies to speak with a single voice on countering Russia and China.To that end, NATO leaders on Monday declared China a constant security challenge and said the Chinese are working to undermine global order, a message in sync with Biden’s pleas to confront Beijing on China’s trade, military and human rights practices.In a summit statement, the leaders said that China’s goals and “assertive behavior present systemic challenges to the rules-based international order and to areas relevant to alliance security.”The heads of state and government expressed concern about what they said were China's “coercive policies,” the opaque ways it is modernizing its armed forces and its use of disinformation.The NATO leaders also took a big swipe at Russia in their communique, deploring what they consider its aggressive military activities and its snap wargames near the borders of NATO countries as well as repeated violations of their airspace by Russian planes.They said that Russia had ramped up “hybrid” actions against member countries by attempts to interfere in elections, by political and economic intimidation, by disinformation campaigns and “malicious cyber activities.”“Until Russia demonstrates compliance with international law and its international obligations and responsibilities, there can be no return to ’business as usual,'” they said.The North Atlantic Treaty Organization is an alliance of European and North American countries formed after World War II as a bulwark against Russian aggression. The new Brussels communique states plainly that the NATO nations “will engage China with a view to defending the security interests of the alliance.”Biden arrived at the NATO summit after three days of consulting with Group of Seven allies in England, where he successfully pushed for a G-7 communique that called out forced labor practices and other human rights violations impacting Uyghur Muslims and other ethnic minorities in China's western Xinjiang province.However, differences remain among the allies about how forcefully to criticize Beijing.German Chancellor Angela Merkel said NATO’s decision to name China as a threat “shouldn’t be overstated” because Beijing, like Russia, is also a partner in some areas. China is Germany's top trading partner, and she said it is important to “find the right balance.”France's President Emmanuel Macron urged the alliance not to let China distract it from what he saw as more pressing issues facing NATO, including the fight against terrorism and security issues related to Russia.“I think it is very important not to scatter our efforts and not to have biases in our relation to China,\" Macron said.The Chinese Embassy to the United Kingdom on Monday issued a statement saying the G-7 communique “deliberately slandered China and arbitrarily interfered in China’s internal affairs.\" There was no immediate reaction from the Chinese government to the new NATO statement.Biden arrived at his first NATO summit as president as leading members declared it a pivotal moment for an alliance beleaguered during the presidency of Trump, who questioned the relevance of the multilateral organization.Biden sat down with NATO Secretary General Jens Stoltenberg and underscored the U.S. commitment to Article 5 of the alliance charter, which spells out that an attack on any member is an attack on all and is to be met with a collective response.“Article 5 we take as a sacred obligation,” said Biden. “I want NATO to know America is there.”It was a marked contrast to the days when Trump called the alliance “obsolete\" and complained that it allowed for “global freeloading” countries to spend less on military defense at the expense of the U.S.Biden was greeted by fellow leaders with warmth and even a bit of relief.Belgian Prime Minister Alexander de Croo said Biden’s presence “emphasizes the renewal of the transatlantic partnership.\" De Croo said NATO allies were looking to get beyond four stormy years with Trump and infighting among member countries.“I think now we are ready to turn the page,\" de Croo said.The alliance also updated Article 5 to offer greater clarity on how the alliance should react to major cyber attacks — a matter of growing concern amid hacks targeting the U.S. government and businesses around the globe by Russia-based hackers.Beyond extending potential use of the mutual defense clause to apply to space, the leaders also broadened the definition of what might constitute such an attack in cyberspace, in a warning to any adversary that might use constant low-level attacks as a tactic.The organization declared in 2014 that a cyber attack could be met by a collective response by all 30 member countries, and on Monday they said that “the impact of significant malicious cumulative cyber activities might, in certain circumstances, be considered as amounting to an armed attack.”The president started his day meeting with leaders of the Baltic states on NATO's eastern flank as well as separate meetings with leaders of Poland and Romania to discuss any threat posed by Russia and the recent air piracy in Belarus.Biden also met with Turkey's President Recep Tayyip Erdogan, on the summit sidelines.Biden has known Erdogan for years, but their relationship has frequently been contentious. Biden, during his campaign, drew ire from Turkish officials when he described Erdogan as an “autocrat.\" In April, Biden infuriated Ankara by declaring that the Ottoman-era mass killing and deportations of Armenians was “genocide\" — a term that U.S. presidents have avoided using.\n                Updated Date:\n                \n                    June 15, 2021 14:18:33 IST\n                \n\n                        TAGS:\n                    \n                Trump targeted TikTok over the summer of 2020 with a series of orders that cited concerns over the US data that TikTok collects from its users\n            \n                President Joe Biden's administration has declined for months to present its position on a possible boycott.\n\n\n            \n                Former president Donald Trump had issued a list of 31 Chinese companies that were deemed to be supplying or supporting China's military and security apparatus\n            Sign up for a weekly curated briefing of the most important strategic affairs stories from across the world.FirstpostSectionPlusToolsAppsNetwork18 sites Copyright © 2021. Firstpost - All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.firstpost.com/world/joe-biden-nato-call-on-vladimir-putin-to-stop-aggressive-military-activities-china-declared-as-security-challenge-9718121.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}