{"Type": "", "Time": "2021-06-15", "Headline": "Operator says China nuclear plant facing 'performance issue'", "Text": "HONG KONG (AP) — The French joint operator of a Chinese nuclear plant near Hong Kong said Monday that the plant is dealing with a “performance issue” but is currently operating within safety limits, following a report of a potential radioactive leak.The Taishan Nuclear Power Plant is jointly owned by China Guangdong Nuclear Power Group and French multinational electric utility Électricité de France, the main owner of Framotome, which helps operate the plant.“Framatome is supporting resolution of a performance issue with the Taishan Nuclear Power Plant in Guangdong province, China,” Framatome said in a short statement Monday.“According to the data available, the plant is operating within the safety parameters,” it said. “Our team is working with relevant experts to assess the situation and propose solutions to address any potential issue.”Radiation levels in Hong Kong, 135 kilometers (85 miles) from the Taishan plant, were normal on Monday, according to the Hong Kong Observatory, which monitors radiation around the city.CNN reported Monday that Framotome had written to the U.S. Department of Energy warning of an “imminent radiological threat” and accusing Chinese authorities of raising acceptable limits for radiation outside the plant to avoid having to shut it down. CNN said U.S. officials believed the current situation at the plant did not present a severe safety threat.Électricité de France said in a statement Monday that it had been informed of the increase in concentration of “certain rare gases” in the primary circuit of reactor No. 1 at the Taishan plant.“The presence of certain rare gases in the primary circuit is a known phenomenon, studied and foreseen by the operating procedures of the reactors,” it said.The utility said it is providing its expertise and has requested that the joint venture company that runs the plant hold a meeting of its board of directors so that management “presents all the data and the necessary decisions.”Chinese authorities in Beijing and Guangdong did not immediately respond to attempts to seek comment on Monday, a public holiday.The plant issued a statement on Sunday saying “At present, continuous monitoring of environmental data shows that the environmental indicators of Taishan Nuclear Power Plant and its surroundings are normal.”It did not refer to any problems, and said “All operating indicators of the two units have met the requirements of nuclear safety regulations and power plant technical specifications.”The United Nation’s nuclear watchdog, the International Atomic Energy Agency, told The Associated Press that it was aware of the media reports and was in contact with its counterpart in China.“At this stage, the agency has no indication that a radiological incident occurred,” the Vienna-based IAEA said in a written response to questions.The agency said it would share more information when it became available.The two reactors entered commercial operation in December 2018 and September 2019, the local city government said on its website. They are the first of a new type called European Pressurized Reactors to become operational in the world. Construction began earlier on two other EPRs in Finland and France, but they continue to face costly delays.___Associated Press writer Angela Charlton in Paris contributed to this report.The Ministry of Health (MOH) on Tuesday (15 June) confirmed 14 new COVID-19 cases in Singapore, taking the country's total case count to 62,315.A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.Search for private jet membership. The affordable price makes these private jet offers hard to resistIn a room warmed by an open wood stove, Baima says her family converted their white-brick house into a hotel as China's Communist leadership ushers tens of millions of tourists to the politically sensitive region of Tibet.The soon-to-be-completed Nord Stream 2 pipeline, set to double natural gas supplies from Russia to Germany, has long divided European capitals and fuelled tensions with Washington.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.Purchases of new private units in Singapore declined about 30% to 891 in May from 1,268 in April, Urban Redevelopment Authority figures showed.The Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.The Copa America that almost never was opened Sunday in Brazil, overshadowed by the desperate search for a last-minute host, sponsor withdrawals and Covid-19 -- including outbreaks on three teams.Research best security system. Protect yourself and your home with wireless alarm systems.US President Joe Biden arrived Sunday in Brussels for two days of summits with leaders from the NATO military alliance and the European Union.With its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Dickson Yeo, the Singaporean man who was jailed in the US for spying for China and was arrested by the Internal Security Department upon his return to Singapore in December will be continue to be detained under the Internal Security Act.New research has identified TEN favorite stocks for the upcoming yearThe WHO warned Monday that Covid-19 was moving faster than the vaccines, and said the G7's vow to share a billion doses with poorer nations was simply not enough.Reigning champions Portugal begin their defence of the trophy against Hungary at Euro 2020 in Budapest on Tuesday as World Cup holders France take on Germany in a hotly-anticipated clash between two of the continent's heavyweights.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Asset sales in a liquidation process at Hyflux Ltd., Singapore’s highest-profile distressed company, would likely bring in less than S$200 million, a person familiar with the matter said, a fraction of the amount creditors are claiming.An ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the challenges posed by its policies.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Here are three growing businesses that should be cheap enough to add to your investment watchlist. The post 3 Undervalued Gems That You Can Add to Your Watchlist appeared first on The Smart Investor.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/operator-says-china-nuclear-plant-100648132.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}