{"Type": "", "Time": "2021-06-15", "Headline": "Two teens get electric shock from lamp post in Lorong 5 Toa Payoh while retrieving football", "Text": "Tay Hong YiThe Straits TimesJune 14, 2021Two teenagers received an electric shock from a lamp post in Lorong 5 Toa Payoh on Sunday (June 13).The incident occurred at about 8.25pm, when the pair attempted to retrieve a football from the fitness corner in front of Block 63.Quoting a resident, Shin Min Daily News said the youngsters, who are in their early teens, were playing football next to the playground near the fitness corner.One of them received a shock from the lamp post, and the other received one while attempting to save the first teen. The father of one of the teens also helped, and emerged unscathed.Bishan-Toa Payoh Town Council, which manages the estate, told The Straits Times it was informed by its essential maintenance services unit about the incident, adding that investigations were ongoing.No such incidents were previously reported in the estate.The lamp post in Lorong 5 was last checked by a licensed electrical worker earlier this year, with the next inspection due in July, said the town council.\"The town council is currently carrying out an investigation into the cause of the electric shock,\" it added in response to queries from ST.It said six-monthly inspections are carried out to ensure electrical installations are safe.\"Town council officers also carry out monthly visual inspections to ensure that outdoor fittings are properly in place and will follow up with defect rectification where required.\" The lamp post in Lorong 5 was last checked by a licensed electrical worker earlier this year, with the next inspection due in July. PHOTO: SHIN MIN DAILY NEWSThe Singapore Civil Defence Force (SCDF) told ST that it received a call for assistance at 8.25pm on Sunday at Block 63 Toa Payoh Lorong 5.Two people were sent to KK Women's and Children's Hospital, the SCDF added.One of them was subsequently discharged, and the other was initially warded in the intensive care unit, before moving to a regular ward on Monday afternoon.Get a copy of The Straits Times or go to straitstimes.com for more stories.Get more of Stomp's latest updates by following us on Facebook, WhatsApp, Twitter, Instagram and YouTube.View the discussion thread.View the discussion thread.Download the new STOMP app today.SPH Digital News | The Straits TimesAll rights reserved | Terms & Conditions | Data Protection Policy | Advertise with usSPH Digital News / STOMP / Copyright (c) 2019 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E.", "Section": "", "Writers": "", "URL": "https://stomp.straitstimes.com/singapore-seen/two-teens-get-electric-shock-from-lamp-post-in-lorong-5-toa-payoh-while-retrieving", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}