{"Type": "", "Time": "2021-06-15", "Headline": "Opinion | Biden has an opportunity to begin rebuilding the U.S.’s fractured relationship with Russia - The Washington Post", "Text": "As President Biden and Russian President Vladimir Putin meet in Geneva for their first in-person summit of Biden’s presidency, they’ll have an opportunity to reverse a dangerous and in many ways unprecedented deterioration in relations between the two countries — and begin to set a new course.Relations between the United States and Russia have reached a particularly perilous moment. The administration recently imposed new sanctions on the Russian economy and expelled 10 Russian diplomats in response to the country’s alleged election interference efforts — further straining our relationship. Russia in turn expelled 10 U.S. diplomats from the country, threatened to take “painful measures” against U.S. businesses in the future, and announced a forthcoming ban on the United States hiring Russian nationals. To make the diplomatic dysfunction worse, the last two U.S. consulates in Russia were recently closed — leaving all consular services to be handled by the overwhelmed, understaffed embassy, which has slowed visa processing to a crawl. It’s now been months since an ambassador from either country has been present in the other. In contrast, ambassadors remained in place during even some of the Cold War’s most dangerous moments, such as the Cuban missile crisis. Those diplomatic channels were crucial to prevent any further escalation of tensions, and no doubt saved lives.It’s hard to overstate the dire global implications if the relationship between the United States and Russia continues to worsen. Former  defense secretary William Perry has said that in recent years, the chance of a major nuclear disaster has become even higher than during the Cold War — and cold wars fuel the military-industrial-congressional complex, empower war parties and hard-liners, and can virtually obliterate the space for dissenting views.But international partnership isn’t just valuable for the sake of preventing war. A lack of cooperation can also obstruct opportunities to address existing global crises — and the consequences can be existential.The covid-19 crisis has demonstrated the necessity of international collaboration to tackle global challenges. Curbing the threat of climate change is an even more daunting and complex battle. When the biggest world powers aren’t working together to protect humanity’s universal interests, the entire planet suffers.Fortunately, this summit gives the United States and Russia the chance to ease tensions and begin working to rebuild their deeply fractured relationship. As my fellow board members and I outlined in a recent open letter from the American Committee for U.S.-Russia Accord, a few important steps can and should be taken immediately.First, the minimum: The Biden administration should reopen the consulates in Russia and resume visa processing at full capacity. The United States cannot hope to meaningfully improve its relationship with Russia without reinstituting basic consular services. The ability for people from both countries to travel to the other is essential, both for encouraging peaceful ties between our peoples and for opening the door for democratizing collaboration between our scientists, students, artists and academics.Second, a crucial and meaningful proclamation: Biden should ask Putin to join him in reiterating the principle that “a nuclear war cannot be won and must never be fought,” which President Ronald Reagan and Soviet President Mikhail Gorbachev agreed upon at their 1985 meeting in Geneva. Just as it did 36 years ago at another moment of dangerously high tensions, such a statement would be a simple yet powerful way to ease fears around the world about further escalation between our two countries.Third, the United States needs a deeper shift in our approach to engaging the world. We should recognize we are not the “indispensable nation” and dispense with this obsolete, triumphalist national security paradigm. The new administration would be wise to focus on getting our own house in order by revitalizing our imperiled democracy, rather than continuing to crusade around the world to dictate values we’ve failed to live up to ourselves. Imagine if we reallocated even a fraction of the $778 billion we spent on our military last year to social needs and human infrastructure spending. As Quincy Institute for Responsible Statecraft President Andrew Bacevich told me in a recent conversation, we need a new national security strategy focused on “providing for the security and the well-being of the American people where they live.” This is not isolationism, this is realism.The collective challenges we face call for a rethinking of how the United States conducts diplomacy not only with Russia but also with the rest of the world. Biden and his team would do well to move forward with humility, caution and restraint — and to avoid falsely conflating those qualities with weakness. As stated last week in an open letter I joined from independent American and Russian women, “new thinking, not new weapons, is the better measure of a valued leader in this time.”Read more:Vladimir Kara-Murza: Russia has hundreds of political prisoners. In Geneva, President Biden can help free some of them.Dmitri Alperovitch and Matthew Rojansky: Putin has bedeviled American presidents. Biden can learn from their mistakes.Katrina vanden Heuvel: What Joe Manchin doesn’t get about the GOP’s voter suppressionThe Post’s View: Biden’s test in Europe: Drawing red lines with Putin and ErdoganThe Post’s View: Putin’s government can bring down its fist — but not on hackersLatest: Disagreements flare among NATO allies despite relief at Biden’s arrivalLive updates: Biden says U.S. has a ‘sacred obligation’ to its NATO allies as he arrives at summitOpinion: Joe Biden: My trip to Europe is about America rallying the world’s democraciesAnalysis and more:President Biden says Queen Elizabeth II ‘reminded me of my mother’G-7 takes stronger stand against China, at U.S. urgingNATO allies seek clarity on maintaining secure facilities in Afghanistan following troop withdrawalAmid strained U.S.-Turkey relations, Biden and Erdogan to meet on sidelines of NATO summitTrump’s shadow still looms over cloudy skies at G-7 summitCornwall, where G-7 leaders are hosted at a beach resort, is one of the poorest regions in BritainBritain’s Boris Johnson takes shots at E.U. leaders as tensions over ‘sausage war’ threaten message of unityDid Biden give Boris Johnson a $6,000 bike and get a Wikipedia printout in return? Not exactly.At the G-7 in Cornwall, protesting with signs, samba and electronic trashThe most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/opinions/2021/06/15/biden-has-an-opportunity-begin-rebuilding-uss-fractured-relationship-with-russia/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}