{"Type": "Asia", "Time": "2021-06-15", "Headline": "What happened at China's Taishan nuclear reactor?", "Text": "SHANGHAI: French energy company EDF is investigating a potential issue linked to a build-up of inert gases at its nuclear plant in China's south-eastern province of Guangdong.The probe comes after CNN reported that the United States government was assessing a report of a leak at the Taishan power station. The report was made by Framatome, the EDF business that designed the plant's reactor and remains involved in its operations.Framatome warned that the plant, a joint venture with China General Nuclear Power Group (CGN) that is located around 200km from Hong Kong, was facing an \"imminent radiological threat\".Here is what we know so far:WHAT HAPPENED AT TAISHAN?According to CNN, US officials have been investigating the Framatome claims of a leak for the past week.EDF, which has a minority stake in the plant, said that a build-up of krypton and xenon - both inert gases - had affected the primary circuit of Taishan Unit 1, but added that it was a \"known phenomenon, studied and provided for in the reactor operating procedures\".Majority owner CGN also said in a statement that operations at the plant met safety rules.Radiation levels in the vicinity were still normal on Monday (Jun 14), according to real-time data from the China Nuclear Safety Administration (CNSA).According to CNN, Framatome's warning included an accusation that CNSA was raising acceptable radiation limits outside the Taishan plant to avoid having to shut it down.The regulator and the Chinese government did not immediately respond to requests for comment.WHAT ARE THE RISKS?Nuclear experts have generally played down the risks. CNN cited US officials as saying that the dangers to the public were currently minimal.Li Ning, a Chinese nuclear scientist based in the United States, told Reuters that CNN was \"making a mountain out of a molehill\" and that it was unrealistic to expect \"zero failure\" in the fuel cladding of nuclear projects anywhere in the world.Li said that the media were \"often unwilling to put risks into proper perspective\", which he said had effectively killed off the nuclear industry in the West.\"Coal-fired power plants can emit and discharge more radioactivity than nuclear power plants,\" Li said.WHY IS THE US GOVERNMENT INVOLVED?CGN, China's largest state-owned nuclear company, was placed on a US blacklist in August 2019 for allegedly making efforts to acquire advanced US technology and material for diversion to military uses in China.That means that Framatome, which has operations in the United States, would need a waiver from the US government to allow it to help CGN fix technological problems, Li said.China's foreign ministry has said that the blacklist is a misuse of export control measures.WHAT IS TAISHAN'S SAFETY RECORD?Minor safety issues have been quite frequent at Taishan. In March, inspectors checking a faulty voltmeter in Unit 1 accidentally caused an electrical malfunction that triggered an automatic shutdown, according to CNSA incident records.In April, a burst of radioactive gas unexpectedly entered a pipe at Unit 1's waste gas treatment system just as workers were trying to seal it, also triggering an alarm, CNSA said.WHAT IS AN \"EPR\"?Formerly known as a European Pressurised Reactor, the EPR is a third-generation nuclear technology that includes enhanced safety features as well as greater generation capacity.It was designed by Framatome together with Germany's Siemens. Its third-generation rivals now include Westinghouse's AP1000, Russia's VVER-1200 and China's Hualong One.In 2006, EDF and fellow French nuclear group Areva lost a bid to build four reactors on China's eastern coast, with China opting for Westinghouse's model after signing a deal to transfer core technology for use in its own projects.In 2007, EDF agreed to build two EPRs at Taishan, which would be 70 per cent-owned by CGN. Construction got under way in 2010.Originally scheduled to be connected to the grid within four years, the first unit wasn't completed until December 2018.WHAT NEXT?EDF did not provide a time frame for completion of its investigation, nor did US officials, according to the CNN report.Problems at the Taishan project are unlikely to dent China's nuclear ambitions, but they underscore the challenges facing foreign reactor developers in a market increasingly dominated by domestic players.China fell short on its 2020 nuclear capacity target. Many complained that the sector's expansion was derailed not only by the 2011 Fukushima disaster, but also by the lengthy delays and spiralling costs at foreign-designed projects.As it steps up the construction of new plants, China is now expected to depend primarily on its own third-generation Hualong One design, but it is also helping to finance the construction of an EPR project at Britain's Hinkley Point.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "US,China,EDF,Framatome,nuclear reactor", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/business/explainer--what-happened-at-china-s-taishan-nuclear-reactor--15018152", "Source": "google"}