{"Type": "", "Time": "2021-06-15", "Headline": "UPDATE 1-Singaporean automotive marketplace Carro says raises $360 mln to become unicorn", "Text": "(Adds detail on investors, tag for pictures) SINGAPORE, June 15 (Reuters) - Singapore-headquartered Carro, a Southeast Asian online automotive marketplace, said on Tuesday it has raised $360 million in its latest funding round led by SoftBank Vision Fund 2, becoming the region's latest unicorn. \"The valuation for the company is well over a billion dollars,\" CEO and founder of Carro, Aaron Tan, told Reuters. He did not provide a specific number. Carro will use the fresh capital to expand into new locations and grow its business in its existing markets - Indonesia, Thailand, Malaysia, and Singapore. It also plans to expand its portfolio of financial services and accelerate development of artificial intelligence capabilities. Carro's platform allows consumers and wholesale businesses to buy and sell vehicles along with providing insurance and financing services. Other investors in the new round of financing include several prominent Indonesian based funds including EV Growth, it said. Since being founded in 2015, Carro has raised more than $400 million in equity and $200 million in debt. Its previous investors include SoftBank Ventures Asia, EDBI Pte, Insignia Ventures Partners and B Capital Group. The company has started preparing internally for an initial public offering (IPO), Tan said. \"The plan is to IPO the company, hopefully, in the next 18-24 months in the U.S., depending on whether the market holds,\" he said. While Carro saw an initial decline in business due to the COVID-19 pandemic, like other digital businesses, the company is now benefiting from users shifting to online transactions. \"People are more willing to buy vehicles entirely online without the need to visit a showroom,\" he said.  Carro booked revenues of $300 million for the year ending March 2021 and has registered positive EBITDA (earnings before interest, taxes, depreciation, and amortization) for two years. (Reporting by Aradhana Aravindan in Singapore Editing by Ed Davies) An ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Search for private jet membership. The affordable price makes these private jet offers hard to resistHere are three growing businesses that should be cheap enough to add to your investment watchlist. The post 3 Undervalued Gems That You Can Add to Your Watchlist appeared first on The Smart Investor.The Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.Malaysia on Sunday deported a leading figure in conspiracy circles who is wanted in France over the kidnapping of an eight-year-old girl, sources told AFP.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.With its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Spain opened their Euro 2020 campaign with a goalless draw against Sweden in Seville on Monday after their preparations were badly affected by Covid-19, while Patrik Schick scored one of the championship's great goals in the Czech Republic's 2-0 win over Scotland.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Diabetes indicators may be more subtle than you think. Take a look at diabetes warning signs and symptoms.The Philippines will extend a key military pact with the United States for another six months, its foreign minister said Monday, after months-long negotiations between the two countries.Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.Major US indices finished at fresh records Monday as global equity markets began the week cautiously ahead of a much-anticipated Federal Reserve meeting.Search for control scalp psoriasis. These treatments for scalp psoriasis are more affordable than everAn American father-son duo accused of orchestrating former Nissan chief Carlos Ghosn's audacious escape from Japan admitted their role Monday as they made their first appearance before a Tokyo court.The death toll from a gas blast that ripped through a residential compound in central China has risen to 25, Beijing's state media reported Monday, as authorities continued a desperate rescue operation.Ukrainian leader Volodymyr Zelensky Monday said US President Joe Biden should have met him before his high-profile summit with Russia's Vladimir Putin as they could resolve nothing on Ukraine without Kiev at the table.Amazon.comWhen you want protection that goes beyond just covering your medical costs, critical illness insurance is the logical choice. But with so many options out there, which ones are best for you? We investigate in this article. In a nutshell, critical illness insurance is insurance […] The post Best Critical Illness Insurance Plans In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Two strategies to consider when making investment decisions. The post Getting Started: What is Averaging Up and Averaging Down appeared first on The Smart Investor.Myanmar's ambassador to the United Nations, who has refused to leave his post despite being fired after the February coup, has called for \"effective collective measures\" against the junta, ahead of expected Security Council talks on the situation.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/1-singaporean-automotive-marketplace-carro-012759298.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}