{"Type": "", "Time": "2021-06-15", "Headline": "'I was dizzy from being beaten up': Man left with gash in head after neighbour allegedly attacks him with chain , Singapore News - AsiaOne", "Text": "A graphic designer was allegedly attacked by his neighbour with a bicycle chain in the corridor of his Housing Board flat on Saturday (June 12). He suffered a cut to his head that needed stitches.The victim, who wanted to be known only as Mr Toh, told Chinese-language evening daily Lianhe Wanbao that the alleged attack occurred after he had moved his neighbour's bicycle.The police told The New Paper they were alerted to the case of dispute that happened at Block 130 Ang Mo Kio Avenue 3 at about 10.30am.They arrested a 65-year-old man for voluntarily causing hurt with a dangerous weapon. Investigations are ongoing.Speaking to Wanbao, Mr Toh, 47, claimed that he had moved his neighbour's bicycle that was parked next to his window so that he could climb his ladder and clean the outside of the window.When the neighbour returned and saw that his bicycle had been moved, he allegedly pushed the bicycle with force, causing it to hit the ladder.[[nid:515777]]Shocked, Mr Toh turned around to ask his neighbour what was wrong.Mr Toh told Wanbao: \"Without a word, he took out a chain with a lock from the bicycle basket and started attacking me.\"The alleged attack caused Mr Toh to fall off the ladder and he felt severe pain on the back of his head.He ran to a nearby unit to ask for help from a woman. She took a towel to stem the bleeding and Mr Toh claimed she also stepped forward to stop the neighbour from attacking him again.Mr Toh, who was in a daze, said he was concerned for the safety of his children who were in the house.The divorcee's 14-year-old daughter and 12-year-old son were visiting him as it was the school holidays.He said: \"I was dizzy from being beaten up, but I remembered that my front door was unlocked.\"I was worried that the attacker would run into the house and hurt my children.\"Fortunately, the woman living next door helped attend to my children.\"Mr Toh was taken to Khoo Teck Puat Hospital by the Singapore Civil Defence Force.[[nid:532343]]Wanbao reported that he needed five stitches for a 4cm wound on his head. He was discharged on the same day.Mr Toh has been living with three tenants in the unit for about two years.He alleged that the neighbour has been spitting and throwing garbage outside his unit and that the incidents started a month after he had moved in in 2019.Mr Toh said: \"My injury is of secondary concern. I am more worried about how this incident will affect my children.\"This article was first published in The New Paper. Permission required for reproduction.", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/singapore/i-was-dizzy-being-beaten-man-left-gash-head-after-neighbour-allegedly-attacks-him-chain", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}