{"Type": "", "Time": "2021-06-15", "Headline": "CDC investigating rare heart inflammation after receiving COVID vaccines | ABC27", "Text": "ABC27\n\t\t\tby: Daniel Hamburg HARRISBURG, Pa. (WHTM) — Later this week the CDC will gather for an emergency meeting to discuss reports of heart inflammation in mostly boys and young men after receiving a COVID vaccine. But experts say it’s no reason to panic.It’s important to look at the big picture first. More than 309 million vaccines have been administered. As of Thursday, the CDC reports 275 cases of that inflammation in 16 to 24-year-olds.“As a scientist and as a nurse and someone that focuses on population health, I am still completely comfortable with the vaccines. I would still tell my family to get vaccinated,” said Dr. Nancy Mimm, assistant professor of nursing and population health at Harrisburg University.Mimm says the benefits of the COVID vaccines far outweigh the risks.“Consider thinking about all the people that were hospitalized,” Mimm said. “A lot of them had so many complications related to the COVID virus that could’ve been prevented like lung damage.”The recent concern is heart inflammation, seeming to occur more often in boys and young men and frequently after the second dose of either Pfizer or Moderna.“That’s inflammation in the muscle, the myocarditis, and pericarditis is inflammation of the sack around the heart,” Mimm said.Those ages 12 to 24 account for more than half of the reports after a second dose but only make up about nine percent of doses administered.“Signs to look for include chest pain, shortness of breath, fever, rash and diarrhea,” Mimm said.It’s a rare, but serious side effect to be aware of, but not alarmed about. Mimm says the extra scrutiny is a good thing.“This happens and this has happened with other vaccines that the CDC has an emergency meeting and scientists get together and they analyze it and they look at it and they look for trends. This is exactly what you want. This is best practice at its best,” Mimm said.As overall vaccination rates continue to go down, she says it’s important to keep up the fight.“We have a vaccine that saves lives and we need to step up to the plate and vaccinate for the people we’re around, the communities that we live in and for ourselves,” Mimm said.The meeting is this Friday. It’s still not clear if the vaccine and inflammation are connected.In the meantime, the CDC and the American Heart Association continue to recommend everyone 12 years and older get a COVID-19 vaccine.Copyright 2021 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.YORK COUNTY, Pa. (WHTM) -- York County has named its new prison warden. Adam Ogle has worked at the prison since 2000. TIOGA COUNTY, Pa. (WHTM) -- Welcome to Leonard Harrison State Park! Located in Tioga County in Northern Pa. the park is named after the man who gave the land to the state in 1922. It's also known as the Pa. Grand Canyon. The Leonard Harrison overlook is on the east rim of the gorge and you can see why this park is known for its views. NEWBERRY TOWNSHIP, Pa. (WHTM) -- It's known as dump road. \"Piles and piles of trash and over the years it just builds up,\" Volunteer Rebecca Love said. It's actually Still House Road in Newberry Township, York County and some have been using it as their garbage dump. Unfortunately, lots of communities have roads like this. ", "Section": "", "Writers": "", "URL": "https://www.abc27.com/news/health/coronavirus/vaccination-frustration/cdc-investigating-rare-heart-inflammation-after-receiving-covidvaccines/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}