{"Type": "", "Time": "2021-06-15", "Headline": "Malaysia's hungry and it's not just the homeless as Covid-19 lockdown extended, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.KUALA LUMPUR - After Mr Asfan Razali lost his clerical job in March when the company shut down, his family survived on plain rice, mackerel and eggs.The 33-year-old then worked as a security guard but was laid off in May, just days before Malaysia entered a third lockdown on June 1. The family of four were kicked out of their rented home in Shah Alam and they are now living with a relative in Klang.Mr Asfan now does odd jobs but his income is not enough to sustain his family.His younger brother Azrin, 28, told The Straits Times: \"Things have been extremely difficult for him. Despite taking up multiple odd jobs, his income is not enough to cover groceries, rent and utility bills.\"He was very depressed and started thinking about suicide as soon as the government announced the extension of the third lockdown. This was when the siblings decided to come together and set up a joint savings account so that all of us have access to some money for food.\" Mr Azrin, an information technology technician, said he and his two younger siblings would make sure to contribute at least RM50 (S$16) weekly to tide Mr Asfan over until he can bounce back.With daily new Covid-19 cases still numbering over 5,000, Malaysia has extended its lockdown until June 28. Only essential services are allowed to operate during this time.Despite the extension, no fresh financial aid has been offered to soften the blow, except for a RM40 billion (S$12.8 billion) stimulus package that was announced on May 31, the eve of the lockdown.The Pemerkasa Plus package includes RM2.1 billion in cash aid - up to RM2,500 each for households with monthly incomes of RM5,000 or less.The government has been trying to balance Covid-19 concerns with rising economic uncertainty. But news of the extension of the lockdown has sparked resistance among some Malaysians on social media amid fears that a large number of people will not be able to survive another lockdown because of high unemployment and pay cuts.Unemployment rose to 5.3 per cent in May last year during the first movement control order (MCO 1.0). As at April this year, the rate was 4.6 per cent.The government's handing of the Covid-19 pandemic has also drawn flak from both sides of the political divide, with several politicians urging it to quickly dispense aid to the people.Opposition Pakatan Harapan lawmaker Hannah Yeoh said an extension without any immediate information on aid for the people was an irresponsible act.Those needing help are no longer just the homeless rummaging for food on the streets. Now, the needy can be well-dressed and have a home.The number of people heading to soup kitchens and food banks has risen since MCO 1.0 in March last year.Mr Justin Cheah, operations director of the Kechara Soup Kitchen (KSK), which has locations in Kuala Lumpur, Johor Baru and Penang, said it has begun seeing more people, including those from other states, and not just the homeless.\nThe Kechara Soup Kitchen in Kuala Lumpur. The charity has begun seeing more people, including those from other states, and not just the homeless. PHOTO: KECHARA SOUP KITCHEN\n\"In terms of people turning up for food, there are more these days,\" he told ST. One of its sites in Jalan Imbi, near Bukit Bintang, is seeing an estimated 120 people a day now, up from 80 during the last MCO, he added.\"We saw one man who was from Ipoh. He was dressed quite nicely but he came to get food from us. He said he was stuck here (in Kuala Lumpur) at the moment because of the MCO. He came down to look for a job but ran out of money, so he had to be on the streets for a while.\"In Johor Baru, many are living on the streets after they lost their jobs in Singapore.The Yayasan Suria charity organisation in Johor Baru distributes around 1,200 packets of cooked food to 450 to 500 people daily.\nThe Yayasan Suria charity organisation in Johor Baru distributes around 1,200 packets of cooked food to 450 to 500 people daily. PHOTO: JAMES HO\n\"We are seeing an increase of between 10 and 15 per cent from the last lockdown,\" Yayasan Suria founder James Ho told ST.\"Not all of them are homeless. Some 70 per cent are homeless, while 30 per cent are poor. The majority of those affected used to work in Singapore. Now they don't have jobs any more. They sleep on the roadside or if it rains, they sit at shophouses.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/more-people-in-malaysia-struggling-with-extended-covid-19-lockdown", "Source": "google"}