{"Type": "Singapore", "Time": "2021-06-15", "Headline": "Man jailed for paid sex act with teenage boy who was looking for a 'sugar mummy'", "Text": "SINGAPORE: A man was jailed for 10 months on Monday (Jun 14) for paying for a sex act with a 17-year-old boy, after tricking the boy into believing he was a \"sugar mummy\".Muhammad AL-Masfuiin Mushin, 26, pleaded guilty to one charge of commercial sex with a minor.The court heard that the victim began using an application called Locanto in 2017. He discovered that there were advertisements for sexual services, and users looking for \"sugar mummies\" or \"friends with benefits\".\"Sugar mummy\" is a term for older women who pay younger individuals for companionship that may be of a sexual nature.The victim wanted to earn money by offering sexual services and created an account.On Jun 16, 2019, the victim was kicked out of his house after a heated argument with his mother. As he needed money, he put up an ad seeking a sugar mummy, titling it \"Toyboy Fantasy Satisfies you - 18\".He included his phone number and two photos of himself in the ad, offering sexual services in exchange for money.The accused saw the ad a day later. Even though the victim was searching for a sugar mummy, Muhammad AL-Masfuiin decided to pose as a woman and chat with the victim.He began chatting with the boy on Telegram, saying: \"I'm looking for a young boy to be my sex slave.\"He asked the victim for photos and body statistics of himself, and told him he was female.When Muhammad AL-Masfuiin asked the victim for his real age, the victim replied that he was 17, had been chased out of his house and needed money.Posing as a woman, Muhammad AL-Masfuiin asked the victim \"would you have sex with my (boyfriend) and I\", despite knowing there would be no woman involved.The victim agreed and asked for S$250 per meet-up. Muhammad AL-Masfuiin told the victim that he could stay over, but he would have to perform sex acts on the fictitious \"boyfriend\".At 1am on Jun 18, 2019, Muhammad AL-Masfuiin booked a taxi for the victim to go to Muhammad AL-Masfuiin's house. Believing that the buyer was a woman, the victim asked if \"she\" would be joining the sex session.Muhammad AL-Masfuiin replied that she \"might not\", but the boyfriend \"will tell me if you did a great job at sex\". The victim asked Muhammad AL-Masfuiin if he knew the victim was 17, and Muhammad AL-Masfuiin replied \"yes\", adding: \"I like my boys young\".The victim got to Muhammad AL-Masfuiin's home. He took a shower on Muhammad AL-Masfuiin's instruction and came out of the bathroom to see Muhammad AL-Masfuiin performing a sex act.Muhammad AL-Masfuiin then performed a sex act on the victim before asking him for sex. The victim resisted, but Muhammad AL-Masfuiin was of a bigger build than him.Before Muhammad AL-Masfuiin could initiate sex, he ejaculated. The victim got dressed and went to sleep and texted the accused's number, thinking it belonged to a woman, telling \"her\" that the sex session was completed.The next morning, the victim woke up and asked Muhammad AL-Masfuiin for money to get to work. Muhammad AL-Masfuiin gave him S$50 and the victim left.Later that day, a police officer on foot patrol in Toa Payoh came across the victim. In the course of investigations, he found messages in the victim's phone pertaining to the provision of sexual services.Court documents did not specify why the victim was stopped by police.Muhammad AL-Masfuiin was identified and arrested for commercial sex with a minor under 18.He could have been jailed up to seven years, fined, or both.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "court,crime", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/man-jailed-for-paid-sex-act-with-teenage-boy-sugar-mummy-15010658", "Source": "google"}