{"Type": "", "Time": "2021-06-15", "Headline": "Freedom has been delayed again – but Boris Johnson can’t quite remember ‘til when | The Independent", "Text": "In his most important public statement for months, Boris Johnson couldn’t manage to say the right date, but never mind, eh?Find your bookmarks in your Independent Premium section, under my profileFind your bookmarks in your Independent Premium section, under my profile“Freedom is never more than one generation away from extinction,” Ronald Reagan famously, and entirely wrongly, said.Freedom may die, it may lie dormant for decades like a plague of cicadas, but it can never go extinct and it can, we now learn, be delayed by yet another four weeks.Freedom Day, as widely anticipated, is no longer 21 June but 19 July. Well, probably 19 July anyway. It could be 29 July as, in his most important public statement for months, Boris Johnson couldn’t quite manage to say the right date, but never mind, eh?It’s not his fault. It’s the Delta variant’s fault. Just like the Alpha variant that came along and ruined Christmas, along comes the Delta variant and ruins Freedom Day. And when we say, “along comes”, we do very much mean along comes. Along it came, on hundreds of direct flights from India, that carried on for weeks after Bangladesh and Pakistan were added to the “red list” but not India which was, at that point, about to welcome one Boris Johnson for an official visit.So, another four weeks it is then. This four weeks, by the way, is to allow more time for everyone to be vaccinated, so that the virus can’t spread. Since these dates were announced, the UK has had one of the fastest vaccine roll-outs in the world. It could scarcely have gone any better. Is it reasonable, maybe, to wonder whether Freedom Day might, maybe, have been scheduled for after that date? Was it, maybe, not altogether wise to lift all restrictions, reopen nightclubs and the like, when the vast, vast majority of people who go to them – young people – had been offered no protection at all?There were some exemptions. If you’ve got a wedding booked for between 21 June and 19 July, that will still be allowed to go ahead with unlimited numbers, with the tiny, tiny detail that it’ll have to be socially distanced and therefore with no dance floor. But it can go ahead, so the wedding insurers won’t pay out, and the venue won’t permit further delay. So it can go ahead, it’ll just be a bit rubbish.Still, try not to get too down about it. You might have been looking forward to the best day of your life for quite some time, but don’t worry. These things have a tendency to come round again far quicker than you think. Just ask the prime minister.Join thought-provoking conversations, follow other Independent readers and see their repliesFreedom’s just another word: Johnson forgets his dates as he announces a push-back of ‘Freedom Day’PAWant to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.Log inNew to The Independent?Want an ad-free experience?Subscribe to Independent Premium.", "Section": "", "Writers": "", "URL": "https://www.independent.co.uk/voices/freedom-day-delayed-boris-johnson-weddings-b1865732.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}