{"Type": "", "Time": "2021-06-15", "Headline": "Mixing and matching AstraZeneca and Pfizer works, say WHO experts - CGTN", "Text": " Share CopiedStudies suggest a first dose of AstraZeneca followed by a second dose of Pfizer works as well as two Pfizer shots.  /Ryad Kramdi/AFPWith the continuing global vaccine supply shortages and an increasing variety of COVID-19 vaccines approved for emergency use, many have wondered whether combining different vaccines could be a feasible option to fast-track and simplify vaccination efforts.The short answer from the World Health Organization, following preliminary studies in Spain, the UK and Germany and evidence coming from real-life scenarios in India, is yes.But so far it is only with an AstraZeneca first dose followed by a Pfizer vaccine as a second dose that we know for sure that this can be done \"without any problems in the sense of efficacy,\" said Alejandro Cravioto, WHO Chair of Strategic Management, when asked about the issue at an online question and answer session.READ MORE:How to curb the soaring amount of 'e-waste'The backward running world championG7 summit pledges on climate and vaccinesIn recent studies, researchers have found that this mixing and matching - which initially happened because of necessity - is actually beneficial, as a first dose of AstraZeneca combined with a second dose of Pfizer proved to develop levels of protection against the virus as high as two doses of Pfizer, with efficacy rates at 97 percent after the second dose.In Europe and Canada, the question was whether patients who had received a first dose of AstraZeneca could switch to a different vaccine, after some countries said that AstraZeneca should not be recommended for younger age groups.While there is enough evidence to prove that it is safe and efficient to mix the AstraZeneca vaccine with the Pfizer vaccine, the same information is not yet available for all the possible combinations of the many vaccines currently available across the world.  \"We have over 15 vaccines now that are being used in different countries,\" said Katherine O'Brien, WHO Director of Immunization, Vaccines and Biologicals department.Despite the fact that some of these vaccines are very different in the way they work, whether they're based on an inactivated cold flu virus like the Johnson & Johnson vaccine or use mRNA technology like Pfizer and Moderna, \"in one way or another [they] are all stimulating your own immune system to develop antibodies against that spike [protein]\" of the COVID-19 virus, said O'Brien.\"So just on basic principles of how vaccines work, we do think that the mix and match regimens are going to work. But it is important that we actually get data on the degree to which your immune response does respond to a second dose that's not the same vaccine as the first dose.\" Mixing vaccines could potentially boost immune response and solve issues of vaccine shortages across the world. /Reuters/Dinuka Liyanawatte/File Photo Mixing doses of different vaccines is nothing out of the ordinary in immunology. Following the ebola epidemic of 2014, Johnson & Johnson produced a two-dose vaccine containing different carrier viral vectors (an adenovirus and a modified version of a poxvirus) that was able to provide long-lasting immunity.Mixing and matching COVID-19 vaccines could potentially not only solve issues of vaccine roll-outs in those countries struggling with sufficient supplies, but also boost the body's immunity to variants of the virus, giving more weapons in our arsenal to fight the virus.But as mRNA vaccines such as Pfizer and Moderna have only been approved for the first time to combat the COVID-19 pandemic, there is a lack of evidence from previous experience with different diseases that mixing and matching will work without possible side effects.For this reason, researchers are pressing for more studies to test different vaccine combinations and the reaction of our bodies to them.  Cover image: Fred Tanneau/AFPCopyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3Copyright Â© 2020 CGTN. Beijing ICP prepared NO.16065310-3", "Section": "", "Writers": "", "URL": "https://newseu.cgtn.com/news/2021-06-14/Mixing-and-matching-AstraZeneca-and-Pfizer-works-say-WHO-experts-114pSzEXN0Q/index.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}