{"Type": "", "Time": "2021-06-15", "Headline": "Can't spell 'receive'? Nine other words that trip up students, Parenting & Education News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - If you find yourself struggling to spell words like receive and successful, you are not alone.A recent study by Edubirdie, a professional essay writing service, revealed that these are among the most commonly misspelt words found in essays submitted to it - by students in the United States, Britain, Canada and Australia - for editing between 2019 and 2020.The study analysed the grammatical mistakes made by students in their essays, going through more than 500,000 words in total.It found that spelling mistakes ranked highest among the types of language errors, which include misplaced modifiers and lack of subject-verb agreement.English language educators see similar patterns here.Mr Benjamin Wong, a secondary school teacher, has noticed that the word receive is very commonly misspelt as students here tend to switch the positions of the letters i and e.Words like accommodate and convenient are also commonly spelt wrongly.He attributes a regression in the spelling abilities of younger generations, as compared with older ones, to an over-reliance on automatic spelling correction tools in smartphones and word processors like Microsoft Word.\"Many do not feel the need to learn the correct spelling by heart because they can always use the predictive text and autocorrect function in their phones and laptops.\"Mr Wong adds that texting could play a role in causing mistakes, as many people do not have enough practice spelling out difficult words in full.\"With texting being the most common mode of communication, many text in shorthand. For example, instead of spelling 'separate' in full, many type 'sep'.\"Ms Christabel Hong, an English tutor, echoes this sentiment but adds that there could be other reasons for misspelling words.One factor could be mispronunciation. Words like privilege and mischievous, for example, are frequently misspelt because they are often pronounced incorrectly.Ms Hong says changes in form may also lead to mistakes - converting the verb explain to the noun explanation, for instance, can be confusing as it involves adding and removing letters.To improve spelling ability, both educators emphasise the need to make a conscious effort to do so.Mr Wong says: \"I do believe we have to make a concerted and deliberate attempt to correct our spelling errors by committing the correct spelling to memory.\"Top 10 misspelt words1. Tomorrow: Misspelt as tommorow2. Which: Misspelt as wich3. Completely: Misspelt as completly4. Receive: Misspelt as recieve5. Until: Misspelt as untill6. Finally: Misspelt as finaly7. Successful: Misspelt as succesful8. Beginning: Misspelt as begining9. Definitely: Misspelt as definately10. Government: Misspelt as goverment• Source: Edubirdie Get the ST Smart Parenting newsletter for expert advice. Visit the microsite for more.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/parenting-education/can-you-spell-successfully-the-top-10-words-students-misspell", "Source": "google"}