{"Type": "", "Time": "2021-06-15", "Headline": "Portugal take on a Hungary backed by noisy cauldron, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BUDAPEST • Portugal will look to their Euro 2020 opener with Hungary to get a head start on Germany and France in a tough Group F, but the holders will have to overcome a wall of noise made by an expected 61,000-strong partisan crowd.Hungary, playing in only their second European Championship in 49 years, are rank outsiders in the \"Group of Death\", but will compensate for what they lack in star names with passion and grit.The shiny new Puskas Arena is the only Euro 2020 stadium which will be at full capacity during the group stage after local authorities agreed to exchange social distancing for a strict entry policy, requiring fans to return a negative Covid-19 test to gain access.It means the likes of Portugal captain Cristiano Ronaldo and Bruno Fernandes face the prospect of their every touch being booed in today's fixture by the Budapest crowd, who will not forgive any slacking off from their side.\"They (Hungary) are a very tough team and won't let any ball go and will never give up. We know what style of play to expect from them,\" said Portugal midfielder Danilo.\"We spent a season without playing in front of fans and we're not used to it any more, but having a crowd will make the game more exciting.\"Hungary will be extra motivated, but it's just another problem we'll have to deal with.\"But leaving aside the rabid fans, the European champions are likely to face more difficult tests from Germany and 2018 World Cup winners France, so the Hungary clash is a golden chance to boost their goal difference, which may prove to be the deciding factor in such an evenly balanced group.Hungary caused the visitors problems at Euro 2016, earning a 3-3 draw in the group stage, but Fernando Santos' side are an even stronger proposition five years on, possessing an embarrassment of attacking riches with the likes of Diogo Jota, Andre Silva, Joao Felix and Fernandes having all broken into the senior set-up since then.\"This is a different group, we have many young players embarking on their first major international tournament although our ambition and hunger will be the same as in Euro 2016,\" added Danilo, who was part of that winning squad.\"The previous team were very cohesive as they had been playing together for a long time, while we are a young team of emerging talents but we are also a united group. We all think the same and want to win.\"9Portugal captain Cristiano Ronaldo and France's Michel Platini head the all-time top scorer list at the European Championship with nine goals apiece.Hungary, meanwhile, are a less potent side than the one which reached the knockout stage in 2016, with stalwarts like Zoltan Gera hanging up their boots.They are also without two key midfielders in 20-year-old Dominik Szoboszlai, considered the team's star man, and 26-year-old Zsolt Kalmar, with neither called up due to injury.Lacking in attacking flair, their group prospects will largely depend on their defence, marshalled by Fenerbahce's Attila Szalai, fellow centre-back Willi Orban and his RB Leipzig teammate Peter Gulacsi in goal.AGENCE FRANCE-PRESSE, REUTERSSingtel TV Ch141 & StarHub LiveNow app, 11.50pmJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/portugal-take-on-a-hungary-backed-by-noisy-cauldron", "Source": "google"}