{"Type": "", "Time": "2021-06-15", "Headline": "'I'm fine - under the circumstances' - Eriksen offers update on his condition following collapse with Denmark | Goal.com", "Text": "Christian Eriksen has delivered a first public message since his  collapse during Denmark's Euro 2020 date with Finland  , with the Inter playmaker offering an update on his condition.The 29-year-old suffered cardiac arrest when representing his country in their opening game of this summer's European Championship.He had to be resuscitated on the field in Copenhagen, with  messages of support for the former Tottenham star flooding in  as he continues on a road to recovery in hospital.Addressing his well-wishers and offering an insight into how he is feeling, Eriksen has posted on social media: \"Big thanks for your sweet and amazing greetings and messages from all around the world. It means a lot to me and my family. \"I'm fine - under the circumstances. I still have to go through some examinations at the hospital, but I feel okay.\"Now, I will cheer on the boys on the Denmark team in the next matches. Play for all of Denmark.\"A post shared by Christian Eriksen (@chriseriksen8) It remains to be seen whether Eriksen will be freed to continue his professional career once out of medical care.His international colleagues are determined to give him something to smile about as they look to make a positive impression at another major international tournament.A 1-0 defeat was suffered to Finland, with that contest controversially played to a finish a matter of hours after Eriksen's life was saved by the quick thinking of colleagues and doctors.Peter Schmeichel has claimed that UEFA threatened the Danes with accepting a 3-0 forfeit defeat  if they did not return to the field once a positive update on Eriksen had been delivered.They will be back in action against Belgium on Thursday as they seek to secure progress out of Group B.Eriksen will be among the interested observers of that contest, with the sporting world delighted to see him battling back from the most serious of health scares.", "Section": "", "Writers": "", "URL": "https://www.goal.com/en-us/news/im-fine-under-the-circumstances-eriksen-offers-update-on-his/a2whp8a8cs4h1jay5bifxhlpk", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}