{"Type": "Asia", "Time": "2021-06-15", "Headline": "Philippines prolongs COVID-19 curbs in capital, more areas under strict quarantine", "Text": "MANILA: Philippines President Rodrigo Duterte on Monday (Jun 14) extended partial coronavirus curbs in the capital and nearby provinces until end-June, but placed more areas under tighter quarantine measures because of rising infections and high hospital occupancy.COVID-19 cases in the capital region, home to at least 13 million people, have eased from their peak in April, but provinces are battling surges, showing that the pandemic is far from over in the Southeast Asian nation.In a weekly national address, Duterte told the public to get inoculated and comply with health regulations. \"If you do not get vaccinated, you will really die\".The government imposed tighter measures in nine cities and 12 provinces, including those in central and southern Philippines, that limit the operating capacity of businesses and shut down non-essential establishments.\"The current downward trend remains fragile as evidenced by the minor uptick in cases the past month,\" Health Secretary Francisco Duque said in the televised address.Provinces in central and southern Philippines accounted for nearly a third of new cases in the past two weeks, government data show.With more than 1.3 million COVID-19 cases and nearly 23,000 deaths, the Philippines has the second highest number of infections and casualties in Southeast Asia, next to Indonesia.Duterte also extended a ban on inbound travel from India, Pakistan, Sri Lanka, Nepal, Oman, and the United Arab Emirates until Jun 30, to prevent the spread of more infectious variants from abroad.Travellers coming directly from those countries, or with a history of travel to any of them within the last 14 days, will be denied entry.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,medical health,quarantine,Rodrigo Duterte", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/philippines-prolongs-covid-19-curbs-in-capital--more-areas-under-strict-quarantine-15014034", "Source": "google"}