{"Type": "", "Time": "2021-06-15", "Headline": "askST: Can we pass Covid-19 to our pets?, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - There have been reports from numerous countries of animals, including pets, getting infected with Covid-19.Last week, an Asiatic lion at a zoo in India died from it. Its death prompted the testing of dozens of elephants at a forest reserve in the country. Tigers in India have also been tested.Russia reportedly started vaccinating pets at veterinary clinics with its Carnivak-Cov vaccine in late May.The Straits Times (ST) answers some common questions about animals and Covid-19.A: A small number of animals, including pet dogs, mink raccoon dogs and zoo animals such as tigers and lions have tested positive for Covid-19 after coming into contact with infected individuals.Two cases of human-to-cat Covid-19 transmission in the United Kingdom were reported in the journal Veterinary Research in late April, providing further evidence of such spread.\"One had mild illness and the other severe. The viral strains in both cats were very similar to human strains,\" said Professor Paul Tambyah from the NUS Yong Loo Lin School of Medicine.Covid-19 infections in farmed mink have also been reported in at least 10 countries. Millions of the animals, which are valued for their fur, have been culled to prevent future spillover events to humans.A: There are very few reports of an animal passing Covid-19 back to humans, though there were reports of mink farmers in northern Europe infected by strains that moved from humans to mink and back to humans, said Prof Tambyah.The vast majority of the millions of Sars-CoV-2 infections have been human-to-human transmissions and it appears that animal-to-human transmission is extremely rare, he added.The World Organisation for Animal Health (OIE) said that animals do not play a significant role in the Covid-19 pandemic, which is being sustained through human-to-human transmission.A: Confirmed cases in cats and dogs are extremely rare and generally result in mild symptoms, said the World Small Animal Veterinary Association (WSAVA) in the United States. No dog or cat is known to have died from the infection to date, it said.People with suspected or confirmed Covid-19 infection should avoid contact with animals, including pets, livestock and wildlife, said the US Centres for Disease Control and Prevention (CDC).If you suspect your pet has Covid-19, you can contact the National Parks Board's animal and veterinary services. It conducts biosurveillance and is able to do the right kind of polymerase chain reaction testing for Sars-CoV-2 in animals, said Prof Tambyah.A: No. Prof Tambyah said there are no licensed Covid-19 vaccines for animals here.The WSAVA said there have been no cases in which a dog or a cat has been proven to transmit the virus to people. There is no need for owners to consider vaccinating their pets against Sars-CoV-2 at this time, it said.\"As Sars-CoV-2 infection of dogs and cats most commonly originates from an infected human, the best way to protect a pet is to vaccinate the owners so that they are less likely to infect their pet,\" it said in a late April statement.In the US last year, veterinary pharmaceutical firm Zoetis started development activities for a vaccine, based on initial concerns about Sars-CoV-2 in domestic animals.\"If regulatory authorities determine there is a need, we are prepared to act quickly to further develop our Covid-19 vaccine for animals,\" Ms Christina Lood, its senior director of innovation and sustainability communications, told ST.A: The exact origins of Sars-CoV-2 are yet to be determined. It could be many years before we know for sure.The common belief so far is that Sars-CoV-2 likely originated from bats, a known reservoir of coronaviruses, and jumped to humans through an unknown intermediary animal host, like a pangolin.Still, a June 7 report by researchers from China West Normal University and Oxford University found that more than 47,000 live animals were sold at Wuhan wet markets from May 2017 to November 2019, but no pangolins or bats were traded.There are other hypotheses, including the politically charged theory that Sars-CoV-2 was leaked from a laboratory in China.The OIE estimates that at least 75 per cent of emerging infectious diseases affecting humans, including Ebola, HIV and influenza, have an animal origin.A: The four wildlife parks here already have strict protocols, such as quarantining new animals, to prevent cross transmission of diseases from humans to animals under their care and vice versa, said a Wildlife Reserves Singapore (WRS) spokesman.The Covid-19 outbreak led to more measures, including the need for staff to wash their hands with soap and water before interacting with an animal, as well as donning face masks and gloves when working with an animal.They also minimise or avoid direct contact unless required, especially with higher-risk species such as primates and carnivores.\"As added preventive measures, our great apes such as the orangutans and chimpanzees also undergo temperature checks twice a day,\" said the WRS spokesman.He said the risk of humans contracting Covid-19 from animals is very low.\"In addition, our veterinarians assess that due to the low number of community cases in Singapore, coupled with the extra precaution we have taken to care for our animals, the risk of our animals contracting Covid-19 is very low,\" he said.None of the zoo animals here has been infected with Covid-19.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/askst-can-we-pass-covid-19-to-our-pets", "Source": "google"}