{"Type": "", "Time": "2021-06-15", "Headline": "Football: Spain draw blank with Sweden in Euro 2020 opener, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SEVILLE, SPAIN (AFP) - Spain's new team struggled with the familiar problems on Monday (June 14) as a string of missed chances allowed Sweden to hang on for a goalless draw in their Euro 2020 opener in Seville.Alvaro Morata wasted the best opportunity of a dominant first half, in which Spain churned out 419 passes, the most of any team on record in the opening 45 minutes of a European Championship fixture.But Luis Enrique's team lost their rhythm after the interval and Sweden might even have won it, the excellent Alexander Isak hitting the post before his strike partner Marcus Berg missed a sitter from two yards out.A goalless draw leaves Spain playing catch-up in Group E after Slovakia earlier pulled off a shock 2-1 victory over Poland, raising the stakes for the game between Spain and Poland on Saturday, when a loser would be left struggling to qualify.Another failure to convert possession into chances was reminiscent of recent disappointments for Spain, most notably when they were frustrated by Russia at the 2018 World Cup, before going out on penalties.In the wake of that defeat, Luis Enrique was tasked with launching a new era as coach, a project that involved promoting a fresh crop of players but also a more direct, penetrative style.His team were impressive in the first half, a far cry from some of the ponderous passing displays that made Spain look out of date in recent major tournaments.But the second half drifted, perhaps through a lack of confidence or even sharpness, given the team were unable to train together for most of last week, separated according to protocol after Sergio Busquets, still absent, and Diego Llorente tested positive for Covid-19.Sweden coach Janne Andersson, meanwhile, promised on Sunday his team would \"run like hell\" and they not only defended resolutely but carved out arguably the two best chances of the match.Isak, the 21-year-old, who scored 17 goals for Real Sociedad last season, showed why he is one of the most rated young strikers in Europe and Spain would have been relieved when Andersson took him off with 20 minutes left.The Spanish host city was switched to Seville after Bilbao was unable to guarantee Uefa's desired number of fans and with 12,517 supporters inside La Cartuja, the atmosphere was as warm as the weather, with the temperature over 30 degrees Celsius.Kick-off was briefly delayed while one of the nets was fixed and on the sideline Luis Enrique sat perched on the edge of an ice-box.His team swarmed all over Sweden in the opening 10 minutes, racking up 100 passes to their opponents' 13.All Spain lacked was a finishing touch as Jordi Alba and Ferran Torres fired over early crosses before Dani Olmo's header was brilliantly pushed wide by Robin Olsen.Twenty minutes was up before Sweden found a foothold in Spain's half, a throw-in up the pitch prompting Andersson to leap off the bench and applaud.But Spain kept passing and the chances kept coming, Koke steering wide after another tired Sweden touch in the area and then ballooning over after he met Alba's ball in.The best opportunity fell to Morata, the ball finding him in the box after Marcus Danielsson failed to clear Alba's clip, but with the goal gaping he curled his finish wide.Already, Spain seemed to feel the weight of their misses and Sweden almost landed a sucker-punch, Isak's finish diverted by Marcos Llorente onto his own post.The game drifted after the break and Spain faded, their earlier urgency fizzling into something much less convincing. Sweden should have taken the lead as Isak twisted and turned in the box, making enough space to drag a ball to the back post where somehow Berg failed to score.Both teams made changes for the last 20 minutes, among them Isak going off for Sweden and Morata departing for Spain, replaced by Gerard Moreno.Spain surged in the final minutes and Moreno almost grabbed a winner, his flicked header flying towards goal but kept out by the right foot of Olsen, who intervened again in injury time to deny Pablo Sarabia.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-spain-draw-blank-with-sweden-in-euro-2020-opener", "Source": "google"}