{"Type": "", "Time": "2021-06-15", "Headline": "Football: Schick stunner for Czechs leaves Scotland reeling, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.GLASGOW (REUTERS) - The Czech Republic's Patrik Schick scored one of the most remarkable goals in European Championship history as his side beat Scotland 2-0 on Monday (June 14) to get their Euro 2020 campaign off to a superb start and deflate home hopes in Glasgow.Schick, who had also netted an excellent header in the first half, doubled his tally after the break with a curling, looping effort from just inside the Scotland half, having spotted goalkeeper David Marshall far off his line.At 49.7 yards, the Bayer Leverkusen forward's astonishing effort was officially the furthest distance from which a goal has been scored on record at the European Championship according to Opta.Scotland had battled gamely on their return to tournament football after a 23-year absence and spurned a number of excellent chances of their own, with Lyndon Dykes guilty of wasting two superb opportunities.Yet the Czechs were worthy winners, soaking up Scottish pressure in the first half, and silencing a noisy Hampden Park crowd, who were seeing their side play in a major tournament for the first time since the 1998 World Cup.The result left the Czechs on three points, level at the top of Group D with England, who beat Croatia 1-0 on Sunday, while Scotland will already be feeling nervous about their prospects ahead of their next game against England on Friday when the Czechs face Croatia.Scotland began the game at full throttle, fuelled by a vociferous home crowd who seemed to defy the fact that there were less than 10,000 of them in the stadium.Yet the Czechs weathered the early pressure and grew into the game, taking the sting out of Scotland's attacks before moving further up the pitch.Schick had a snapshot palmed away by Marshall after 15 minutes, but he made his mark decisively just before half-time.The Czechs, who scored more than half of their goals in qualifying from set pieces, earned a string of corners just before the break and finally took advantage in the 42nd minute.Scotland cleared the initial ball into the box, but Vladimir Coufal curled a cross back into the danger area and Schick rose brilliantly to beat his marker and angle a header into the far corner away from Marshall's despairing dive.The second half began with a flurry of activity and the Czechs could have extended their lead with first Schick and then Vladimir Darida drawing fine saves from Marshall, with Scotland almost levelling at the other end when Jack Hendry hit the bar.Yet Schick's astonishing finish in the 52nd minute crushed hopes of a Scottish revival.There appeared to be little danger when the forward latched on to the ball just inside the Scotland half, but his instant finish curled past Marshall, who was scampering to get back into his goal, and dipped just beneath the bar.Scotland were not dead and buried at this stage, but after Czech goalkeeper Tomas Vaclik saved twice from Dykes, their hopes of getting back into the match seemed to have evaporated.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/football-schick-stunner-for-czechs-leaves-scotland-reeling", "Source": "google"}