{"Type": "", "Time": "2021-06-15", "Headline": "Naftali Bennett, Israel's new PM, Middle East News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.JERUSALEM • Mr Naftali Bennett is a multi-millionaire former tech entrepreneur who made his political name with hardline religious-nationalist rhetoric.A former defence minister and one-time special forces commando, Mr Bennett, 49, leads the right-wing Yamina party, which has called for Israel to annex parts of the occupied West Bank.He is Israel's first premier to lead an openly religious lifestyle, with his small skullcap, or kippa, fastened to his head.Mr Bennett shares this ideology with former prime minister Benjamin Netanyahu, having served in several of the latter's governments. But in recent years, tensions between the two arose and intensified.Mr Bennett lives with his wife Gilat and four children in the central city of Raanana.The son of US-born parents, Mr Bennett speaks perfect English, is ultra-liberal on the economy and takes a hardline stance against Israel's arch-foe, Iran. He entered politics after selling his tech start-up for US$145 million in 2005, and became chief of staff the next year to Mr Netanyahu, then in the opposition.After leaving Mr Netanyahu's office, Mr Bennett in 2010 became head of the Yesha Council, which lobbies for Jewish settlers in the West Bank.In 2012, he took charge of the hard-right Jewish Home party, which was facing annihilation. He increased its parliamentary presence fourfold, while making headlines with a series of incendiary comments about Palestinians.In 2013, he said Palestinian \"terrorists should be killed, not released\". He also argued that the West Bank was not under occupation as \"there was never a Palestinian state (in the area\", and that the Israeli-Palestinian conflict could not be resolved but must be endured.Last year, in opposition and with Covid-19 raging, Mr Bennett dampened his right-wing rhetoric to focus on the health crisis. He moved to broaden his appeal by releasing plans to contain the pandemic and aid the economy.Former supporters and critics have accused him of betraying his nationalist voters by joining a fledgling coalition that includes the dovish Meretz party and support from the Arab Israeli Islamic conservative party Raam. But he said he is on a mission to restore Israel's governance and avoid a fifth election in little more than two years.\"The core promise of these elections was to extract Israel from chaos. I chose what's good for Israel,\" he said.AGENCE FRANCE-PRESSEJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/middle-east/naftali-bennett-israels-new-pm", "Source": "google"}