{"Type": "Business", "Time": "2021-06-15", "Headline": "Private-sector economists raise Singapore’s 2021 growth forecast again to 6.5%: MAS survey", "Text": "SINGAPORE: Private-sector economists have once again raised their 2021 growth forecasts for the Singapore economy, according to the latest quarterly survey by the Monetary Authority of Singapore (MAS) released on Monday (Jun 14).The 24 economists polled are expecting the economy to grow 6.5 per cent this year, up from theearlier forecast of 5.8 per centand the second upgrade they have made in six months.This is also higher than the 4 per cent to 6 per cent forecast range that the Ministry of Trade and Industry left unchanged last month, citing “heightened uncertainties” arising from the global COVID-19 pandemic.Singapore saw a spike in local community infections in recent months and on May 16 tightened restrictions under what authorities called aPhase 2 (Heightened Alert)in order to stem transmissions. This included increasing the cap on social gatherings to two people, banning dining-in at restaurants and returning to work-from-home as the default.Some of these tightened measures werelifted on Mondayas the number of community cases fell, with the limit on group sizes back up to five people. If the situation remains under control, dine-ins will once again be possible from Jun 21.Economists had previously said the temporary move to tighten curbswould not throw the economic recovery off course.In the latest MAS survey released on Monday, they pencilled in year-on-year growth of 15 per cent for the second quarter which lasts from April to June. This is higher than the earlier estimate of 14.6 per cent.For the year ahead, the manufacturing sector remains a key bright spot in the economy.The sector, which makes up about one-fifth of Singapore’s economy, is expected to grow 8.3 per cent, well above the forecast of 4.7 per cent three months ago.The outlook also brightened for the finance and insurance sector at 6 per cent, a slight upgrade from the 5.8 per cent in the previous survey; as well as for non-oil domestic exports which is seen rising 7.5 per cent this year compared with the last 6.9 per cent estimate.The battered construction sector remains on track for a recovery this year, although its growth outlook has been trimmed to 19.3 per cent from 22.5 per cent previously.Among the others with a dimmer outlook, growth for the accommodation and food services sector is now at 6.5 per cent, nearly halving from the 11 per cent expected three months ago.Expectations for private consumption is also down to 5.2 per cent from 7.9 per cent, while wholesale and retail trade is seen rising 4.4 per cent, down marginally from the last 4.5 per cent forecast.The labour market is set to improve marginally as economists expect the unemployment rate to reach 2.7 per cent by the end of the year, compared with the earlier expected 2.9 per cent.An escalation of the COVID-19 situation remained the top downside risk to growth, said the economists. This is followed by geopolitical tensions and a slower-than-expected labour market recovery that could weigh on private consumption.As for upside risks, these include a containment of the pandemic, a stronger-than-expected performance from the manufacturing sector and the possibility of borders reopening for international travel.Further ahead in 2022, the Singapore economy is set to expand by 4 per cent.The MAS survey was sent out on May 25 to close private-sector watchers of the Singapore economy. The findings do not represent the central bank’s views or forecasts, it said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Singapore economy,Monetary Authority of Singapore", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/business/economists-raise-singapore-growth-forecast-2021-15010588", "Source": "google"}