{"Type": "", "Time": "2021-06-15", "Headline": "Young people are experiencing rare cases of heart inflammation after getting coronavirus vaccines", "Text": "Young people who received the Pfizer-BioNTech or Moderna coronavirus vaccines are reporting higher-than-usual rates of heart inflammation and swelling, US health officials said on Thursday.The findings are preliminary and come from a self-reported database of potential side effects. The Centers for Disease Control and Prevention has yet to confirm a link to the vaccines, although researchers are now investigating these incidents of heart inflammation, known as myocarditis, and heart swelling, known as pericarditis.The CDC plans to convene an advisory group to discuss the issue on June 18. Earlier this month, Israel's health ministry said there was a \"probable link\" between Pfizer's vaccine and heart muscle inflammation in young men.In Thursday interviews with Insider, cardiologists and infectious-disease specialists said the potential risk of the vaccine is still tiny compared to the potential damage from getting infected with the coronavirus. Not all experts are convinced there's a link between the events and the shots.\"It's not a no-brainer that there's an association, because the season for getting myocarditis is around now,\" Dr. Lorry Rubin, director of pediatric infectious diseases at Northwell Health's Cohen Children's Medical Center told Insider.A group of viruses called enteroviruses is the most common cause of myocarditis, Rubin said. Those viruses typically circulate in the summer months.\"That's not the sole cause, but that's the most common infectious trigger for myocarditis and that's more of a seasonal infection,\" he said.All three experts also agreed that getting vaccinated, even for young and healthy men and boys, is still the best option.\"You definitely should choose vaccination in that age group because it's safer than wild-type virus infection,\" said Dr. Leslie Cooper, a cardiologist who specialises in myocarditis at the Mayo Clinic.The preliminary data show elevated rates of the heart issues among younger vaccinated people, ages 16 to 24 years old. CDC officials, presenting Thursday at a Food and Drug Administration advisory meeting, shared data that included about 12 million doses given to people in this age range. CDC officials said they would typically expect to see between 10 to 102 cases of these heart events in this group. Instead, 275 confirmed cases have been reported.Most of these cases came after the second dose and were commonly reported in men, according to the preliminary data. The CDC is still in the process of confirming and investigating these self-reported cases. The most common symptoms were chest pain and elevated levels of cardiac enzymes. The vast majority of these cases were short-lived, and at least 81% of people have already fully recovered from their symptoms, according to the data.Even if the cases are linked to the vaccine, experts said the greater risk - by far - is Covid-19. \"We're talking about an incidence of myocarditis from the vaccine that is 100 times lower than the incidence when you actually get the infection,\" Dr. Eliot Peyster, a cardiologist at the University of Pennsylvania, told Insider. \"So, yes it's probably twice as likely as people who don't get the vaccine in a vacuum, but we aren't in a vacuum. We're in a pandemic where young people who get the virus get myocarditis in about 1 in 300 cases.\"Peyster cited a study of college athletes, which showed that roughly 1 in 300 of these young and healthy adults had myocarditis after recovering from Covid-19. The exact incidence rate among younger people who got the Covid-19 vaccine is still being determined, CDC officials said Thursday. The agency will have more data to present at another meeting next Friday. The Pfizer and Moderna shots are both messenger RNA vaccines, a new technology that has not been used in a federally approved medicine before the pandemic. Despite its newness, experts said they don't think these cases stem from something unique to the technology itself. Instead, Peyster said he would guess it's from the robust inflammatory response people have from the vaccine, particularly after the second dose.\"Any systemic inflammatory condition, any kind, can generate enough inflammatory stuff where you can actually get a little bit of heart muscle damage just through systemic inflammation,\" he said. While more than 140 million Americans have been fully vaccinated, concerns about younger people come as the vaccines start to be used in younger and younger populations. Pfizer's vaccine was OK'd last month for children as young as 12 years old. Moderna applied for a similar authorisation on Thursday. Not enough shots have been given and tracked in the 12-to-15-year-old population to know yet if these heart side effects could be a concern for that age group. Both vaccine developers are testing their shots in even younger children, all the way down to six-month-old babies. Northwell Health's Rubin said he doesn't think there's reason for concern among parents deciding whether or not to get their children vaccinated.\"We don't know if there's a causal relationship, and it appears that the rate is low given the millions of people in the 12-to-25-year-old age group who have gotten this vaccine,\" he said.Peyster said he expects these heart side effects would decrease among the younger ages. Given the history of myocarditis, he said it's likely the incidence rate will peak with young adults and adolescents. And, overall, for all age groups, medical experts were unequivocal that the vaccine is clearly the best option.\"The evidence says you are much more likely to have heart inflammation from the virus than from the vaccine, even in young healthy people,\" Peyster said. \"Therefore, the clear recommendation is vaccine is better than no vaccine.Get the best of our site delivered to your inbox every day.", "Section": "", "Writers": "", "URL": "https://www.businessinsider.co.za/myocarditis-from-pfizer-moderna-covid-19-vaccines-what-to-know-2021-6", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}