{"Type": "", "Time": "2021-06-15", "Headline": "G-7 commits to one billion extra Covid-19 vaccine doses, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.CARBIS BAY (England) • The Group of Seven (G-7) nations confirmed a promise to deliver at least one billion extra doses of Covid-19 vaccines over the next year, even as they laid out plans to tackle any future pandemic.The vaccine pledge was the most dramatic element of the bloc's effort to work together to bring an end to the Covid-19 pandemic spelled out in a joint communique issued at the end of the three-day summit. But the grouping also cast an eye to the future.It pledged, among other things, to increase early warning systems and to shorten the cycle for the development of safe and effective vaccines from 300 days to 100.United States President Joe Biden said the summit had rallied the world's democracies to deliver on the challenges of the age.\"America is back at the table and fully engaged,\" he told reporters after the summit in south-west England, adding that the North Atlantic Treaty Organisation's mutual defence was a \"sacred obligation\" and that democracies were in a \"contest with autocracies\".On a busy final day, the group of leading economies also agreed to raise contributions to meet an overdue spending pledge of US$100 billion (S$133 billion) a year by rich countries to help poorer ones cut carbon emissions and cope with global warming, but campaigners said firm cash promises were missing.The leaders had strong words for China and Russia. The G-7 condemned Russia for \"destabilising behaviour\", and called on Moscow to pursue hackers carrying out ransomware attacks from its soil.\"We reaffirm our call on Russia to stop its destabilising behaviour and malign activities, including its interference in other countries' democratic systems, and to fulfil its international human rights obligations and commitments,\" the leaders said.The G-7 cited China explicitly on human rights issues in Xinjiang and Hong Kong, but omitted any mention of Beijing in the section on forced labour practices.The G-7 called \"on China to respect human rights and fundamental freedoms, especially in relation to Xinjiang, and those rights, freedoms and high degree of autonomy for Hong Kong enshrined in the Sino-British Joint Declaration and the Basic Law\".Still, the coronavirus was clearly the priority during the summit. The communique said: \"Total G-7 commitments since the start of the pandemic provide for a total of over two billion vaccine doses, with the commitments since we last met in February 2021, including here in Carbis Bay, providing for one billion doses over the next year.\"Many of the doses will flow through Covax, a global vaccine-buying system backed by the World Health Organisation and Gavi, the vaccine alliance.Experts said the plan is a boost to Covax, which has so far distributed only 83 million shots worldwide. Covax has struggled to secure deliveries as wealthy nations reserve enough shots to vaccinate their populations several times over.\"It's going to rescue Covax from its pretty dire predicament right now, so it's a very significant step,\" said Mr Stephen Morrison, director of the Global Health Policy Centre at the Centre for Strategic and International Studies, a think-tank. At the same time, some experts said the commitment falls far short of the five billion to six billion doses needed by poorer nations.BLOOMBERG, REUTERSJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/g-7-commits-to-one-billion-extra-covid-19-vaccine-doses", "Source": "google"}