{"Type": "", "Time": "2021-06-15", "Headline": "Euro 2020: Heart doctor's Twitter thread on Christian Eriksen collapse is eye-opening | GiveMeSport", "Text": "Brought to you by  HeinekenEveryone in football and beyond is praying that Christian Eriksen will make a full recovery from his traumatic collapse during Denmark's Euro 2020 clash with Finland on Saturday night.There is optimism surrounding Eriksen's condition now that he is in the hands of medical officials in Copenhagen having regained conscious before being stretched off the Parken Stadium pitch.The Danish FA confirmed in an official statement on Sunday that the former Tottenham Hotspur midfield was 'stable' and that messages of support will be passed on to him and his loved ones.It read: “This morning we have spoken to Christian Eriksen, who has sent his greetings to his teammates. His condition is stable, and he continues to be hospitalised for further examination.“The team and staff of the national team has received crisis assistance and will continue to be there for each other after yesterday’s incident.\"We would like to thank everyone for the heartfelt greetings to Christian Eriksen from fans, players, the Royal Families from both Denmark and England, international associations, clubs etc.“We encourage everyone to send their greetings to the Danish FA, where we will make sure they are all passed on to Christian and his family.”Seeing such a fit and healthy 29-year-old suffering such a harrowing medical incident during an athletic performance has undoubtedly been a traumatic and affecting moment for everyone involved.And if any good can come from the upsetting scenes that transpired in the Danish capital then it's the hope of greater awareness surrounding cardiological health.Euro 2020: News, Groups, Fixtures, Dates, Tickets, Odds And Everything You Need To KnowAfter all, there's good reason to think that Simon Kjær's proficiency in CPR and knowledge of the recovery position was integral in saving Eriksen's life.And that's exactly why a viral Twitter thread by cardiologist Sadi Raza is so important, highlighting some of the potential details around Eriksen's condition and explaining what we can all do if - forbid - any such incident were ever to happen around us.It makes for an educational and sobering read, so be sure to join the thousands of Twitter users who have already given it their attention by checking out the full thread down below:Life really is fragile and it is so important that we all have a basic understanding of first aid in the unlikely scenario that our assistance might be required.Besides, the conduct of the medical team as well as both the Danish and Finnish squads was nothing short of heroic in what will endure as one of football's most traumatic ever incidents.It's incredibly positive to hear that Eriksen is now on the mend and no doubt he would be greatly buoyed by the idea of what happened to him raising awareness about heart health and first aid.If just one person is more educated on CPR because of Saturday night's events, then the legacy of Eriksen's collapse could well be a life-saving one. Get well soon, Christian.The world's ninth-fastest journalist. Interviewed Sir Mo Farah, Dina Asher-Smith, Eliud Kipchoge and Katarina Johnson-Thompson. Author of such literary classics as 'Ranking every Premier League manager by how good they'd be on a night out'.Once you have subscribed we will use the email you provided to send you the newsletter. You can unsubscribe at any time by clicking the unsubscribe link at the bottom of the newsletter email.© 2021 Sports New Media Limited. All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.givemesport.com/1706579-euro-2020-heart-doctors-twitter-thread-on-christian-eriksen-collapse-is-eyeopening", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}