{"Type": "", "Time": "2021-06-15", "Headline": "UEFA threatened Denmark with 3-0 forfeit if they did not resume Euro 2020 clash after Eriksen cardiac arrest, claims Schmeichel | Goal.com", "Text": "Peter Schmeichel has claimed that UEFA threatened Denmark with a 3-0 forfeit if they did not resume their opening Euro 2020 fixture after Christian Eriksen's cardiac arrest.Denmark's Group B clash against Finland in Copenhagen on Saturday was initially suspended after 41 minutes following Eriksen's on-field collapse.The midfielder received life-saving CPR before being taken to hospital, with both sets of players subsequently spending an hour in their respective dressing rooms before the match was restarted at 7:30pm BST (2:30pm ET).UEFA released a statement confirming that the game would be completed on the same day after consulting with the Denmark and Finland squads following the news that Eriksen was in a stable condition in hospital.However, Schmeichel says his country were also warned that they would lose the match by default if they decided against choosing to continue on Saturday or at 12pm BST (7am ET) the following day.The former Denmark goalkeeper, whose son Kasper played in goal against Finland, told   Good Morning Britain   : \"I actually saw an official quote from UEFA yesterday saying that they were following the advice of the player, the players insisted on playing - I know that not to be the truth.\"Or, it's how you see the truth. They were left with three options, one was to play immediately and get the last 50 minutes played.\"The next one was to come in yesterday at 12 noon and finish the 50 minutes and the third option was to forfeit the game, 3-0.\"So, work it out for yourself. Is it the players' wish to play? Did they have any choice really? I don't think they had.\"As you can hear from yesterday's press conference, the coach, he seriously regrets putting the players back on to the pitch.\"As Schmeichel referenced, Denmark head coach   Kasper Hjulmand has expressed regret over the decision  to recommence the match so soon after Eriksen's collapse.He told reporters: \"I think it was the wrong decision to make between the two scenarios. It was very tough for the players. They didn't even know if they could probably lose their best friend.\"I have the feeling that we shouldn't have played and it's wrong that the players had to decide.\"Denmark's team doctor Morten Boesen was also present to address the media and, although he was able to confirm that Eriksen's heart stopped beating momentarily on the pitch, he refused to speculate on how close he might have been to death.“He was gone and we did cardiac resuscitation. It was cardiac arrest,\" he said. \"How close were we? I don’t know. We got him back quite fast. I'm not a cardiologist so I'll leave the analysis to experts.\"", "Section": "", "Writers": "", "URL": "https://www.goal.com/en-ae/news/uefa-threatened-denmark-with-3-0-forfeit-if-they-did-not/1cynq41n01bd51xtlhqqvtojlk", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}