{"Type": "", "Time": "2021-06-15", "Headline": "Evidence mounts Wuhan lab studied live bats despite denials", "Text": "\n        Show Ad\n      Evidence that includes newly unearthed Chinese government video continues to mount indicating the Wuhan Institute of Virology studied live bats in its lab, despite longtime lab collaborator Peter Daszak calling this a “conspiracy theory.\"Footage obtained and released by the Australian and Sky News was purportedly shot from inside the Wuhan lab and shows live bats kept in cages. The video was reportedly produced and released by the Chinese Academy of Sciences in 2017 to tout the opening and launch of the Wuhan lab’s then-new biosafety level four laboratory. The apparently Chinese state-produced video shows multiple bats in a cage, a researcher wearing a mask and gloves holding a bat and feeding it a worm, video of researchers in personal protective equipment out searching for and collecting bats, and a bat hanging off of a researcher’s hat as the person wears glasses and a surgical face mask.The video was reportedly dug up by an online group that calls itself “DRASTIC” or the Decentralized Radical Autonomous Search Team Investigating COVID-19.In the video, Song Donglin, deputy director of the Wuhan BSL-4 lab, says, “China had no prior experience designing or contracting BSL-4 laboratories. There was no prior experience in using and managing autoclave sterilizers nor life-support systems for personnel.”A voiceover states: “Over more than a decade, Shi Zhengli’s research team has collected more than 15,000 bat samples in China and many countries of Africa, searching for the origins of SARS, as well as isolating and characterizing many new viruses.”WHO-CHINA COVID-19 ORIGINS TEAM LABELED LAB LEAK CONCERNS 'CONSPIRACY THEORIES'The United States has cast doubt on a joint study conducted early this year. The World Health Organization-China report said a lab leak was “extremely unlikely” and that a jump from animals to animals to humans was most likely.Shi was director of the lab’s Center for Emerging Infectious Diseases and known as “bat woman” for her work with bat coronaviruses. The EcoHealth Alliance received at least $3.7 million from the National Institutes of Health between 2014 and 2020, and Daszak, who has worked with Shi, steered at least $600,000 in NIH funding to the lab, criticized the Biden administration for skepticism of WHO’s findings, and defended China on Communist Party-linked outlets.In December, an article in the Independent reported that “samples from the bats were sent to the Wuhan laboratory for genetic analyses of the viruses collected in the field.”Daszak called this false and a conspiracy theory, saying in a since-deleted December tweet, “Important error in this piece. No BATS were ‘sent to Wuhan lab for genetic analyses of viruses collected in the field.’ That's not how this science works. We collect bat samples, send them to the lab. We RELEASE bats where we catch them!”Simon Boyi Chen, listed as being in the fellowship program in molecular genetic pathology at Stanford Health Care, tweeted in response: “There can be a very big risk for Western scientists to automatically assume that Chinese labs operate by the same practices and standard operating protocols that they do.”Daszak then tweeted back, “This is a widely circulated conspiracy theory. This piece describes work I'm the lead on & labs I've collaborated with for 15 years. They DO NOT have live or dead bats in them. There is no evidence anywhere that this happened.”Daszak seemed to concede months later that the Wuhan lab may have had live bats after all, admitting he hadn’t asked about it when the WHO-China team visited the laboratory.Jason Tetro of the Super Awesome Science Show tweeted: “A new angle for the lab leakers has been the alleged presence of ‘bat rooms’ in the WIV BSL4 … Any chance you can simply point out that the animal husbandry BSL4 is in Harbin and not WIV?”Daszak replied: “You're right, labs in US & around world are trying to keep bats to test viral immune responses etc. None are successfully doing this at scale like lab mice & animals are always screened virus-free before experiments, so even if WIV were trying this, it's prob irrelevant for origins ... I also think it's in the WHO report (annexes) that they were working with animals in WIV at BSL-4, just like US labs.”Tetro tweeted on June 1: “It's in the Annexes but perhaps not as explicit as some might like to see. … It's one of the way conspiracy theories work - they take what isn't said and turn it into an accusation of guilt.”Daszak replied: “You're right, but also we didn't ask them if they had bats. I wouldn't be surprised if, like many other virology labs, they were trying to set up a bat colony.”The WHO-China joint team’s numerous annexes totaled 193 pages, but the annex on its Feb. 3, 2021, visit to the Wuhan lab is just four pages and does not mention live bats being studied there.A State Department fact sheet in January contended Wuhan lab researchers “conducted experiments involving RaTG13, the bat coronavirus identified by the WIV in January 2020 as its closest sample to SARS-CoV-2 (96.2% similar)” and that the lab “has a published record of conducting ‘gain-of-function’ research to engineer chimeric viruses.” The fact sheet said the lab “engaged in classified research, including laboratory animal experiments, on behalf of the Chinese military.\" The annex made no use of the phrase “gain-of-function” and doesn't mention alleged Chinese military collaboration. The State Department fact sheet also said lab workers became sick with COVID-19-like symptoms in autumn 2019.The WHO-China team contended that Shi “gave an extensive scientific report on her team’s work on bat coronaviruses.”Shi also claimed in the annex that “all fieldwork is done with full PPE.” But Shi previously admitted her team did not always use full protective gear.Peter Ben Embarek, head of the WHO’s international team, admitted in late February that “we didn’t do an audit of any of these labs, so we don’t really have hard facts or detailed data on the work done.\"Further evidence that the Wuhan lab was studying live bats was laid out by Taiwan News in February.An archived website from the Chinese Academy of Sciences Laboratory Animal Resources stated: “The Wuhan Institute of Virology … has 126 cages for Japanese white rabbits, 340 cages for SD and Wistar rats, inbred strains, closed groups, mutant strains, and genetically engineered mice. There are 3268 cages, 12 ferrets, 12 bats, and 2 species of cotton bollworm and beet armyworm, totaling 52 strains.”CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINERAn article in Sixth Tone from May 2018 on China's bat caves included a passage about Wuhan lab researcher Luo Dongsheng, saying: “Their one-day expedition to Taiyi Cave — a cavern 2,200 meters deep, located 100 kilometers south of Hubei’s provincial capital, Wuhan — is less about the bats themselves than the viruses they carry … By 8:30 p.m., Luo’s team has collected a full rack of swabs and bagged a dozen live bats for further testing back at the lab.”An article in China’s Science Times quoted Wuhan lab researcher Zhang Huajun as saying, “The research team captured a few bats from the wild to be used as experimental animals. They need to be fed every day. This Spring Festival, the students went home for a holiday, and Teacher Shi silently undertook the task of raising bats.”And a patent apparently filed by the Wuhan lab in 2018 and granted in 2019 was for “a kind of carnivorism bat rearging [sic] cage” with an abstract describing it, “The utility model discloses a kind of carnivorism bat rearging [sic] cages … The utility model makes bat being capable of healthy growth and breeding under artificial condition.”Washington Examiner VideosTags: News, Wuhan Lab, China, Donald Trump, Joe Biden, CoronavirusOriginal Author: Jerry DunleavyOriginal Location: Evidence mounts Wuhan lab studied live bats despite denialsTerry Moran reports on what lead researchers are learning about COVID-19 while studying inside the Wuhan Institute of Virology.Most scientists say they believe the virus emerged naturally, but U.S. intelligence says secret research may have taken place at the lab.Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.Indian American journalist Megha Rajagopalan won the 2021 Pulitzer Prize on Friday for her coverage of China’s detention camps in Xinjiang.  The recognition: Rajagopalan won the award for International Reporting with Alison Killing and Christo Buschek for BuzzFeed News, the first for the website since its founding in 2012.  Rajagopalan, according to BuzzFeed News, was the first to visit an internment camp in 2017, at a time when the Chinese government reportedly denied the existence of such places.China's government said Tuesday no abnormal radiation was detected outside a nuclear power plant near Hong Kong following a news report of a leak, while Hong Kong's leader said her administration was closely watching the facility.  The operators released few details, but nuclear experts say based on their brief statement, gas might be leaking from fuel rods inside a reactor in Taishan, 135 kilometers (85 miles) west of Hong Kong.  A foreign ministry spokesman in Beijing, Zhao Lijian, gave no confirmation of a leak or other details.The U.S. government has started extending financial incentives and other enticements to countries severing ties with China's Huawei Technologies Co., Ltd and ZTE Corp (OTC: ZTCOF) that allegedly pose national security risks, the Wall Street Journal reports. What Happened: The U.S. foreign-affairs agencies are developing workshops and a handbook to guide Central and Eastern Europe and other developing countries' policymakers to build next-generation 5G cellular networks with non-Chinese equipmentGet a $200 checking bonus when you apply for an eligible checking account online in minutes with qualifying direct deposits. Learn more.Shi Zhengli questioned how she can ‘offer up evidence for something where there is no evidence’The worst thing for China is for America and its allies to get their act together. Biden is doing that in Europe and the Senate is backing him up.The Hambantota port on Sri Lanka’s southern shore has long provided a cautionary tale of just what can go wrong when countries become involved in China’s Belt and Road Initiative. Built at a cost of $1.3bn (£920m) and funded by Chinese loans, ministers in Colombo struck a deal to sell an 80pc stake in the port to a state-controlled Chinese group just six years after it opened. A little over a year later, Sri Lanka handed over the port to China on a 99-year lease. China’s playbook is familiar atSearch for control scalp psoriasis. These treatments for scalp psoriasis are more affordable than everCalifornia, the first state in America to put in place a coronavirus lockdown, is now turning a page on the pandemic.MANILA/WASHINGTON (Reuters) -The Philippines has again suspended a decision to scrap a crucial agreement governing the U.S. troop presence in the country, its foreign minister said on Monday, amid continuing maritime pressure from China.  The Pentagon welcomed the announcement from Manila - the third suspension of the decision covering the two-decade-old Visiting Forces Agreement (VFA) that had been due to expire in August - but analysts said there would be disappointment in both countries that it was not renewed.  Philippine Foreign Minister Teodoro Locsin said the suspension would be for a further six months while President Rodrigo Duterte \"studies, and both sides further address his concerns regarding, particular aspects of the agreement\".As the delta variant of the coronavirus spreads in southeastern China, doctors say they are finding that the symptoms are different and more dangerous than those they saw when the initial version of the virus started spreading in late 2019 in the central city of Wuhan. Patients are becoming sicker, and their conditions are worsening much more quickly, doctors told state-run television Thursday and Friday. Four-fifths of symptomatic cases developed fevers, they said, although it was not clear howCut your monthly payment while rates are low. Free Quotes. Wont affect your credit. Calculate New Payment. (1.97% APR)Evacuations were ordered near the plant, owned by Chemtool Inc., which produces greases, lubricants, metal working fluids and cleaners.In 326 BC, on the banks of the Hydaspes (the modern Jhelum River in Pakistan), Alexander the Great’s horse died, either from wounds or old age; as ever in ancient history, the stories vary. A tomb was built, and the Macedonian founded a city, Bucephala, named after his charger. In AD 1830, at Bushehr on the Persian Gulf, one Charles Masson claimed that during his travels in India he had found the lost city, complete with gigantic equine burial mound. It was a barefaced lie – the site of BucephalIf animals can’t adapt to natural noises, can they live near humans?VoIP phones could have you trading in your current phone faster than you think. Take a look at VoIP now!Wimbledon will be allowed to have a full crowd of 15,000 at Centre Court for the men's and women's finals, a year after the tournament was canceled entirely because of the pandemic.TOKYO (Reuters) -Oil prices rose on Tuesday, with Brent gaining for a fourth consecutive session, as the prospect of extra supply coming to the market soon from Iran faded with talks dragging on over the United States rejoining a nuclear agreement with Tehran.  Brent crude was up by 38 cents, or 0.5%, at $73.24 a barrel by 0651 GMT, having risen 0.2% on Monday.  U.S. oil gained 33 cents, or 0.5%, to $71.21 a barrel, having slipped 3 cents in the previous session.The UK government has delayed plans to lift the remaining COVID-19 restrictions in England.Prime Minister Boris Johnson made the announcement on Monday, citing the highly contagious Delta variant spreading rapidly throughout the country.He warned that thousands more people might die if he did nothing.It means pubs, nightclubs, restaurants and other venues won't be allowed to fully reopen for another four weeks.The final stage of lockdown had been due to end on June 21, under a plan laid out by Johnson in February.Johnson said more time was needed to fully assess the risk of reopening.\"We will monitor the position every day and if after 2 weeks we have concluded that the risk has diminished, then we reserve the possibility of proceeding to Step 4 and a full opening sooner. As things stand - and on the evidence that I can see right now - I am confident we will not need more than 4 weeks and we won't need to go beyond July 19th... But now is the time to ease off the accelerator because by being cautious now we have the chance - in the next four weeks - to save many thousands of lives by vaccinating millions more people.\"The Delta variant, first detected in India, has sparked a recent resurgence of COVID-19 cases in Britain.Health officials believe it is 60% more transmissible than the previously dominant strain, and fear it could lead to hospitals being overwhelmed again.The extra time under lockdown will also be used to speed up Britain's vaccination programme, by shortening the suggested time between doses from 12 weeks to eight.Britain currently has one of the fastest vaccine rollouts in the world.Over 41 million people have received their first dose and nearly 30 million have had both, around 57% of the adult population.Homeowners should read this! This technique uncovers how much you should actually pay for home insurance.The European Union and the United States were on the verge of announcing a truce on Tuesday in their 17-year conflict over aircraft subsidies, bringing to a close one set of Trump-era tariffs which had soured relations between them.  The two sides have been battling since 2004 in parallel cases at the World Trade Organization over subsidies for U.S. planemaker Boeing and European rival Airbus.  They agreed in March to a four-month suspension of tariffs on $11.5 billion of goods from EU wine to U.S. tobacco and spirits, which they had imposed in response to the row.Why did the Bruins continue to start Tuukka Rask against the Islanders despite the goaltender's injury? Head coach Bruce Cassidy explained his thought process.Cortisol is a powerful hormone, people.", "Section": "", "Writers": "", "URL": "https://news.yahoo.com/evidence-mounts-wuhan-lab-studied-193700731.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}