{"Type": "", "Time": "2021-06-15", "Headline": "Singapore Regulator Reprimands AIA, Aviva and Prudential - Bloomberg", "Text": "Singapore’s financial regulator reprimanded the local entities of AIA Group Ltd., Aviva Plc and Prudential Plc for breaching requirements related to risk management and supervisors’ pay.The Monetary Authority of Singapore found numerous instances where supervisors at these firms were paid in contravention of requirements under the Financial Advisers Act, relating to the sale of investment products and premium life policies, it said in a statement on Tuesday.MAS also reprimanded Peter Tan Shou Yi, a consultant engaged by Aviva in Singapore, for accepting remuneration in breach of regulatory requirements, and the insurance firm’s local Chief Executive Officer Chee Boon Chai Lionel, for his failure to discharge the duties of his office.“Our requirements on remuneration practices relating to the sale of investment and life insurance products aim to promote good sales conduct in the financial advisory industry,” MAS Deputy Managing Director Ho Hern Shin said in the statement. “We have dealt firmly with these financial institutions and individuals who have breached our regulations, to send a clear message to the industry on the importance of upholding high ethical standards.”MAS ordered Aviva Financial Advisers Pte Ltd. to appoint an independent external team to conduct a holistic review of the company’s internal control processes, and to perform call-backs to all customers before any sales are completed. These measures are still in place.A reprimand registers the authority’s serious concerns regarding the misconduct, requiring the involved parties to remediate the issues promptly, a MAS spokesperson said in a separate email after the statement. The authority may also take the reprimands into account when considering actions to be taken against the entities and individuals for any future contravention, the spokesperson said.", "Section": "", "Writers": "", "URL": "https://www.bloomberg.com/news/articles/2021-06-15/singapore-financial-regulator-reprimands-aia-aviva-prudential", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}