{"Type": "Asia", "Time": "2021-06-15", "Headline": "Bangkok hospitals postpone COVID-19 shots, citing vaccine shortages", "Text": "BANGKOK: Thailand'srecently launched coronavirus vaccination campaignwas hit by confusion in the capital on Monday (Jun 14) after at least 20 hospitals in Bangkok postponed COVID-19 inoculation appointments set for this week, citing delays in vaccine deliveries.The hospital announcements were made on their Facebook pages, while Bangkok's vaccine booking app also sent messages saying appointments after Tuesday would be delayed, as officials sought to reassure the public over vaccine supplies.\"There may have been confusion because private hospitals did not check with the Bangkok administration,\" health minister Anutin Charnvirakul told reporters on Monday, adding that more doses were being delivered to Bangkok.Thailand's main vaccine drive is depending on 61 million shots from AstraZeneca, produced by Siam Bioscience, a company owned by the country's powerful king.There have been concerns about a possible shortfall in production, with several countries in the region reporting delays in orders of Thai-made shots.AstraZeneca and Siam Bioscience have not responded to Reuters requests for comment on production delays, though the Anglo-Swedish drugmaker said it was working with Southeast Asia's governments on vaccine deliveries..Thailand currently offers AstraZeneca and China's Sinovac shots.\"We are not slowing down vaccinations, but there should be a calculation of the doses received,\" Anutin said.In a separate briefing, Bangkok governor Aswin Kwanmuang said there had been some \"technical errors\" in delivery of vaccines and the city had notified those who registered between Jun 15-21.\"We will vaccinate as quickly as possible once we receive the vaccines,” said Aswin.Thailand has recorded a total of 199,264 COVID-19 infections and 1,466 deaths. Over 80 per cent of the new cases and 90 per cent of fatalities have been reported after April, putting pressure on authorities to speed up vaccinations.So far, 1.6 million people out of a population of more than 66 million are fully vaccinated, below the rates achieved by some neighbours.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Bangkok,COVID-19,vaccine,Thailand", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/bangkok-hospitals-postpone-covid-19-shots--citing-vaccine-shortages-15011402", "Source": "google"}