{"Type": "", "Time": "2021-06-15", "Headline": "\nG7 leaders discuss Wuhan lab leak theory behind COVID-19 pandemic - The Hindu\n", "Text": "\nBritain's Foreign Secretary Dominic Raab on the sidelines of G7 summit in Carbis Bay, Cornwall, Britain, June 11, 2021\n  | Photo Credit: \nReuters\n  World leaders gathered at the G7 Summit in Cornwall discussed the possibility that a laboratory leak in central China's Wuhan city may have a connection with the start of the COVID-19 pandemic, with the World Health Organisation (WHO) chief saying all hypotheses behind the origins of the deadly disease remain in play.UK Foreign Secretary Dominic Raab said that officials \"compared notes\" over the theory that the pandemic may have originated from a leak from a lab in Wuhan, calling for further investigations. However, he asserted that the UK's \"best information\" remained that it \"jumped\" from animals to humans but admitted they did not have \"all the answers\".\"That's why internationally we wanted the review to be able to go into China to get all the answers, so that we have the full picture rather than these possible, potential, plausible options,” Mr Raab told ‘Sky News’ on Sunday when asked about the issue.\"But, on balance, we do not believe that it came from a laboratory. We think it is much more likely to have jumped from animal species,\" he said.WHO Director-General Dr Tedros Adhanom Ghebreyesus told reporters on Saturday that the theory was raised during a formal session at the G7 summit in Cornwall dedicated to health matters and that identifying the source of the pandemic was a core part of showing respect to the millions of people around the globe who have died from the deadly virus.\"Yes, it was raised, and we discussed about the origins,\" he said in response to a question. \"The first phase of the origin study was not conclusive so there are four hypotheses, but [it’s] not conclusive yet. So we believe that all four hypotheses should be open, and we need to proceed with the second phase, to really know the origins,” said Dr Ghebreyesus. \"As you know, more than 174 million people have been confirmed for COVID illness. This is actually an underestimate, it could be more. And so far, close to 3.75 million people have died. This is very tragic and I think the respect these people deserve is knowing what the origin of this virus is so that we can prevent it from happening again,\" he said, stressing on the importance of “cooperation from the Chinese side\".The origins of the COVID-19 remain a widely debated topic, with some scientists and politicians maintaining that the possibility of a lab leak of the deadly virus exists.China's Wuhan Institute of Virology (WIV) is near the outbreak's known epicentre of Huanan Seafood Market in Wuhan, where the virus first emerged in late 2019 and became a pandemic. More than 175 million confirmed cases have since been confirmed worldwide and at least 3.79 million deaths reported. China has been accused of withholding raw data and access to sites that would aid deeper investigation into how the virus came into being, and how it first spread. Scientists believe that the virus is likely to have passed from animals to humans, but there remains a possibility that it may have escaped from the Wuhan Institute of Virology, which investigates other coronaviruses. US President Joe Biden last month directed the country’s intelligence agencies to report in the next three months on whether COVID-19 emerged from an animal or during a laboratory accident. However, Beijing has maintained there is no connection between the pandemic origins and the Wuhan lab and sought to dismiss the issue of a possible leak as an “absurd story”.China asserts that the COVID-19 broke out in different places in the world and China only reported the virus first. \n\n\n\n\n Our code of editorial valuesPlease enter a valid email address.\nPrintable version | Jun 15, 2021 10:40:51 AM | https://www.thehindu.com/news/international/g7-leaders-discuss-wuhan-lab-leak-theory-behind-covid-19-pandemic/article34804805.ece\n\n© THG PUBLISHING PVT LTD.\n\nA video on the protests in Budapest against the building of a Fudan University campus in the city\n\nDiplomatic Affairs Editor Suhasini Haidar discusses what led to the country's current vaccine crisis\n", "Section": "", "Writers": "", "URL": "https://www.thehindu.com/news/international/g7-leaders-discuss-wuhan-lab-leak-theory-behind-covid-19-pandemic/article34804805.ece", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}