{"Type": "", "Time": "2021-06-15", "Headline": "Covid: Lockdown easing in England delayed to 19 July - BBC News", "Text": "By Becky MortonBBC NewsThe final stage of easing lockdown restrictions in England is to be delayed until 19 July.It means most remaining curbs on social contact will continue beyond 21 June, when they had been due to be lifted. The limit on wedding guest numbers will be removed but venues will still have to adhere to other rules. Prime Minister Boris Johnson said there would be a review after two weeks and he was \"confident\" the delay would not need to be longer than four weeks.However, he told a Downing Street press conference he could not rule out the possibility the date could be pushed back further.Scientists advising the government had warned of a \"significant resurgence\" in people needing hospital treatment for Covid-19 if stage four of easing the lockdown went ahead on 21 June.It comes amid rising cases, driven by the more transmissible Delta variant, which was first identified in India.  Mr Johnson said going ahead with stage four on 21 June would mean \"a real possibility\" of the virus outrunning the vaccines, leading to thousands more deaths which could otherwise have been avoided. The delay would give the NHS \"a few more crucial weeks\" to get people vaccinated, he said, adding that while the link between infections and hospital admissions had been \"weakened\" it had not been \"severed\".\"We will monitor the position every day and if, after two weeks, we have concluded that the risk has diminished, then we reserve the possibility of proceeding to step four and a full opening sooner,\" he said.\"At a certain stage, we are going to have to learn to live with the virus and to manage it as best we can,\" he added.Addressing MPs in the Commons later, Health Secretary Matt Hancock said the decision not to ease restrictions next week was being made with a \"heavy heart\" but the government's four tests for easing restrictions - one of which is that the risks are not fundamentally changed by new variants - had not been met.He said extra testing facilities and access to vaccines would be rolled out in more areas of the country, while vaccinations would be opened up on Tuesday in England to people aged 23 and 24.The delay means limits remain on how many people can meet, with groups of up to 30 allowed to meet outdoors and up to six people or two households allowed indoors. However, 15 coronavirus pilot events will continue as planned, including some upcoming Euro 2020 games, Wimbledon and arts and music performances. Attendees will have to show proof of vaccination or a recent negative test. Capacity limits will continue at other venues and nightclubs will stay closed. Advice to work from home where possible will remain in place.The extension of restrictions will be put to a Commons vote, which could trigger a sizeable Conservative backbench rebellion, with a debate expected on Wednesday. Mr Johnson said two-thirds of adults would have been offered two coronavirus jabs by 19 July, including all vulnerable groups. The gap between doses for over-40s in England will be reduced from 12 to eight weeks. And the target to offer all adults a first dose will be brought forward to 19 July. It comes as new analysis by Public Health England shows two doses of either the Pfizer or AstraZeneca vaccine are highly effective at preventing hospital admissions from the Delta variant.PHE said the effectiveness was comparable to against the Alpha variant which was previously dominant in the UK. The size of a future surge in infections is uncertain because questions remain about the Delta variant, vaccines and people's behaviour once rules are relaxed. The Scientific Pandemic Influenza Group on Modelling (SPI-M) said a third wave could range from \"considerably smaller than January 2021 to considerably higher\". It said even a short delay to easing the restrictions would lead to a significant drop in the number of Covid patients in hospital as more people were vaccinated and the school holidays got closer, reducing transmission. Scientists have advised the government delaying by four weeks would reduce the peak in hospital admissions by between a third and a half.The government's chief scientific advisor Sir Patrick Vallance said there would still be an increase in numbers and an increase in hospitalisations \"because that's what happens when there's more mixing\".Labour's shadow health secretary Jonathan Ashworth said the public had been \"let down by ministerial incompetence and indecision\". \"The only reason this delay is being introduced is because the Conservatives failed to secure the country's borders and a new variant from overseas was allowed to take hold; and failed to put in measures like proper sick pay support and surge vaccinations when needed,\" he said. There are plenty of benefits to delaying the full unlock. More vaccinations will be done and the impact of this wave in terms of hospitalisations will be reduced.We could also see the rise in infections slow as the initial surge meets the wall of immunity already built up by the vaccination campaign.But make no mistake the coming weeks will see a real resurgence of Covid.Infection levels are already climbing steeply and modelling suggests there could be 1,000 hospital admissions a day by the middle of summer.That is the same number that the NHS would normally see for all types of respiratory illness in the depths of a bad winter.The proportion of people dying should be much much lower than it was in previous waves though thanks to the protective effect of vaccines.But the alternative would be a reintroduction of restrictions. It is a price worth paying, the government believes.The Night Time Industries Association said the delay to the roadmap was a \"devastating blow\" that would \"drive down confidence in the sector to a new low\", forcing more workers to leave the industry. Julian Bird, chief executive of the Society of London Theatre and UK Theatre, said thousands of jobs were \"hanging in the balance\", with venues no longer able to increase their capacity as planned. Many pubs and restaurants are also trading at a loss because of social distancing measures. Industry trade body UKHospitality called for additional financial support for affected businesses, saying the delay would cost the sector around £3bn in sales.The government has said it will not extend the furlough scheme or other financial support further, despite the delay to the unlocking roadmap. Under the furlough scheme, the government covers up to 80% of an employee's salary for the hours they cannot work because of the pandemic. The scheme is due to run until the end of September but employers will have to help cover the cost from July. Some Tory MPs were also critical of the delay, with senior backbencher Sir Robert Neill saying a few weeks made \"the difference between survival or closure for some businesses\". The rise in cases in the UK is being driven by the Delta variant, first identified in India, which is believed to be around 60% more infectious than the previous dominant variant and twice as likely to result in hospital admissions.On Monday, the UK has recorded 7,742 new cases of Covid-19 and three deaths within 28 days of a positive test.The seven-day average for cases in the UK is up 46% compared with the seven days before. Plans for easing coronavirus restrictions differ between the four UK nations.All areas of Scotland are due to move to Level Zero Covid restrictions on 28 June - meaning bigger groups can gather in cafes, pubs and restaurants, although they will still have to observe social distancing. Limits on indoor gatherings in Northern Ireland are scheduled to be relaxed on 21 June and the rules in Wales will be reviewed on 25 June.Are you affected by the delay to restrictions easing in England? Email haveyoursay@bbc.co.uk.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of the BBC website to submit your question or comment or you can email us at HaveYourSay@bbc.co.uk. Please include your name, age and location with any submission. Beijing accuses Nato of exaggerating China threatIt comes after a summit of alliance leaders described China's behaviour as a \"systemic challenge\".Ikea France fined €1m for snooping on staffThree things to watch as Biden meets Putin. VideoThree things to watch as Biden meets PutinWhat Putin really wants from BidenThe man dedicating his life to saving pangolins. VideoThe man dedicating his life to saving pangolinsThree things to watch as Biden meets Putin. VideoThree things to watch as Biden meets PutinUnearthing the brutal camps housing allied forcesWhat can cause a cardiac arrest?A quick guide to Ethiopia's electionEurope tools up against US and Asia as a car battery forceHow bad is Nato's climate change problem?The successes and failures of India's vaccine driveFootball phrases15 sayings from around the worldCanadian military leader resigns over golf game1Minneapolis woman killed as car hits protesters2US lawmaker sorry for likening masks to Holocaust3Ikea France fined €1m for snooping on staff4Chrissy Teigen: I was a troll and I'm so sorry5Beijing accuses Nato of exaggerating China threat6Rare orchids found on roof of City of London bank7Houlihan blames burrito for four-year ban8US bans dog imports from more than 100 countries9Airlines report 3,000 unruly passengers in US10© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "Section": "", "Writers": "", "URL": "https://www.bbc.com/news/uk-57476776", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}