{"Type": "", "Time": "2021-06-15", "Headline": "Singapore car marketplace Carro raises $478m to become a unicorn, eyes IPO, Companies & Markets News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE (REUTERS) - Singapore-based car marketplace Carro said on Tuesday (June 15) it has raised US$360 million (S$478 million) in its latest funding round led by SoftBank Vision Fund 2, becoming the region's latest unicorn.\"The valuation for the company is well over a billion dollars,\" CEO and founder of Carro, Aaron Tan, told Reuters. He did not provide a specific number.A unicorn is a privately held start-up valued at over US$1 billion.Carro will use the fresh capital to expand into new locations and grow its business in its existing markets - Indonesia, Thailand, Malaysia, and Singapore. It also plans to expand its portfolio of financial services and accelerate development of artificial intelligence capabilities.Carro's platform allows consumers and wholesale businesses to buy and sell vehicles along with providing insurance and financing services.Other investors in the new round of financing include several prominent Indonesian-based funds including EV Growth, it said.Since being founded in 2015, Carro has raised more than US$400 million in equity and US$200 million in debt. Its previous investors include SoftBank Ventures Asia, EDBI Pte, Insignia Ventures Partners and B Capital Group.The company has started preparing internally for an initial public offering (IPO), Mr Tan said.\"The plan is to IPO the company, hopefully, in the next 18-24 months in the US, depending on whether the market holds,\" he said.While Carro saw an initial decline in business due to the Covid-19 pandemic, like other digital businesses, the company is now benefiting from users shifting to online transactions.\"People are more willing to buy vehicles entirely online without the need to visit a showroom,\" he said.Carro booked revenues of US$300 million for the year ending March 2021 and has registered positive Ebitda (earnings before interest, taxes, depreciation, and amortization) for two years.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/companies-markets/singapore-car-marketplace-carro-raises-478m-to-become-a-unicorn-eyes-ipo", "Source": "google"}