{"Type": "Sport", "Time": "2021-06-15", "Headline": "Soccer-Spain's Luis Enrique rues missed chances but defends game plan", "Text": "SEVILLE, Spain:     Spain coach Luis Enrique rued missed chances from his side in their 0-0 European Championship draw with Sweden on Monday, insisting he will not be changing his style of play despite getting off to a disappointing start in the tournament.It was a familiar story for Spain, who enjoyed 85per cent possession in Seville, the highest figure for a team in a European Championship fixture since 1980 when Opta started recording the data.\"We were by far the better team, the opposition tried to hang back, we completely controlled the game and tried to generate as many chances as possible,\" Luis Enrique told a news conference.\"We were up against a physically strong team. We did have the chances to win the game. What went wrong was that we did not take these chances.\"The Spain coach was also keen to stress that there was no need to panic. Spain have enjoyed just one win in their last six opening matches at a major tournament, a 1-0 victory against the Czech Republic at Euro 2016.There will be no change in system either, even though Spain's possession amounted to little end product in Seville, with top spot in Group E remaining the target.\"Of course, there are two games to go and we still aspire to win the group,\" Luis Enrique added. \"If we cannot do that we will try to come second.\"I am not going to change the plan before the match against Poland (Spain's next game). We try to play the same way in every match, we are going to be prepared and we try to give our best.\"Spain play Poland on Saturday.(Reporting by Peter Hall, editing by Ed Osmond)It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "rue,sports,Luis Enrique,Spain", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/soccer-spain-s-luis-enrique-rues-missed-chances-but-defends-game-plan-15016106", "Source": "google"}