{"Type": "", "Time": "2021-06-15", "Headline": "Korean heartthrob Park Seo-joon tipped to star alongside Brie Larson in ‘Captain Marvel’ sequel | Showbiz | Malay Mail", "Text": "Loading...Tuesday, 15 Jun 2021 01:51 PM MYTBY TAN MEI ZI\n\nKorean news portals are reporting that Park has landed a role in the ‘Captain Marvel’ sequel. — Pictures via Instagram/bn_sj2013 and Instagram/captainmarvelofficial\n\nFollow us on Instagram and subscribe to our Telegram channel for the latest updates.PETALING JAYA, June 15 — Korean actor Park Seo-joon is reportedly the latest addition to the cast of the upcoming superhero film The Marvels.Industry insiders claim that Park, 32, will be flying to the United States in the second half of this year to work on the Captain Marvel sequel, based on a report by Korean news portal Star News.Park is currently wrapping up filming for the disaster-thriller movie Concrete Utopia in South Korea.A representative from Park’s agency Awesome ENT kept mum when contacted by Newsen for confirmation on the Marvel film role.“No comment,” said the rep.If confirmed, Park will be the second Korean actor to have a lead role in a Marvel film after Ma Dong-seok in Eternals.The Marvels will see Brie Larson reprising her role as Captain Marvel, Teyonah Parris as Monica Rambeau, and Iman Vellani as Ms Marvel. captain marvel's director is always a fan of park seojoon hahaha..that's right use ur power while also being successful fan pic.twitter.com/h2nSe2KOdt Social media was abuzz with news of Park possibly joining the cast, and some have even shared screenshots of The Marvels director Nia Dacosta expressing her love for the Itaewon Class actor.In a text conversation with a friend, Dacosta called Park her “drama boyfriend.”Loading...© 2021, Malay Mail, All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.malaymail.com/news/showbiz/2021/06/15/korean-heartthrob-park-seo-joon-tipped-to-star-alongside-brie-larson-in-cap/1982335", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}