{"Type": "", "Time": "2021-06-15", "Headline": "Myanmar’s detained Aung San Suu Kyi to face Naypyidaw court | Aung San Suu Kyi News | Al Jazeera", "Text": "Analysts say army chief Min Aung Hlaing determined to sideline hugely popular leader and reshape politics free of her influence.After five years as the de facto leader of Myanmar, Aung San Suu Kyi finds herself in a familiar place: under house arrest while facing an eclectic mix of charges levelled by military rulers, with her party, the National League for Democracy (NLD), on the verge of dissolution.On Monday, more than four months after the military seized power in a coup, the hugely popular politician will face trial in a Naypyidaw court on five charges including the illegal possession of walkie-talkies and breaking coronavirus restrictions while campaigning for elections. Military officials have also accused her of corruption and violating the colonial-era Official Secrets Act.There is a sense of finality about this showdown between Aung San Suu Kyi, and army chief and coup leader, Min Aung Hlaing.At 75 years old, Aung San Suu Kyi is facing prison sentences that could put her in jail for the rest of her life, permanently sidelining her from a political arena she has defined for decades. Meanwhile, many of her supporters have moved beyond her past calls for non-violent resistance and gradual reform, instead endorsing armed revolt and the total overthrow of the military regime.“This time around, there is no indication that the regime plans to release Aung San Suu Kyi, allow her to communicate with her supporters, or use her as a bargaining chip in its relations with the outside world. Rather, Min Aung Hlaing wants to have a free hand to shape the political landscape free from the influence of her and the NLD,” said Richard Horsey, a political analyst with decades of experience in Myanmar.Despite being largely shut off from the outside world for the last four months, she still occupies a central role in the continuing political crisis. Before the generals violently cracked down on protests, killing more than 850 civilians, posters and banners featuring Aung San Suu Kyi’s face were a mainstay at most demonstrations.Analysts say army chief Min Aung Hlaing, right, wants to remove Aung San Suu Kyi and the NLD from the political landscape [File: Myawaddy/AFP]“It’s far too early to write her off. She is, without a doubt, by far the most popular political figure in the country, no one else even comes close,” said Thant Myint-U, historian and author of The Hidden History of Burma.Aung San Suu Kyi emerged as a political force during the 1988 uprisings against a previous military regime, perfectly primed to take the helm of Myanmar’s pro-democracy movement during a period of instability. The daughter of independence icon Aung San, she had just returned from the United Kingdom, where she had studied at Oxford and married a British man.She became synonymous with Myanmar’s pro-democracy movement and earned the respect of millions by sacrificing her freedom and safety for the cause, winning the Nobel Peace Prize in 1991. She spent years in and out of house arrest and survived an assassination attempt in 2003 that left dozens, possibly hundreds, dead. Aung San Suu Kyi’s education and international recognition was also a source of admiration for many of her followers.But while this was a strength in the eyes of many, it was an insult to the ultra-nationalist military, also known as the Tatmadaw, which often insulted the “foreigner’s wife”.In 2008, before allowing elections, the military regime drafted a new constitution that allowed it to retain control of several key institutions and guaranteed it 25 percent of the seats in parliament. It also added a clause banning anyone with a foreign husband or child from serving as president, which many saw as being directly aimed at Aung San Suu Kyi.With the help of a constitutional lawyer named Ko Ni, she found a way around this prohibition, taking on the role of state counsellor after the NLD’s first election victory in 2015. Two years later, Ko Ni was shot dead.But while she was a global superstar as an activist, many of her biggest supporters were disappointed once she was in power.In 2017, hundreds of thousands of mostly Muslim Rohingya fled into Bangladesh as the military unleashed a brutal crackdown in the western state of Rakhine.The Nobel Prize winner did not condemn the military’s actions and, after a case of genocide was brought before the International Court of Justice in The Hague, she travelled to the Netherlands to defend what the generals had done.“Aung San Suu Kyi’s domestic popularity only grew as she transitioned from dissident to national leader. Internationally, she fell spectacularly from grace as a result of the violence against the Rohingya, in which she was seen as complicit by denying the extent of abuses and defending the military,” said Horsey.Aung San Suu Kyi returned home to care for her mother and found herself propelled into politics leading opposition to military rule [File: Manny Ceneta/AFP]Activist and protest leader Thinzar Shunlei Yi is one of many young human rights defenders who grew up idolising Aung San Suu Kyi, only to be let down by her time in power.“She was the reason why I became a woman human rights defender,” she said. But as violence against the Rohingya grew, Thinzar Shunlei Yi became one of the only people to speak out against it, putting her at odds with her hero and her throngs of supporters.“I was outspoken against her and got a lot of backfire,” she said.It was not just during the Rohingya crisis where Aung San Suu Kyi failed to live up to expectations. “She was also seen as deserting her human rights principles when in government in other ways, including her treatment of the free media, civil society and ethnic minority rights,” Horsey explained.When two Reuters journalists were arrested for exposing the military killings of Rohingya civilians, Aung San Suu Kyi said the case “had nothing to do with freedom of expression at all”. During her time in power, journalists and Facebook users faced criminal charges for criticising NLD politicians.With NLD leadership scattered or in prison after the coup, more progressive activists like Thinzar Shunlei Yi found themselves spearheading the initial resistance movement. They called for increasingly radical change, like abolishing the military-drafted constitution of 2008, the complete removal of the military from politics, the reform of the discriminatory 1982 Citizenship Law that helped render the Rohingya stateless, and armed revolution rather than non-violent resistance.These positions were eventually endorsed by the National Unity Government, a parallel government set up by elected legislators in defiance of the military regime. Thinzar Shunlei Yi recognised that Aung San Suu Kyi is still “so influential” in the pro-democracy movement, but also worried that her influence could be double-edged.“Even in this revolution, where many people go starving and running for their lives, people still think about her situation and weep for her,” she said. This can help motivate people even when they are beleaguered and losing hope.But Aung San Suu Kyi might not agree with the armed revolt, abolishing the constitution, or accepting the Rohingya as citizens. “We wonder what if she says something against the current revolution, things would go upside down,” Thinzar Shunlei Yi said.People hold placards of Aung San Suu Kyi in a rally to demand her release and protest against the military coup a week after the generals seized power [File: Stringer/Reuters]While some have argued that Aung San Suu Kyi backed the military on the Rohingya crisis due to fear of a coup or a need to appeal to a nationalist voter base, others say her position simply reflected her genuine beliefs on the issue.“It’s not at all clear that her position on the Rohingya was driven by political considerations,” Horsey said. “But it certainly meant that, at the time of the coup, she had a much-diminished international reputation at a time when she needed international support the most.”Altogether, Aung San Suu Kyi is facing seven criminal charges; five in the capital city of Naypyidaw, one at the Supreme Court and a recently added corruption charge.Her lawyers are among the only people who have had access to the detained leader since her arrest in February. The leader of her legal team, Khin Maung Zaw, told Al Jazeera they met with Aung San Suu Kyi and deposed President Win Myint on June 7. Khin Maung Zaw said the five cases in Naypyidaw were classified as “simple”, with hearings to be held every Monday and Tuesday until the end of the month.For the Supreme Court case, he said the court marked Aung San Suu Kyi down as defending herself, something Khin Maung Zaw said was done “without her knowledge and consent”.“She further said that she told the persons who kept her in custody that she wouldn’t defend her cases without a lawyer,” he said.He said that while Aung San Suu Kyi has not been satisfied with the military’s arrangement to deliver her medicine regularly, she and the other two politicians “seemed to be in good health”.When asked about her spirits, Khin Maung Zaw said, “Unlike me, she’s full of optimism”.On Wednesday, the military revealed new corruption charges against Aung San Suu Kyi for allegedly taking bribes and leasing land at discounted rates, which carry an additional prison sentence of 15 years.Khin Maung Zaw said the latest accusation is “absurd” and “groundless”. “She might have defects but personal greed and corruption is not her traits,” he said, calling her “incorruptible”.Michael Aris, the late husband of Aung San Suu Kyi, stands with their two sons Alexander, left, and Kim, right, at the Nobel Prize ceremony in Oslo Town Hall on December 10, 1991 [Stringer/Reuters]Given the nature of the trials, Thinzar Shunlei Yi calls on Aung San Suu Kyi to “join CDM” by “boycotting the judicial system”. CDM stands for the Civil Disobedience Movement, a mass strike of civil servants refusing to work under the military regime.“I don’t trust the domestic judicial system and I don’t think the [military] will do a fair trial for her and other leaders,” she said.While the outcome of the trial appears inevitable, Thant Myint-U says that what happened in Myanmar was not.“There was no way the army was going to agree to constitutional reform,” Thant Myint-U said. “But a visionary economic agenda that brought in billions in fresh investment and created millions of new jobs, together with measures to fight discrimination, build a more inclusive national identity, and work closely with civil society, could have outflanked the army leadership, and perhaps even won over many in the officer corps.”Al Jazeera takes a look at the leader’s life and how she went from being an icon of democracy to courting controversy.What we know so far about Monday’s coup in Myanmar.Why did Myanmar’s military overthrow the government? And what does it mean for democracy?Machine-gun fire, sleeping in safe houses and waking every morning anxious to find out who has been arrested overnight.Follow Al Jazeera English:", "Section": "", "Writers": "", "URL": "https://www.aljazeera.com/news/2021/6/14/myanmars-detained-aung-san-suu-kyi-to-face-naypyidaw-court", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}