{"Type": "", "Time": "2021-06-15", "Headline": "Lack of expectation may be good for Spain: Luis Garcia, Latest Football News - The New Paper", "Text": "Former Spain midfielder Luis Garcia believes the fact that La Furia Roja are not among the favourites to win Euro 2020 could work in their favour.After a week without training and three years of upheaval, Spain head into their opener against Sweden tomorrow morning (Singapore time) determined to leave the past behind.Luis Enrique was appointed to ring the changes in the aftermath of the 2018 World Cup, when going out on penalties to Russia had made it three consecutive failures to reach the quarter-finals of a major tournament.Spain's preparations for the Euros have been hardly ideal, with captain Sergio Busquets and defender Diego Llorente testing Covid-19 positive, although the latter has since received four consecutive negative tests and been allowed to rejoin the squad.Due to the positive tests, their final warm-up match against Lithuania was played by Spain's Under-21s, with the senior team in isolation and unable to train together.Ahead of their clash with Sweden, who have also seen their plans disrupted by the positive tests for Dejan Kulusevski and Mattias Svanberg, former Champions League winner Garcia told Indian media: \"It can be an advantage.\"We have seen many times that when the spotlight is not on you, the players arrive with a little less pressure.\"(When you are favourites) the media brings the pressure when you play...\"Everyone expected them to perform the way they did in 2008, 2010 and 2012,\" he said, in reference to Spain's two European Championship wins, which sandwiched their maiden World Cup triumph.He added: \"At the moment, Spain probably don't look like favourites. (But) for me, they are good enough.\"We have got very good players - Thiago (Alcantara) in midfield will be key. He is a player who can create something out of nothing.\"There are players like (striker) Gerard Moreno who can kill the game in a single second because he has been fantastic this whole season.\"Cesc Fabregas, who was involved in Spain's era of success from 2008-2012, also was optimistic about Enrique's charges, who are the fifth-youngest team at the Euros.He told Goal.com: \"I don't like it when we are complaining before the tournament starts about the squad.\"I had it in 2008 when I was 21, I think. There was (David) Silva and (Andres) Iniesta coming through, and everyone was doubting us a bit because Raul (Gonzalez), (Michel) Salgado, (Santiago) Canizares and (David) Albelda weren't called up.\"All those players were cast aside to make space for us young players.\"We ended up winning the tournament and I don't think I need to repeat what happened after... It will not be easy for Spain... It is a young team but they have proven that they can play well in qualification.\"Get The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/sports/football/lack-expectation-may-be-good-spain-luis-garcia", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}