{"Type": "World", "Time": "2021-06-15", "Headline": "As US COVID-19 death toll nears 600,000, racial gaps persist", "Text": "WASHINGTON: Jerry Ramos spent his final days in a California hospital, hooked to an oxygen machine with blood clots in his lungs from COVID-19, his 3-year-old daughter in his thoughts.“I have to be here to watch my princess grow up,” the Mexican American restaurant worker wrote on Facebook. “My heart feels broken into pieces.”Ramos didn't live to see it. He died Feb 15 at age 32, becoming not just one of the nearly 600,000 Americans who have now perished in the coronavirus outbreak but another example of the outbreak's strikingly uneven and ever-shifting toll on the nation's racial and ethnic groups.The approaching 600,000 mark, as tracked by Johns Hopkins University, is greater than the population of Baltimore or Milwaukee. It is about equal to the number of Americans who died of cancer in 2019. And as bad as that is, the true toll is believed to be significantly higher.President Joe Biden acknowledged the milestone on Monday (Jun 14) during his visit to Europe, saying that while new cases and deaths are dropping dramatically in the US, “there's still too many lives being lost\", and “now is not the time to let our guard down\".On the way to the latest round-number milestone, the virus has proved adept at exploiting inequalities in the US, according to an Associated Press data analysis.In the first wave of fatalities, in April 2020, black people were slammed, dying at rates higher than those of other ethnic or racial groups as the virus rampaged through the urban Northeast and heavily African American cities like Detroit and New Orleans.Last summer, during a second surge, Hispanics were hit the hardest, suffering an outsize share of deaths, driven by infections in Texas and Florida. By winter, during the third and most lethal stage, the virus had gripped the entire nation, and racial gaps in weekly death rates had narrowed so much that whites were the worst off, followed closely by Hispanics.Now, even as the outbreak ebbs and more people get vaccinated, a racial gap appears to be emerging again, with black Americans dying at higher rates than other groups.Overall, black and Hispanic Americans have less access to medical care and are in poorer health, with higher rates of conditions such as diabetes and high blood pressure. They are also more likely to have jobs deemed essential, less able to work from home and more likely to live in crowded, multigenerational households, where working family members are apt to expose others to the virus.Black people account for 15 per cent of all COVID-19 deaths where race is known, while Hispanics represent 19 per cent, whites 61 per cent and Asian Americans 4 per cent. Those figures are close to the groups' share of the US population - black people at 12 per cent, Hispanics 18 per cent, whites 60 per cent and Asians 6 per cent - but adjusting for age yields a clearer picture of the unequal burden.Because blacks and Hispanics are younger on average than whites, it would stand to reason that they would be less likely to die from a disease that has been brutal to the elderly. But that's not what is happening.Instead, the Centers for Disease Control and Prevention, adjusting for population age differences, estimates that Native Americans, Latinos and blacks are two to three times more likely than white people to die of COVID-19.Also, the AP analysis found that Latinos are dying at much younger ages than other groups.Thirty-seven per cent of Hispanic deaths were of those under 65, versus 12 per cent for white Americans and 30 per cent for black people. Hispanic people between 30 and 39 - like Ramos - have died at five times the rate of white people in the same age group.Public health experts see these disparities as a loud message that the nation needs to address deep-rooted inequities.“If we want to respect the dear price that 600,000 people have paid, don’t return to normal. Return to something that is better than what was,” said Dr Clyde Yancy, vice dean for diversity and inclusion at Northwestern University’s medical school in Chicago.He added: “It will be an epic fail if we simply go back to whatever we call normal.”Ramos had asthma and diabetes and had quit his job as a chef at Red Lobster before the pandemic because of diabetes-related trouble with his feet.He died during the devastating winter surge that hit Latinos hard, and the rest of his household of seven in Watsonville, an agricultural city of around 54,000 people about 90 miles south of San Francisco, also got sick.That included his toddler daughter; the family matriarch, 70-year-old Mercedes Ramos; and his girlfriend, who was the only one in the household working and the first to get infected, bringing home the virus from her job managing a marijuana dispensary, according to family members.Mother and son were admitted to the same hospital, their rooms nearby. They would video chat or call each other every day.“He would tell me he loved me very much and that he wanted me to get better and that he was doing fine, but he was telling me that so I wouldn’t worry,” Mercedes Ramos said in Spanish, her voice breaking. She has since returned to her job picking strawberries.Gaps in vaccination rates in the US also persist, with blacks and Hispanics lagging behind, said Samantha Artiga of the Kaiser Family Foundation, a nonpartisan health-policy research organisation.Experts say several factors could be at work, including deep distrust of the medical establishment among black Americans because of a history of discriminatory treatment, and fears of deportation among Latinos, as well as a language barrier in many cases.The US was averaging about 870,000 injections per day in early June, down sharply from a high of about 3.3 million a day on average in mid-April, according to the CDC.Initial vaccine eligibility policies, set by states, favoured older Americans, a group more likely to be white. Now, everyone over 12 is eligible, but obstacles remain, such as concerns about missing work because of side effects from the shot.“Eligibility certainly does not equal access,” Artiga said. “Losing a day or two of wages can have real consequences for your family. People are facing tough decisions like that.”The AP’s analysis of the outbreak's racial and ethnic patterns was based on National Center for Health Statistics data on COVID-19 deaths and 2019 Census Bureau population estimates.It’s less clear who is dying now, but the still-incomplete data suggests a gap has emerged again. In Michigan, black people are 14 per cent of the population but accounted for 25 per cent of the 1,064 deaths reported in the past four weeks, according to the most recent available state data. Similar gaps were seen in Florida and Pennsylvania.“For people of colour like myself, we’ve had deep personal experiences during the pandemic” of caring for loved ones and sometimes losing them, said Yolanda Ogbolu, a nurse researcher at the University of Maryland, Baltimore.Ogbolu, who is black, made herself an advocate for two relatives during their COVID-19 hospital stays: her 50-year-old police officer brother - she persuaded his doctors to treat him with the drug remdesivir - and her 59-year-old repairman uncle. She called the hospital daily during his 100-day stay.Both survived. But Ogbolu wonders whether they would have lived if they hadn't had a nurse in the family.“What happens when people don’t have that person to push for them? What happens when you don’t even speak the language?\" Ogbolu said. “What happens when they don’t know how to navigate the health system or what questions to ask?”Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "news and politics,COVID-19,Latinos,coronavirus", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/as-us-covid-19-death-toll-nears-600-000-racial-gaps-persist-15015506", "Source": "google"}