{"Type": "", "Time": "2021-06-15", "Headline": "Itaewon Class actor Park Seo-joon may be in Captain Marvel sequel, Entertainment News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Actor Park Seo-joon may soon be the second South Korean actor to appear in a Marvel movie.According to industry insiders, the Itaewon Class star is reportedly appearing in the upcoming sequel to Captain Marvel (2019), The Marvels, which will see actress Brie Larson reprise her title role.Park's management agency Awesome ENT has not confirmed the rumours, but if the 32-year-old does join the Marvel Cinematic Universe, he will be the second South Korean actor after Ma Dong-seok.Ma, who is also known as Don Lee and had a breakout role in Train To Busan (2016), will be appearing later this year in the upcoming Marvel movie, Eternals, as the strongest Eternal superhero Gilgamesh.Besides Larson, other confirmed actors in The Marvels include Teyonah Parris and Iman Vellani, while the movie will be directed by Nia DaCosta.Park is said to be currently filming a disaster-thriller movie, Concrete Utopia, and will head to the United States after it wraps to start work on The Marvels.It is not known what his role will be in the movie, which is slated for a November 2022 release.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/life/entertainment/itaewon-class-actor-park-seo-joon-may-be-in-captain-marvel-sequel", "Source": "google"}