{"Type": "Sport", "Time": "2021-06-15", "Headline": "Football: Spain stifled as Swedes grind out grim 0-0 draw", "Text": "SEVILLE: Spain tried to pass Sweden into oblivion in their Euro 2020 opener on Monday (Jun 14) but had to settle for a 0-0 draw as they were let down by poor finishing and might have even lost had it not been for a glaring miss by opposing striker Marcus Berg.Alvaro Morata spurned Spain's best opening in a dominant first half display from Luis Enrique's side on a scorching evening at Seville's La Cartuja stadium in Group E when he missed the target from inside the area after a defensive slip.But Sweden's Berg was equally wasteful when he somehow missed the target after a sensational piece of skill and cross from fellow forward Alexander Isak, who had manoeuvred his way past four Spain defenders to put the chance on a plate.Spain ran out of steam in the second half before rallying again late on but still failed to beat Sweden keeper Robin Olsen, who thwarted substitute Gerard Moreno in stoppage time.\"The team leave feeling bad after all the effort we made and the chances we created but we have two games left and we'll try to do better. If we played like that in 10 games we'd have won nine of them,\" said Spain's Aymeric Laporte.\"We just lacked a goal today, on some days we'd score five, others none. But we're not worried, it wasn't meant to be today but it'll come off for us in the next game.\"This was a deeply frustrating start to the tournament for three-time European champions Spain, who broke a competition record with 917 passes while keeping 85 per cent possession but failed to win their first game for the fifth time in their last six major tournament appearances.\"We don't care too much about how many passes they have as long as they don't have too much time in the centre. At the end of the day it is about scoring goals and not conceding any,\" said Sweden defender Victor Lindelof.\"I think they became really frustrated. They had a lot of possession but the longer the game went on the more frustrated they became, which was good for us.\"Slovakia are the unlikely leaders of Group E after beating Poland 2-1 earlier on Monday. They face Sweden next on Friday, while Spain meet Poland.PREPARATIONS ROCKEDBoth sides had their tournament preparations rocked by two COVID-19 positives each but Spain were hit hardest as captain Sergio Busquets missed the game and the remaining players had to train individually for the next five days.Busquets' absence left Spain with no members of their 2010 World Cup winning side on the pitch while stand-in captain Jordi Alba was the only player who has won an international trophy, triumphing in Euro 2012 to complete a glorious cycle of three international tournament wins starting with Euro 2008.Luis Enrique had challenged his young side to lead themselves and they took the game to Sweden with their usual slick passing game and caused a fair amount of danger.The lively Dani Olmo skied an early opportunity then forced Olsen into two good saves with a low header and a strike from distance while he also sent a through ball to Koke, who hammered over the bar.The best chance, though, fell to Morata who failed to cash in on a lapse of concentration by Sweden's Marcus Danielson but slotted wide of goal with only Olsen to beat.Sweden had offered very little going forward but had a great chance to score late in the half when Isak won a scrap with Laporte and went for goal, his wayward shot hitting Marcos Llorente and then striking the near post.They were left agonising over a second big chance going to waste when Berg missed the target from point-blank range.But when the full time whistle came, Sweden revelled in ruining Spain's party, keeper Olsen punching the air and the grins of their numerous travelling supporters contrasting with the frustrated faces of their red-shirted hosts.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Sweden,sports,football,Spain,Swedes,Euro 2020", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/euro-2020-spain-stifled-as-swedes-grind-out-grim-0-0-draw-15015796", "Source": "google"}