{"Type": "", "Time": "2021-06-15", "Headline": "Sweden make no apologies after Spain stalemate", "Text": "published :\n\t\t\t\t\t\t\t\t\t\t\t\t\t15 Jun 2021 at 06:07\t\t\t\t\t\t\t\t\t\t\t\twriter: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tReutersSEVILLE: Sweden were out-passed by a factor of over five to one against Spain in their opening Euro 2020 Group E match but they made no apologies for shutting down the Spaniards in a dull 0-0 draw on Monday.Spain dominated possession and played a massive 953 passes, according to UEFA statistics, compared with Sweden's 178, yet their stifling tactics and superb goalkeeping from Robin Olsen earned them a point.\"For us, it makes no difference if they have that many passes, if they have the ball outside us and can't find a way in, it makes no difference. In football, it's about scoring goals, so for me there's no problem,\" Sweden defender Victor Lindelof told reporters.\"I think they (the Spaniards) got a bit frustrated. They had a lot of the ball and some high pressing at times, but we managed to defend well and clear the ball on many occasions. The longer the match goes, the more frustrated they get because they wanted to score,\" he added.Coach Janne Andersson was delighted with his side after they kept the 2008 and 2012 European champions scoreless.\"It's not like it was raining goal-scoring chances for Spain, even if they had a lot of the ball. Robin (Olsen) made some good saves, and there were some other good chances for them too,\" he told reporters.Andersson sent his side out to be tight and compact, with strikers Alexander Isak and Marcus Berg asked to sacrifice the creative part of their game to lead the defensive effort from the front.\"Our forwards are the ones who have to run the most and work the hardest, and they are very important when we win the ball based on how we play,\" Andersson said.The 58-year-old chose to withdraw Isak and Berg, both of whom had chances to score what would have been a scarcely-deserved winner for the Swedes, in the second half to replace them with fresh legs.\"Spain are brutally skilful with the ball, and when you go you have to be sure you can be better in your pressing ... Sure, there's absolutely things we could do better in this game, but overall I think we did very well,\" Andersson said.The Philippines is expecting most of its 17 million AstraZeneca Plc Covid-19 vaccine orders manufactured in Thailand to arrive this year, following a brief delay in the initial shipments.NAYPYIDAW, Myanmar: Myanmar junta witnesses were set to testify on Tuesday against deposed leader Aung San Suu Kyi on charges of sedition and flouting coronavirus restrictions, in a trial that could see the Nobel laureate jailed for more than a decade.BEIJING: A herd of elephants on a mammoth trek across China is taking an enforced break -- as they wait for a wayward youngster to catch-up.", "Section": "", "Writers": "", "URL": "https://www.bangkokpost.com/sports/2132595/sweden-make-no-apologies-after-spain-stalemate", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}