{"Type": "Asia", "Time": "2021-06-15", "Headline": "ICC seeks probe into Philippines drug war killings", "Text": "THE HAGUE: The International Criminal Court's chief prosecutor on Monday (Jun 14) sought a full investigation into crimes against humanity during the Philippines' \"war on drugs\", in one of her last acts before stepping down this week.Fatou Bensouda asked judges at the world's only permanent war crimes court to authorise a probe into allegations that police unlawfully killed as many as tens of thousands of civilians between 2016 and 2019.The Philippines left the ICC in 2019 after the court launched a preliminary examination into President Rodrigo Duterte's drug crackdown, but Bensouda said it could still investigate crimes committed while Manila was a member.\"I have determined that there is a reasonable basis to believe that the crime against humanity of murder has been committed .. in the context of the government of Philippines 'war on drugs' campaign,\" Bensouda said in a statement.\"The available information indicates that members of the Philippine National Police, and others acting in concert with them, have unlawfully killed between several thousand and tens of thousands of civilians\" during the period under investigation.Gambian lawyer Bensouda, whose term of office ends on Tuesday, said that \"any authorised investigation in the Philippines will fall to my able successor, Mr Karim Khan, to take forward\".Britain's Khan will be sworn in on Wednesday with a host of other challenges in his inbox including a probe into Israel and the Palestinian territories.THOUSANDS OF CIVILIANSDuterte's drug crackdown has drawn international censure and prompted the ICC to launch its preliminary probe three years ago.The crackdown is Duterte's signature policy initiative and he defends it fiercely, especially from critics like Western leaders and institutions which he says do not care about his country.He was elected in 2016 on a campaign promise to get rid of the Philippines' drug problem, openly ordering police to kill drug suspects if their lives are in danger.More than 6,000 people have been killed in over 200,000 anti-drug operations conducted since July 2016, according to official data. Human rights groups estimate the number of dead could be several times higher.Many suspects have been put on \"drug watch lists\" by local officials and then visited by police at their homes - a situation which often ends in a deadly shooting that officers claim was self-defence.Amnesty International said the ICC investigation was a \"landmark step\".\"This announcement is a moment of hope for thousands of families in the Philippines who are grieving those lost to the government's so-called 'war on drugs',\" Amnesty head Agnes Callamard said in a statement.Human Rights Watch said the court had \"dealt a blow\" for Duterte's \"presumption of impunity\" for the killings.'DRUGH WATCH LISTS'The tough-talking Duterte has repeatedly claimed the ICC has no jurisdiction over him and that he will not cooperate with what he has called an \"illegal\" probe. He even threatened to arrest Bensouda.Duterte has previously told the tribunal that the country's justice system is working amid allegations that local courts cannot or are unwilling to prosecute suspects in the killings - one of the criteria for the ICC to open a full investigation.Duterte has said he is willing to go behind bars if proven guilty in the Philippine judicial system.\"If the court says that I should go to jail, I will go to jail. That's no problem. I did what I embarked to do,\" Duterte said in a televised speech in December 2020.Bensouda said previous cases showed that the ICC \"retains jurisdiction over crimes that are alleged to have occurred on the territory of that state during the period when it was a state party\" to the international court.She added that the court \"does not take a position on any government's internal policies\" to combat drugs but that it was acting under its mandate to investigate war crimes and crimes against humanity.The court would also investigate allegations of torture and other \"inhumane acts\" dating back as far as 2011, it said.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "The Philippines,drug war,ICC,news and politics,Rodrigo Duterte,Fatou Bensouda", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/icc-seeks-probe-into-philippines-drug-war-killings-15013918", "Source": "google"}