{"Type": "", "Time": "2021-06-15", "Headline": "Nato summit: leaders declare China presents security risk | Nato | The Guardian", "Text": "Communique is first time alliance has asserted it needs to respond to Beijing’s growing powerFirst published on Mon 14 Jun 2021 06.52 EDTNato leaders have declared China presents a security risk at their annual summit in Brussels, the first time the traditionally Russia-focused military alliance has asserted it needs to respond to Beijing’s growing power.The final communique, signed off by leaders of the 30-member alliance at the urging of the new US administration, said China’s “stated ambitions and assertive behaviour present systemic challenges to the rules-based international order”.After the summit, Joe Biden said that the US had a “sacred commitment” to come to the defence of its Nato allies in an effort to soothe residual nervousness in the wake of Donald Trump’s hostility. Biden said that his fellow leaders at the summit knew most Americans were committed to democracy and that the US was a “decent, honourable nation”.On the question of potential Ukrainian membership of Nato, Biden said the Russian occupation of Crimea would not be an impediment, but that Ukraine still had work to do on corruption before it could join a membership action plan.“It depends on whether they meet the criteria. The fact is, they still have to clean up corruption,” Biden said.The Nato leaders declared their concern about China’s “coercive policies” – an apparent reference to the repression of the Uyghur Muslims in Xinjiang – the expansion of its nuclear arsenal and its “frequent lack of transparency and use of disinformation”.The language, notably stronger than the China remarks contained in the G7 statement agreed on Sunday, follows lobbying and pressure by the Biden administration, seeking to create a counterweight of democratic nations in response to Beijing’s growing economic and military might.However, Nato’s secretary general, Jens Stoltenberg, insisted China was “not an adversary”, saying instead the emerging strategy was to address “the challenges” posed by Beijing, which will “soon be the biggest economy in the world” and “already has the second-largest defence budget, the biggest navy”.At the beginning of the summit, Biden said there was a growing recognition that Nato faced new challenges. “We have Russia, which is acting in a way that is not consistent with what we had hoped, and we have China.”Nato, founded in 1949 at the start of the cold war, was created to respond to the Soviet Union and more recently Russia, while Beijing rarely posed a serious security concern for its members.China had never previously been mentioned in a Nato summit declaration, apart from a brief reference in 2019 to the “opportunities and challenges” the country posed for members of the western alliance – a time when Biden’s predecessor, Donald Trump, was president.On Sunday night, Jake Sullivan, the US national security adviser, promised Nato would increase its focus on Beijing, saying that China “will feature in the communique in a more robust way than we’ve ever seen before”.Other countries have highlighted the importance of striking a balance. Boris Johnson, the UK prime minister, said as he arrived at the gathering: “I think when it comes to China, I don’t think anybody around the table today wants to descend into a new cold war.”G7 leaders criticised Beijing over human rights in its Xinjiang region, called for Hong Kong to keep a high degree of autonomy and demanded a full investigation of the origins of the coronavirus in China.China’s embassy in London said such mentions of Xinjiang, Hong Kong and Taiwan distorted the facts and exposed the “sinister intentions of a few countries such as the United States”. It added: “China’s reputation must not be slandered.”Stoltenberg also said the alliance’s relationship with Russia was at “its lowest point since the end of the cold war”. He blamed Russia’s “aggressive actions” for the deterioration in relations at the start of a one-day summit attended by Biden for the first time since he took office.Alliance members had hoped for a strong statement of support for Nato from Biden after several years in which Donald Trump dominated the summits, threatening to pull out of Nato in 2018 and storming home early in 2019.“Nato is critically important for US interests in and of itself,” Biden said as he met Stoltenberg. The president described Nato’s article 5, under which an armed attack against one member is deemed an attack against them all, as “a sacred obligation”.He added: “I want Nato to know America is there.”The allies denounced Moscow’s “hybrid actions”, “widespread disinformation campaigns”, “malicious cyber activities”, and election interference directed against Nato members. “Until Russia demonstrates compliance with international law and its international obligations and responsibilities, there can be no return to ‘business as usual’,” the statement said. “We will continue to respond to the deteriorating security environment by enhancing our deterrence and defence posture.”Alliance members agreed a new cybersecurity strategy in response, and will for the first time help each other out in the case of “cyber-attacks of significance”, mirroring Nato’s obligation of collective defence in the traditional military sphere, enshrined in article 5.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/world/2021/jun/14/nato-summit-china-russia-biden-cyber-attacks", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}