{"Type": "", "Time": "2021-06-15", "Headline": "Philippines drugs war: ICC prosecutor seeks full investigation - BBC News", "Text": "The chief prosecutor of International Criminal Court (ICC) has called for a full investigation into suspected crimes against humanity during a deadly drugs crackdown directed by the government of the Philippines.Fatou Bensouda, who leaves office this week, opened a preliminary probe into the drugs war back in 2018. Philippines President Rodrigo Duterte withdrew from the ICC soon afterwards.Thousands of civilians are known to have died under the campaign. National data acknowledges more than 6,000 deaths, but international rights groups have long warned the figure could be far higher. A spokesperson for President Duterte said his government would not co-operate with any ICC investigation since the Philippines was no longer a member.The controversial anti-drugs crackdown has sparked years of international condemnation, including from the United Nations. Ms Bensouda first said she was \"deeply concerned\" about reports of extrajudicial killings in October 2016.On Monday she said she had determined there was reasonable basis to believe that murder had been committed, and she asked judges on the war crimes court to authorise a full investigation under her replacement. Ms Bensouda will be replaced by Mr Karim Khan, a British lawyer, on Wednesday. Her statement said the available information indicated that members of the country's police, and others acting alongside them, had unlawfully killed between several thousand and tens of thousands of civilians during the period she looked at between July 2016 and March 2019.She said the court has authorisation to look at alleged crimes during the time the country was a party to the ICC, before Mr Duterte's withdrawal took effect.The controversial leader, known for his flamboyant remarks and lack of remorse over his deadly drugs policy, has repeatedly said the ICC has no jurisdiction over him and said he will not cooperate the probe.The development has been welcomed by human rights groups. Amnesty International described the investigation as a \"landmark step\", which could provide \"a moment of hope for thousands of families\" grieving loved ones in the country.'If helping people is seditious then I am guilty'Duterte 'war on drugs' faces Hague probeDuterte pulls police off drugs crackdownDuterte: The 'strongman' of the PhilippinesWhat is the International Criminal Court?Burundi first to quit international courtNato warns of military challenge posed by ChinaA summit of alliance leaders in Brussels describes China's behaviour as a \"systemic challenge\".Australia refugee family released from islandThree things to watch as Biden meets Putin. VideoThree things to watch as Biden meets PutinWhat Putin really wants from BidenThree things to watch as Biden meets Putin. VideoThree things to watch as Biden meets PutinA quick guide to Ethiopia's electionUnearthing the brutal camps housing allied forcesWhat can cause a cardiac arrest?Europe tools up against US and Asia as a car battery forceHow bad is Nato's climate change problem?The successes and failures of India's vaccine driveBBC Worklife: A fix for sky-high CEO pay?Football phrases15 sayings from around the worldChrissy Teigen: I was a troll and I'm so sorry1Nato warns of military challenge posed by China2Minneapolis woman killed as car hits protesters3Canadian military leader resigns over golf game4US lawmaker sorry for likening masks to Holocaust5Staff arrested for not giving police free burgers6Christiane Amanpour says she has ovarian cancer7US whistleblower jailed during Trump era released8US bans dog imports from more than 100 countries9Australia refugee family released from island10© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "Section": "", "Writers": "", "URL": "https://www.bbc.com/news/world-asia-57477802", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}