{"Type": "Singapore", "Time": "2021-06-15", "Headline": "Small turnout as Jewel Changi Airport reopens after more than a month", "Text": "SINGAPORE: Around 10 customers were gathered outside the Rich & Good Cake Shop outlet at Jewel Changi Airport a few minutes before it opened for business on Monday (Jun 14).It had been more than a month since the shop was shuttered, when Jewel and the passenger terminals at Changi Airport were closed to the public in May to control a growing cluster of COVID-19 cases.Jewel was initially slated to reopen on May 27, but the closure wasextendedby the Civil Aviation Authority of Singapore (CAAS) and the Changi Airport Group (CAG) as an “added precaution”.“(The crowd) is actually slightly more than what we expected, we were expecting it to be totally empty because dine-in is still not allowed,” said Ms Jerelyn Foo, the company's media and operations manager.“But it’s definitely less compared to what we had before the closure,” she added.At burger chain Shake Shack, which typically sees long queues during peak hours, food delivery riders as well as customers were spotted waiting in line for their food inside the restaurant.In contrast, luxury watch retailer Sincere Watch's outlet at Jewel was largely empty, when CNA visited the mall between 11.30am to 3pm.\"I'm not surprised because it's just the first day of reopening and consumers just got to know about this so it will take time for them to gain confidence to come back to the mall and spend again,\" said Mr Kenneth Tan, the company's senior operations manager.Meanwhile, a small handful of moviegoers trickled in and out of Shaw Theatres Jewel.\"It's a typical Monday morning, so obviously it's quite quiet,\" said Mr Mark Shaw, director of Shaw Organisation.\"We're just really happy to be open and we expect, hopefully, with some decent marketing from Jewel and our team, as well as some of the bigger Hollywood blockbusters coming online in the next couple of weeks, that business will pick up,\" he added.JEWEL EXTENDS RENTAL SUPPORT FOR TENANTSOn Monday, Jewel announced that it would extend full rental waiver by an additional week until Jun 20. Previously, it was only for the period of the mall’s closure.Between Jun 21 and Jun 27, Jewel tenants will also receive rental \"assistance\", according to the mall. It did not specify how much assistance would be provided.The additional support was welcomed by tenants CNA spoke to, who said that it would take some time before shoppers returned.\"I expect that it will take a month or two to have the business back on track ... but we're quite positive about the sales going back to what we used to have, especially when the dine-in resumes,\" said Ms Cami Soh, director of operations at Shake Shack Singapore.ENHANCED SAFETY MEASURESAs of Jun 13, 108 cases have been linked to Changi Airport, which remains the country’s largest active cluster. Thelast three reported caseswere on May 23, which includes a seven-year-old Singaporean boy who is a student at St Stephen’s School.Last month, a 95-year-old woman linked to the clusterdied from complicationsdue to the coronavirus.To minimise the risk of transmission, Jewel is now part of asegregated zoning systemimplemented by Changi Airport, which segregates 14,000 airport workers into three distinct zones based on risk level.Jewel Changi Airport is under Zone 3 - the lowest risk group.This means that airport workers from Zone 1, which has the highest risk of exposure, will not be allowed to enter Jewel during their shifts.During the closure period, thorough cleaning and disinfection works were carried out. More than 2,500 workers at Jewel took the mandatory COVID-19 test and none tested positive, according to Jewel.It added that close to 90 per cent of eligible Jewel staff have taken at least one dose of the vaccine so far.ATTRACTING VISITORSTo draw shoppers back, Jewel is offering free parking until Jul 11. It is also working on new programmes and promotions, which will be shared at a later date.“We are cognisant that it will take time to ramp up footfall at Jewel, as Singapore cautiously moves into Phase 3 (Heightened Alert) with a gradual easing of restrictions,” Ms Hung.\"With enhanced precautionary measures in place and staff well-trained to ensure that all measures are adhered to, we hope to welcome our guests back again to a sparkling Jewel experience soon.\"Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,Jewel,Changi Airport,retail", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/covid-19-jewel-changi-airport-reopens-month-long-closure--15010656", "Source": "google"}