{"Type": "", "Time": "2021-06-15", "Headline": "Opinion | Biden and Putin Are Meeting. Here's How to Make Progress. - The New York Times", "Text": "AdvertisementSupported bySerge SChmemannBy Serge SchmemannMr. Schmemann is a member of the editorial board.The last time American and Russian leaders met in Geneva was when Ronald Reagan squared off against the new Soviet chief, Mikhail Gorbachev, in November 1985. Oh, how times have changed since then.To be sure, there will be blasts from the past when President Biden and President Vladimir Putin come together on Wednesday at the Villa La Grange overlooking Lake Geneva. Mr. Biden has promised to lecture Mr. Putin on human rights and Russia’s foreign adventurism, and Mr. Putin will fire back in kind. And at separate news conferences at the end both men will most likely assert that they made the world a safer place, despite their disagreements, by at least agreeing to manage their hostilities.That would be no small achievement, and a necessary one. American relations with Russia, as Mr. Putin said in an interview, and Mr. Biden concurred, are at their “lowest point in recent years,” quite possibly since Russia emerged out of the rubble of the Soviet Union in 1991.And despite Russia’s sharply reduced fortunes and expanse, there are plenty of fronts on which it poses a serious threat to the international order and to global stability, from Ukraine and Syria to cybersecurity to human rights, as well as areas in which a more businesslike relationship between Moscow and Washington could benefit both, including climate change, Iran, China, the thawing Arctic and the coronavirus pandemic.This is where summit diplomacy is most needed, to find ways to manage a relationship that has gone sour so things don’t get worse, and so antagonists can still cooperate where they have to.But that is not to be confused with the summits of the Cold War. When Mr. Reagan and Mr. Gorbachev squared off in Geneva in 1985, the United States and the Soviet Union were still masters of their rival domains in a bipolar universe, and their every word and gesture — as well as the comportment of their formidable first ladies, Nancy Reagan and Raisa Gorbachev — were minutely examined by hordes of aides and experts for shifts in global tectonics and beamed to a fascinated world by a legion of reporters.I was among them, and it was heady. There hadn’t been a summit in six years, and Mr. Gorbachev had come to power only eight months earlier with the promise of real change after years of stagnation in the Soviet Union and in U.S.-Soviet relations. Mr. Reagan opened the talks with a dramatic proclamation: “The United States and the Soviet Union are the two greatest countries on earth, the superpowers. They are the only ones who can start World War III, but also the only two countries that could bring peace to the world.”The Soviet Union would fall apart in a few years. Yet the first post-Soviet summit, between Bill Clinton and Boris Yeltsin, in Vancouver in April 1993, was still a big deal, now full of hope that a Russia freed of Communism would meld seamlessly into a “new democratic partnership.” I remember watching as Mr. Clinton ardently pumped Mr. Yeltsin’s hand in parting, exhorting him: “Win! Win!”That bonhomie still lingered when President George W. Bush met with Mr. Yeltsin’s handpicked heir, Vladimir Putin, in Slovenia in 2001. It was there that Mr. Bush made his famous (or infamous) comment, “I was able to get a sense of his soul.”But the relationship soured for Americans as Mr. Putin’s Russia annexed Crimea, launched military operations against Georgia and Ukraine and became increasingly authoritarian and intolerant of opposition. Then came Russia’s entry into the Syrian fray and the brazen meddling in the 2016 election campaign in support of Donald Trump, followed by four years in which Mr. Trump pursued a bizarre personal relationship with Mr. Putin while a special commission was investigating Russia’s machinations and government-to-government relations tanked.The rosy days of two decades ago are hard to imagine now, when Mr. Putin’s image among most Americans is of an irredeemable thug, when all consulates outside the respective capitals are closed, both ambassadors are home “for consultations,” and Mr. Biden’s meeting with Mr. Putin is assailed in some hawkish quarters in Washington as appeasement of a malign autocrat. In American eyes, Russia is an irritant, a country in decline but still capable of major mischief under a leader whose stripes cannot be changed and who is entrenched for many more years.It may come as a surprise to some Americans, but in many Russian eyes, it is the United States that is the mischief-maker and needs to change; the United States that needs to acknowledge that its unipolar moment is over and it cannot impose its will around the world; the United States that preaches democracy and human rights and scatters sanctions against those who defy it while its own democracy is in polarized disarray.Though a struggling economy and too many years in power have eroded Mr. Putin’s standing at home, and dissidents like Aleksei Navalny have shaken his rule, he remains popular — in part for managing to remind the Biden administration, whether through cybermeddling or threatening troop movements on Ukraine’s borders, that Russia will not be taken for granted.The meeting in Geneva will not reconcile these visions nor find either leader peering into the other’s soul. Both have made that clear. But both also have pressing reasons to make their relations more stable and predictable.After years of conflicts and sanctions, Mr. Putin probably welcomes some evidence that he still carries weight in the world. His apparent readiness to deal seriously on cybersecurity suggests he does want to emerge from the meeting with something to show.Mr. Biden, for his part, is probably keen to lower the temperature with Russia if only not to be distracted from his domestic agenda, and from the more important joust with China. China, indeed, will be the elephant in the Genevan lakeside villa, a gathering force that worries Moscow as much as it worries Washington.So even if the meeting features mutual bashing and ends without a joint communiqué, a “reset” or displays of chumminess or trust, simply getting together and demonstrating a readiness to give real diplomacy a chance — possibly by announcing joint initiatives on arms control, cybersecurity, climate change or the Arctic — would be mission accomplished.The Times is committed to publishing a diversity of letters to the editor. We’d like to hear what you think about this or any of our articles. Here are some tips. And here’s our email: letters@nytimes.com.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement", "Section": "", "Writers": "", "URL": "https://www.nytimes.com/2021/06/14/opinion/biden-putin-meeting-summit.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}