{"Type": "", "Time": "2021-06-15", "Headline": "Man, 26, posed as 'sugar mummy' to lure teen boy for sex", "Text": "SINGAPORE — A 17-year-old boy who wanted to find himself a sugar mummy after being kicked out by his mother, was preyed upon by a 26-year-old man instead.The victim had put up an advertisement on platform Locanto expecting elder women to reply.He instead received a reply from Muhammad AL-Masfuiin Mushin, who pretended to be a woman to lure the victim to his flat.AL-Masfuiin, a Singaporean, was jailed for 10 months on Monday (14 June), after he pleaded guilty to one count of obtaining the sexual service of a minor under 18The victim cannot be named due to a gag order protecting his identity.On 16 June 2019, the teen got into a heated argument with his mother and was kicked out of the house. In need of money, he placed an advertisement on Locanto, which he had downloaded two years ago in order to earn money by providing sexual services.The advertisement was titled \"Toyboy Fantasy Satisfies you- 18”, and stated that he was looking for a “sugar mummy” who could pay him in return for sexual services. He included his mobile phone number and two photographs of himself.The next day, AL-Masfuiin saw the advertisement and decided to chat up the victim while posing as a woman. He told the boy, “I’m looking for a young boy to be my sex slave” and asked the victim for his photographs and body statistics.When the victim asked if he was male or female, AL-Masfuiin said she was female. The victim told him that he was 17 years old and in need of money as he had been chased out of his house.As a “woman”, AL-Masfuiin asked the victim for a threesome with “her” and “her boyfriend”, even though there would be no female involved. The victim agreed and asked for $250 per meet up.At about 10.38pm that day, the victim messaged AL-Masfuiin to ask if they were able to meet up. AL-Masfuiin was aware that the victim had no place to stay.He told the victim that he could stay at “her boyfriend’s place” and that “he’ll send a Grab to let you stay over”. AL-Masfuiin texted that he also expected the boy to service “her boyfriend”.AL-Masfuiin then arranged transport for the victim. At about 1am on 18 June 2019, AL-Masfuiin sent a Grab to the victim, who asked AL-Masfuiin if “she” was joining the sex session. AL-Masfuiin replied “she might not” but that her “boyfriend will tell me if you did a great job at sex”.When the victim asked if the boyfriend knew his age, AL-Masfuiin replied “yes” and “I like my boys young”.After the victim arrived at AL-Masfuiin’s apartment, AL-Masfuiin told him to take a shower while he sat on the sofa bed in the living room masturbating himself. The two engaged in sexual acts, with AL-Masfuiin overpowering the boy when the latter resisted. After the incident, the boy went to sleep.He woke at about 8.30am and asked AL-Masfuiin for money to go to work. AL-Masfuiin took out a $50 note from his wallet and handed it to the victim before the two parted ways.According to court documents, a police officer performing foot patrol came across the victim on 18 June 2019 at Toa Payoh Central. During the course of investigations, the officer discovered messages relating to him providing sexual services, in his phone. AL-Masfuiin was arrested afterwards. Commercial sex with a minor under 18 carries a jail term of up to seven years, with fine, or both. Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:Singapore reports 13 new COVID-19 cases, 10 from the communityCOVID: Social gathering size can increase to 5 per group from 14 June – MTFCOVID: Dine-in at F&B places can resume at max 5 per group from 21 JuneWork-from-home remains default arrangement in Singapore's Phase 3 (HA)4 COVID ART test kits on sale at 3 Singapore pharmacies from 16 June: MTFGetting the COVID-19 vaccine in Singapore is easy. According to the Ministry of Health (MOH), as of 17 May 2021, 3.4 million doses have been administered. Here's a guide on how to find a vaccination centre near you.European stock markets rose Tuesday after a mixed showing in Asia, as investors braced for news from a key Federal Reserve interest-rate meeting.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.In the wake of one of the biggest password leaks in history, Apple has unveiled a new biometric-based feature that could one day replace passwords across all Apple devices.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.Board certified internal medicine and obesity specialist reveals what happens after drinking just 1 diet soda. Click here to watch video.A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.A French nuclear firm said Monday it was working to resolve a \"performance issue\" linked to a gas build-up at a plant it part-owns in southern China following a US media report of a potential leak there.The nominee to be the top US diplomat for East Asia promised Tuesday that President Joe Biden would keep building relations with Taiwan, but balked at backing an overhaul of delicate arrangements on the issue with China.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.If you’re wondering whether Ethereum is a good long term investment, keep reading.Looking for travel insurance? Save more with these promo codes and discounts from insurers such as FWD, MSIG, AXA, and more! To find out if your travel insurance covers COVID-19, read this article for the latest updates. No matter your travel itinerary, travel insurance is […] The post Travel Insurance Promotions and Discounts appeared first on SingSaver Blog - We Compare, You Save.Every PC user must read this in 2021 - Do it now.Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the challenges posed by its policies.Toshiba apologised to shareholders Monday and said it would remove two directors after a probe found the Japanese conglomerate had sought government help to try and influence a boardroom vote.New research has identified TEN favorite stocks for the upcoming yearWith its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Asset sales in a liquidation process at Hyflux Ltd., Singapore’s highest-profile distressed company, would likely bring in less than S$200 million, a person familiar with the matter said, a fraction of the amount creditors are claiming.A 20-year-old male polytechnic student on internship with a hospital secretly recorded a staff relieving herself at Jurong Medical Centre in January, a court heard.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/singaporean-man-26-posed-sugar-mummy-lure-teen-boy-sex-035110137.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}