{"Type": "", "Time": "2021-06-15", "Headline": "Malaysia's Sultans to meet as public anger against Muhyiddin government grows , Malaysia News - AsiaOne", "Text": "Malaysia ’s sultans may have limited constitutional powers, but what they say after a special Conference of Rulers on Wednesday (June 16) could determine whether the government looks to extend a state of emergency that dates back to January, analysts say.Along with the suspension of parliament, the emergency – which expires on Aug 1 – has granted Prime Minister Muhyiddin Yassin ’s government vast executive powers that critics say are being used to throttle opponents rather than deal with the Covid-19 pandemic.It was declared amid signs the administration was on the verge of a humiliating no-confidence vote by lawmakers.Political analysts told This Week in Asia  they believed the most likely scenario following Wednesday’s meeting was for the sultans to state their preference for parliament to be reconvened, while emphasising the need for continuity and stability amid the current crisis. The meeting – convened by the country’s king, Sultan Abdullah Sultan Ahmad Shah – is being held amid rising public discontent with the Muhyiddin administration over a litany of issues, including confusion over lockdown rules and tepid progress in Covid-19 vaccinations.It is the second special council called by Sultan Abdullah since the start of the pandemic. The Conference of Rulers is usually held four times a year.Even if the emergency was extended, in the event of the country’s daily caseload remaining at a high level, the sultans might “force Muhyiddin to have a parliamentary sitting”, said veteran Malaysia watcher James Chin.“The people want parliament to sit in order to keep an eye on the government, especially on the vaccine roll-out,” Chin said, adding that there was “no reason” for the legislature to remain suspended given that MPs had received their vaccinations. Malaysia recorded 4,949 new cases on Monday, bringing its total number of infections to more than 662,000.Ahead of the rulers’ meeting, Sultan Abdullah has over the past week summoned the leaders of the country’s political parties for private audiences. The Wednesday council involves the heads of the country’s nine royal households – each of whom are sultans or regents of their respective states – as well as the governors of four non-royal states. [[nid:519945]]Sultan Abdullah, from the state of Pahang, currently serves as Yang di-Pertuan Agong, or king, in the country’s rotational monarchy system. He plays a largely ceremonial role and is obliged to abide by the government’s advice in carrying out most of his constitutional duties – though he wields a veto on some matters.The state of emergency was approved in January with his assent; a request for a similar measure last October was denied by Sultan Abdullah after a Conference of Rulers. Constitutional powers are vested in the reigning Yang di-Pertuan Agong rather than the council, though it is the norm for the monarch to consult and abide by a consensus among his peers on key matters. Some observers said Wednesday’s meeting might be an avenue for the sultans to discuss the groundswell of dissent against the Muhyiddin government. Preserving “political stability” would be high on the agenda during the closed-door talks in the National Palace, said National University of Malaysia political scientist Muhamad Nadzri Noor. [[nid:520247]]Negative feelings stemming from the view that the government – riven by internal discord – has largely been incompetent during the Covid-19 crisis have affected sentiment towards the royals, according to the likes of elder statesman Mahathir Mohamad . The two-time former prime minister last month said social media comments showed the country’s Malay majority was becoming uncharacteristically critical of the sultans – with many holding the view that the controversial state of emergency was a royal edict. In fact, however, Sultan Abdullah approved the plan in line with Prime Minister Muhyiddin’s advice, which is the norm.Political economist Abdullah Azmi Khalid said concerns about “integrity and corruption” in government – publicly aired in recent months by the likes of Sultan Nazrin Shah of Perak – would likely also be on the agenda at the Wednesday meeting. He said Sultan’s Nazrin’s comments were noteworthy given the royals’ usual practice of staying clear of undermining or even criticising sitting administrations.“Although these are mundane issues, for [Sultan Nazrin] to actually take it up shows that he is not very happy with what is happening in the country,” Abdullah said.[[nid:515448]]Ahead of Wednesday’s meeting, there has been rampant speculation about other proposals or issues that are likely to be discussed. One such matter is Mahathir’s proposal for the establishment of a National Rehabilitation Council. Malaysia had a similar National Operations Council – Majlis Gerakan Nasional in Malay, or Mageran – from 1969 to 1971 as part of a nationwide state of emergency imposed following deadly racial riots. That council did not include the then prime minister, and acted as a body with powers that superseded the executive branch. Mahathir said his version of Mageran – dubbed Mageran 2.0 by commentators – would include medical experts, non-partisan economists and “social mobilisers” and would report directly to Sultan Abdullah while also remaining accountable to parliament. Following a private audience with the king last week, Mahathir said he had raised the proposal with the monarch, who in turn replied that any such plan had to be mooted by Muhyiddin’s government.Mahathir, who was unceremoniously ousted as prime minister following a political coup by Muhyiddin, said he had little hope his proposal would be considered by the government. [[nid:530484]]There has been across-the-board criticism of the plan, with Muhyiddin’s allies as well as critics saying it would do little to boost public accountability. Another cause for speculation is the possibility that the sultans may urge Muhyiddin to consider a “unity government” for the sake of medium-term stability. Such an arrangement would stave off the possibility of the current administration collapsing once parliament reconvenes. Nadzri said such an arrangement – or a confidence-and-supply pact – might be a possibility, though such proposals had fallen through last year, before the emergency was declared. Writing in The New Straits Times , political commentator Munir Majid said the sultans could nudge forward such a course of action following the meeting, notwithstanding their constitutional constraints. “The Malay rulers have a role, although the difficulty has always been how exactly they should play it without exceeding constitutional provision and without undermining support for the institution,” he wrote.“In our present circumstances, the people need some intervention to save their lives and livelihoods. A nod in the direction of a national unity government and convening of parliament would be something the rakyat [people] would deeply appreciate.” This article was first published in South China Morning Post.", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/malaysia/malaysias-sultans-meet-public-anger-against-muhyiddin-government-grows", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}