{"Type": "", "Time": "2021-06-15", "Headline": "Morning Briefing: Top stories from The Straits Times on June 14, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.Good morning! Here are our top stories to kick-start your Monday, June 14.All staff and tenants who worked at the market from May 25 have been quarantined.READ MORE HEREIn the first step of reopening on Monday, people will be able to gather in groups of up to five while operating capacity limits for attractions go up from 25 per cent to 50 per cent.READ MORE HERENo deaths have been linked to the jab, the Health Sciences Authority said.READ MORE HEREAmong them is a 177 sq m executive maisonette in the non-mature estate of Hougang that sold for $1 million in January 2018.READ MORE HEREG-7 will work together with the private sector, the G-20 and other countries to increase this contribution over the months to come.READ MORE HEREST answers some common questions about animals and Covid-19.READ MORE HEREThe Commissioner for the Maintenance of Parents attended to 98 seniors last year - down from 143 the year before and almost a third of the 286 in 2011.READ MORE HEREUnder the coalition deal, Bennett will be replaced as prime minister by centrist Yair Lapid in 2023.READ MORE HEREThe hub connects a new bus interchange below Causeway Point shopping mall with Woodlands MRT station.READ MORE HEREYou can also check out travelogues that showcase culture and cuisines from around the world.READ MORE HEREJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/morning-briefing-top-stories-from-the-straits-times-on-june-14-2021", "Source": "google"}