{"Type": "", "Time": "2021-06-15", "Headline": "MAS reprimands insurers for breaching rules on risk management, commission payments, Business News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Four financial institutions were reprimanded by the Monetary Authority of Singapore (MAS) for breaching rules over commission payments.AIA Financial Advisers (AIA FA), Prudential Assurance Company Singapore (Prudential), and Aviva, along with its wholly owned subsidiary Aviva Financial Advisers (Aviva FA), were found to have breached risk management and supervisor remuneration regulations, the central bank said on Tuesday (June 15).MAS also reprimanded Mr Peter Tan Shou Yi, a consultant engaged by Aviva, for accepting remuneration in breach of regulatory requirements, and Aviva FA's chief executive and director, Mr Lionel Chee Boon Chai, for his failure to discharge the duties of his office.Mr Tan and his company, Peter Tan Organisation Management and Consultancy, were sued in 2019 by Prudential for up to $2.5 billion for allegedly “surreptitiously” orchestrating a mass defection to Aviva’s subsidiary, Aviva Financial Advisers, in mid-2016.In May 2021, the High Court found he had breached his agency agreement in soliciting the defection.A reprimand is considered a serious warning by the regulators and is usually issued when a regulatory breach by a financial institution does not lead to any direct monetary harm to its customers.Such reprimands are taken into account when regulators take enforcement action against future violations by the reprimanded financial institutions.MAS said that following indications of rule violations by the insurers, it conducted an investigation and found numerous instances where remuneration was paid to supervisors in contravention of requirements under the Financial Advisers Act (FAA).Indications of violations may emerge from a whistle-blower, a complaint by a customer or during the course of regular on-site checks conducted by regulators.These violations were related to the Balanced Scorecard requirements (BSC) for the sale of investment products, and the Spreading and Capping of Commissions rules (SCC) for the sale of regular premium life policies.The BSC and SCC seek to align the incentives of financial adviser (FA) firms, agents and supervisors with their customers' interests, to promote a culture of fair dealing.Under the BSC, supervisors' and agents' variable incomes are determined with reference to the fulfilment of non-sales key performance indicators (KPIs), such as whether an agent has taken steps to understand the customer's needs, recommend suitable products and make adequate disclosures. The aim is to raise the quality of advice and to mitigate risks of product pushing and pressure sales tactics.Under the SCC, which applies to the sale of regular premium life policies to individuals, insurers and FA firms are required to cap the variable income payable to agents and supervisors in the first year and spread the remaining variable income payable over a prescribed period.The rule addresses concerns that an agent who has received most of his total variable income upfront may not be incentivised to provide quality after-sales services to his clients.Narrating its investigation and its findings, MAS said three of AIA FA's managing directors (MDs) had acted as supervisors of AIA FA. They were responsible for the supervision of the conduct and performance of the agents in their respective agency groups, including sales and compliance standards.However, AIA FA failed to review and assess the performance of these MDs, assign BSC grades as well as determine and pay their remuneration in accordance with the BSC.AIA FA also failed to cap and spread the MDs' variable income in accordance with the SCC.\nMAS also reprimanded Mr Peter Tan Shou Yi (left), a consultant engaged by Aviva, and Aviva FA's chief executive and director, Mr Lionel Chee Boon Chai. PHOTOS: ST FILE, AVIVAFA.COM.SG\nThe MAS investigation found that Mr Tan, engaged by Aviva as a consultant from July 2016 to March 2020, went beyond providing strategic advice and acted as a supervisor to Aviva FA's agents.While Mr Tan from July 2016 to April 2019 had frequent and direct interactions with Aviva FA's agents, including discussions on sales and compliance issues, neither Aviva nor Aviva FA had put in place compliance arrangements to monitor his activities in Aviva FA.Hence, Aviva contravened the Guidelines on Risk Management Practices - Internal Controls (RM Guidelines) and Aviva FA contravened the Financial Advisers Regulations. At Prudential, three individuals referred to as Master Group Agency Manager (MGAM) Leaders and a consultant appointed by the firm had acted as supervisors.However, Prudential failed to review and assess the performance of the MGAM Leaders and the consultant, assign BSC grades to them, as well as determine and pay their remuneration in accordance with the BSC.Prudential also breached the RM Guidelines as it failed to put in place adequate risk mitigation procedures and compliance arrangements to monitor the activities of the MGAM Leaders and consultant.Ms Ho Hern Shin, MAS' deputy managing director for financial supervision, said: \"MAS expects financial institutions to have robust arrangements to ensure that their agents place their customers' interests first.\"She noted that MAS' requirements on remuneration practices relating to the sale of investment and life insurance products aim to promote good sales conduct in the financial advisory industry.\"We have dealt firmly with these financial institutions and individuals who have breached our regulations, to send a clear message to the industry on the importance of upholding high ethical standards,\" she said.According to MAS, all financial institutions are expected to put in place appropriate compliance arrangements to ensure that they comply with all applicable laws and rules and to mitigate the risks of non-compliance.The RM Guidelines provide guidance to financial institutions on sound and prudent internal control practices.FA firms are also required under Regulation 14 of the Financial Advisers Regulations to put in place compliance arrangements to ensure they comply with the applicable legal and regulatory requirements. Effective compliance arrangements help protect customers' interests and reduce the possibility of unexpected losses or damage.An Aviva Singapore spokesman said the lapses identified by MAS occurred before the sale of Aviva Singapore to a consortium led by Singapore Life, which was completed in November 2020.\n \nSince then, Aviva said, it has made leadership changes to strengthen management effectiveness and accelerate culture change.“Following the transaction, the newly constituted board has invested significant time and resources to address the underlying issues. We have strengthened our controls to prevent the recurrence of such issues, and these are being validated by an independent external auditor,” the spokesman said.“We will ensure we hold ourselves to high standards on regulatory compliance.” Prudential Singapore said in a statement: “We will work closely with MAS to further enhance our controls in relation to the Balanced Scorecard Framework and accompanying risk management measures, in view of resolving the issues raised so we can continue to provide the highest standard of service to our customers.”\n Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/mas-reprimands-insurers-for-breaching-rules-on-risk-management-commission-payments", "Source": "google"}