{"Type": "", "Time": "2021-06-15", "Headline": "Indonesian badminton champion Markis Kido dies at 36", "Text": "Indonesian doubles badminton champion Markis Kido has died at the age of 36 after he collapsed during a casual match, the country's badminton association said.Kido, who won gold in men's doubles at the 2008 Beijing Olympics, passed out while playing in Jakarta on Monday evening and was later pronounced dead at the hospital, the association said.His untimely death sparked an outpouring of emotion from fans in the badminton-mad country.\"Sending prayers for our nation's pride,\" said one fan on Instagram.\"Thank you, Markis Kido. Indonesians will always remember the 2008 Beijing Olympics. Goodbye, legend.\"Kido's longtime doubles partner Hendra Setiawan described him as an \"amazing and very talented player\".\"Thank you so much for being a great partner in victory and defeat,\" Setiawan said in an online tribute.The cause of Kido's death was not made public, but the former champion suffered from high blood pressure, the Indonesian Badminton Association (PBSI) said in a statement, citing his mother, Zul Asteria.\"He seems to have given his life for badminton,\" she was quoted as saying.The association hailed the once world champion shuttler.\"With his great achievements, Kido was respected on the world stage,\" said its head Agung Firman Sampurna.\"The Indonesian badminton family shares our condolences and feels the great loss of Markis Kido.\"Kido and Setiawan took gold at the Beijing Olympics as well as the 2007 World Championships and the 2010 Asian Games.agn/pb/qanGetting the COVID-19 vaccine in Singapore is easy. According to the Ministry of Health (MOH), as of 17 May 2021, 3.4 million doses have been administered. Here's a guide on how to find a vaccination centre near you.European stock markets rose Tuesday after a mixed showing in Asia, as investors braced for news from a key Federal Reserve interest-rate meeting.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.In the wake of one of the biggest password leaks in history, Apple has unveiled a new biometric-based feature that could one day replace passwords across all Apple devices.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.Board certified internal medicine and obesity specialist reveals what happens after drinking just 1 diet soda. Click here to watch video.A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Here’s a look at the 15 vehicles most likely to last for more than 200,000, and in some cases even 300,000.Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.A French nuclear firm said Monday it was working to resolve a \"performance issue\" linked to a gas build-up at a plant it part-owns in southern China following a US media report of a potential leak there.The nominee to be the top US diplomat for East Asia promised Tuesday that President Joe Biden would keep building relations with Taiwan, but balked at backing an overhaul of delicate arrangements on the issue with China.This new car cloth can easily remove all the car scratches and dents from your car.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.If you’re wondering whether Ethereum is a good long term investment, keep reading.Looking for travel insurance? Save more with these promo codes and discounts from insurers such as FWD, MSIG, AXA, and more! To find out if your travel insurance covers COVID-19, read this article for the latest updates. No matter your travel itinerary, travel insurance is […] The post Travel Insurance Promotions and Discounts appeared first on SingSaver Blog - We Compare, You Save.Every PC user must read this in 2021 - Do it now.Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the challenges posed by its policies.Toshiba apologised to shareholders Monday and said it would remove two directors after a probe found the Japanese conglomerate had sought government help to try and influence a boardroom vote.Father's Day is coming up.  Show him that you care with a special unique gift.With its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Asset sales in a liquidation process at Hyflux Ltd., Singapore’s highest-profile distressed company, would likely bring in less than S$200 million, a person familiar with the matter said, a fraction of the amount creditors are claiming.A 20-year-old male polytechnic student on internship with a hospital secretly recorded a staff relieving herself at Jurong Medical Centre in January, a court heard.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/indonesian-badminton-champion-markis-kido-071808072.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}