{"Type": "", "Time": "2021-06-15", "Headline": "All 14 new COVID cases in Singapore in community", "Text": "SINGAPORE — The Ministry of Health (MOH) on Tuesday (15 June) confirmed 14 new COVID-19 cases in Singapore, taking the country's total case count to 62,315.All of them are local cases in the community, of whom nine of 10 linked cases belong to the 115 Bukit Merah View Market & Food Centre cluster. The cluster now has 25 cases.Tuesday marks the 51st consecutive day with local cases reported as well as the first time since 29 June last year to have no imported cases reported.\"Amongst the new cases today, four are asymptomatic, and were detected from our proactive screening and surveillance, while 10 were symptomatic,\" said the MOH.The four unlinked cases in the community are:a 41-year-old Filipino woman who is a foreign domestic worker (received first dose of vaccine)a 36-year-old Singaporean woman who is a homemakera 30-year-old Singaporean woman who works as a sales representative at Imperva Singaporea 35-year-old Singaporean man who is currently unemployedSeparately, one case has been linked to the 36-year-old woman, who is his family member and household contact. He is a 35-year-old Singaporean man who works as a senior executive at NETS.The ministry noted that the number of new cases in the community has decreased from 93 in the week before to 60 in the past week. The number of unlinked cases in the community has increased from 10 in the week before to 18 in the past week.The MOH also announced the closure of two clusters – \"Case 63290\" and White Sands – as there have been no cases linked to them for the past two incubation periods, or 28 days. Singapore currently has 44 active COVID-19 clusters.The cluster was first linked to a 74-year-old Singaporean man who works at a sundry store at the food centre. The fully-vaccinated man was confirmed to have COVID-19 on 9 June.Three of the nine new cases linked to the cluster work at the food centre and had been quarantined earlier:a 37-year-old female India national who is a food stall vendora 77-year-old Singaporean man who is a food stall vendor (fully vaccinated)a 39-year-old male India national who is a food stall vendor (fully vaccinated)Of the remaining six, most are family members or household contacts, or both, of cases in the cluster:a 30-year-old male India national who works as a supervisor at Keong Hong Construction (quarantined earlier)a 33-year-old female permanent resident who is a cleaner employed by SATS Facility Management (quarantined earlier)a 35-year-old Singaporean woman who is a teacher at KidsCampus at Chai Cheea 87-year-old Singaporean man who is a retiree; frequently visits 115 and 116 Bukit Merah View (link to cluster cases not mentioned)a 35-year-old male India national who works as a sales executive at Halnaz Frozen Goods (link to cluster cases not mentioned)a 72-year-old Singaporean man who is a retiree (fully vaccinated, link to cluster cases not mentioned)The food centre, initially planned for a 13 to 15 June closure, will now be closed to members of the public till 26 June, said the MOH on Tuesday. This is due to the detection of more cases amongst the market and food centre staff and their close contacts, which suggests that there is \"ongoing spread with wider transmission\", the ministry noted.All staff and tenants who have been working at 115 Bukit Merah View Market & Food Centre from 25 May have been placed on quarantine, and are tested during quarantine.The MOH said that special testing operations have commenced on Monday for all staff and tenants who have been working in 116 Bukit Merah View from 25 May. Free COVID-19 testing has also been extended to members of the public who had visited the shops at 115 and 116 Bukit Merah View between 25 May and 12 June, it added. These testing operations are in progress, said the MOH.\"All visitors to 115 and 116 Bukit Merah View between 25 May and 12 June are advised to monitor their health closely, and minimise social interactions as far as possible, for 14 days from their date of visit. They are encouraged to see a doctor immediately if they feel unwell,\" the ministry stressed.With 17 more patients discharged from hospitals or community isolation facilities on Tuesday, 61,911 cases – or 99.4 per cent of the total – have fully recovered from the infection.Most of the 137 hospitalised cases are stable or improving, while two of them are in critical condition in the intensive care unit.A total of 233 patients – with mild symptoms or are clinically well but still test positive – are isolated and cared for at community facilities.Apart from the 34 patients who have died from COVID-19 complications, 15 others who tested positive for the virus were determined to have died from unrelated causes, including three whose deaths were attributed to a heart attack and another four, whose deaths were attributed to coronary heart disease.Among the 96 confirmed cases reported from 9 to 15 June, 40 cases have tested positive for their serology tests, 41 have tested negative, and 15 serology test results are pending.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:'Not possible to have fair hearing': Woman without mask at MBSMan who smuggled 3 dogs and 3 cats from pet shop in JB jailed 24 weeksE-scooter, PAB riders must pass online theory test from 1 Jan 2022Getting the COVID-19 vaccine in Singapore is easy. According to the Ministry of Health (MOH), as of 17 May 2021, 3.4 million doses have been administered. Here's a guide on how to find a vaccination centre near you.European stock markets rose Tuesday after a mixed showing in Asia, as investors braced for news from a key Federal Reserve interest-rate meeting.New $89 Portable Air Cooler Everyone In The U.S. Is Talking AboutAn American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.In the wake of one of the biggest password leaks in history, Apple has unveiled a new biometric-based feature that could one day replace passwords across all Apple devices.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.Luxury rehab centers near you could have you living the amazing lifestyle you dreamed of. See luxury rehab centers.A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Board certified internal medicine and obesity specialist reveals what happens after drinking just 1 diet soda. Click here to watch video.Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.A French nuclear firm said Monday it was working to resolve a \"performance issue\" linked to a gas build-up at a plant it part-owns in southern China following a US media report of a potential leak there.The nominee to be the top US diplomat for East Asia promised Tuesday that President Joe Biden would keep building relations with Taiwan, but balked at backing an overhaul of delicate arrangements on the issue with China.Mortgage Refi Alert: Rates now at 1.77% FIXED - No hidden points or fees! 1.97% APR. Takes 2 minutes to start. Massive Savings.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.If you’re wondering whether Ethereum is a good long term investment, keep reading.Looking for travel insurance? Save more with these promo codes and discounts from insurers such as FWD, MSIG, AXA, and more! To find out if your travel insurance covers COVID-19, read this article for the latest updates. No matter your travel itinerary, travel insurance is […] The post Travel Insurance Promotions and Discounts appeared first on SingSaver Blog - We Compare, You Save.Unique New “Hybrid Driver” Launches High, Carries Long and Splits Fairways Like Nothing You’ve Ever Played. (Watch Now)Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the challenges posed by its policies.Toshiba apologised to shareholders Monday and said it would remove two directors after a probe found the Japanese conglomerate had sought government help to try and influence a boardroom vote.These professional cleaning services will do the job for much cheaper than you might think. Search your options!With its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Asset sales in a liquidation process at Hyflux Ltd., Singapore’s highest-profile distressed company, would likely bring in less than S$200 million, a person familiar with the matter said, a fraction of the amount creditors are claiming.A 20-year-old male polytechnic student on internship with a hospital secretly recorded a staff relieving herself at Jurong Medical Centre in January, a court heard.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/all-14-new-covid-cases-in-singapore-in-community-074801883.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}