{"Type": "", "Time": "2021-06-15", "Headline": "Eriksen 'stable' but reason for heart attack not clear, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.COPENHAGEN • Denmark playmaker Christian Eriksen remained in hospital yesterday but is in a \"stable\" condition after collapsing during his country's Euro 2020 Group B game against Finland on Saturday, the Danish Football Union (DBU) said.\"This morning, we have spoken to Christian Eriksen, who has sent his greetings to his team-mates. His condition is stable, and he continues to be hospitalised for further examination,\" it tweeted.The 29-year-old player suffered a cardiac arrest, the team doctor confirmed, but the reason remained unclear.\"He was gone; we did cardiac resuscitation, it was a cardiac arrest. We got him back after one defib (defibrillation),\" Dr Morten Boesen told a news conference, adding that Eriksen remained in hospital for further tests.\"The exams that have been done so far look fine. We don't have an explanation to why it happened.\"The DBU also said that the team and staff had \"received crisis assistance and will continue to be there for each other after yesterday's incident\".The news will have come as relief to Eriksen's current and former teammates, many of whom wished him well.The Inter Milan midfielder collapsed in the 43rd minute of Denmark's Euro 2020 opener, laying motionless on the pitch as medical personnel performed cardiopulmonary resuscitation (CPR).Captain Simon Kjaer reportedly helped to clear Eriksen's airways first and started CPR before medics took over. Goalkeeper Kasper Schmeichel was seen consoling Eriksen's wife Sabrina Kvist. Both players earned widespread praise as heroes.The game was suspended temporarily but after receiving confirmation that Eriksen was all right and in a stable condition and awake, Uefa gave the Danes an option to resume the game shortly or restart yesterday at noon local time.1. FABRICE MUAMBAThe Bolton man collapsed during an FA Cup match in 2012 due to a cardiac arrest and was technically \"dead\" for 78 minutes before he was revived. The former England Under-21 midfielder had to retire soon after at the age of 24.2. ANTONIO PUERTAThe Sevilla midfielder collapsed during a Spanish La Liga match in 2007 and again in the dressing room. He was rushed to hospital, where he died three days later of multiple organ failure due to cardiac arrest at the age of 22.3. MARC-VIVIEN FOEThe Cameroon midfielder, 28, died during a Confederations Cup match in 2003. Medical staff failed to restart his heart on the pitch and he was pronounced dead.REUTERSThe former Tottenham star was said to have told his teammates to return to the field and Denmark coach Kasper Hjulmand also insisted there was no pressure from Uefa, but some felt the game should have been called off and rescheduled to a later date.Manchester United great Peter, the Danish custodian's father, told the BBC: \"It's a ridiculous decision by Uefa. They should have tried to work out a different scenario and shown a little bit of compassion, and they didn't.\"When the game resumed, the atmosphere at Parken Stadium was considerably muted and the hosts appeared to be distracted, slipping to a 1-0 defeat courtesy of Joel Pohjanpalo's second-half winner.The header was one that Kasper would normally have saved as it was straight at him, while Kjaer had to be taken off in the 63rd minutes as the defender was too \"overwhelmed\" to continue.Denmark's Yussuf Poulsen won a penalty when he went down under slight contact in the 73rd minute. In the absence of usual spot-kick taker Eriksen, Pierre-Emile Hojbjerg assumed the responsibility but the midfielder could only hit his penalty straight at Finland goalkeeper Lukas Hradecky and Hjulmand later admitted that his players were \"traumatised\".In the aftermath of the shocking event, conspiracy theories sprung up on the Internet, suggesting that Eriksen had previously contracted Covid-19 and had been vaccinated.But Inter director Giuseppe Marotta dismissed those claims, saying there was no truth behind them, while Eriksen's former cardiologist, Dr Sanjay Sharma of St George's, University of London, added he had no heart issues during his seven-season spell at Spurs.The DBU yesterday called off a scheduled press conference while the team's next training session was postponed indefinitely, local broadcaster TV2 reported.AGENCE FRANCE-PRESSE, REUTERSJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/eriksen-stable-but-reason-for-heart-attack-not-clear", "Source": "google"}