{"Type": "", "Time": "2021-06-15", "Headline": "Chinese Netizens Still Haven’t Forgiven D&G | BoF", "Text": "Hong Kong singer and actress Karen Mok has apologised in response to backlash over her new music video, in which she wears multiple Dolce & Gabbana pieces, SupChina reports.In the video for Mok’s song, “Woman for All Seasons,” she wears a D&G robe, swimsuit and accessories; when the video was released, she changed her profile photo on social media platform Weibo to one of her donning the brand’s robe. Commentators quickly criticised her for supporting the brand, with some calling for a boycott. The backlash worsened after journalists pointed out that Mok was the first Chinese artist to sport the brand’s wares in public after its fall from grace several years ago.During an interview conducted over the weekend, Mok said in Mandarin that though there was no ill will behind the styling choices, she and her team were “definitely in the wrong,” and promised to be more careful in the future. Many netizens have since accepted her apology, but the same can’t be said for the luxury brand, which remains in the doghouse.In November 2018, the Italian luxury brand’s video campaign featuring a Chinese model attempting to eat pizza with chopsticks angered social media users, who called for a nationwide boycott after designer Stefano Gabbana responded to comments by referring to Chinese as “ignorant dirty smelling mafia.” A major runway show Dolce & Gabbana was planning to hold in Shanghai was swiftly cancelled as a result.\n                                    Ssense Raises Money from Sequoia at $4.1 Billion Valuation, Eyes Chinese Market  \n                                                                    \n                                    The Rise of Google Shopping\n                                                                    \n                                    The State of Fashion: Watches and Jewellery Report — Bringing the Sparkle Back\n                                                                    \n                                    Reinventing Luxury Retail for the Post-Pandemic Era\n                                                                    \n                                    The ‘Re-Signification’ of Valentino\n                                                                    \n                                    Gap’s First Yeezy Product Is Here\n                                                                    \n                                    How Ssense Became a Quiet Contender in Fashion’s E-Commerce Race \n                                                                    \n                                    Inside Ferrari’s Fashion Reboot\n                                                                    \n                                    How to Avoid Brand Ambassador Controversy in China\n                                                                    \n                                    Ferrari’s First Fashion Collection \n                                                                    \n                                    Careers Counsel | How to Avoid Burning Out at Work\n                                                                    \n                                    How to Avoid Brand Ambassador Controversy in China\n                                                                    \n                                    Luxury’s Latest Battleground: Material Science \n                                                                    \n                                    The Rise of Google Shopping\n                                                                    \n                                    Retail’s Post-Covid Labour Shortage\n                                                                    \n                                    Brooks Brothers Goes Casual in Post-Bankruptcy Revamp\n                                                                    \n                                    Stella Bugbee Named Editor of New York Times Styles Section\n                                                                    \n                                    Former Tapestry CEO Victor Luis Invests in Moose Knuckles\n                                                                    \n                                    The Future of Watches: The Pre-Owned Market Will Be Worth Up To $32 Billion\n                                                                    \n                                    Team India Drops Li Ning as Kit Sponsor Ahead of Tokyo Games\n                                                                    \n                                    How to Avoid Brand Ambassador Controversy in China\n                                                                    \n                                    Israel Becomes the First Country to Ban Fur\n                                                                    \n                                    Careers Counsel | How to Avoid Burning Out at Work\n                                                                    \n                                    Luxury’s Latest Battleground: Material Science \n                                                                    \n                                    The Rise of Google Shopping\n                                                                    \n                                    Retail’s Post-Covid Labour Shortage\n                                                                    \n                                    Brooks Brothers Goes Casual in Post-Bankruptcy Revamp\n                                                                    \n                                    Stella Bugbee Named Editor of New York Times Styles Section\n                                                                    \n                                    Former Tapestry CEO Victor Luis Invests in Moose Knuckles\n                                                                    \n                                    The Future of Watches: The Pre-Owned Market Will Be Worth Up To $32 Billion\n                                                                    \nSite Map\n                    © 2021 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions and Privacy Policy.\n                ", "Section": "", "Writers": "", "URL": "https://www.businessoffashion.com/news/china/chinese-netizens-still-havent-forgiven-dg", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}