{"Type": "", "Time": "2021-06-15", "Headline": "Man who fled to Thailand cheated mask buyers in Singapore", "Text": "SINGAPORE — A man who was under investigation for drug offences fled to Thailand while on bail.Despite being away from Singapore, Jonathan Poh Yu Qin, described by the prosecution as a “serial cheater”, managed to scam $16,842 in total from victims in Singapore by promising them masks he did not have.Poh, 24, was jailed for one year and two months on Tuesday (15 June), with an additional jail term of 134 days for reoffending while he was serving a remission order for a previous offence.The Singaporean pleaded guilty to four out of 12 charges of cheating, with the remaining taken into consideration for sentencing. Poh was on remission from 5 October 2019 to 9 June 2020 for a 2019 offence, also involving cheating, when he reoffended.On 25 November 2019, Poh fled to Thailand while on bail and under investigation for drug offences. He met his wife, who was waiting for him there.While in Thailand, Poh began advertising the sale of surgical masks on Telegram and Carousell, and used the proceeds he cheated on his personal expenses.Using pseudonyms like “Kenji”, “Kenji Wong” and “Kenk3n”, Poh would then solicit pre-orders of surgical masks and ask victims to transfer deposits to him. After he received the monies, however, he would disappear and none of the victims, of which there were at least 12, received their orders.The largest amount came from a 23-year-old woman who contacted Poh on 28 January last year to buy surgical masks after seeing his advertisement on a Telegram group titled “SG Free Marketplace (Buy/ Sell/ Trade/ Advertise)”.She placed an order for 30 cartons of surgical masks and transferred $13,925 into Poh’s bank account. Although Poh assured her that he would deliver the masks to her on 31 January, the woman never received the masks she bought.The victim lodged a police report on 1 February 2020.Another victim made an order for N95 surgical masks for his clinics after friends working at another clinic passed Poh’s contact to him. The victim, a 37-year-old man, placed an order for 200 boxes and paid $1,650 to Poh but he never received his order.Another victim, a 47-year-old man, contacted Poh after seeing the advertisement on Telegram. To convince the victim of the legitimacy of his ‘business’, he sent the victim screenshots of payments allegedly made by other buyers.He transferred $375 to Poh, who directed him to meet him at Toh Guan ExtraSpace. While the victim followed his instructions, Poh never showed up and stopped returning the victim’s calls and messages.Poh was arrested upon his return to Singapore on 25 February this year. No restitution was made to the victims.Deputy Public Prosecutor Claudia Chen said that Poh’s cheating offences date back to 2017, showing the he had a blatant disregard for the law and no regard to reforming himself. The prosecution sought at least 14 months’ jail for the offences and another 134 days’ jail for his breach of remission order.Poh, who represented himself, said that he went to Thailand where his wife was waiting because he “really did not do the offences related to drugs”.He told the court that the charges were for having an amount of methamphetamine, which he claimed had belonged to his friend.“I was told by the Central Narcotics Bureau that I was being monitored because I was trafficking,” he added. Poh currently does not face any drug-related charges.“I have been holding a job ever since...I ran and when I was in Thailand I was also working, it was paying very low. I resorted to cheating because of my family and my kid. I am a young father and my kid is one this year. I resorted to cheating because I really could not find a way out,” he said.Appearing through videolink, Poh told District Judge Marvin Bay that he surrendered and admitted everything upon returning to Singapore as his parents were old and told him that they “did not have much time” left.DJ Bay said he agreed with the prosecution that a “hard stance” was needed to deal with scams related to COVID-19 given the vulnerability of the public to such hoaxes.He told Poh, “You are still a young man, aged 24 with a child. You really need to find a better way to make a living.”For cheating, Poh could have been jailed up to 10 years and fined.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:Landlord who kept exposing himself to female tenant jailed and finedAll 14 new COVID cases in Singapore in communityGetting the COVID-19 vaccine in Singapore is easy. According to the Ministry of Health (MOH), as of 17 May 2021, 3.4 million doses have been administered. Here's a guide on how to find a vaccination centre near you.European stock markets rose Tuesday after a mixed showing in Asia, as investors braced for news from a key Federal Reserve interest-rate meeting.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.In the wake of one of the biggest password leaks in history, Apple has unveiled a new biometric-based feature that could one day replace passwords across all Apple devices.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.Board certified internal medicine and obesity specialist reveals what happens after drinking just 1 diet soda. Click here to watch video.A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Every PC user must read this in 2021 - Do it now.Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.A French nuclear firm said Monday it was working to resolve a \"performance issue\" linked to a gas build-up at a plant it part-owns in southern China following a US media report of a potential leak there.The nominee to be the top US diplomat for East Asia promised Tuesday that President Joe Biden would keep building relations with Taiwan, but balked at backing an overhaul of delicate arrangements on the issue with China.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.If you’re wondering whether Ethereum is a good long term investment, keep reading.Looking for travel insurance? Save more with these promo codes and discounts from insurers such as FWD, MSIG, AXA, and more! To find out if your travel insurance covers COVID-19, read this article for the latest updates. No matter your travel itinerary, travel insurance is […] The post Travel Insurance Promotions and Discounts appeared first on SingSaver Blog - We Compare, You Save.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the challenges posed by its policies.Toshiba apologised to shareholders Monday and said it would remove two directors after a probe found the Japanese conglomerate had sought government help to try and influence a boardroom vote.New research has identified TEN favorite stocks for the upcoming yearWith its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Asset sales in a liquidation process at Hyflux Ltd., Singapore’s highest-profile distressed company, would likely bring in less than S$200 million, a person familiar with the matter said, a fraction of the amount creditors are claiming.A 20-year-old male polytechnic student on internship with a hospital secretly recorded a staff relieving herself at Jurong Medical Centre in January, a court heard.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/man-fled-thailand-drug-charges-cheated-mask-buyers-singapore-094206858.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}