{"Type": "", "Time": "2021-06-15", "Headline": "Delta variant doubles risk of Covid-19 hospitalisation: Scottish study, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.LONDON (REUTERS) - The Delta coronavirus variant doubles the risk of hospitalisation compared with the previously dominant variant in Britain, but two doses of vaccine still provide strong protection, a Scottish study found on Monday (June 14).The study said early evidence suggested that the protection from vaccines against the Delta variant, first identified in India, might be lower than the effectiveness against the Alpha variant, first identified in Kent, south-east England.British Prime Minister Boris Johnson is expected to delay the ending of Covid-19 restrictions in England on Monday, following a rapid rise in cases of the Delta variant, which is also more transmissible than the Alpha variant.The study, published in a research letter in the Lancet, looked at 19,543 community cases and 377 hospitalisations among 5.4 million people in Scotland - 7,723 cases and 134 hospitalisations of which were found to have the Delta variant.Professor Chris Robertson,  an expert on public health epidemiology at University of Strathclyde, said that adjusting for age and co-morbidities, the Delta variant roughly doubled the risk of hospitalisation, but vaccines still reduced that risk.\"If you test positive, then two doses of the vaccine or one dose for 28 days roughly reduces your risk of being admitted to hospital by 70 per cent,\" he told reporters.Two weeks after the second dose, Pfizer BioNTech's vaccine was found to have 79 per cent protection against infection from the Delta variant, compared with 92 per cent against the Alpha variant. For Oxford-AstraZeneca's vaccine, there was 60 per cent protection against Delta compared with 73 per cent for Alpha.The researchers cautioned against using the data to compare the vaccines against each other due to differences in the cohorts which received each type of shot, and differences in how quickly immunity is developed with each shot.They said two doses of vaccine provide much better protection than one dose against the Delta variant, and a delay to easing lockdown in England would help more people get second doses and for their immune responses to build up.\"I think any sort of increase in the window of opportunity before lockdown measures are completely brought to an end will be helpful,\" said Professor Aziz Sheikh, director of the Usher Institute at the University of Edinburgh.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/delta-variant-doubles-risk-of-covid-19-hospitalisation-scottish-study", "Source": "google"}