{"Type": "Singapore", "Time": "2021-06-15", "Headline": "Jail for man who cheated Singapore victims in mask scam while on the run in Thailand", "Text": "SINGAPORE: While under investigation for drug-related offences, a Singaporean man fled to Thailand and turned to cheating victims in Singapore by claiming to sell surgical masks online.Jonathan Poh Yu Qin, 24, was arrested when he returned to Singapore in February.He was sentenced on Tuesday (Jun 15) to 14 months in prison and an additional enhanced term of 134 days' jail.The court heard that Poh fled to Thailand in November 2019 as he was being investigated by the Central Narcotics Bureau (CNB) for drug-related offences.In Thailand, he scammed victims via online marketplace Carousell and chat application Telegram, offering surgical masks for sale but failing to deliver them.Between January and February 2020, he cheated 12 victims of S$16,842.One victim was cheated of S$13,925 in January 2020 after placing an order for 30 cartons of surgical masks. After transferring the money to Poh's bank account as instructed, the victim could not contact him.Several other victims were tricked by Poh in this way, with amounts ranging from a few hundred dollars to more than S$1,000.Poh has not made any restitution.The prosecutor called for at least 14 months' jail, with an additional enhanced sentence for reoffending while on remission.She said Poh had been convicted twice before of cheating. He was sentenced to probation for a conviction in 2017, but breached probation and was re-sentenced to jail and a S$30,000 fine. In 2019, he was convicted of cheating and jailed for 21 months.Deputy Public Prosecutor Claudia Chen said there has been an exponential increase in scams recently, and it is important for the court to take a hard stance against such scams.She called Poh \"a serial cheater\" whose recalcitrance shows \"a blatant disregard for the law\".He also exploited the COVID-19 situation and relied on the sale of surgical masks, seeking to capitalise and prey on the public's fears over the pandemic, she said.ACCUSED SAYS HE DID NOT COMMIT DRUG OFFENCESPoh, who was unrepresented and spoke via video-link from his place in remand, said he escaped to Thailand as he did not commit the drug offences. He had been facing a charge of holding methamphetamine, but the drug belonged to his friend and he no longer faces the charge, he claimed.\"When I was in Thailand, I was also working, and it was paying very low,\" he said. \"I resorted to cheating because of my family and my kid.\"He said he had gone to Thailand to meet his wife and his child, who is one year old now.The prosecutor confirmed that Poh does not face pending drug charges, but said this does not change the fact that he fled while on bail and under investigation.District Judge Marvin Bay told Poh that this is the third time he is facing a court for cheating, noting that he is only 24.\"Despite having fled to Thailand, you were able to commit a spate of offences against victims in Singapore,\" he said. \"I agree with the prosecution that a hard stance against COVID-19-related scams is merited, given the vulnerability of the public to such scams in a time of heightened fear of contracting the disease and a ... desire to protect themselves and their loved ones.\"\"Mr Jonathan you are still a young man and you have a child,\" said Judge Bay. \"You really need to find a better way to make a living.\"For each charge of cheating, Poh could have been jailed for up to 10 years and fined.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "court,crime,COVID-19", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/scam-face-masks-man-fled-to-thailand-cheating-15018446", "Source": "google"}