{"Type": "", "Time": "2021-06-15", "Headline": "Park Seo Joon reportedly cast in ‘The Marvels’ alongside Brie Larson", "Text": "If confirmed, Park will be the third South Korean actor to be cast in a Marvel film South Korean actor Park Seo Joon has reportedly been cast in Marvel’s upcoming superhero action flick, The Marvels.According to Soompi, Park’s involvement in the film was first reported by industry representatives, but the actor’s agency Awesome ENT has yet to confirm the rumours. The company has since responded with a “no comment” when contacted for more information.The reports also claimed that Park will travel to the United States later this year to begin working on The Marvels once he wraps filming on Korean disaster movie Concrete Utopia.Should Park’s casting in the film be confirmed, it would make him the third South Korean actor to star in a major Marvel film, following Ma Dong Seok’s (Train To Busan) upcoming role in Chloé Zhao’s The Eternals. Actress Claudia Kim had previously starred in Avengers: Age of Ultron as Dr Helen Cho.The Marvels – currently set to premiere in July next year – is the highly anticipated sequel to 2019’s Captain Marvel. Brie Larson is set to reprise her role as Carol Danvers/Captain Marvel with Iman Vellani as Kamala Khan and Teyonah Parris as Monica Rambeau.Park Seo Joon is best known for his roles in popular Korean drama series such as Itaewon Class, What’s Wrong With Secretary Kim, Kill Me, Heal Me and films like The Chronicles Of Evil and Be With You. He’d also made a short cameo as Min-hyuk in Bong Joon Ho’s acclaimed 2019 film, Parasite.\nShowbox’s 2020 hit limited series Itaewon Class ranked in the seventh spot in NME‘s 10 Best Asian TV Shows Of 2020 list. NME‘s Hidzir Junaini described the show as a “fun, twist-laden journey filled with betrayal, murder, a cooking competition, and lots and lots of pining”.The world's defining voice in music and pop culture since 1952.\n    © 2021 NME is a member of the media division of BandLab Technologies.\n", "Section": "", "Writers": "", "URL": "https://www.nme.com/en_asia/news/film/park-seo-joon-reportedly-cast-in-the-marvels-alongside-brie-larson-2969707", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}