{"Type": "", "Time": "2021-06-15", "Headline": "Man, 78, apprehended after falling from sixth-floor window ledge of Geylang Bahru block", "Text": "This story was submitted via Web contribution form.Click here to submit a story or submit it to our WhatsApp.This story was submitted via Web contribution form.Click here to submit a story or submit it to our WhatsApp.A 78-year-old man was taken to hospital and subsequently apprehended after falling from a window ledge on the sixth floor of Block 61 Geylang Bahru on June 9.Several Stompers alerted Stomp to a video circulating online of a man sitting on the window ledge.While Singapore Civil Defence Force (SCDF) officers are preparing to rescue the man, he falls.He hits the ledge before falling onto a safety life air pack set up at the foot of the block.Bystanders can be heard collectively gasping as he falls.In response to a Stomp query, the SCDF said they received a call for assistance at about 4.25pm.\"After SCDF deployed a safety life air pack, the person fell on it,\" an SCDF spokesman said.\"SCDF conveyed the person to Tan Tock Seng Hospital.\"The police were alerted to a call for assistance at 3.27pm and told Stomp the 78-year-old man was conscious when taken to the hospital.\"He was subsequently apprehended under Section 7 of theMental Health (Care and Treatment) Act,\" a police spokesman said.Get more of Stomp's latest updates by following us on Facebook, WhatsApp, Twitter, Instagram and YouTube.View the discussion thread.View the discussion thread.Download the new STOMP app today.SPH Digital News | The Straits TimesAll rights reserved | Terms & Conditions | Data Protection Policy | Advertise with usSPH Digital News / STOMP / Copyright (c) 2019 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E.", "Section": "", "Writers": "", "URL": "https://stomp.straitstimes.com/singapore-seen/man-78-apprehended-after-falling-from-sixth-floor-window-ledge-of-geylang-bahru-block", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}