{"Type": "", "Time": "2021-06-15", "Headline": "Signs your hybrid workplace could be toxic", "Text": "An award-winning team of journalists, designers, and videographers who tell brand stories through Fast Company's distinctive lensThe future of innovation and technology in government for the greater goodOur annual guide to the businesses that matter the mostLeaders who are shaping the future of business in creative waysNew workplaces, new food sources, new medicine--even an entirely new economic systemCelebrating the best ideas in businessWith the pandemic in the U.S. winding down, many companies are contemplating how to best resume their operations. Though some have decided to stay fully remote for the long term, nine out of 10 companies plan to shift to a hybrid work environment.That said, of those companies, 68% don’t have a detailed plan in place, with 32% of companies just starting the conversation. As a result, employees are anxious about returning to in-person work and what their jobs will look like post-pandemic.Switching over to a hybrid workplace takes thoughtful planning and careful execution. To help employees and job seekers better navigate the post-pandemic work world, FlexJobs has identified 10 red flags that could indicate a hybrid workplace is toxic.It’s important to note that a toxic hybrid workplace may not have all 10 of these red flags. Some may have only a few. Likewise, if a company has one of these red flags, that’s not necessarily proof of a toxic workplace. It could just indicate that the transition to a hybrid workplace is going to be bumpy.When it comes to designing functional hybrid work policies, it’s crucial employers create fair policies that apply equally to employees no matter where they work.If the company doesn’t seem committed to creating a clear set of policies that integrate remote and hybrid teams into the in-person workforce and to building a vibrant hybrid work culture, or if it creates policies that seem to treat remote and hybrid employees differently than in-office workers, it’s likely an unhealthy workplace.A company that values remote or hybrid work walks the walk. That means it allows and encourages people at all levels—from entry-level to the C-suite—to work remotely or in a hybrid arrangement.If only early or mid-level employees are remote or hybrid, it could indicate that off-site workers can’t move up the career ladder unless they move to in-person work. Examine the organization to see if there are remote or hybrid workers at every career level. A lack of remote or hybrid higher-ups could indicate you won’t have long-term success at this company unless you are 100% in-person.The advantage of in-person work is that communication is usually streamlined. You can pop into someone’s office to ask a question, get clarification on a project, or chat about weekend plans in real time. Even casual conversations that help form and strengthen bonds among employees are easier when employees gather in the employee break room.The same is not true for off-site staff. Communication is one of the harder parts of remote work. But, if the company has prioritized communication through the use of digital tools (e.g., using Zoom for all meetings, or having all projects managed and tracked in an online collaboration tool), in-person and hybrid workers alike will find communication and collaboration easier and more equitable.Find out how the company communicates or plans to communicate with all employees. Ask how they view synchronous versus asynchronous communications. Learn how each team collaborates on projects and how they get work done.Often a large part of company culture includes celebrating, praising, and rewarding employees. This can help staff feel valued and that their work matters to the organization. If celebrations only happen in the office, or the company doesn’t make a conscious effort to include remote workers, this could be a red flag.Communication tools make it easy to share kudos with the entire organization, and virtual events can be organized to include everyone. Companies committed to remote and hybrid employees use these tools to praise and include everyone equally.It’s not enough to have the proper remote communication tools in place. Everyone must use those tools efficiently and effectively to keep remote, hybrid, and in-person employees in the loop.If remote and hybrid employees are always out of the loop, their careers may never thrive at the company. For example, if a project deadline is changed, but this change is not noted in the project management tool, remote and hybrid employees may miss deadlines or work overtime to get something done “now” that could have waited until “later,” which could make them feel undervalued or even taken advantage of.Depending on the size of the company and where remote and hybrid employees live, some workers may be one or even several time zones away from the main office. While there are ways to overcome and work with time zone differences, if the company always holds meetings when it’s convenient for the in-person staff, this could indicate a toxic workplace.Companies that commit to and embrace hybrid and remote work make an effort to rotate meeting times, so off-site employees don’t always have to meet at 5:00 a.m. or 8:00 p.m. Likewise, companies that value remote employees make it clear during the hiring process that there are core hours staff have to be available for meetings, so they know exactly what they are signing up for before they accept the job.In general, a lack of information is often a sign of a toxic work environment. However, when it comes to remote and hybrid workplaces, it’s not just a lack of information that’s a red flag.Companies that aren’t committed to remote workers may not make information easily accessible. While this can be done with intent, it can also happen unintentionally. In either case, when a company does not create and maintain a central platform for sharing crucial information with everyone, that’s a sign of a toxic hybrid workplace.For example, if policy manual updates are only shared as a hard copy that’s distributed by human resources and never posted online, remote and hybrid workers won’t know about the policy changes. They may find out about it from another coworker or never hear about it at all, which could lead to remote and hybrid employees feeling “less than” compared to their in-office counterparts.Lack of an upward career path may or may not be a red flag for your professional plans. However, if it seems that in-person employees have a more clear-cut path for career development or advancement compared to remote or hybrid staff, that’s an indication that the company does not value remote workers or see them as part of a larger strategic plan.Remote and hybrid employers need to think about providing off-site staff with supplies. This can range from computers and monitors to internet connections and ergonomically correct chairs.Employers can provide staff with equipment or reimburse the expenses. Alternatively, some companies may say you can buy and use whatever device or supplies you want and not reimburse you for them, effectively making them yours to keep when you leave the company.That said, it’s important to note that employers are not necessarily required to reimburse remote employees for their work-related expenses. The exception is if the expenses would cause the employee’s pay to fall below the minimum wage.Though employers are not required to reimburse remote-related work expenses, the failure to reimburse remote and hybrid staff for these expenses when the company provides equipment and supplies to in-person employees is a clear sign of a toxic work environment.Saying that the company is transitioning to a hybrid or fully remote workplace is one thing. Becoming a hybrid or remote workplace is another.As the previous nine points have demonstrated, a lot of careful thought, planning, and execution go into creating and maintaining this kind of work environment. So while a company may announce a shift, they might also create policies that discourage staff from taking advantage of it.For example, the company may say that if you work from home you cannot work flexible hours, and assign them instead. Or, they may schedule meetings for days and times that are inconvenient for you and require your in-person attendance. Actions like these may indicate that the company is not serious about remote and hybrid work.Some policy changes, however, may seem disheartening but are fair. If, say, the company decides staff can work remotely and live anywhere, they may also add a cost of living adjustment that cuts pay for people who relocate. While this may seem like an attempt to discourage staff from remote work, it may not be if the adjustment is applied fairly and the formula for determining salary adjustments is made public to all staff and even applicants.With 83% of workers preferring hybrid work, employers would be wise to examine their current practices and integrate hybrid work into their long-term plans. At the same time, employees and job seekers should approach these changes with caution. Otherwise, whether it’s a hybrid or fully remote workplace, they could end up in a toxic hybrid workplace.This article originally appeared on FlexJobs blog and is reprinted with permission.Innovation in your inbox  Sign up for the daily newsletter ", "Section": "", "Writers": "", "URL": "https://www.fastcompany.com/90646872/ask-these-10-questions-to-find-out-if-your-hybrid-workplace-could-be-toxic", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}