{"Type": "", "Time": "2021-06-15", "Headline": "Men who helped Nissan boss Carlos Ghosn flee Japan admit their role | Carlos Ghosn | The Guardian", "Text": "Michael and Peter Taylor tell Tokyo court of their part in spiriting away executive in musical instrument caseLast modified on Mon 14 Jun 2021 17.40 EDTTwo Americans charged with helping former Nissan chair Carlos Ghosn flee Japan while he was facing accusations of financial misconduct have told a court that they took part in a scheme for him to escape the country.Statements by Michael Taylor and his son, Peter, on the opening day of their trial in Tokyo suggested the pair don’t plan to fight charges of assisting a criminal, which carry a possible penalty of up to three years in prison.Keiji Isaji, one of the attorneys for the Taylors, told the Associated Press after the court session that he wants the trial to “proceed efficiently”. He said ending the trial quickly is “in the best interests of his clients”.He declined to confirm his team was hoping for a suspended sentence if they are convicted, meaning no time would be served. He stressed the decision was up to the judge.The Taylors appeared calm as they were led into the courtroom in handcuffs, with ropes tied around their waists.They said little except to answer the judge’s questions when asked about simultaneous interpreting relayed through headphones.Prosecutors read out a statement accusing Michael Taylor, a former Green Beret, and Peter Taylor of arranging to hide Ghosn in a musical equipment case. It was loaded on to a private jet that flew him from the western city of Osaka to Lebanon via Turkey in December 2019.Ryozo Kitajima, one of the prosecutors, said Peter Taylor met Ghosn at a hotel several times in 2019 and introduced Ghosn to his father. He said Peter Taylor received $562,500 in two transfers to pay for chartering the jet and other expenses.Peter Taylor arranged for Ghosn to change his clothing at a Tokyo hotel. His father and another man, George-Antoine Zayek, later accompanied Ghosn to the Osaka airport, Kitajima said. Zayek has not been arrested.The prosecutors said bitcoins worth $500,000 were transferred from Ghosn’s son Anthony’s account to Peter Taylor in 2020, purportedly to cover the Taylors’ defence costs.Prosecutors said that during their detention the Taylors had expressed remorse and that the pair had been misled to believe helping someone to jump bail was not illegal in Japan.They said Ghosn’s wife, Carole, told them Ghosn was being tortured. The prosecutors quoted the Taylors as saying they were not tortured and were treated in a way that was “fair and professional”.The trial’s next session is set for 29 June, when prosecutors will continue their questioning.The Taylors were arrested in Massachusetts last year and extradited to Japan in March. Ghosn has French, Lebanese and Brazilian citizenship and Lebanon has no extradition treaty with Japan. The authorities say Ghosn paid the Taylors at least $1.3m (£920,000).Ghosn led Nissan Motor Co for two decades before his arrest in 2018. He was charged with falsifying securities reports in under-reporting his compensation and of breach of trust in using Nissan money for personal gain. He says he is innocent and says he fled Japan because he did not expect to get a fair trial. More than 99% of criminal cases in Japan result in convictions.No Japanese executives have been charged in the scandal at Nissan, the Yokohama-based manufacturer of the Leaf electric car, March subcompact and Infiniti luxury models. Extraditions between Japan and the US are relatively rare, even for serious crimes.The possible penalty of three years in prison is the minimum required for an extradition.Before his arrest, Ghosn was an motor industry star, having orchestrated Nissan’s rebound from the brink of bankruptcy after he was sent to Japan by its French alliance partner Renault in 1999.Ghosn’s pay was halved, by about 1 billion yen ($10 million), in 2010 when Japan began requiring disclosure of high executive pay.The concern was that his relatively high compensation might be viewed unfavourably since Japanese top executives tend to draw lower pay packages than their peers in other countries.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/business/2021/jun/14/men-who-helped-nissan-boss-carlos-ghosn-flee-japan-admit-their-role", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}