{"Type": "Singapore", "Time": "2021-06-15", "Headline": "Singapore's new private homes sales fall in May amid tightened COVID-19 measures", "Text": "SINGAPORE: Fewer new private homes in Singapore were sold in May compared to the month before as Singapore's Phase 2 (Heightened Alert) measures kicked in.According to data released by the Urban Redevelopment Authority (URA) on Tuesday (Jun 15), developers sold 891 units private residential units in May, excluding executive condominiums.This represents a 29.7 per cent decline in sales compared to April this year, although it was still about 83 per cent higher than in May last year, when Singapore was in its \"circuit breaker\" period.The Outside Central Region led new home sales in May, with 401 units sold, followed by the Rest of Central Region with 299 units sold and the Core Central Region with 191 units sold, URA data showed.The fall in sales comes amid the Phase 2 (Heightened Alert) measures, which started on May 16 to curb the spread of COVID-19. Viewings were restricted during this period.\"In response to a resurgence of virus infections, stricter measures were imposed on property sales galleries and house viewings, such as having no more than two persons per group (including salesperson) for property viewings,\" said Ms Christine Sun, senior vice-president of research and analytics at OrangeTee & Tie.\"However, the drop in sales volume was not as drastic as a year earlier during the circuit breaker period,\" she added.\"The difference in sales before and after Heightened Alert is not significant. The industry is more prepared for disruption and the usage of virtual viewings might have helped to mitigate the drop in sales,\" said Huttons Asia's CEO Mark Yip.The firm believes that sales in May would have been \"much higher\" if there were no restrictions on showflat viewings, Mr Yip added.Sales performance was stronger this year as the property sector \"seems to be more prepared to ensure business continuity\" amid the tightened measures, said Ms Sun, adding that many developers and sales agents were able to switch to remote viewings quickly.The top five projects which saw the most units sold in May were One Bernam, with 83 units sold, followed by Treasure at Tampines, Normanton Park, Midwood and Affinity at Serangoon.Ten units were sold for at least S$10 million each in May, said Ms Sun. The priciest unit was a 548 sqm 20th floor apartment at Park Nova that sold for S$34.4 million.OUTLOOK AS PHASE 3 (HEIGHTENED ALERT) KICKS INAs COVID-19 restrictions ease, with Singapore now in Phase 3 (Heightened Alert), experts said sales could pick up again.\"There is potential for sales in June to match May’s numbers as the relaxed COVID-19 measures of up to five in a group may see pent-up demand translate into actual sales,\" said Mr Yip, adding that he expects July to be a \"very busy month, with several launches lined up\".Ms Sun said new home sales may pick up again as restrictions are further eased.\"With many HDB owners selling their flats in recent months, we may also expect upgrader demand to remain strong, which will likely boost ... the new sales market,\" she added.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "URA,private home sales,property", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/new-private-home-sales-may-condominiums-covid-19-measures-15018100", "Source": "google"}