{"Type": "", "Time": "2021-06-15", "Headline": "S'pore new private home sales drop 30% in May on heightened alert restrictions, Property News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Developers sold fewer homes in May as the latest round of tighter Covid-19 restrictions dampened showflat and property viewings and slowed new launch activity.New private home sales last month fell nearly 30 per cent to 891 units from 1,268 units in April. But the drop in sales volume was not as drastic as during the first month of the circuit breaker in April 2020, when sales plunged by almost 60 per cent from March 2020, analysts noted. Year on year, bookings were up 83 per cent from May last year.Given the cap on two visitors per group – including the property agent – at showflats, most developers have pushed back their launches until after June 13, or even to July, said Mr Ismail Gafoor, chief executive of PropNex. “In addition, some buyers may prefer to stay home to reduce transmission risk. We think these factors have had some impact on sales. But this is mitigated to an extent by the use of digital tools and virtual tours,” he added. The figures from the Urban Redevelopment Authority exclude executive condominium (EC) units - a public-private housing hybrid.Including ECs sold, developers moved 1,230 new homes last month - just 8.8 per cent lower than in April, and more than double the 510 units sold in May 2020.Developers launched 927 units for sale in May, down 11 per cent from 1,038 in April, and 51 per cent more than 615 units in the same month last year.“The successful containment of Covid-19 spread and progress in the vaccination programme would also give more confidence. Fundamentals have not changed, as buyers are still positive and developers plan to release more units for sale,” said Mr Ong Teck Hui, senior director of research & consultancy at JLL.Three new projects were launched before the heightened alert measures kicked in on May 16 – the executive condominium Provence Residence in Canberra Link and luxury projects One Bernam and Park Nova.Provence Residence and One Bernam were among the best-selling projects last month. Others included earlier launches - Midwood, The Jovell and One Pearl Bank. Together, these projects accounted for 65 per cent of the total units launched. Given current strong HDB resale prices, there will be a ready pool of demand from upgraders.“But with expected construction delays, home buyers could turn to the resale market,” said Ms Catherine He, director of research for Southeast Asia at CBRE .For June, sales could remain muted, due to the absence of major launches, analysts say. But new home sales should rebound from July, when more projects are launched. In the pipeline are Pasir Ris 8 and The Watergardens at Canberra in the suburbs; Klimt Cairnhill and Perfect Ten in the prime districts; and Parc Greenwich EC at Fernvale Lane. These projects, especially those in the suburbs where there is pent-up demand for cheaper mass market units from HDB upgraders, could see strong interest. Last month’s take-up was led by projects in the suburbs with 401 units sold, followed by 299 units taken up in the city fringes and 191 units sold in the prime districts, according to JLL. Despite lower sales in the prime district last month, Park Nova saw 12 units sold from $6.8 million to more than $34 million. Its biggest penthouse transacted at $5,838 per square foot (psf), beating the recent high of $5,125 psf in another project in the Orchard Boulevard area, noted Mr Mark Yip, chief executive of Huttons Asia.Based on caveats that were lodged, buyers continued to gravitate towards larger homes to accommodate telecommuting and flexible work arrangements, noted Ms Wong Siew Ying, PropNex’s head of research and content.In May, the number of new non-landed homes sold (excluding  ECs) that were 1,200 sq ft and above   accounted for 19.4 per cent of total sales, up from 14.7 per cent in April and 11 per cent in March, she said.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/property/singapore-new-private-home-sales-drop-30-in-may-on-heightened-alert-restrictions", "Source": "google"}