{"Type": "", "Time": "2021-06-15", "Headline": "Man, 60, charged over stabbing at Choa Chu Kang void deck", "Text": "SINGAPORE — A 60-year-old man was charged on Monday (14 June) for allegedly stabbing another man at the void deck of a Choa Chu Kang HDB block.Ong Eng Siew, a Singaporean, was charged with repeatedly stabbing 52-year-old Ku Teck Eng on Saturday at Block 407 Choa Chu Kang Avenue 3. The act was allegedly committed between 9.20 and 9.32pm. Court documents did not state the nature of the two men's relationship or why the act was committed. A police statement on Sunday, however, said the men were known to each other.Ong appeared via videolink to receive his charge. The prosecution applied for him to be remanded so that the case's investigation officer could bring him out to recover evidence, as well as to conduct further investigations on scene. He will return to court on 21 June. In its statement, the police said they were alerted to the incident at around 9.35pm on Saturday. Upon arriving at the scene, officers found Ku with stab wounds. He was conveyed to hospital while conscious.Ong fled the scene before the authorities arrived and was arrested within two hours. Those convicted of attempted murder face imprisonment for life and caning. Ong is ineligible for caning as he is over 50 years old.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:Singapore reports 13 new COVID-19 cases, 10 from the communityCOVID: Social gathering size can increase to 5 per group from 14 June – MTFCOVID: Dine-in at F&B places can resume at max 5 per group from 21 JuneWork-from-home remains default arrangement in Singapore's Phase 3 (HA)4 COVID ART test kits on sale at 3 Singapore pharmacies from 16 June: MTFThe Ministry of Health (MOH) on Tuesday (15 June) confirmed 14 new COVID-19 cases in Singapore, taking the country's total case count to 62,315.A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.Search for private jet membership. The affordable price makes these private jet offers hard to resistReigning champions Portugal begin their defence of the trophy against Hungary at Euro 2020 in Budapest on Tuesday as World Cup holders France take on Germany in a hotly-anticipated clash between two of the continent's heavyweights.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.Board certified internal medicine and obesity specialist reveals what happens after drinking just 1 diet soda. Click here to watch video.Dickson Yeo, the Singaporean man who was jailed in the US for spying for China and was arrested by the Internal Security Department upon his return to Singapore in December will be continue to be detained under the Internal Security Act.The Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.US President Joe Biden arrived Sunday in Brussels for two days of summits with leaders from the NATO military alliance and the European Union.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.The Copa America that almost never was opened Sunday in Brazil, overshadowed by the desperate search for a last-minute host, sponsor withdrawals and Covid-19 -- including outbreaks on three teams.Asset sales in a liquidation process at Hyflux Ltd., Singapore’s highest-profile distressed company, would likely bring in less than S$200 million, a person familiar with the matter said, a fraction of the amount creditors are claiming.In a room warmed by an open wood stove, Baima says her family converted their white-brick house into a hotel as China's Communist leadership ushers tens of millions of tourists to the politically sensitive region of Tibet.Research best security system. Protect yourself and your home with wireless alarm systems.An ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).The WHO warned Monday that Covid-19 was moving faster than the vaccines, and said the G7's vow to share a billion doses with poorer nations was simply not enough.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Spain opened their Euro 2020 campaign with a goalless draw against Sweden in Seville on Monday after their preparations were badly affected by Covid-19, while Patrik Schick scored one of the championship's great goals in the Czech Republic's 2-0 win over Scotland.This new car cloth can easily remove all the car scratches and dents from your car.US President Joe Biden will seek the EU's backing on Tuesday to face the rise of China, but Brussels wants a swift end to lingering trade rows and a clean break from Donald Trump.Major US indices finished at fresh records Monday as global equity markets began the week cautiously ahead of a much-anticipated Federal Reserve meeting.Purchases of new private units in Singapore declined about 30% to 891 in May from 1,268 in April, Urban Redevelopment Authority figures showed.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/man-60-charged-stabbing-choa-chu-kang-void-deck-051309444.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}