{"Type": "", "Time": "2021-06-15", "Headline": "E-scooter and e-bike riders must pass theory test by end of this year: LTA, Transport News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Users of power-assisted bicycles (PABs) and e-scooters will have to pass a mandatory online theory test by the end of this year, in order to continue using them in public spaces.PAB users will have 40 minutes to tackle 40 multiple-choice questions.E-scooter riders will have to answer 30 multiple-choice questions in 30 minutes.The passing score for both tests - which will improve awareness of active mobility rules, code of conduct and safe riding practices - is 80 per cent.The Land Transport Authority (LTA), which announced details of the test on Monday (June 14), said those who pass will receive a digital certificate with no expiry date.It added that it is giving riders time to prepare for the test - which will be rolled out on July 1 - before enforcement kicks in on Jan 1.\"From Jan 1, 2022, riders will be required to show their digital certificate when requested by enforcement officers,\" said LTA.\"We encourage riders to register and obtain the test certificates as soon as possible, once the test is made available on June 30.\"Those caught riding without the certificate can be fined up to $2,000 and/or jailed for six months for the first offence.Repeat offenders can be fined up to $5,000 and/or jailed for 12 months.The Active Mobility Advisory Panel (Amap) first proposed a mandatory test for e-scooter and PAB users in September 2019, among other recommendations. These came after a spate of accidents involving mobility devices and the death of a cyclist after a collision with a speeding e-scooter rider whose device did not meet regulations.The Government accepted the recommendations and said it would complement other efforts to boost path and road safety.Riders can register for the test from June 30 with the Singapore Polytechnic's Professional and Adult Continuing Education Academy. Those who do so between June 30 and Sept 30 will pay a discounted rate of $5 per test, with a free resit should they fail on their first try.Those who register after Sept 30 will pay $10 per test attempt.LTA said the test will be available in English, Chinese, Malay and Tamil. Riders can prepare through e-handbooks that it has uploaded online.Those who want to take the test in person should contact LTA at this website and the request will be assessed on a case-by-case basis.LTA said riders will need to register an account on the theory test portal using their Singpass at least one day before the test.Those taking the test have to be at least 16, the minimum age for riding PABs and e-scooters.Adults supervising e-scooter riders below 16 will also be required to pass the e-scooter theory test.Mr Denis Koh, chairman of personal mobility device enthusiast group BWSS, said the six-month timeline to take the test is an achievable one for riders.Mr Koh, a former AMAP member, said he had tried a trial version of the test without referring to the handbooks provided by LTA. For the e-scooter test, he was able to meet the 80 per cent passing mark, but he fell short for the PAB test.He said there is no need for riders to panic about the tests, and encouraged them to prepare by reading LTA’s handbooks and signing up for available training programmes.“At the end of the day, it’s about making sure candidates know the rules and good practices well enough to be safe on paths and roads,” he added. \n“Hopefully, the test will ensure that people have the minimum required knowledge to ride safely.”Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/transport/e-scooter-and-e-bike-riders-required-to-pass-theory-test-by-end-of-this-year-lta", "Source": "google"}