{"Type": "", "Time": "2021-06-15", "Headline": "2018 NSF death: SAF captain accused of rash act says he didn't expect Bionix to reverse, Courts & Crime News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The Singapore Armed Forces captain involved in a 2018 incident where a Bionix infantry fighting vehicle reversed and mounted a Land Rover he was in, killing the driver, told a district court on Tuesday (June 15) that he did not expect the armoured vehicle to move backwards.Ong Lin Jie, 30, said he was also surprised that the Bionix had fired at targets in front of it before reversing, as he thought it had encountered a friendly vehicle.The officer is accused of acting rashly by failing to keep a safe distance of 30m between the Land Rover and the Bionix, and ordering the driver - Corporal First Class (CFC) Liu Kai - to overtake it even though it was unsafe to do so and without first establishing communication with the other vehicle.Ong, who has since been suspended from service, was testifying during his trial on Tuesday.The tragedy occurred during a company exercise by the 42nd Battalion Singapore Armoured Regiment on Nov 3, 2018.Ong was then a platoon trainer with the Armour Unit Training Centre of the Armour Training Institute and was tasked, among other things, with evaluating some of exercise participants.He was also responsible for the safety of CFC Liu, 22, the only other person in the Land Rover that day.Shortly before 10am, the Land Rover stopped about 30m behind the Bionix at a junction. Ong then ordered CFC Liu to overtake the armoured vehicle on its left.After the Bionix fired, CFC Liu stopped the Land Rover 16m to 18m behind it.The armoured vehicle then reversed and mounted the driver's side of the Land Rover, pinning CFC Liu in his seat. He died of traumatic asphyxia.The prosecution is arguing that it should have been obvious to Ong that there was a real risk that the Bionix had encountered its opponents in the exercise and would need to reverse as part of the drill.Ong, through his lawyer Teo Choo Kee, is arguing that there was no regulation that states he had to establish communication with the Bionix when overtaking it.On Tuesday, Ong said he had thought that the Bionix had identified a friendly vehicle in front of it prior to the incident, based on an exchange via radio communications between the Bionix commander and another army personnel.He had also assessed that there was a \"high possibility\" that opposing troops would appear from behind the vehicles, Ong added.As he wanted to get into a position where he could observe the Bionix without being caught in the middle of any firefight that might take place, he directed CFC Liu to overtake the Bionix.When the armoured vehicle started to reverse, he shouted for it to stop and saw that its rear guide was also shouting.\"But the Bionix did not stop and the accident happened,\" recounted Ong as he struggled to keep his composure in court.He had told the court on Monday that his actions in overtaking a vehicle without establishing communication with it first was \"not unsafe\".\nCorporal First Class Liu Kai, 22, died on Nov 3, 2018, after a Bionix armoured vehicle reversed into a Land Rover he was driving. PHOTO: MINDEF\nIf the practice of notifying a vehicle before overtaking it was \"important and safe\", it would have been included in the training safety regulations, he had said.Ong also said he had instructed CFC Liu to overtake a Bionix the day before the incident.The trial continues on Wednesday.If convicted, Ong can be jailed for up to five years, fined, or both.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/courts-crime/nsfs-death-saf-captain-accused-of-rash-act-did-not-expect-bionix-to-reverse", "Source": "google"}