{"Type": "", "Time": "2021-06-15", "Headline": "Lianhe Zaobao replies to open letter over its editorial on race, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Chinese daily Lianhe Zaobao has responded to an open letter signed by local academics and scholars who took issue with its recent editorial on race relations, saying it has consistently upheld racial equality and advocated for mutual understanding among all ethnic groups in Singapore.As the anchor Chinese newspaper, it has publicly and unequivocally condemned several recent local incidents of racial discrimination, and jointly defended racial harmony through its editorials, Zaobao said on Monday (June 14).\"Singapore is a multiracial nation. We truly believe in the ideals expressed in the national pledge and cherish the hard-won racial harmony, but that does not mean that we believe that there are no tensions in racial relationships,\" it said.\"Lianhe Zaobao has always taken a consistent stance on upholding equality among all races and advocating that there should be mutual understanding among ethnic groups. This is evident from our editorials, news reports and feature articles. In the midst of the pandemic, we have seen more racial tensions simmering, which is why we have published a total of seven editorials related to this issue in the past year and a half.\"The open letter, which was signed by over 200 people, was concerned about the way it felt Zaobao had characterised the problem of racism here in the wake of recent racial incidents in its June 9 editorial titled 'Expanding public space to promote racial harmony'.The letter's signatories include PhD students, researchers and academics, among them professors Linda Lim, Lee Soo Ann, Vineeta Sinha and Pang Eng Fong.The letter said the editorial \"ignores the dynamics of structural racism and the longer history of racial stereotyping in Singapore\", and blamed the recent incidents on the uncertainty caused by the pandemic, the sensationalism of social media, and the import of \"foreign ideas\" such as critical race theory - the idea that racism is not just about personal prejudice but is also embedded and perpetuated by systems and policies.\"It is true that feelings of uncertainty heighten inter-group tensions, and that conversations on social media can be polarising. However, the editorial uses these arguments to suggest that recent racist incidents are an anomaly in an otherwise racially harmonious society, and that social media exaggerates what are otherwise exceptional acts by unusually racist individuals,\" said the letter.It said the pandemic and social media have \"simply revealed long-standing fissures and the everyday discrimination experienced by racial minorities in Singapore\".The letter also said Zaobao had misrepresented critical race theory as \"promoting hatred of white people\" in the United States, and by extension, of Chinese people here. It added that this argument is typically made by far-right commentators in the US who do not engage in the actual writings and concepts of critical race theory.In response, Zaobao hoped readers would see the June 9 editorial in its entirety, saying the piece analyses the problem from three different aspects, and tries to explain that the pandemic, the role of social media, and popular ideological trends from abroad have all exacerbated racial tensions.Critical race theory (CRT) was cited as an example of the influence of foreign ideas, Zaobao said, adding some scholars had used the concept, which originated in the US in the 1970s, to analyse race issues here, and criticise it for downplaying the \"systemic and structural racism\" in Singapore.It also noted the different interpretations of the concept in academic circles, saying: \"One should not easily dismiss the critique of CRT by serious scholars as a 'far-right American perspective'.\"\"We strongly believe that when discussing the issue of race in Singapore, we should not be applying foreign ideas and concepts without adapting them to local conditions,\" Zaobao added.It said racial discrimination exists in every society, with some things in common and others specific to each. \"Theories and concepts based on foreign situations may not always be applicable to Singapore. Sometimes, instead of deepening our understanding of the issue and promoting consensus, they may complicate it. But we are also aware and accept that there are those who do not agree with such views and positions.\"It added: \"Racial harmony is a common goal for all Singaporeans. We believe the scholars who signed the letter share the same philosophy and welcome rational and open discussion on the issue.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/lianhe-zaobao-replies-to-open-letter-over-its-editorial-on-race", "Source": "google"}