{"Type": "", "Time": "2021-06-15", "Headline": "Explainer: Why G7 spotlight on Xinjiang and Hong Kong has set China on edge", "Text": "\n                        China's outburst came after the powerful grouping in a communique slammed Beijing over abuses against minorities in the Xinjiang region and pro-democracy activists in Hong Kong\n                    \n                            File image of Chinese pfesident Xi Jinping. AP\n                        A day after China's State-run Global Times, in a not-so-subtle dig at the G7, said the days when a \"small group\" of countries deciding the fate of the world were long past, Beijing on Monday further accused the bloc of \"interference\" and \"political manipulation\".\"The Group of Seven (G-7) takes advantage of Xinjiang-related issues to engage in political manipulation and interfere in China's internal affairs, which we firmly oppose,\" an embassy spokesman said in a statement. The statement accused the G7 of \"lies, rumours and baseless accusations, China said.Why China is upsetChina's outburst came after the powerful grouping, in a communique after a three-day summit in England, slammed Beijing over abuses against minorities in the Xinjiang region and pro-democracy activists in Hong Kong. US President Joe Biden also called for Beijing to \"start acting more responsibly in terms of international norms on human rights\".\"We will promote our values, including by calling on China to respect human rights and fundamental freedoms\" the G7 communique read.Here's why the G7 statement shining a spotlight on Xinjiang and the Uighurs set China on edge:Mistreatment of Uighurs in XinjiangChina's treatment of the Uighurs, a predominantly Muslim ethnic group, has raised the hackles of human rights activists all over the world and led to coordinated sanctions from the US, the European Union, Britain and Canada.Activists have said the northwestern Xinjiang region is home to a vast network of extrajudicial internment camps that have imprisoned at least one million people and sought to indoctrinate them. The detentions come on top of harsh travel restrictions and a massive surveillance network equipped with facial recognition technology.China for its part, has denied that the camps are abusive, describing them instead as job training centres aimed at countering religious extremism and terrorism, despite a preponderance of contradictory evidence.For example, on 10 June, Amnesty International in a new report citing dozens of eyewitness accounts said Xinjiang has become a “dystopian hellscape” where Uighurs and other predominantly Muslim ethnic minorities face systematic and state-organised “mass internment and torture amounting to crimes against humanity”, Al Jazeera reported.As per the report, Amnesty said the minority groups had been forced to abandon their religious traditions, language and culture, and subjected to mass surveillance, supporting previous allegations of genocide and ethnic cleansing committed within a network of hundreds of detention centres.“The Chinese authorities have created a dystopian hellscape on a staggering scale in the Xinjiang Uyghur Autonomous Region,” said Agnès Callamard, Amnesty International’s secretary-general and a former UN investigator on human rights.This is hardly the only such horror story that has emerged.In December 2020, a report stated that hundreds of thousands of ethnic minority labourers in China's northwestern Xinjiang region are being forced into picking cotton by hand through a coercive State labour scheme. A report by Washington-based think-tank the Center for Global Policy — which referenced online government documents — said that in 2018 three majority-Uighur regions within Xinjiang sent at least 570,000 people to pick cotton as part of a State-run coercive labour transfer scheme.Researchers estimated that the total number involved in coerced Xinjiang cotton-picking — which relies heavily on manual labour — exceeds that figure by \"several hundred thousand\". Xinjiang is a global hub for the crop, producing over 20 percent of the world's cotton, with the report warning of the \"potentially drastic consequences\" for global supply chains. Around a fifth of the yarn used in American comes from Xinjiang.Incidentally, that very month, China won a not inconsequential victory when the International Criminal Court decided not to pursue an investigation into its mass detention of Muslims. Which makes it plain why China doesn’t want this particular issue back in the spotlight.Tightening grip on Hong KongMeanwhile, China continues to tighten its grip on the semi-autonomous city (at least in name) of Hong Kong.Earlier this month, Hong Kong police for the second straight year banned an annual candlelight vigil marking China’s deadly crackdown in Tiananmen Square (though many were not dissuaded). While the police cited coronavirus social distancing restrictions, one must make note of the interesting fact that there have been no local cases in the city for more than six weeks.After all, for years Hong Kong and nearby Macao were the last places on Chinese soil allowed to publicly mark the events of 4 June 1989, when the People’s Liberation Army opened fire on student-led protesters in a crackdown that left hundreds, if not thousands, dead.Before last year, tens of thousands gathered annually in Hong Kong’s Victoria Park, lighting candles and singing songs to remember the victims. In May, Hong Kong’s security minister warned residents last week against taking part in unauthorised assemblies.But memory can be a powerful thing. Thus, China's efforts to suppress commemorations in Hong Kong come as Beijing continues to ever-tighten its control over Hong Kong following massive anti-government protests in 2019.This, after Hong Kong’s legislature in May passed a bill amending electoral laws that drastically reduced the public’s ability to vote and increased the number of pro-Beijing lawmakers making decisions for the city. The new law empowered the city’s national security department to check the backgrounds of potential candidates for public office and set up a new committee to ensure candidates are “patriotic.”The number of seats in Hong Kong’s legislature were expanded to 90, with 40 of them elected by a largely pro-Beijing election committee. The number of legislators elected directly by Hong Kong voters were cut to 20 from the previous 35. Authorities have arrested and charged most of the city’s outspoken pro-democracy advocates, such as Joshua Wong, who was a student leader of 2014 protests, as well as media tycoon Jimmy Lai, who founded the Apple Daily newspaper.With Chinese president Xi Jinping urging Chinese media and diplomats – in what observers see as a rare admission of Beijing's growing isolation exacerbated by the COVID-19 pandemic -- to present the image of a \"credible, lovable and respectable China\" to the world, the powerful and high-profile G7 choosing to spotlight Beijing's behaviour in Xinjiang and Hong Kong is as welcome as a kick in the teeth.With inputs from agencies\n                Updated Date:\n                \n                    June 15, 2021 10:25:29 IST\n                \n\n                        TAGS:\n                    \n                The Hong Kong government now have the power to ban films from exhibition to “prevent or suppress any act or activity endangering national security,” it said in a statement.\n\n\n            \n                Cordeiro, who holds the Guinness world record for the world’s longest-working DJ, retired last month at the age of 96.\n            \n                Joe Biden is pushing leaders of the G-7 nations to call out China over allegations of forced labour targeting Uyghur Muslims and other ethnic minorities\n            Sign up for a weekly curated briefing of the most important strategic affairs stories from across the world.FirstpostSectionPlusToolsAppsNetwork18 sites Copyright © 2021. Firstpost - All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.firstpost.com/world/explainer-why-g7-spotlight-on-xinjiang-and-hong-kong-has-set-china-on-edge-9717561.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}