{"Type": "", "Time": "2021-06-15", "Headline": "Opinion | Netanyahu just showed that he’s as graceless and selfish as Trump - The Washington Post", "Text": "In established democracies, the tradition is for a defeated leader to act graciously toward the victor — to make a show of national unity despite the rage and humiliation that might be burning inside. Former president Donald Trump flushed that tradition down a gold-plated toilet, along with many other democratic norms. He not only refused to show up at President Biden’s inaugural but continues to this day to accuse Biden of being an illegitimate president who was fraudulently elected.You would think other democratic leaders would recoil from Trump’s odious example. Not former Israeli prime minister Benjamin Netanyahu. In leaving office, Bibi, as he is known, is showing himself to be as graceless and selfish as the Master of Mar-a-Lago. Like Trump, he refused to attend the inauguration of his successor — the new right-wing prime minister, Naftali Bennett, who leads a coalition government with the centrist Yair Lapid.Shortly before the vote in the Knesset that confirmed his downfall, Netanyahu delivered an angry, vituperative, scorched-earth speech full of Trumpian invective. It truly has to be read for its awfulness and pettiness to be believed.Netanyahu began with lots of self-praise before segueing into attacks on the “dangerous” new government. Although Bennett is also a critic of the nuclear deal with Iran, Bibi claimed that his former protege won’t stand up to the Biden administration like he would. He even attacked President Franklin D. Roosevelt for not bombing German concentration camps and the railways leading to them in 1944. This was by way of suggesting that the United States is again doing nothing to save the Jewish people from “extermination,” while Bibi alone protects the Jews. He claimed that Bennett “doesn’t have the international standing” to oppose a nuclear agreement — and won’t do what Netanyahu did when he spoke to Congress in 2015 against the nuclear deal.This is several orders of crazy historical revisionism. First, historians doubt that U.S. bombing could have stopped or even significantly slowed the Holocaust. Second, Netanyahu’s speech to Congress did not stop the nuclear accord — it only alienated then-President Barack Obama and other Democrats, while aligning Netanyahu with the Republicans. That partisanship has done long-term damage to the U.S.-Israel alliance.Third, and most importantly, the Iranian threat against Israel has actually grown since Trump, at Netanyahu’s urging, pulled out of the nuclear accord in 2018. Since then, Iran has ramped up its nuclear program, while stepping up the production of missiles and drones and its support for regional allies such as Hamas and Hezbollah. Yet Netanyahu claimed that Iran is “celebrating” his downfall.As if it weren’t enough to accuse the new government of endangering Israel’s security, Netanyahu also argued that it will endanger Israel’s economy. “Try to ruin our wonderful economy as little as possible,” he said, “so that we can fix it as quickly as possible when we return to power.”Bibi then delivered his own version of Trump’s phony claims about a “rigged” election. “The vote counting was kosher,” Netanyahu admitted, “but the winning of the votes was done fraudulently. Bennett led astray hundreds of thousands of right-wing voters and transferred their votes from the right to the left.” As if Israeli voters did not realize that in casting ballots for the parties led by Bennett and his allies, they were voting to remove Netanyahu from office. Because the new coalition government is backed by an Israeli-Arab party, Bibi accused it of being the handmaiden of “extreme Islam.“Bibi’s final blast was very Trumpian in its self-pity. “My family and I have been through hunting, prosecution and denigration, the likes of which has never been seen,” he said. “All so that I will bow down and surrender to the left.” Just as Trump claims to be fighting for “forgotten Americans,” so Bibi insisted, “I did not surrender because I am operating in the name of a large public of millions of citizens, as the servant of a millennia old ancient people, wishing to sit in peace and security in its own land.”What nonsense. Netanyahu is facing corruption charges in an Israeli court. The reason he did not “surrender” — the reason he put the country through four elections in less than two years — has nothing to do with the interests of “millions of citizens” and everything to do with his self-interest. He has been desperately clinging to power in the hopes of getting the Knesset to pass a law that would render a prime minister immune to prosecution.Netanyahu has genuine accomplishments to boast of — from Israel’s covid-19 vaccination campaign to winning recognition of Israel from four Muslim states. He is much smarter than Trump and much more skilled at politics. But his farewell speech shows why so many of his former allies turned against him and ultimately turfed him out of office. Like Trump, Netanyahu suffers from a crippling character defect. He lies, schemes and backstabs because politics, for him, is ultimately about self-promotion — not national service. His farewell address showed why he should never be given another chance to lead.Read more:Jennifer Rubin: Like the U.S., Israel bids goodbye to an unhinged leaderYousef Munayyer: Why a new Israeli government won’t mean justice or peace for PalestiniansDavid Ignatius: Inside the palace intrigue in Jordan and a thwarted ‘deal of the century’Jackson Diehl: Netanyahu’s reaction to Biden’s victory is appallingThe most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/opinions/2021/06/14/netanyahu-farewell-speech-recalls-trump/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}