{"Type": "Asia", "Time": "2021-06-15", "Headline": "Suspected Australian child sex offender arrested in Thailand after 6 months on the run", "Text": "BANGKOK: An Australian national accused of sexually assaulting Myanmar children in Thailand was arrested in the border province of Tak after six months on the run, according to the Tak Immigration Office.On Jun 2, Thai authorities managed to track down and arrest an Australian man identified as Adam James Fox in the remote town of Mae Sot near Myanmar.The operation was launched after an arrest warrant was issued by the Mae Sot Provincial Court when he failed to attend a court hearing in December last year. He was earlier charged with child sex and immigration offences and was granted a provisional release on bail by the Court of Appeal.“(Fox) was supposed to appear in court but he did not show up. As a result, the court issued an arrest warrant so he could be brought in,” Pol Lt Col Suchart Penphu, deputy superintendent of the Tak Immigration Office, told CNA.“The warrant was issued on Dec 1 and the court marshal had since been following the case until Jun 2, when he was found to be residing at a new house,” he said, adding that crystal methamphetamine was also found at his house during his arrest.According to the authorities, police confiscated a number of mobile phones and computer devices from Fox. They also obtained an Australian passport, which belongs to him but under the name of Guy Christopher Weymouth.The Australian was initially arrested in Mae Sot in March last year for allegedly sexually assaulting children aged 15 or younger.At that time, authorities found two Myanmar boys at his residence and five other minors in an apartment he rented for them.Besides the alleged sexual offence, Fox was also charged with entering and staying in Thailand without permission.IN CUSTODY AWAITING TRIALPrior to his arrest in 2020, Fox had allegedly developed close relationships with Myanmar children aged between 12 and 15 in Mae Sot, a private investigator from New Zealand who assisted Thai authorities with the case told CNA.“Two or three of these children went to a local school in Mae Sot and the headmaster of the school noticed that these boys had been missing for about a month.“He became concerned about where they were and did some inquiries about what was happening to them,” the investigator, who requested anonymity, said. He is an investigator working with a non-governmental anti-human trafficking group.The matter was referred to the provincial Social Development and Human Security Office, which proceeded to conduct interviews and enquiries before engaging law enforcement officers, the investigator added, citing alleged serious sexual violations that led to his arrest.“(Fox) gave them money to go to school and provided them with food and accommodation because their parents were poor,” said Pol Lt Col Teerawat Moopayak from the Mae Sot police station, who handled his child sex offence case at that time.“They didn’t think he had done anything wrong,” he added.According to Pol Lt Col Suchart from the Tak Immigration Office, Fox is currently in custody awaiting trial.“Once the case is final – whether he’d be acquitted, prosecuted or imprisoned – and he is released from jail, the Mae Sot police will be informed and he will be transferred to the Immigration Office,” he explained.\"Since his right to stay is no longer valid because it has already expired, we will need to push him back to Australia.\"According to Pol Lt Col Suchart, Fox could be blacklisted and banned from re-entering Thailand if found guilty of child sexual assault or a drug-related offence.In Thailand, convicted sexual offenders face serious punishment. A sexual assault against children aged 15 or younger – with or without their consent – is punishable by up to 20 years in jail and a fine of 100,000 baht to 400,000 baht (US$3,200 to US$12,900).However, if such offence was committed against a child aged 13 or younger, the offender could face life imprisonment.The criminal code also stipulates the sentence can increase by one-third if the assault was recorded for exploitation, or by half if the recorded material was shared with others.Currently, the provincial police are working closely with the Department of Special Investigation (DSI) to find out if Fox is linked to any of the agency’s active cases.Mr Khemachart Prakyhongmanee, deputy director of the Foreign Affairs and Transnational Crime Bureau at the DSI, told CNA that more children have become vulnerable to paedophiles who leverage the power of the Internet.Many children have to study online as a result of the pandemic and their increased use of the Internet could easily expose them to online sexual predators, he said.“In the past, grooming partly took place in person and online. But at present, it has gone online and allowed more direct access to children as they currently use computers more often and have more devices provided by their parents. So, children who didn’t have these devices before now do,” he added.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Thailand,Australia,child sex abuse", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/thailand-suspected-australian-child-sex-offender-arrest-mae-sot-15015374", "Source": "google"}