{"Type": "", "Time": "2021-06-15", "Headline": "Duterte slams call for war crimes probe into his drugs crackdown as 'legally erroneous, politically motivated', SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.MANILA - Philippine President Rodrigo Duterte on Tuesday (June 15) slammed a call for a war crimes court to probe his bloody drug war as \"legally erroneous and politically motivated\".Mr Duterte's spokesman, Mr Harry Roque, said at a news briefing that Mr Duterte's crackdown on the narcotics trade was not a \"widespread systematic attack against civilians\".\"Did you target civilians? Did you kill them willingly, knowing they were civilians? Obviously, the answer is no,\" he said.That being the case, he argued, the \"extrajudicial killings\" that resulted from the drug war could not be considered \"crimes against humanity\".In one of her last acts before stepping down as chief prosecutor of the International Criminal Court (ICC) this week, Ms Fatou Bensouda sought a full investigation into Mr Duterte's purported crimes against humanity for a drug war that has left thousands dead since he took office in 2016.\"I have determined that there is a reasonable basis to believe that the crime against humanity of murder has been committed… in the context of the government of Philippines 'war on drugs' campaign,\" she said in a statement.In her 57-page report to ICC's judges, Ms Bensouda said \"there is a reasonable basis to believe\" that security forces and state-sanctioned \"vigilantes\" killed between 12,000 and 30,000 drug suspects from July 1, 2016, to March 16, 2019.She said security officials \"paid police officers and vigilantes bounties\" to execute people suspected of being involved in the drug trade.\"State officials at the highest levels of government also spoke publicly and repeatedly in support of extrajudicial killings and created a culture of impunity for those who committed them,\" she said.She said the investigation should include allegations of torture and other \"inhumane acts\" dating back as far as 2011, when Mr Duterte was mayor of Davao City.Human rights activists called Ms Bensouda's decision a step closer to holding Mr Duterte accountable.It is a \"much-awaited step in putting murderous incitement by President Duterte and his administration to an end\", Amnesty International's secretary-general, Ms Agnes Callamard, said.\"The ICC's intervention must end this cycle of impunity in the country and send a signal to the police and those with links to the police who continue to carry out or sanction these killings that they cannot escape being held accountable for the crimes they commit,\" she said.The International Coalition for Human Rights in the Philippines said it was \"a positive step that may help bring some measure of justice to the thousands victimised and terrorised by the Duterte regime\".It called on the United Nations Human Rights Council to begin its own probe into Mr Duterte's human rights record.Mr Duterte was elected to office in 2016 on a campaign promise to get rid of the country's drug problem, openly exhorting the police to kill drug suspects.But he has repeatedly denied links to the killings, insisting that most resulted from rivalries among drug gangs.He has also backed police accounts that most of those killed were on \"drug watch lists\" who had been armed and resisted arrest.While Ms Bensouda concluded that as many as 30,000 had been killed, the latest official data showed just 6,000 suspects had died in over 200,000 anti-drug operations.The Philippines officially withdrew from the ICC in 2019 on Mr Duterte's order after multiple complaints were filed against him.Ms Bensouda, however, said previous cases showed that \"the court retains jurisdiction over crimes that are alleged to have occurred on the territory of that state during the period when it was a state party\" to the ICC.But Mr Roque insisted that the ICC lacked jurisdiction in the Philippines.\"We are no longer a member of the ICC,\" he said.He added that the court could not intervene as long as the Philippines had \"independent and competent courts\" that were already investigating the killings.\"The ICC will not exercise jurisdiction unless the state is unable and unwilling to prosecute… This is not the case in the Philippines,\" he said.Should the court decide to probe him for war crimes, Mr Duterte would \"never cooperate\" as long as he is president, Mr Roque added.He said the ICC should also not allow itself to be used by Mr Duterte's political enemies harbouring ambitions for higher office.He said among those who filed complaints before the ICC was former senator Antonio Trillanes, a former soldier and fierce critic of Mr Duterte, who has announced his intention to run for president next year.The ICC's judges have up to four months to issue a decision on Ms Bensouda's request. But pursuing it would be up to Ms Bensouda's successor, Mr Karim Khan, who would be sworn in on Wednesday (June 16).In a statement, the Philippines' Foreign Ministry said Ms Bensouda's \"midnight announcement\" tied Mr Khan's hands.The ministry said Ms Bensouda had \"undercut the attractiveness\" of joining the ICC for some nations.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/duterte-slams-call-for-war-crimes-probe-into-his-drugs-crackdown-as-legally-erroneous", "Source": "google"}