{"Type": "", "Time": "2021-06-15", "Headline": "Where Is Proof: Russia's Vladimir Putin Denies Cyberattacks On US", "Text": "Russian President Vladimir Putin said that US-Russia relations should have stability. (File)President Vladimir Putin dismissed accusations that Russia was behind cyberattacks against the United States as \"farcical\" in an interview with NBC broadcast on Monday ahead of his summit with President Joe Biden.The Russian leader also said he was open to a prison swap with the United States -- the fate of prisoners is set to be on the agenda when the two meet in Geneva on Wednesday -- and said that jailed Kremlin critic Alexei Navalny would \"not be treated any worse than anybody else.\"Biden will attend the summit after a week of meeting allies from the G7, European Union and NATO, with tensions between Moscow and Washington at their highest in years over a long list of disputes.Asked if Russia was waging a \"cyber war\" against the United States, Putin said: \"Where is proof? It's becoming farcical.\"\"We have been accused of all kinds of things, election interference, cyberattacks and so on and so forth, and not once, not one time, did they bother to produce any kind of evidence or proof, just unfounded accusations.\"US companies, including a major fuel pipeline network, have been hit by cyberattacks in recent months, often forcing temporary shutdowns until ransoms are paid.Prisoner swap?Any negotiations over prisoners would focus on individuals including former US marine Paul Whelan who was jailed for 16 years by Russia for espionage. Whelan has urged Biden to arrange a prisoner exchange and said in a recent interview he was victim of hostage diplomacy.Another US citizen, Trevor Reed, was sentenced to nine years in prison in 2020 on charges of assaulting Russian police officers while drunk.Moscow could be eyeing the return of the notorious Russian arms dealer imprisoned by the United States, Viktor Bout, and a contract pilot and alleged drug trafficker, Konstantin Yaroshenko.But the White House moved to quickly tamp down talk of an exchange of \"cyber criminals\" after Biden appeared open to the idea when speaking at a press conference after the G7 meeting in Britain.\"He's not saying he's going to be exchanging cyber criminals with Russia,\" National Security Advisor Jake Sullivan said.\"What he was talking about was accountability and the idea that responsible countries should be held accountable... not harboring cyber criminals, and to bringing cyber criminals to justice.\"When asked about Navalny and accusations of brutal crushing of dissent in Russia, Putin said \"you are presenting it as dissent and intolerance towards dissent in Russia... we view it completely differently.\"Putin called for \"predictability and stability\" in Russian-US relations, saying it was \"something we haven't seen in recent years\" -- while also describing former president Donald Trump as \"colorful\" and a \"talented individual.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)Track Latest News Live on NDTV.com and get news updates from India and around the world. Watch Live News:Follow Us:................................ Advertisement ................................", "Section": "", "Writers": "", "URL": "https://www.ndtv.com/world-news/where-is-proof-russias-vladimir-putin-denies-cyberattacks-on-us-2463770", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}