{"Type": "", "Time": "2021-06-15", "Headline": "SHN rules for travellers from Fiji tightened", "Text": "SINGAPORE — All travellers entering Singapore who have travel history in the past 21 days to Fiji are required to serve a 21-day Stay-Home Notice (SHN) at dedicated SHN facilities given the \"worsening\" COVID-19 situation in the South Pacific country, the Ministry of Health (MOH) said on Monday (14 June).Previously, these travellers were subject to a 21-day SHN consisting of 14-day SHN at dedicated SHN facilities and seven days at a place of residence or self-sourced accommodation.Travellers who have not completed their 14-day SHN at dedicated SHN facilities by 16 June 2021, 11.59pm, have to serve the additional seven days at their current dedicated SHN facility.Travellers who are currently serving their SHN at a place of residence or self-sourced accommodation have to complete their 21-day SHN at their current location to minimise risk of transmission.Meanwhile, given the \"improving situation in Israel\", travellers from the Middle Eastern country who have remained in Israel in the last 21 days before arrival in Singapore from 16 Jun 2021, 11.59pm, will be subject to a 21-day SHN comprising 14-day SHN at dedicated SHN facilities and seven days at a place of residence or self-sourced accommodation, the MOH said.Previously, all travellers from Israel are subject to a 21-day SHN at dedicated SHN facilities.All travellers serving 21-day SHN will undergo COVID-19 polymerase chain reaction tests on arrival, on the 14th day of their SHN, and before the end of their 21-day SHN period.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:COVID: Social gathering size can increase to 5 per group from 14 June – MTFWork-from-home remains default arrangement in Singapore's Phase 3 (HA)Man, 60, charged over stabbing at Choa Chu Kang void deckBeijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the \"systemic challenges\" posed by its policies.An ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Spain opened their Euro 2020 campaign with a goalless draw against Sweden in Seville on Monday after their preparations were badly affected by Covid-19, while Patrik Schick scored one of the championship's great goals in the Czech Republic's 2-0 win over Scotland.The Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.Dickson Yeo, the Singaporean man who was jailed in the US for spying for China and was arrested by the Internal Security Department upon his return to Singapore in December will be continue to be detained under the Internal Security Act.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Here are three growing businesses that should be cheap enough to add to your investment watchlist. The post 3 Undervalued Gems That You Can Add to Your Watchlist appeared first on The Smart Investor.The Copa America that almost never was opened Sunday in Brazil, overshadowed by the desperate search for a last-minute host, sponsor withdrawals and Covid-19 -- including outbreaks on three teams.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.The first crew for China's new space station prepared to blast off this week for the latest step in Beijing's ambitious programme to establish itself as a space power.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.With its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.US President Joe Biden will seek the EU's backing on Tuesday to face the rise of China, but Brussels wants a swift end to lingering trade rows and a clean break from Donald Trump.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Major US indices finished at fresh records Monday as global equity markets began the week cautiously ahead of a much-anticipated Federal Reserve meeting.Reigning champions Portugal begin their defence of the trophy against Hungary at Euro 2020 in Budapest on Tuesday as World Cup holders France take on Germany in a hotly-anticipated clash between two of the continent's heavyweights.When you want protection that goes beyond just covering your medical costs, critical illness insurance is the logical choice. But with so many options out there, which ones are best for you? We investigate in this article. In a nutshell, critical illness insurance is insurance […] The post Best Critical Illness Insurance Plans In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/shn-rules-travellers-fiji-tightened-israel-eased-073813671.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}