{"Type": "", "Time": "2021-06-15", "Headline": "Nato adopts tough line on China at Biden’s debut summit with alliance, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BRUSSELS (REUTERS, AFP) - Nato leaders on Monday (June 14) designated China as presenting “systemic challenges” in a summit communique that marked a forceful stance for the Western military alliance, declared a priority for US President Joe Biden after the Trump years. In a diplomatic victory for Mr Biden, who has urged his fellow Nato leaders to stand up to China’s authoritarianism and growing military might, the final statement branded China a security risk to the Western alliance. The language, which will now set the path for alliance policy, comes a day after the Group of Seven rich nations issued a statement on human rights in China that Beijing said slandered its reputation. “China’s stated ambitions and assertive behaviour present systemic challenges to the rules-based international order and to areas relevant to alliance security,” Nato leaders said in a communique after their summit.But it also held out the prospect for “a constructive dialogue with China where possible”. Nato secretary-general Jens Stoltenberg said China’s growing military presence from the Baltics to Africa meant nuclear-armed Nato had to be prepared.“China is coming closer to us. We see them in cyberspace, we see China in Africa, but we also see China investing heavily in our own critical infrastructure,” he said, a reference to ports and telecoms networks. “We need to respond together as an alliance.”Earlier in the day, Mr Biden told European allies that Nato’s mutual defence pact was a “sacred obligation” for the US – a marked shift in tone from his predecessor Donald Trump, who had threatened to withdraw from the alliance and accused Europeans of contributing too little to it. “I want all Europe to know that the United States is there,” Mr Biden said. “Nato is critically important to us.” Germany’s Chancellor Angela Merkel, attending her last Nato summit before she steps down in September, described Mr Biden’s arrival as the opening of a new chapter.The allied leaders were also concerned about Russia’s military build-up near Ukraine, as well as its covert and cyber attacks to undermine Western states. “Until Russia demonstrates compliance with international law and its international obligations and responsibilities, there can be no return to ‘business as usual’,” the Nato communique said. “We will continue to respond to the deteriorating security environment by enhancing our deterrence and defence posture.” Mr Biden is slated to meet Russian President Vladimir Putin in Geneva on Wednesday (June 16).In another first for Nato, the alliance agreed on Monday on an action plan to mitigate climate change. Nato will increase its awareness, adaptation, mitigation and outreach efforts related to climate change, \nand also incorporate climate change considerations into its full spectrum of work. The Western alliance also called on Iran to stop all ballistic missile activities.Separately, senior Western officials said security officials under Nato command had approached Qatar to secure a base that can be used to train Afghan special forces as part of a strategic commitment after foreign forces withdraw from Afghanistan.After two decades of war, forces from 36 countries involved in Nato’s mission in Afghanistan are set to pull out of the country in coordination with a US troop withdrawal by Sept 11.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/nato-designates-china-a-systemic-challenge-as-biden-rebuilds-bond-with-western-alliance", "Source": "google"}