{"Type": "", "Time": "2021-06-15", "Headline": "Sandrine Pinna on why she's scared to watch her new Taiwanese HBO drama Trinity of Shadows and working with Frederick Lee , Entertainment News - AsiaOne", "Text": "While she's encouraging her fans and the public to catch her new HBO Asia Original drama Trinity of Shadows, Taiwanese actress Sandrine Pinna isn't that hyped up to watch it herself.In an Instagram post dated May 30, the 34-year-old wrote: \"[The series] will premiere soon, but to be honest, there's a part of me that doesn't dare to watch my own performance.\"When AsiaOne caught a preview of the first two episodes of the 15-part murder mystery thriller, we thought Sandrine was on point as the tough, gruff, and easily triggered police detective Tse-wei.So why the hesitancy, we asked her during a regional interview that she and co-star Kaiser Chuang, 40, attended recently.[embed]https://www.instagram.com/p/CPfYuInn9h6/[/embed]She replied: \"I put in a lot of feelings into this role and there are a lot of times where Tse-wei breaks down, or is at the brink of losing it.\"When I see myself like that, I'm scared. Although it was a very thrilling experience working on this drama, I got very nervous when I looked back at those times and those feelings. Even when I recorded the voiceovers for the series, I felt very uneasy.\"Trinity of Shadows, which premiered on HBO and HBO Go yesterday (June 13), follows a murder investigation that leads righteous detective Tze-wei, an up-and-coming politician Chi-hsiao (played by Kaiser), and rookie policeman Chia-hao (Liu Kuan-ting) into a dark labyrinth of power play.As the trio close in on the truth, they are inextricably intertwined and forced to confront their demons linked to a cold case from three years ago.[embed]https://www.youtube.com/watch?v=J-nsmcqRK4g[/embed]During the interview, Sandrine said the role was a big challenge for her, and one reason is that Tze-wei is as dark as Sandrine is rainbows and sunshine.The award-winning actress said Tze-wei had a very traumatic childhood because her father was an abuser who hurt other women. As a result, Tze-wei becomes especially angry when she hears of women who are abused.On the other hand, Sandrine grew up in a very loving environment.She explained: \"Tze-wei is cold and she doesn't want to socialise with others, so she doesn't bother to hide [her feelings].\"I'm not cold and distant like her. I like socialising with others instead of keeping them away at arm's length. When playing this role, I spent a lot of time and effort discussing the character with the director to be able to portray her.\"The brutally dark drama also stars Malaysia actor Frederick Lee — younger brother of local actor Christopher Lee — as Hu Ta-dong, a notorious, wanted fugitive with an extensive criminal history. After laying low for three years following his narrow escape from the police, Ta-dong resurfaces for an unknown reason that brings about grim consequences.Ta-dong is inextricably linked to both Tze-wei and Chi-hsiao, sharing a dark history, and from Kaiser's account, even manipulating Chi-hsiao into committing certain deeds for him.Sandrine and Kaiser had a lot of scenes with Frederick and their close friendships helped with their chemistry.Sandrine, who addressed 44-year-old Frederick as 'ge', Chinese for older brother, said Trinity of Shadows is her second time working with him.\"He triggers and brings out the hate within our characters. I have faith in him, which was why when his character did a series of destructive actions to Tze-wei, I was able to fully let go of myself to him [during filming],\" she said.\"And because of our familiarity and my faith in and love for him, I felt sorry that he had to shoulder the heavy burden of portraying the bad guy.\"Kaiser added he and Frederick, as well as Christopher, are all from the same talent management agency and they would send messages to each other and meet up whenever they are in the same country.Sandrine said the characters' choices lead to events snowballing, and both she and Kaiser hope the drama will lead viewers to question the traditional or popular notions of love and truth.\"This show doesn't show the fairytale type of love; you can see love in its true form. When someone doesn't leave you, it could be because they rely on you. And when someone leaves you, it's not because they don't love you but it's the only way they can protect you,\" he explained.He added: \"At the end of the series Tze-wei and Chi-hsiao appear to have found the light at the end of the tunnel, but that 'truth' is also debatable.\"Sandrine concluded: \"We are searching for the truth, but when we find it, do we get salvation or do we, while chasing for it, also make mistakes that end up hurting someone or ourselves? The more you get to the end, the less perfect the truth appears.\"Trinity of Shadows is available on HBO and HBO Go with new episodes released every Sunday.kwokkarpeng@asiaone.com", "Section": "", "Writers": "", "URL": "https://www.asiaone.com/entertainment/sandrine-pinna-scared-watch-new-taiwanese-hbo-drama-trinity-shadows-frederick-lee-kaiser-chuang", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}