{"Type": "", "Time": "2021-06-15", "Headline": "Use of wedding pic for Raya ‘not racist’: People's Association", "Text": "SINGAPORE — While the use of a Malay-Muslim couple's wedding photo as a standee in Hari Raya decorations by the People's Association (PA) last month was \"culturally insensitive\", it was certainly not \"racist\", said the PA in a Facebook post on Monday (14 June). \"It is not right to raise the allegation of racism, without basis, to stoke emotions and sentiments,\" said the PA in a detailed post, adding that it saw \"no point\" in proceeding with an arranged meeting with Sarah Bagharib and her husband Razif Abdullah.In an Instagram post on 28 May, Sarah had highlighted the use of the photo to create a standee alongside a decorative platform and banner depicting Radin Mas Member of Parliament Melvin Yong and his Hari Raya wishes for residents. Noting that neither she nor her husband had given consent for the photo to be used by the PA, Sarah added, \"The inappropriate appropriation and use of our cultural symbol only succeeded in showing People('s) Association's superficial understanding of Malay/Singaporean Muslim culture\". The post has garnered almost 18,000 likes. In its post on Monday, the PA noted that it had removed the standee and apologised to the couple, as well as posting a public apology on its social media platforms. Its post on 29 May revealed that Warabi Enterprise (Art Studio) had been engaged by Radin Mas Constituency Office (CO) to design and put up Hari Raya decorations at the Tiong Bahru Orchid estate.However, in the process, the vendor downloaded Sarah’s photo from an online source and then used it for a cut-out standee. And while the PA spoke to the vendor on the seriousness of the incident, it stressed, \"The PA, including Radin Mas CO, take responsibility for this error as we have oversight of the matter.\"In addition, the PA offered on Monday to meet with the couple to apologise in person. \"We also wished to clarify our position, elaborate on the steps we have taken to prevent such incidents from recurring, and hear her suggestions of how we might improve at the meeting.\"However, it claimed that Sarah had said this incident “perpetuate(s) the racist culture” and characterised the incident as “racist”. In an Instagram Live interview with Walid J. Abdullah last Tuesday, said the PA, she also insinuated that PA staff and volunteers did not find anything wrong with the standee as they might be “blind to racism”.\"These are accusations we reject,\" said the PA.Furthermore, in Sarah's public social media posts about her upcoming meeting with the PA, she had made a public call for anyone to “please share your messages/suggestions to PA here and we’ll share them”.  \"We find this odd,\" said the PA. \"We do not see why our meeting should be appropriated as a platform for her to funnel the views and comments of persons unrelated to the incident.\"The PA added, \"All these lead us to believe her purpose in agreeing to meet with us has gone far beyond the Radin Mas incident. We therefore see no point in proceeding with the meeting.\"It also claimed that Sarah’s email to the PA on 1 June alleged that it was “hasty in sharing the name of the vendor” in order to “distance and deflect blame” from itself. \"This is untrue. The vendor had identified himself directly to Ms Sarah on 28 May, and apologised. This was before PA issued our statement on 29 May,\" said the PA. \"It is regrettable that Ms Sarah did not clarify this point during her Instagram Live interview with Mr Walid J. Abdullah on 7 June. Instead she persisted in conveying the impression that PA had deflected blame from itself.\"We hope that this incident will not tar the other good work which our staff and volunteers have done.\"PA also said it is looking at setting up a resource panel to guide its staff on cultural matters, and stepping up training to enhance its staff and volunteers' understanding and appreciation of different cultures.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:Of 25 new COVID cases in Singapore, 19 local including 1 dorm residentMan who smuggled 3 dogs and 3 cats from pet shop in JB jailed 24 weeksE-scooter, PAB riders must pass online theory test from 1 Jan 2022Dickson Yeo, the Singaporean man who was jailed in the US for spying for China and was arrested by the Internal Security Department upon his return to Singapore in December will be continue to be detained under the Internal Security Act.Reigning champions Portugal begin their defence of the trophy against Hungary at Euro 2020 in Budapest on Tuesday as World Cup holders France take on Germany in a hotly-anticipated clash between two of the continent's heavyweights.Search for private jet membership. The affordable price makes these private jet offers hard to resistAn ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.The Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.The first crew for China's new space station prepared to blast off this week for the latest step in Beijing's ambitious programme to establish itself as a space power.Spain opened their Euro 2020 campaign with a goalless draw against Sweden in Seville on Monday after their preparations were badly affected by Covid-19, while Patrik Schick scored one of the championship's great goals in the Czech Republic's 2-0 win over Scotland.US President Joe Biden arrived Sunday in Brussels for two days of summits with leaders from the NATO military alliance and the European Union.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.Research best security system. Protect yourself and your home with wireless alarm systems.The Copa America that almost never was opened Sunday in Brazil, overshadowed by the desperate search for a last-minute host, sponsor withdrawals and Covid-19 -- including outbreaks on three teams.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.US President Joe Biden will seek the EU's backing on Tuesday to face the rise of China, but Brussels wants a swift end to lingering trade rows and a clean break from Donald Trump.Amazon.comWith its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Major US indices finished at fresh records Monday as global equity markets began the week cautiously ahead of a much-anticipated Federal Reserve meeting.This new car cloth can easily remove all the car scratches and dents from your car.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the \"systemic challenges\" posed by its policies.When you want protection that goes beyond just covering your medical costs, critical illness insurance is the logical choice. But with so many options out there, which ones are best for you? We investigate in this article. In a nutshell, critical illness insurance is insurance […] The post Best Critical Illness Insurance Plans In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/wedding-photo-hari-raya-culturally-insensitive-but-not-racist-pa-123919530.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}