{"Type": "", "Time": "2021-06-15", "Headline": "E-scooter, PAB riders must pass theory test from 1 Jan, 2022", "Text": "SINGAPORE — Power-assisted bicycle (PAB) and e-scooter riders must soon pass a mandatory online theory test before they are able to ride on cycling paths and roads, the Land Transport Authority (LTA) said on Monday (14 June). The rule, which will take effect from 1 January 2022, will improve awareness of active mobility rules, code of conduct and safe riding practices, said LTA. Separate tests for PAB and e-scooter users will be available on Singapore Polytechnic’s (SP) Professional & Adult Continuing Education (PACE) Academy at www.pace.sp.edu.sg from 30 June in English, Chinese, Malay and Tamil. To help riders prepare for the tests, e-handbooks in these languages have been made available at go.gov.sg/amrules.This will comprise 30 multiple-choice questions for the e-scooter test and 40 for the PAB test, with 30 minutes and 40 minutes given respectively to complete the tests. A digital certificate, with no expiry date, will be issued to those who pass. The passing score is 80 per cent.Riders, who must be at least 16 years old, must register for an account on the theory test portal using their SingPass at least a day before taking the test. E-scooter riders below the age of 16 can only ride under adult supervision, and the supervising adult will need to have passed the test.Those who register for the test from 30 June to 30 September will enjoy a discounted fee of $5 per test, with a free second attempt should they fail on the first. Riders who register after 30 September must pay $10 per test attempt. There will be a transition period of six months – 30 June to 31 December – for riders to prepare, take and complete the test before enforcement kicks in. From 1 January 2022, riders must show their digital certificate when requested by enforcement officers.  Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore stories:Singapore reports 13 new COVID-19 cases, 10 from the communityStudents to gradually return to school from 28 June: MOESHN rules for travellers from Fiji tightened, for travellers from Israel easedGetting the COVID-19 vaccine in Singapore is easy. According to the Ministry of Health (MOH), as of 17 May 2021, 3.4 million doses have been administered. Here's a guide on how to find a vaccination centre near you.European stock markets rose Tuesday after a mixed showing in Asia, as investors braced for news from a key Federal Reserve interest-rate meeting.Meet the PayPal business debit card. Use it everywhere Mastercard® is accepted.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.In the wake of one of the biggest password leaks in history, Apple has unveiled a new biometric-based feature that could one day replace passwords across all Apple devices.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.Board certified internal medicine and obesity specialist reveals what happens after drinking just 1 diet soda. Click here to watch video.A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Every PC user must read this in 2021 - Do it now.Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.A French nuclear firm said Monday it was working to resolve a \"performance issue\" linked to a gas build-up at a plant it part-owns in southern China following a US media report of a potential leak there.The nominee to be the top US diplomat for East Asia promised Tuesday that President Joe Biden would keep building relations with Taiwan, but balked at backing an overhaul of delicate arrangements on the issue with China.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.If you’re wondering whether Ethereum is a good long term investment, keep reading.Looking for travel insurance? Save more with these promo codes and discounts from insurers such as FWD, MSIG, AXA, and more! To find out if your travel insurance covers COVID-19, read this article for the latest updates. No matter your travel itinerary, travel insurance is […] The post Travel Insurance Promotions and Discounts appeared first on SingSaver Blog - We Compare, You Save.New research has identified TEN favorite stocks for the upcoming yearSingtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the challenges posed by its policies.Toshiba apologised to shareholders Monday and said it would remove two directors after a probe found the Japanese conglomerate had sought government help to try and influence a boardroom vote.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.With its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Asset sales in a liquidation process at Hyflux Ltd., Singapore’s highest-profile distressed company, would likely bring in less than S$200 million, a person familiar with the matter said, a fraction of the amount creditors are claiming.A 20-year-old male polytechnic student on internship with a hospital secretly recorded a staff relieving herself at Jurong Medical Centre in January, a court heard.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/e-scooter-pab-riders-pass-online-theory-test-1-jan-2022-102449409.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}