{"Type": "", "Time": "2021-06-15", "Headline": "A humpback whale swallowed Michael Packàrd as was lobster diving in Cape Cod - The Washington Post", "Text": "Josiah Mayo surveyed the ocean’s surface on Friday, watching the bubbles that emerged from his fishing partner’s underwater breathing gear. It was Michael Packard’s second plunge into the ocean off the coast of Cape Cod that morning and he had already caught about 100 pounds of lobster.But the bubbles suddenly stopped. Then, an explosion of white water erupted from the sea.Mayo wasn’t sure what he was witnessing. A burly fish thrashed before him and for a split second he thought it was a great white shark. Then Mayo saw its flukes cut through the water and observed it violently shake its head.“This was a humpback whale,” Mayo, 43, told himself, as he recounted in an interview with The Washington Post. “It was a relief because it wasn’t a shark, which meant Michael would be all done at that point.”Moments later there was another mighty boil of white water and Packard soared out of the ocean and flopped back down. Mayo sped the boat up next to Packard, who was floating in a puffed-out drysuit thanks to the whale’s speedy ascent to the surface.“I was inside it. I was inside its mouth,” Packard, 56, told Mayo. “It tried to eat me.”Packard’s harrowing tale is rare and unheard of among the experienced divers of Provincetown, Mass. Humpback whales don’t harm people on purpose, said Mayo, who worked on whale-watching boats as a teenager and whose father is a premier whale scientist.Mayo said his father and his colleagues believe the only logical explanation was that the whale swallowed Packard by accident.“It took [Packard] from behind and it seemed like it fully enveloped him immediately,” Mayo said. “That’s kind of remarkable and so we can only imagine the whale was probably feeding.”Mayo added he believed it was a young whale.“I like to think of it as a teenager or a puppy. … It probably doesn’t know what it’s doing too well,” he said.A similar incident occurred off the coast of Port Elizabeth, South Africa, in 2019 when a Bryde’s whale scooped up a marine conservationist documenting a mass migration. Experts who witnessed the event also said it was an accident, noting the whales are “gentle giants,” one said in a short documentary.Diving is a dangerous occupation and Packard, a Provincetown native who has been commercial diving since he was 18, has come close to death more times than most, Mayo said.While lobster diving in 2017, Packard came across the body of a fellow diver who was lost at sea six years earlier. Packard has gotten lost a few times himself, Mayo said, thanks to a strong current that carried him far from the boat. Mayo, fortunately, found him each time.Packard spent years diving for abalone in the shark-filled waters off the coast of central California, Mayo said. He’s gotten concussions, injured his hand a few times and had two close encounters with great white sharks in Cape Cod.“Clearly they weren’t interested in eating him because they would have, since they could have,” Mayo said.Packard also nearly died in 2001 when he was in a plane crash in Costa Rica and suffered life-threatening injuries. Three people died and at least four others survived.On Friday around 5:30 a.m., Mayo and Packard set off into calm water in their fishing vessel, named the “Ja’n J” after Packard’s 12- and 16-year-old sons. The two have worked together for about 15 years and often fish for lobster, bluefin tuna and mackerel.Packard’s first dive that morning “wasn’t great,” Mayo said, requiring his partner to go back in a few more times.At about 8 a.m., Packard plunged about 45 feet deep, and almost reached the ocean floor when he “felt this truck hit me and everything just went dark,” he said in an interview with WBTS.“And I could feel just … hard stuff all around me,” Packard said. “And I just thought, ‘Did I just get eaten by a white shark?’ And then I said, ‘No, I don’t feel any teeth.’ And I said, ‘Oh my God, I’m in the mouth of a whale. With his mouth shut.’ ”Packard felt the whale swimming and shoved his breathing regulator back into his mouth.“I’m like, 'This is how you’re gonna go, Michael. This is how you’re going to die. In the mouth of a whale,’ ” he recalled thinking.For about 30 to 40 seconds, Packard twisted, turned and coped with an agonizing pressure on his legs. He could feel the whale’s forceful head shakes.Then came the light.“I just got thrown out of his mouth, into the water — there was white water everywhere,” he said. “And I just was lying on the surface floating and saw his tail and he went back down. And I was like, ‘Oh my God, I got out of that. I survived.’”With the help of a friend who was fishing nearby and witnessed the incident, Mayo gently pulled Packard out of the water and removed his drysuit. Packard was calm and fully cognizant, Mayo said, and told the men he thought his legs were broken. They also worried that Packard had an embolism because the whale drove him up to the surface so quickly, a “no-no in diving,” Mayo said.Mayo then called the ambulance, rescue squad and Packard’s wife and drove full-speed toward the dock.Hospital staff were in awe of Packard’s story, he said in an “Ask Me Anything” on Reddit on Sunday.“I said 'I got stuck in a whale’s mouth,’” Packard’s son wrote on behalf of his father. “All the nurses and doctors at the hospital came to see me and ask me about it. One nurse came in with a notepad, she asked me for lottery numbers!”After tests, doctors told Packard he had no broken bones and there were no signs of an embolism. His legs were badly bruised, and he had a dislocated knee. Doctors sent him home later that day.Packard’s story quickly spread throughout the town and eventually made national and international headlines. Though Packard’s experience appears fantastical, his reputation among locals as an experienced angler made his account all the more believable, Mayo said.“If it was some yahoo, I think we’d be arguing if it actually happened,” Mayo said. “You see him narrating what happened and it’s just … so very clearly true and obvious what happened.”Packard’s bruised legs have forced him to stay grounded as they heal, but he’s already planning his next trip out into the ocean.“It looks like being the tough son of a gun he is, he’s ready to be back at it as soon as he can be,” Mayo said. “I think we’ll probably be diving in a week, which is pretty remarkable.”The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/nation/2021/06/14/michael-packard-humpback-whale-lobster-diver/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}