{"Type": "", "Time": "2021-06-15", "Headline": "AstraZeneca says its antibody treatment failed in preventing Covid-19 in exposed patients, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.LONDON (REUTERS) - Anglo-Swedish drugmaker AstraZeneca said on Tuesday (June 15) that a study of its monoclonal antibody treatment, AZD7442, did not meet the main goal of preventing symptomatic Covid-19 in people recently exposed to the novel coronavirus. The company said the participants in the trial were unvaccinated adults older than 18 years with confirmed exposure to a person with the coronavirus within the past eight days. AZD7442 reduced the risk of developing symptomatic Covid-19 by 33 per cent compared with a placebo, which was not statistically significant, the company reported. \"While this trial did not meet the primary endpoint against symptomatic illness, we are encouraged by the protection seen in the PCR (polymerase chain reaction) negative participants following treatment with AZD7442,\" Dr Mene Pangalos, AstraZeneca executive vice-president, said in a statement. AstraZeneca is also studying the treatment in a pre-exposed patients trial and for preventing more severe disease. The monoclonal antibody therapy belongs to a class of drugs which mimic natural antibodies the body produces to fight off the infection. Rivals Regeneron Pharmaceuticals and Eli Lilly & Co have both developed monoclonal antibody therapies which have been authorised for use in the United States to treat patients infected with the virus. The European Medicines Agency (EMA) has approved Regeneron’s therapy and is reviewing similar drugs from Eli Lilly, Celltrion and one developed by GlaxoSmithKline and Vir Biotechnology. AstraZeneca last October enlisted Swiss contract manufacturer Lonza to produce the antibody drug in Portsmouth, New Hampshire, starting in the first half of 2021. AZD7442 is being developed with support from the US government. AstraZeneca in March announced a deal with the US government to supply up to half a million doses of AZD7442.The company said on Tuesday that it is now in talks with the US government regarding next steps on the deal. Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/astrazeneca-says-its-antibody-treatment-failed-in-preventing-covid-19-in-exposed", "Source": "google"}