{"Type": "", "Time": "2021-06-15", "Headline": "COVID-19: What you need to know about the coronavirus pandemic on 14 June | World Economic Forum", "Text": "This site uses cookies to deliver website functionality and analytics. If you would like to know more about the types of cookies we serve and how to change your cookie settings, please read our Cookie Notice. By clicking the \"I accept\" button, you consent to the use of these cookies.Confirmed cases of COVID-19 have passed 175.9 million globally, according to Johns Hopkins University. The number of confirmed deaths stands at more than 3.8 million. More than 2.36 billion vaccination doses have been administered globally, according to Our World in Data.UK Prime Minister Boris Johnson is set to announce a delay to a planned easing of COVID-19 restrictions in England. Victoria, Australia, has reported two new locally acquired COVID-19 cases. The two people were already in isolation, authorities said. They come after a two-week snap lockdown prompted by a cluster of cases.Moscow will give away cars in a prize draw for those who get a COVID-19 vaccine in an effort to speed up a slow uptake of jabs. The city has reimposed some restrictions after a rise in cases.Two-thirds of eligible people in Dubai have now received two doses of a COVID-19 vaccine, the Dubai Health Authority has said.An Indonesian city is using a fleet of vaccination buses to deliver COVID-19 shots to its population. Pekanbaru now has 10 buses as part of its vaccination programme.India has reported 70,421 new COVID-19 cases over the last 24 hours - the lowest figure since 31 March, healthy ministry data showed. The Group of Seven (G7) major economies have pledged to donate a billion vaccine doses over the next year. A communique following the summit in Carbis Bay, Cornwall said, \"The commitments since we last met in February 2021 including here in Carbis Bay provide for one billion doses over the next year.\"The document goes on to explain that the G7 will work with the private sector, G20 and other countries to \"increase this contribution over the months to come\".The bulk of these billion doses will be donated through the vaccine-sharing facility, COVAX. “This is an important moment of global solidarity and a critical milestone in the push to ensure those most at risk, everywhere are protected,” said Dr Seth Berkley, CEO of Gavi, the Vaccine Alliance (Gavi).Dr Tedros Adhanom Ghebreyesus, the World Health Organization's Director-General also welcome the announcement but added, \"we need more, and we need them faster\".The head of the European Union drug regulator's COVID-19 task force gave an update on the AstraZeneca COVID-19 vaccine yesterday.Marco Cavaleri said the vaccine has a \"favourable benefit-risk profile in all ages but particularly in the elderly above 60\".The European Medicine Agency's position is that the AstraZeneca shot is safe and can be used for all age groups over 18, Reuters reports. But, many EU countries have stopped administering it to people below a certain age over fears of very rare cases of blood clotting.The COVID Response Alliance for Social Entrepreneurship is a coalition of 85 global leaders, hosted by the World Economic Forum. Its mission: Join hands in support of social entrepreneurs everywhere as vital first responders to the pandemic and as pioneers of a green, inclusive economic reality.Its COVID Social Enterprise Action Agenda, outlines 25 concrete recommendations for key stakeholder groups, including funders and philanthropists, investors, government institutions, support organizations, and corporations. In January of 2021, its members launched its 2021 Roadmap through which its members will roll out an ambitious set of 21 action projects in 10 areas of work. Including corporate access and policy change in support of a social economy.For more information see the Alliance website or its “impact story” here.\nJoe Myers, Writer, Formative Content\nThe views expressed in this article are those of the author alone and not the World Economic Forum.Social purpose organization, Mann Deshi, is using its position on the frontlines of the pandemic to deliver critical COVID-19 relief.The G7 are to donate a billion COVID-19 vaccine doses to poorer countries, but some experts fear it offers only a small lifeline to global vaccine equity.", "Section": "", "Writers": "", "URL": "https://www.weforum.org/agenda/2021/06/covid-19-coronavirus-pandemic-14-june-2021/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}