{"Type": "", "Time": "2021-06-15", "Headline": "S'pore new private home sales drop 30% in May on heightened alert restrictions, Property News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Developers sold fewer homes in May as the latest round of tighter Covid-19 restrictions dampened showflat and property viewings.But the drop in sales volume was not as drastic as during the first month of the circuit breaker in April 2020, when sales plunged by almost 60 per cent from March 2020, analysts noted.New private home sales last month fell nearly 30 per cent to 891 units from 1,268 units in April, but bookings were up 83 per cent from May last year.\"More companies have set up new technology infrastructures... Many developers and sales agents were able to switch to remote viewings quickly,\" said Ms Christine Sun, senior vice-president of research and analytics at real estate firm OrangeTee & Tie.The figures from the Urban Redevelopment Authority exclude executive condominium (EC) units - a public-private housing hybrid.Including ECs sold, developers moved 1,230 new homes last month - just 8.8 per cent lower than in April, and more than double the 510 units sold in May 2020.Developers launched 514 units for sale in May, down 50 per cent from 1,038 in April, and 16 per cent lower than 615 units in the same month last year.Three new projects were launched before the heightened alert measures kicked in on May 16 - the executive condominium Provence Residence in Canberra Link and luxury projects One Bernam and Park Nova.Provence Residence and One Bernam were among the best-selling projects last month. Others included Treasure at Tampines, Normanton Park, Parc Central Residences and Midwood.There are no new project launches in June but new home sales this month could match May's numbers due to pent-up demand, Huttons Asia director of research Lee Sze Teck said.Several new launches are lined up for July - The Watergardens in Canberra, Parc Greenwich, Klimt Cairnhill and Pasir Ris 8.Despite lower sales in the prime district last month, Park Nova saw 12 units sold from $6.8 million to more than $34 million. Its biggest penthouse transacted at $5,838 per square foot (psf), beating the recent high of $5,125 psf in another project in the Orchard Boulevard area, noted Mr Mark Yip, chief executive of Huttons Asia.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/property/singapore-new-private-home-sales-drop-30-in-may-on-heightened-alert-restrictions", "Source": "google"}