{"Type": "", "Time": "2021-06-15", "Headline": "Pan Ocean proposes delisting from SGX with $8.70 per share exit offer, Companies & Markets News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE (THE BUSINESS TIMES) - Bulk shipping company Pan Ocean is proposing a voluntary delisting from the Singapore Exchange with a conditional cash exit offer of $8.70 per share.This represents a premium to the shares' last transacted price of $8 on May 10, its last trading day.The delisting is not a privatisation exercise, Pan Ocean and its South Korean parent company Harim Holdings said in a joint announcement of Monday (June 14). The company intends to maintain its primary listing on the Korea Exchange (KRX), and Singapore registered shareholders can elect to have their shares transferred from the Singapore branch register to the South Korea register if they wish.The exit offer will not be extended to the shareholders of the company whose shares are registered on the company's principal register of shareholders in South Korea.In the announcement, Pan Ocean and Harim said that in maintaining the dual listing, Pan Ocean incurs costs that could be focused on business operations.KRX is also geographically more aligned with the company's business operations and core business competencies, which are based in South Korea, it said.Furthermore, trading liquidity in Singapore is generally thin, with an average of 86 shares traded in the last one month leading up to its last trading day. There are only 170,597 shares, representing about 0.03 per cent of the total number of issued shares, trading on the SGX, as at the Monday announcement.Moreover, Pan Ocean has no need for access to capital markets and has not carried out any exercise to raise cash funding on the SGX in the last five years.The delisting is subject to the approval of the SGX and both the delisting and exit offer will be conditional on the obtaining of shareholders' approval at an extraordinary general meeting.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/companies-markets/pan-ocean-proposes-delisting-from-sgx-with-870-per-share-exit-offer", "Source": "google"}