{"Type": "", "Time": "2021-06-15", "Headline": "Larger groups seen amid a cautious reopening, Latest Singapore News - The New Paper", "Text": "Singapore cautiously lifted some of its Covid-19 restrictions yesterday - allowing larger groups to gather - and indicated that it would take the same approach to reopening schools.After close to a month of being on heightened alert, the country saw larger groups venture out and more activities resume.A further reopening is on the cards next Monday, if infection numbers remain in check.But many continued to take a cautious approach to public gatherings, with community cases still in the double digits.There were 18 community cases reported yesterday, the highest since June 3 when 35 such cases were confirmed. One of yesterday's cases was unlinked.The cautious approach to reopening will apply to schools too, and students will be allowed back progressively once the June school holidays end and classes resume on June 28.With two weeks left in the June school holidays, many families welcomed the easing of restrictions, such as for group sizes to go up from two to five people.Households can now also have five unique visitors a day, up from the limit of two unique visitors under phase two (heightened alert) measures from May 16 to Sunday.Attractions, museums and public libraries have returned to 50 per cent of normal capacity, up from 25 per cent for the past month. Live performances and spectator sports events have also resumed.Many who ventured out in larger groups yesterday said they were glad to be able to do so, after a month cooped up at home. A number of groups had young children with them.Civil servant Anna Wong, 45, who was at Jurong Lake Gardens for a walk with her two sons, was glad she could get her mother to join them.\"It can get pretty stifling if she were to stay indoors all day.\"The scene was similar at Jewel Changi Airport, which reopened yesterday after a month-long closure triggered by a large cluster of Covid-19 infections at the airport. Visitors began streaming in when the mall opened at 10am.Larger groups of people were also seen at parks and attractions such as the Singapore Zoo.With the relaxing of measures, some businesses such as beauty salons that involve clients removing masks have also been allowed to resume.Several salons said they were fully booked given pent-up demand.Madam Lim Joo Li, director of Beauty Horizon Aesthetics Salon in International Plaza, said she was fully booked for appointments for the rest of the week.\"I am relieved I can open up again. During the circuit breaker last year, we lost some customers who never returned afterwards,\" said the 50-year-old.Get The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/singapore/larger-groups-seen-amid-cautious-reopening", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}