{"Type": "", "Time": "2021-06-15", "Headline": "The Guardian view on delaying lockdown easing: sadly unavoidable | Editorial | The Guardian", "Text": "The exponential spread of the Delta variant, and the uncertainties surrounding it, mean pausing the roadmap is justifiedLast modified on Tue 15 Jun 2021 05.55 EDTSince February, when Boris Johnson unveiled a four-step roadmap to ending all Covid restrictions in England, progress has been steady and at times relatively serene compared with the periods of abject confusion and chaos that went before. The successful rollout of the vaccination programme allowed targets to be met, including the substantial “step three” easing of restrictions on 17 May.But as Boris Johnson recognised in his press conference today, the spread of the new Delta variant – which now accounts for 96% of Covid cases in the United Kingdom – has upended calculations. Latest data suggests it is 40-80% more transmissible than the Alpha variant, which originated in Kent. The variant partly evades vaccines and appears to increase the risk of hospitalisation. Hospital admission rates are increasing by 50% a week and 61% in the north-west. A significant third wave is thus under way and the government’s scientific advisers do not know the extent to which current rates of vaccination and acquired immunity will keep it in check. A summer surge in hospitalisations could overwhelm an already overstretched NHS.The prime minister is therefore right to opt for caution by delaying the lifting of all Covid restrictions until 19 July, reviewing the data in two weeks’ time. The roadmap has encountered a significant new hazard and, as Mr Johnson put it: “now is the time to ease off the accelerator.” Given that significant unlocking has already taken place, it must be hoped this pause is enough to put the brakes on the new wave. It will allow vital progress to be made in administering millions of second vaccine doses, which greatly increase protection against the Delta variant. It will also allow time to focus on reaching the 2 million or so over-50s who have still not been fully vaccinated, and to speed up second doses for the under-40s. This will save lives. By late July, schools will be breaking up for the summer, further reducing transmission risk. Even so, it seems likely that there will be another fraught review of data next month, in order to assess whether the link between infection and hospitalisation has been sufficiently broken to fully unlock.The delay is, of course, another bitter blow for the hospitality industry and the arts. Theatres, restaurants, pubs, concert venues and nightclubs, after haemorrhaging cash for more than a year, have spent money that they haven’t got preparing for a full reopening next week. Many businesses are teetering on the edge of the abyss and some will now go under. The level of the government’s support should reflect the extent of the restrictions it continues to impose. Instead, the Treasury is sticking to its plan to scale down the furlough scheme and business rate relief, ramping the financial pressure up still further. This is shortsighted and unfair. Far more needs to be done to address the dire predicament of much-loved institutions, many of them independently owned and part of the fabric of their communities. There was at least some limited good news for those who planned summer nuptials on the presumption that all restrictions would be lifted. Mr Johnson announced the current cap on 30 guests will still be lifted for weddings and for funerals, though other restrictions and social distancing will remain in place. The Delta variant has cast a shadow over the summer. But given the greater risks it has unleashed, and its virulence, Mr Johnson was right to heed the scientific advice and press the pause button for the time being. As Sir Patrick Vallance suggested today, the vaccination programme is now in a race with a faster-spreading variant. The four-week delay is necessary to help it win that crucial contest.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/commentisfree/2021/jun/14/the-guardian-view-on-delaying-lockdown-easing-sadly-unavoidable", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}