{"Type": "", "Time": "2021-06-15", "Headline": "Boris Johnson says dancing indoors at weddings is banned", "Text": "The government has lifted the 30-person limit on weddings – but dancing remains banned.Under the new rules for weddings, dancing indoors is still not permitted except for the couple’s first dance.On Monday, Boris Johnson delayed the end of England's coronavirus lockdown until 19 July.However, one key change to the restrictions saw Johnson scrap the 30-guest limit for wedding ceremonies and receptions from 21 June: the date the lockdown was supposed to end.Watch: 30-person limit on weddings in England lifted from 21 JuneThe number of attendees will instead be decided by how many people the venue can safely accommodate with social distancing measures in place.As well as indoor dancing not being allowed, other restrictions must remain in place.Food and drink must be ordered, served and consumed by guests seated at a table, while attendees must also wear face masks.New rules also state that anyone organising weddings in gardens of private homes, or on private land, must complete a COVID risk assessment if they want more than 30 people to attend.Johnson, meanwhile, was asked about wedding restrictions by a member of the public at Monday's Downing Street press conference.Tessa from Bedfordshire, who said she had to postpone her wedding twice, asked the prime minister why testing and vaccination status cannot be used to open up weddings in the same way it is being used for football matches.She said it feels like weddings are “bottom of the priority list despite being significant life events without which some people cannot progress with their lives”.Read more:PM delays end of Covid restrictions by up to four weeks over Delta variant fears‘Totally unacceptable’: Sir Lindsay Hoyle vents anger over move to hold Covid road map press conference before MPs are toldJohnson said: “I’m very, very sorry to hear about your wedding plans being postponed twice. Indeed, obviously, I’m sorry for all the disappointment that’s going to be caused by going a bit slower as we are today.“All I can say is I’m sorry for the disappointment that this will certainly bring to weddings, to many, many businesses, but it’s a few weeks that I think is worth it to get those jabs in.\"Johnson himself married his fiancee, Carrie Symonds, at the end of last month with a 30-person limit at the ceremony.Watch: PM delays end of Covid restrictions by up to four weeks over Delta variant fearsDickson Yeo, the Singaporean man who was jailed in the US for spying for China and was arrested by the Internal Security Department upon his return to Singapore in December will be continue to be detained under the Internal Security Act.Reigning champions Portugal begin their defence of the trophy against Hungary at Euro 2020 in Budapest on Tuesday as World Cup holders France take on Germany in a hotly-anticipated clash between two of the continent's heavyweights.Search for private jet membership. The affordable price makes these private jet offers hard to resistAn ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.The Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.The first crew for China's new space station prepared to blast off this week for the latest step in Beijing's ambitious programme to establish itself as a space power.Spain opened their Euro 2020 campaign with a goalless draw against Sweden in Seville on Monday after their preparations were badly affected by Covid-19, while Patrik Schick scored one of the championship's great goals in the Czech Republic's 2-0 win over Scotland.US President Joe Biden arrived Sunday in Brussels for two days of summits with leaders from the NATO military alliance and the European Union.More than half of America’s 724 billionaires live in just four states: California, New York (118), Florida (68) and Texas (64).Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.Research best security system. Protect yourself and your home with wireless alarm systems.The Copa America that almost never was opened Sunday in Brazil, overshadowed by the desperate search for a last-minute host, sponsor withdrawals and Covid-19 -- including outbreaks on three teams.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.US President Joe Biden will seek the EU's backing on Tuesday to face the rise of China, but Brussels wants a swift end to lingering trade rows and a clean break from Donald Trump.Amazon.comWith its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.Major US indices finished at fresh records Monday as global equity markets began the week cautiously ahead of a much-anticipated Federal Reserve meeting.This new car cloth can easily remove all the car scratches and dents from your car.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the \"systemic challenges\" posed by its policies.When you want protection that goes beyond just covering your medical costs, critical illness insurance is the logical choice. But with so many options out there, which ones are best for you? We investigate in this article. In a nutshell, critical illness insurance is insurance […] The post Best Critical Illness Insurance Plans In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/boris-johnson-indoor-dancing-banned-183610646.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}