{"Type": "", "Time": "2021-06-15", "Headline": "SG automotive marketplace Carro raises $360m led by SoftBank to become a unicorn", "Text": "Aaron Tan Founder and CEO of Carro, and Fong Hon Sum Founder and CEO of myTukar, Carro's subsidiary.By Khairani Afifi NoordinJune 15, 2021Singapore-headquartered Carro has announced the completion of a $360 million Series C funding round led by SoftBank Vision Fund 2, making it the first automotive marketplace unicorn in Southeast Asia. Notable investors in this round of financing include several prominent Indonesia-based funds such as EV Growth, according to a statement, according to a press release on Tuesday.The funds will be used to strengthen Carro’s market position and expand its retail offering across markets that have seen significant growth in the past year, namely Indonesia, Thailand, Malaysia, and Singapore. The company will also enhance its portfolio of financial services by expanding beyond in-house loan financing. It will also use the funds to accelerate the development of its AI capabilities, it said. Carro CEO and founder Aaron Tan said the round marks a huge milestone for the company, adding that he is grateful for the strong support from its investors. “As digitalisation shapes the global landscape through new consumer habits and business practices, it is a very exciting time for an end-to-end online car marketplace like Carro,” said Tan.Meanwhile, Softbank Investment Advisers managing partner Greg Moon said the firm is delighted to partner with Tan and the Carro team, supporting its ambition to expand into new markets as well as use AI-powered technology to make the car buying process smarter, simpler, and safer.SoftBank Group first invested in Carro through SoftBank Ventures Asia, its venture capital arm, in 2016.Carro provides a full-stack service for all aspects of car ownership and uses AI-powered technology to transform the car buying and selling experience. It has pioneered innovative services such as Singapore’s first contactless car purchase service, first car subscription service and the first region-wide behaviour and usage-based car insurance. The company closed its financial year ending March 2021 with over a 2.5x growth in revenue and continues to be EBITDA positive for the second year running. Carro was also named Asia Pacific’s fastest growing company in 2021 by The Financial Times and Statista.In September last year Carro raised about S$150 million in debt and equity financing from investors that included Japanese trading company Mitsubishi Corp. and MS&AD Ventures, the venture arm of MS&AD Insurance Group. Earlier investors in Carro include Insignia Ventures and B Capital.In an earlier interview with DealStreetAsia, Carro’s chief financial officer Ernest Chew said that the company’s revenue for 2020 was two-and-a-half-times more than 2019, which was $86 million, according to regulatory filings. The company is EBITDA positive, and has a $1 billion gross merchandise value run-rate, although it declined to provide the numbers for its used car transactions. Carro is currently EBITDA positive. Chew also said Carro is in partnership with banks to expand its consumer financing solutions.Carro is estimated to be raking in annualised revenues of $300-400 million, selling around 4,000 cars a month, compared with Carsome’s $800 million annual revenues, selling 10,000 cars per month.Competition in Southeast Asia’s used car marketplace is heating up with Singapore’s classifieds company Carousell combining its used-car platforms across Southeast Asia under an automotive unit called Carousell Auto Group. The auto business is the group’s largest moneymaker, contributing a third of Carousell’s revenue last year.Carro Softbank Deals\n                                                Carro said it plans to use the funding for expanding its business in the region. \n                                                Venture Capital\n                                                Existing investors SoftBank Ventures Asia and Golden Gate Ventures topped up in the round. \n                                                Analysis\n                                                Carousell, Carro and Carsome line up aggressive expansion plans with sale of used cars going up.   \n                                                Unicorns\n                                                The used car marketplace is also moving ahead with IPO plans as COVID-19 has boosted business.  \n                                                Already have an account? Sign in here\n0\nYou have one free story left this month.\nYou have 0 free stories left this month.\nThis is your last free story of the month.\nRegister to continue reading our free content.\n© Copyright DEALSTREETASIA 2014-2021 All rights reserved.Forgot your password?We will never share your information with third parties.If you don’t already have an account click the button below to create your account.OR\n                            Unlock your competitive advantage in a\n                            rapidly evolving landscape. Our packages\n                            come with exclusive access to archive\n                            content, data, discount on summit tickets & more.\n                            Be a part of our growing community now.\n                        In Singapore, we are looking to double our reporting team by this year-end to comprehensively cover the fast-moving world of funded startups and VC, PE & M&A deals. We want reporters who can tell our readers what is really happening in these sectors and why it matters to markets, companies and consumers. The ability to write precisely and urgently is crucial for these roles. Ideal candidates must have to ability to work in a collaborative, dynamic, and fast-changing environment. We want our new hires to be digitally savvy and ready to experiment with new forms of storytelling. Most importantly, we are looking for hard-hitting reporters who work well in a team. Collaboration and collegiality are a must.Following vacancies can be applied for (only in Singapore).Following vacancies can be applied for (only in Singapore).   In Singapore, we are looking to double our reporting team by this year-end to comprehensively cover the fast-moving world of funded startups and VC, PE & M&A deals. We want reporters who can tell our readers what is really happening in these sectors and why it matters to markets, companies and consumers. The ability to write precisely and urgently is crucial for these roles. Ideal candidates must have to ability to work in a collaborative, dynamic, and fast-changing environment. We want our new hires to be digitally savvy and ready to experiment with new forms of storytelling. Most importantly, we are looking for hard-hitting reporters who work well in a team. Collaboration and collegiality are a must.Following vacancies can be applied for (only in Singapore).Following vacancies can be applied for (only in Singapore).   ", "Section": "", "Writers": "", "URL": "https://www.dealstreetasia.com/stories/carro-360m-softbank-unicorn-245899/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}