{"Type": "", "Time": "2021-06-15", "Headline": "9 more Covid-19 cases linked to Bukit Merah View food centre; closure extended to June 26, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Nine more Covid-19 cases have been confirmed to be linked to the Bukit Merah View Market and Food Centre cluster, most of whom are food stall workers there or their household contacts, said the Ministry of Health (MOH) on Tuesday (June 15) night.This brings the total number of cases in the cluster to 25.The food centre will have its closure extended to June 26 for cleaning and to break the chain of transmission, said MOH. It has been closed since June 13 and was meant to be reopened on Wednesday.\"With the detection of more cases among the market and food centre staff and their close contacts, which suggests that there is ongoing spread with wider transmission, the closure of 115 Bukit Merah View Market and Food Centre will be extended to June 26,\" it said.Overall, there were 14 confirmed cases of Covid-19 on Tuesday, taking Singapore's total to 62,315.All were locally transmitted within the community, with no new imported cases.Four of the community cases are unlinked, and 10 are linked to existing cases.Of the linked cases, five had already been placed under quarantine, while the other five were detected through surveillance.The four unlinked cases include a 36-year-old housewife who developed a fever on June 8 and lost her sense of taste and smell on June 10.She sought medical treatment on Monday, when she visited a general practitioner, where she was administered both an antigen rapid test (ART) and a polymerase chain reaction (PCR) test.Both test results came back positive for Covid-19 infection. Her serology test result is pending.She is a household contact of a 35-year-old male Singaporean who works as a senior executive at Nets, and who is a linked case detected through surveillance.Tuesday is the first day since June 29, 2020 to have zero imported cases reported.There were also no new cases from workers' dormitories.The weekly total number of community cases is 60 this week, down from 93 the previous week. But the number of unlinked cases has risen to 18 in the past week, compared with 10 cases in the week before. There are currently 44 active clusters, down from 46 on Monday.As at Tuesday night, 137 patients remain hospitalised, including two in critical condition in the intensive care unit, while 233 are recuperating at community facilities.Singapore has had 34 deaths from Covid-19 complications, while 15 who tested positive have died of other causes.Read the full MOH press release here.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/nine-more-cases-linked-to-bukit-merah-view-food-centre-closure-extended-to-june-26", "Source": "google"}