{"Type": "", "Time": "2021-06-15", "Headline": "Malaysia’s plan to fast-track jabs at workplaces slammed, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.KUALA LUMPUR - Malaysia's move to start inoculating workers in key economic sectors against Covid-19 before the completion of vaccinations for senior citizens and front-liners has drawn criticisms from several opposition politicians.Mr Khairy Jamaluddin, the national coordinating minister for immunisation, said on Monday (June 14) that the government will begin vaccinating industry workers from Wednesday, as part of measures to reduce infections in workplaces that continue to dominate the number of new clusters.Vaccine centres will be opened for the manufacturing, construction, plantation, retail and hospitality sectors.A total of 30,000 doses will be set aside to inoculate factory workers this month.\"If we look at the daily Covid-19 data on Sunday, 11 out of 15 clusters are workplace outbreaks, involving almost 200 active cases,\" Mr Khairy told a news conference.\"This is why we made the decision for the fourth phase, or the pandemic control phase, to kick off as soon as possible to reduce the number of workplace clusters and stop the transmission of infections among workers.\"But the move announced last week was slammed by the opposition who pointed out that the vaccination of front-liners and senior citizens has yet to be completed.The management department director of the federal police, Datuk Ramli Din, revealed last week that 20 per cent of the police force, many of whom have to man roadblocks during the ongoing nationwide lockdown, had yet to be vaccinated.Opposition Democratic Action Party (DAP) MP and former deputy education minister Teo Nie Ching said on June 10: \"KJ (Khairy Jamaluddin) promised in March that teachers would be prioritised in phase two. However as at June 5, only 70,000, or 16.2 per cent, of the teachers under the Ministry of Education had been vaccinated. When will the remaining 83.8 per cent of the teachers get their vaccine?\"Teachers are currently conducting classes online until end-July.While some 57 per cent of senior citizens are expected to be vaccinated by mid-June, it appears the rest may have to wait while the government fast-tracks vaccines for workers, said DAP MP Khoo Poay Tiong on June 9.\"As Khairy himself has repeatedly stated, our supply of Covid-19 vaccines is limited. Starting phase four concurrently with phase two means fewer vaccines would be available for senior citizens. This is a major deviation from the government's own policy. In effect, senior citizens would have to wait longer for their vaccine although they are categorised as a high-risk group.\"The states of Pahang, Terengganu and Kelantan, as well as Sabah in Borneo, have the lowest vaccine take-up rates in the country.As at June 6, the registration rates for Pahang, Kelantan and Terengganu were 43.36 per cent, 36.83 per cent and 43.28 per cent respectively, DAP Pahang assemblyman Chiong Yoke Kong said last week.Sabah has the lowest rate at 19.75 per cent.In contrast, Putrajaya and Kuala Lumpur have the highest rates of 100 per cent and 70.65 per cent respectively.Kelantan, Terengganu and Pahang also have the highest number of people who skipped their vaccine appointments, totalling more than 10,000 in each state.Believing in fake news, not checking the vaccine app and transport issues, were some of the reasons for missing the appointments, said Mr Chiong.Prime Minister Muhyiddin Yassin on Sunday said the government is confident that Kuala Lumpur and Putrajaya will achieve herd immunity earlier than expected by August.Malaysia recorded 4,949 new cases on Monday, with 2,026 of them from Selangor and Kuala Lumpur.There are a total of 662,457 cases so far.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/malaysias-move-to-fast-track-covid-19-vaccinations-in-economic-sector-draws-brickbats", "Source": "google"}