{"Type": "Asia", "Time": "2021-06-15", "Headline": "Herders to hoteliers: China lures millions of tourists to Tibet", "Text": "NYINGTRI, China: In a room warmed by an open wood stove, Baima says her family converted their white-brick house into a hotel as China's Communist leadership ushers tens of millions of tourists to the politically sensitive region of Tibet.Surrounded by mist-covered mountains, nearly 500km from the capital Lhasa and close to a disputed border with India, most of the houses in her remote village of Tashigang have followed suit and turned into homestays.\"We used to live a life of herding and farming,\" the 27-year-old told AFP. \"Then the government encouraged us to run a hotel.\"The villagers - who speak the Tibetan language - have been given Mandarin classes to help them accommodate the Chinese guests whose arrival has boosted their income.But critics warn the surge of visitors risks eroding traditional ways of life.\"Opening hotels is not as hard as herding,\" Baima said, from her home packed with ornate wooden furniture and brightly painted walls.Government officials looked on as she spoke.Tibet is heavily restricted to foreign journalists who have little chance to visit a sensitive region that Beijing says it \"peacefully liberated\" in 1951.It has been near-impossible to report from Tibet independently since 2008, when violent protests broke out in Lhasa and Beijing clamped down on access to the region and its residents.AFP joined a recent government-steered tour to the region.Tourism in Tibet fits with one of China's key aims - poverty alleviation - but also, experts warn, follows a pattern of co-opting and reshaping outlying areas with a history of resistance to Beijing's rule.Thirty-five million tourists flooded into the region last year, ten times the entire population of Tibet.That has prompted warnings that the influx could overwhelm traditional lifestyles and values.\"The cultural degradation that is involved in this case of hyper-managed mass tourism spectacle is very worrying,\" said Robert Barnett of the School of Oriental and African Studies (SOAS) in London.\"It's hard to identify though, since of course there is benefit for Tibetans in that trade; what is harder to quantify is the damage.\"\"CULTURAL TRAINING\"Waves of mainland travellers have flocked to the region, attracted by the scenery, air of mystique and multitude of new transport links.Many dress in traditional Tibetan outfits and pose outside cultural landmarks in the capital city of Lhasa.Baima's hamlet has 51 family hotels, according to officials, tying the bulk of its residents to the tourism industry.AFP did not see any tourists in the village on the visit.\"The government organises cultural training, national common language training (and) catering industry training,\" party official Chen Tiantian told a crowd of reporters on the state-organised trip, insisting the programmes were \"voluntary\".\"Now 80 per cent of the people in the village can communicate in Mandarin,\" she added.Baima's neighbour Cangjie, wearing an identical traditional dress with embroidered sleeves, said their lives have changed.\"With the arrival of outsiders, we are ... exposed to new things,\" she said, four pictures of the Chinese president Xi Jinping hanging from her walls.Scholars of Tibet say Beijing has pumped money into the region in the hopes that economic growth will diminish separatist sentiment.Yet that carries the risk of the \"commodification of culture\", Barnett of SOAS said, adding that Beijing expects its investment to be repaid by \"gratitude to the Party for its generosity\".Tashigang comes under the jurisdiction of Nyingtri city - a modern city called Linzhi in Chinese that is being dubbed an \"international tourism area\" by the government, pulling in eight million visitors last year.\"Our next goal is to strive for international tourists,\" said Hu Xiongying, from the managing Party group of Lunang tourism town - Lulang in Chinese - a neighbouring district that administers Tashigang.But most foreign passport holders are required to have an approved guide and special permit to enter Tibet so numbers are low, with only 270,000 international tourists in 2019.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Beijing,China,travel,Tibet,tourism", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/china-tibet-tourism-hotels-mandarin-classes-culture-training-15017920", "Source": "google"}