{"Type": "", "Time": "2021-06-15", "Headline": "US journalist Nathan Maung detained in Myanmar released: Lawyer, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.YANGON (AFP) - A US journalist detained in Myanmar since March was released on Monday (June 14) after charges against him were dropped, his lawyer said.US citizen Nathan Maung \"was released this morning from Insein prison as the police withdrew the charges against him\", and will fly back to the US on Tuesday, his lawyer Tin Zar Oo told AFP.Mr Maung, who founded local outlet Kamayut Media, had faced charges under a colonial-era law that criminalises encouraging dissent against the military, she added.Earlier this month a Myanmar journalist working for another outlet was jailed for two years under the same law.Myanmar has been in turmoil since the military ousted civilian leader Aung San Suu Kyi on Feb 1, triggering a mass uprising as large swathes of the population take to the streets.The junta has responded with force - shooting protesters, arresting suspected dissidents in night raids, targeting journalists and shutting down news outlets.Several foreign journalists have been detained, including another US citizen, Mr Danny Fenster, who was held while attempting to leave the country on May 24.Authorities have yet to release any information on his whereabouts and well-being.Since the February coup, a military crackdown on dissent has killed more than 860 civilians, according to a local monitoring group.Junta leader Min Aung Hlaing has justified his power grab by citing alleged electoral fraud in the November poll won by Ms Suu Kyi's National League for Democracy party.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/us-journalist-nathan-maung-detained-in-myanmar-released-lawyer", "Source": "google"}