{"Type": "", "Time": "2021-06-15", "Headline": "PM arrives at Istana Negara | The Star", "Text": "\n                    Tuesday, 15 Jun 2021\n                PETALING JAYA: Prime Minister Tan Sri Muhyiddin Yassin has arrived for his audience with the King at Istana Negara on Tuesday (June 15).Muhyiddin was spotted entering the Palace in a black Toyota Vellfire via Gate 1 at 2.20pm.Muhyiddin's presence at the Palace came following an earlier audience between the King and Special Committee on Emergency chairman Arifin Zakaria, who arrived in a black Proton Perdana at 9.45am through the Istana Negara's Gate 2.Muhyiddin's audience with the King comes just hours before a scheduled announcement on the recovery plan for the country at 5pm.There is public intrigue over the recent flurry of high-level audiences between the King and political parties heads that began on Wednesday (June 9), where talks were believed to be on the current political landscape and the Covid-19 situation.The political heat went up a notch after Tun Dr Mahathir Mohamad revealed that he proposed the setting up of a National Operations Council (Mageran) to take over the administration.However, he said that the setting up of a Mageran would require the consent of the government, which he said was very unlikely to obtain.Mageran is an Emergency administration body formed after the May 13 riots in 1969 to restore law and order in Malaysia and to ensure unhindered economic growth.The King is also set to chair a special meeting involving the Malay rulers on Wednesday (June 16), which is the second of such meetings chaired by His Majesty.Umno and Pakatan Harapan have since called for Parliament to reconvene, and they both objected to the Mageran proposal. \nTags / Keywords:\nPrime Minister\n                                                                ,\n                                                                                                King\n                                                                ,\n                                                                                                Audience\n                                                                ,\n                                                                                                Muhyiddin Yassin\n                                                                ,\n                                                                                                Arifin Zakaria\n                                                                ,\n                                                                                                Istana Negara\n                                                                ,\n                                                                                                Emergency\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/news/nation/2021/06/15/pm-arrives-at-istana-negara", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}