{"Type": "", "Time": "2021-06-15", "Headline": "Badminton: Doubles star Kido collapses during a casual match, dies of heart attack at 36, Sport News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.JAKARTA (REUTERS, AFP) - Indonesian badminton player Markis Kido, an Olympic doubles gold medallist, has died aged 36 from a heart attack, the Badminton World Federation (BWF) said in a tweet on Monday (June 14).The Badminton Association of Indonesia (PBSI) said in a statement that former player Candra Wijaya witnessed Kido collapse while playing badminton at a sports complex in Tangerang.Kido has played badminton at the venue every Monday.The doubles specialist won gold at the 2008 Beijing Olympics partnering Hendra Setiawan, a year after the pair won the men's doubles title at the world championship in Kuala Lumpur.He also won the World Cup title in 2006 and Asian Games gold four years later, also partnering Setiawan.\nHendra Setiawan (left) and Markis Kido with their gold medals at the 2008 Beijing Olympics. PHOTO: AFP\nSetiawan described Kido as an \"amazing and very talented player\".\"Thank you so much for being a great partner in victory and defeat,\" Setiawan said in an online tribute.PBSI chairman Agung Firman Sampurna said Kido's death is a \"huge loss\" for the Indonesian badminton family, which is currently preparing for next month's Tokyo Olympics.Kido suffered from high blood pressure, the PBSI said in a statement, citing his mother, Zul Asteria.\"He seems to have given his life for badminton,\" she was quoted as saying.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/badminton-doubles-star-kido-collapses-during-a-casual-match-dies-of-heart-attack-at-36", "Source": "google"}