{"Type": "", "Time": "2021-06-15", "Headline": "WHO warns virus moving quicker than Covid-19 vaccines after G-7 doses pledge, Europe News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.GENEVA (AFP) - The WHO warned Monday (June 14) that Covid-19 was moving faster than the vaccines, and said the G-7's vow to share a billion doses with poorer nations was simply not enough.Global health leaders also warned the pledge was too little, too late, with more than 11 billion shots needed.Faced with outrage over disparities in jab access, the Group of Seven (G-7) industrialised powers pledged during a weekend summit in Britain to take their total dose donations to more than one billion, up from 130 million promised in February.\"I welcome the announcement that G-7 countries will donate 870 million (new) vaccine doses, primarily through Covax,\" World Health Organisation chief Tedros Adhanom Ghebreyesus told journalists.\"This is a big help, but we need more, and we need them faster. Right now, the virus is moving faster than the global distribution of vaccines.\"More than 10,000 people are dying every day... these communities need vaccines, and they need them now, not next year.\" While people in many wealthy nations are enjoying a return to a sense of normalcy thanks to high vaccination rates, the shots remain scarce in less well-off parts of the world.In terms of doses administered, the imbalance between the G-7 and low-income countries, as defined by the World Bank, is 73 to one.Many of the donated G-7 doses will be filtered through Covax, a global body charged with ensuring equitable vaccine distribution.Run by the WHO, the Gavi vaccine alliance and CEPI, the Coalition for Epidemic Preparedness Innovations, it has to date shipped more than 87 million vaccine doses to 131 countries - far fewer than anticipated.The WHO wants at least 70 per cent of the world's population vaccinated by the next G-7 meeting in Germany next year.\"To do that, we need 11 billion doses. The G-7 and G-20 can make this happen,\" said Tedros.Medical charity Doctors Without Borders questioned how sincere the G-7 was in pursuing vaccine equity.\"We need to see more clarity around the actual number of doses donated, and exactly how long it's going to take to translate their pledges into real impact and access,\" the medical charity's Hu Yuanqiong said.As well as dose sharing, the G-7 anti-pandemic battle plan includes commitments to avert future pandemics - slashing the time taken to develop and licence vaccines to under 100 days, reinforcing global surveillance and strengthening the WHO.But observers voiced scepticism at their willingness to follow through on the last point especially.\"I will believe (that) point when the contributions to WHO are increased,\" tweeted Ilona Kickbusch, founding director and chair of the Global Health Centre in Geneva.Others stressed the need to quickly resolve the issue of Covid vaccine patent protections, to boost production.Full-fledged negotiations towards a possible suspension of intellectual property protections for Covid vaccines, as well as other medical tools needed to battle the pandemic, have just begun at the World Trade Organisation after months of contentious debate.G-7 leaders \"say they want to vaccinate the world by the end of next year, but their actions show they care more about protecting the monopolies and patents of pharmaceutical giants,\" lamented Max Lawson, Oxfam's head of inequity policy.Human Rights Watch agreed.\"Focusing on vaccines and making charitable donations are not enough,\" Aruna Kashyap, Human Rights Watch's senior counsel for business and human rights, told AFP.\"The G-7's failure to unequivocally support a temporary waiver of global intellectual property rules is deadly status quo.\" WHO and partners also highlighted the desperate need for funds to overcome the pandemic.More than US$16 billion is still needed this year to fully fund efforts to speed up production and access to Covid-19 diagnostics, treatments and vaccines against Covid.That figure represents less that one percent of annual global defence expenditure, the WHO's emergencies director Michael Ryan pointed out.\"Surely we can afford one percent of that to save lives and bring this pandemic to an end.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/world/europe/who-warns-virus-moving-quicker-than-covid-19-vaccines-after-g-7-doses-pledge", "Source": "google"}