{"Type": "", "Time": "2021-06-15", "Headline": "China's nuclear leak is no Chernobyl, but how it was handled is troubling", "Text": "Is a nuclear power plant on the edge of China’s 60 million-strong Pearl River Delta megalopolis on the verge of an emergency? It doesn’t look like it — but that doesn’t mean there’s no cause for concern.The U.S. government has been assessing a report of a leak at the Taishan No. 1 nuclear power plant west of the cities of Guangzhou, Shenzhen and Hong Kong, CNN reported Monday, adding that the situation doesn’t pose a severe safety threat to workers at the plant or the wider public. A separate statement from Electricite de France SA, or EDF, which owns 30% of the facility and controls Framatome, the company responsible for its maintenance, said there had been an “increase in the concentration of certain noble gases in the primary circuit” of the plant, adding that this was a “known phenomenon.”Don’t fret. There’s nothing in the reports so far to suggest that Taishan is anywhere near turning into a Chernobyl, Fukushima or Three Mile Island. Still, the manner in which the news has emerged suggests a deeper problem that China’s nuclear industry will need to rectify in the years ahead.The scant information we have already gives several clues about what’s happened. Noble gases, particularly helium, xenon and krypton, are normal products of radioactive decay. The gas was coming from the deterioration of “a few fuel rods” and levels were in line with international standards, EDF said. If rods deteriorate, they’ll release fission products like xenon into the water flowing past them and on to the turbines that generate electricity. Detecting these gases is an early warning that one of the plant’s multiple safety systems isn’t working properly.Such incidents aren’t particularly rare, or overly concerning. More than 2% of fuel rod assemblies failed in this way in the U.S. between 1994 and 2006, according to a study by the International Atomic Energy Agency. Rates in most of Europe were not much better. Nuclear power plants have numerous redundant safety systems, and as long as any leak remains within the fortress-like reactor building, it should largely mean that plant staff have to temporarily take a few extra precautions, refueling becomes more tricky, and maintenance spending goes up.Why, then, should anyone care about what happened? The main reason relates to the way the news has emerged.Framatome first reached out to the U.​​​​​​S. Department of Energy last month warning of a potential issue at the plant, according to CNN’s report, adding that a company official described the incident as “an imminent radiological threat to the site and to the public” in a June 8 memo. Meanwhile, China’s regulator, the National Nuclear Safety Administration, or NNSA, was increasing its mandatory limit on noble gas concentrations to keep the leak within safety parameters, according to CNN’s account of the memo; Framatome suspected this was being done to avoid shutting down the reactor.Throughout this, the NNSA itself has remained silent. A nuclear safety monitoring website run by China’s Ministry of Ecology and Environment has no records of any problems with Taishan. The plant’s operator, China General Nuclear Power Corp., only said that “environmental indicators” at and around the plant are normal — a wording that doesn’t quite address the within-plant issues that EDF and Framatome are looking at.That silence and careful choice of words is the real problem. Nuclear safety, like aviation safety, is generally pretty good — but to get that way, it depends on a paranoid regulatory culture that addresses the smallest problem with the maximum of attention and transparency. That doesn’t appear to be happening in this instance.In both the Chernobyl and Fukushima disasters, the absence of such a culture within government regulators and power utilities was a key contributor to the incidents that followed, according to Najmedin Meshkati, a professor of engineering at the University of Southern California and expert on nuclear safety.“The combination of these two things can make or break a nuclear power industry in any country,” he said. The Taishan incident “should be an awakening for China to learn the lessons from Chernobyl and Fukushima, and do some soul-searching.”China accounts for more than 10% of the world’s nuclear power production, and about a third of the new plants under construction worldwide. For the health of its population, and its ability to decarbonize the world’s most polluting power grid, the government needs to ensure the atomic energy sector is run in a way that puts safety and transparency above political and public-relations concerns. Fixing that should be just as much a priority as replacing Taishan’s broken fuel rods. –BloombergAlso read: ‘China’s ambitions present systemic challenges’ — what NATO said on global security concerns Subscribe to our channels on YouTube & Telegram Why news media is in crisis & How you can fix itIndia needs free, fair, non-hyphenated and questioning journalism even more as it faces multiple crises.But the news media is in a crisis of its own. There have been brutal layoffs and pay-cuts. The best of journalism is shrinking, yielding  to crude prime-time spectacle.ThePrint has the finest young reporters, columnists and editors working for it. Sustaining journalism of this quality needs smart and thinking people like you to pay for it. Whether you live in India or overseas, you can do it here.Support Our Journalism ", "Section": "", "Writers": "", "URL": "https://theprint.in/opinion/chinas-nuclear-leak-is-no-chernobyl-but-how-it-was-handled-is-troubling/678149/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}