{"Type": "", "Time": "2021-06-15", "Headline": "Not possible to have fair hearing: Woman without mask at MBS", "Text": "SINGAPORE — An ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces (SAF).Phoon Chiu Yoke, who faces seven charges of not wearing her mask in various places and breaching her Stay-Home Notice, again asked District Judge (DJ) Janet Wang for her charges to be dropped. The 53-year-old Singaporean was filmed in a confrontation with a safe-distancing ambassador (SDA) at Marina Bay Sands last month. The incident on 15 May was caught in a viral video showing Phoon demanding to see the SDA's badge. Phoon also removed her mask after leaving court on 24 May, when she was photographed and filmed by the media.At her Tuesday hearing, the prosecution told the court that Phoon may face additional charges, including those from the Immigration and Checkpoints Authority. Phoon, who represented herself, stated that she was an ex-naval officer who had a \"number of incidents\" when she was a \"plaintiff\" or \"eyewitness\" to many cases, and as such, it was \"not possible\" for her to have a fair hearing. \"I am not privy to discuss all these cases in court here without causing embarrassment or being prejudicial to the SAF and to the government of Singapore (so I) am applying for all these charges to be dropped,\" she said. When probed on her cases with the SAF, Phoon repeated her allegations, adding, \"Due to all these cases in the past, I should be granted immunity as a citizen.\" Phoon described the cases as \"grave\" and \"very serious in nature\". DJ Wang then responded that her case with the SAF would not be relevant to her present charges, and that the court would not be cognisant of those charges. In reply, Phoon said, \"I beg to differ.\"The judge then adjourned the case to 6 July, pending her additional charges and for Phoon to seek legal advice. The maximum penalty for breaching COVID-19 measures is six months' jail and a fine of $10,000. Repeat offenders can be jailed for up to one year and fined up to $20,000.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeRelated stories:Woman, without mask in viral MBS video, asks judge to drop chargesWoman charged for not wearing mask at MBS, outside court and elsewhereWoman in viral video at MBS seen outside court without maskWoman in viral video at MBS claims trial to not wearing mask charge in separate incidentGetting the COVID-19 vaccine in Singapore is easy. According to the Ministry of Health (MOH), as of 17 May 2021, 3.4 million doses have been administered. Here's a guide on how to find a vaccination centre near you.European stock markets rose Tuesday after a mixed showing in Asia, as investors braced for news from a key Federal Reserve interest-rate meeting.Board certified internal medicine and obesity specialist reveals what happens after drinking just 1 diet soda. Click here to watch video.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.In the wake of one of the biggest password leaks in history, Apple has unveiled a new biometric-based feature that could one day replace passwords across all Apple devices.US President Joe Biden and the EU agreed a long-term truce in the 17-year-old Airbus-Boeing feud Tuesday, putting aside their own disputes to take on a rising China.Celebrated surgeon and author of the New York Times best seller \"The Plant Paradox\" reveals what many have suspected for a long time, and even worse.A landlord who kept exposing himself to a female tenant was jailed for 11 weeks and fined $2,000 on Tuesday (15 June) after he was found guilty of all six related charges.The largest bank in Singapore, DBS was named the ‘World’s Best Bank’ in 2019. If you’re a loyal DBS/POSB customer and have no plans to switch banks, here are the credit cards worth your salt. As the economy grapples with the plunge in consumer spending, […] The post Loyal DBS/POSB Customers: Which Credit Card Should You Add To Your Wallet? appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.Yep! Earn 1% cash back on eligible purchases* with a PayPal business debit card.Wednesday's talks between US President Joe Biden and Russian counterpart Vladimir Putin evoke vivid memories of the 1985 Geneva summit, when Cold War rivals Ronald Reagan and Mikhail Gorbachev met for the first time.A French nuclear firm said Monday it was working to resolve a \"performance issue\" linked to a gas build-up at a plant it part-owns in southern China following a US media report of a potential leak there.The nominee to be the top US diplomat for East Asia promised Tuesday that President Joe Biden would keep building relations with Taiwan, but balked at backing an overhaul of delicate arrangements on the issue with China.Father's Day is coming up.  Show him that you care with a special unique gift.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.If you’re wondering whether Ethereum is a good long term investment, keep reading.Looking for travel insurance? Save more with these promo codes and discounts from insurers such as FWD, MSIG, AXA, and more! To find out if your travel insurance covers COVID-19, read this article for the latest updates. No matter your travel itinerary, travel insurance is […] The post Travel Insurance Promotions and Discounts appeared first on SingSaver Blog - We Compare, You Save.We compiled data on 650 places across all 50 states to come up with this list.Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the challenges posed by its policies.Toshiba apologised to shareholders Monday and said it would remove two directors after a probe found the Japanese conglomerate had sought government help to try and influence a boardroom vote.New research has identified TEN favorite stocks for the upcoming yearWith its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Asset sales in a liquidation process at Hyflux Ltd., Singapore’s highest-profile distressed company, would likely bring in less than S$200 million, a person familiar with the matter said, a fraction of the amount creditors are claiming.A 20-year-old male polytechnic student on internship with a hospital secretly recorded a staff relieving herself at Jurong Medical Centre in January, a court heard.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/not-possible-fair-hearing-woman-without-mask-mbs-015240583.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}