{"Type": "", "Time": "2021-06-15", "Headline": "Nikhil Kamath Admits to Taking Help in Chess Game Against Viswanathan Anand; AICF Secretary Terms it 'Unfortunate' | LatestLY", "Text": "New Delhi, June 14: The All India Chess Federation (AICF) Secretary Bharat Chauhan has said it is \"unfortunate\" to see unfair methods employed in a charity chess game by Zerodha co-founder Nikhil Kamath against five-time world champion Viswanathan Anand.\rKamath defeated Anand in a COVID-19 relief charity match. However, reports claimed Kamath manipulated the game to register a win. The AICF secretary termed it as a \"bad\" move by Kamath and said it shouldn't have happened.\r\"It is very unfortunate it was a charity match. We don't expect anybody to get help from computers, at the national and state level we are following the protocols. We are putting cameras where players are playing and there is a fair play committee which includes three grandmasters and two players,\" Bharat told ANI. Viswanathan Anand Speaks About Controversial Charity Chess Match Against Zerodha Co-Founder Nikhil Kamath (Watch Video). \"All things are completely followed but in this kind of charity match we didn't expect anybody to do this. It is very unfortunate such things have happened.\rIt is ridiculous that so many are thinking that I really beat Vishy sir in a chess game, that is almost like me waking up and winning a 100mt race with Usain Bolt. 😬 pic.twitter.com/UoazhNiAZV — Nikhil Kamath (@nikhilkamathcio) June 14, 2021 He is not a player and he has apologised in public. He is not a regular player or our member we don't have jurisdiction, he was doing it for charity he shouldn't have done. This is really bad. For the noble cause, we are helping people and such things shouldn't happen,\" Bharat added.\rAfter reports came to the light, claiming that Kamath had been banned, he too revealed that he took help from some people and computers to analyse the game. He also apologised for his \"silly\" behaviour.\r\"Yesterday was one of those days that I had dreamt of when I was a really young kid learning chess, to interact with Vishwanath Anand. Got the opportunity thanks to Akshaypatra and their idea of raising funds for charity conducting a bunch of chess games with Vishy. It is ridiculous that so many are thinking that I really beat Vishy in a chess game, that is almost like me waking up and winning a 100mt race with Usain Bolt,\" Kamath said in a statement.\r\"I had help from the people analyzing the game, computers, and the graciousness of Anand sir himself to treat the game as a learning experience.\rThis was for fun and charity. In hindsight, it was quite silly as I didn't realise all the confusion that can get caused due to this. Apologies,\" he added.\rEven Anand tweeted Kamath's statement and added he just played the position on the board and expected the same from everyone. \"Yesterday was a celebrity simul for people to raise money It was a fun experience upholding the ethics of the game. I just played the position on the board and expected the same from everyone,\" Viswanathan tweeted.\rAccording to the AICF secretary, the Checkmate COVID progamme is launched to help the Chess community and not only Anand but a lot of other players played for this charity.\r\"Yesterday lot of celebrities, like Aamir Khan, Riteish Deshmukh, Kamath were there and various other celebrities were there for the initiative,\" Bharat said.\r(This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)Copyright © Latestly.com All Rights Reserved.", "Section": "", "Writers": "", "URL": "https://www.latestly.com/agency-news/sports-news-kamath-admits-to-taking-help-in-chess-game-against-anand-aicf-secy-says-turn-of-events-unfortunate-2547510.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}