{"Type": "Singapore", "Time": "2021-06-15", "Headline": "2 SCDF firefighters taken to hospital following Outram shophouse fire", "Text": "SINGAPORE: Two Singapore Civil Defence Force (SCDF) firefighters were taken to hospital following a shophouse blaze in Outram on Tuesday (Jun 15) morning.SCDF said it was alerted to a fire at 31 Teo Hong Road at about 11.15am.Thick smoke was emitting from the shophouse when the SCDF teams arrived, it said. Firefighters were equipped with breathing apparatus sets before they entered the unit.The fire at the ceiling on the third floor and the attic of the shophouse was extinguished with three water jets at about 1.15pm. A Combined Platform Ladder was also deployed to conduct aerial firefighting, said SCDF.“Two career firefighters were conducting firefighting operations on the third floor when segments of the ceiling fell onto them. Both firefighters, who were in full personal protective equipment including helmets, were immediately evacuated,” said SCDF.The two firefighters were assessed by an SCDF paramedic. One was conscious when taken to Singapore General Hospital while the other was treated at the site for minor scratches.Another firefighter, a full-time national serviceman, experienced heat exhaustion and was also taken to Singapore General Hospital.The shophouse occupants had “self-evacuated” prior to SCDF’s arrival while about 20 other occupants from the neighbouring units were evacuated by SCDF as a precautionary measure.SCDF said damping down operations are ongoing. Damping down refers to the application of water to wet burnt surfaces immediately after a fire is put out in order to prevent any potential rekindle of fire from the hot burnt surfaces.The cause of the fire is under investigation.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Singapore Civil Defence Force,fire", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/2-scdf-firefighters-hospital-outram-shophouse-fire-teo-hong-road-15018584", "Source": "google"}