{"Type": "", "Time": "2021-06-15", "Headline": "PM Muhyiddin unveils Malaysia's post-pandemic exit plan, SE Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.KUALA LUMPUR - Prime Minister Muhyiddin Yassin on Tuesday (June 15) unveiled a four-phase, post-pandemic exit plan for Malaysia, on the eve of a crucial meeting among the country's monarchs that could decide on his political future.Tan Sri Muhyiddin, in a televised address, unveiled the National Recovery Plan, which projects that Malaysia from September might gradually open up its economy, social sectors and also Parliament.The federal Parliament and the 13 state legislatures have not sat this year.\"We cannot continue like this. We need to exit this crisis as soon as possible,\" Mr Muhyiddin told Malaysians, indicating that the current lockdown is costing the government RM1 billion (S$320 million) a day.Mr Muhyiddin said that much of the country's economy is expected to reopen by the end of October, based on current projections.The country is undergoing its third nationwide lockdown to tame the latest Covid-19 surge.Mr Muhyiddin described the current lockdown as the first phase of the exit plan, and outlined several factors that would allow the country to move on to a more relaxed phase. The second phase, where Covid-19 curbs will be slightly relaxed while retaining social sector and travel bans, will start once Malaysia's daily new infections dip below 4,000 cases, and also after 10 per cent of the population has been fully inoculated. This is expected to take place in July and August.The third phase, earmarked for the beginning of September, will see most sectors of the economy allowed to open by default, while some curbs on social sectors remain. For this, daily cases have to dip below 2,000 a day and 40 per cent of the population has to be fully vaccinated. A full reopening is projected from November onwards, once 60 per cent of the population has been fully vaccinated and daily cases dip below 500 a day, he said.\"The continuous lockdowns have badly affected our livelihoods. Now, we can begin to see the light at the end of the tunnel,\" Mr Muhyiddin said, while expressing his confidence that the exit plan would succeed when matched with the pace of vaccinations. Malaysia has been struggling to bring down its Covid-19 infections this year, with daily cases hitting a record 9,020 on May 29.Daily infections have gone below 1,000 a day only once this year, at 941 cases on March 29.Mr Muhyiddin's address to the nation came hours after he had an audience with Malaysia's King, Sultan Abdullah Ahmad Shah.Sultan Abdullah will meet the eight other Malaysian monarchs in a special Conference of Rulers meeting on Wednesday at 2.30pm that is expected to discuss the handling of the Covid-19 crisis by the Muhyiddin administration.Also expected to be discussed is the national state of emergency that is supposed to end on Aug 1.Mr Muhyiddin in January gained the King's consent to declare a state of emergency that suspended Parliament and state legislatures, and also postponed several by-elections, to allow the government to focus its efforts in battling the pandemic.But Covid-19 cases have only worsened during the emergency, with Malaysia imposing movement curbs for the third time last month, which was also the deadliest month since the pandemic began in January last year.\nMalaysia reimposed movement curbs for the third time last month. PHOTO: REUTERS\nMr Muhyiddin imposed a total lockdown nationwide from June 1, and it has now been extended to last until June 28. He said on Tuesday that the total lockdown had helped Malaysia \"avoid a catastrophe\".Malaysia recorded 5,419 new infections on Tuesday, bringing total infections to 667,876.The country is accelerating its vaccinations. On Monday, Malaysia registered its highest vaccination rate to date, administering 197,963 doses in one day.The country has now given at least one dose of the vaccine to 10 per cent of its 33 million population, while 59 per cent of its adult population have registered to receive Covid-19 vaccines.Malaysia's Drug Control Authority (DCA) on Tuesday approved two single-dose vaccines, China's CanSino and the United States' Johnson & Johnson vaccine.Malaysia currently uses three two-dose vaccines, namely Pfizer-BioNTech, Sinovac and AstraZeneca.The DCA on Tuesday also approved the use of the Pfizer-BioNTech vaccine for those aged 12 years old and above.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/se-asia/pm-muhyiddin-unveils-malaysias-post-pandemic-exit-plan", "Source": "google"}