{"Type": "", "Time": "2021-06-15", "Headline": "Winners and Losers of the Work-From-Home Revolution - The Atlantic", "Text": "High-income workers at highly profitable companies will benefit greatly. Downtown landlords won’t.About the author: Derek Thompson is a staff writer at The Atlantic, where he writes about economics, technology, and the media. He is the author of Hit Makers and the host of the podcast Crazy/Genius. This year, two international teams of economists published papers that offer very different impressions of the future of remote work.The first team looked at an unnamed Asian tech company that went remote during the pandemic. Just about everything that could go wrong did go wrong. Working hours went up while productivity plummeted. Uninterrupted work time cratered and mentorship evaporated. Naturally, workers with children at home were the worst off.The second team surveyed more than 30,000 Americans over the past few months and found that workers were overwhelmingly satisfied with their work-from-home experience. Most people said it exceeded their expectations. “Employees will enjoy large benefits from greater remote work” after the pandemic, the paper’s authors predicted. They said that productivity would surge in the post-pandemic economy, “due to re-optimized working arrangements” at some of the economy’s most successful white-collar companies.Read: There’s a perfect number of days to work from home, and it’s 2Put it together, and it’s a bit of a muddle. Remote work might crush productivity, but it will also lead to a productivity boom? It obliterates focus and extends working hours, but people want more of it? It hampers the sort of teamwork that is essential at knowledge-economy companies, but those same companies say they’re going to make it a permanent feature?This complexity makes more sense if we think of WFH as an invention that helps some people more than others. The remote-work revolution might be, as I’ve argued before, a good thing overall. But it will produce winners and losers. Let’s consider a few.Winners: High-income workers at highly profitable companiesIn the past year, no group has been more pleased with working from home than high-income men in their 30s and 40s, according to the survey of 30,000 U.S. workers. And highly profitable companies are more likely to say they are planning to make WFH a central part of their business. The most likely immediate winners of the remote-work revolution, then, are those who, in an economic sense, are already winning.“Ground zero for who stands to benefit from WFH in the near future is something like a 45-year-old software engineer who used to work in central Manhattan but now they can do the same work, for the same salary, from their living room in the suburbs,” says Nicholas Bloom, a Stanford professor and co-author of the paper that included these surveys.At least in the short term, Bloom told me, one should expect to see profitable companies such as Google, Apple, and Facebook loudly celebrate hybrid or WFH policies, while less opulent companies urge their workers to come back to the office.Winners: Work introverts and people who enjoy (or are good at) using online communication tools For extroverts, the office can be an ideal place for getting things done with just the right amount of spontaneous interruption. But for more introverted types, the office can be a quagmire of forced proximity, unwelcome noise, and the looming threat of unwanted small talk with that one colleague you absolutely dread. For this latter group, WFH lowers the anxiety temperature of the workday.Offices don’t benefit just extroverts; they also reward anybody with a talent for talking with people in person. In an office, workers can prove their value by bantering with their bosses, or delivering sparkling presentations in crowded conference rooms in the presence of managers. These occupational advantages somewhat (if not entirely) melt away online, where other skills are prized—such as quickly responding to emails, being a clear and fast writer, understanding how to share a presentation on Zoom, or having the right mix of irony, brevity, and charm in your Slack messages.The distributed office is not a placeless space. A Zoom call is a place; a Slack channel is a place; your manager’s inbox is a place. These are all “rooms” in which bosses can evaluate worker performance. It’s a fact of human diversity that different people thrive in different spaces, so we should expect that the virtual spaces of remote work will reward certain skills that went underappreciated in office settings.Losers: Entry-level workers in less established positionsIf the pre-pandemic office was like a fine-dining experience—a large group enters, sits down together, and leaves several hours later—the post-pandemic office may be more like a neighborhood café. People will come and go, you’ll recognize some of them but feel estranged from others, and the office might convey a sense of both vague belonging and day-to-day transience. That’s not an ideal environment for new workers to feel welcomed into a community of peers. “Deprived of desk neighbors, impromptu coffees, and any real way to, for a lack of a better term, read everyone’s vibe,” my colleague Amanda Mull wrote last year, “new hires and young people who work remotely risk remaining unknown quantities.”Losers: Downtown landlords and businessesYou don’t have to believe in the death of the city to see how remote and hybrid work will shake up urban businesses. Hybrid work entails less commuting, and less commuting means fewer consumers in urban cores. Bloom and his co-authors estimated that the post-pandemic shift to WFH will durably slash spending in downtown restaurants, movie theaters, barbershops, and other retailers by up to 10 percent compared with pre-pandemic spending. As commuting declines, public-transit authorities should also expect lasting hits to revenue.Read: What bosses really think of remote workers“Econ 101 tells you that the input that cannot move is what will get hit the hardest,” Bloom said. “Moving is easier for workers than for businesses. But you know what really can’t move? Skyscrapers. The implications for commercial real estate could be very interesting.” Downtown office vacancies have surged across the country, and even in the optimistic scenario that 90 percent of white-collar workers return to the office three days a week, that’s still a nearly 50 percent decline in commuting and office use.Winners: Suburban-town-center developersThe money that’s not going to downtown commutes, offices, and barbershops won’t disappear into the ether. A lot of it will just move to the suburbs. Bloom calls this the “donut effect,” as economic activity vacates city centers and plumps up suburban rings.If white-collar workers, especially Millennials, transfer their time and money to the suburbs, they’ll take their aesthetic with them. A lot of at-home workers don’t dislike urban life; they just want to buy space at a cheaper price per square foot. All those exposed-brick coffee shops, dark-wood cocktail bars, boutique gyms, and everything-fusion restaurants that have been features of the 21st-century city may well become ubiquitous features of 21st-century suburban town centers.Read: Generation work-from-home may never recoverFor years, urban developers have been talking about “15-minute cities”—accessible downtown neighborhoods where residents can satisfy just about every food, drink, beauty, entertainment, and fitness need with a short walk or bike ride. Logically, as more 30-somethings relocate to the suburbs, real-estate developers will chase their needs by pouring money into a constellation of 15-minute suburban town centers. The downtown office building’s loss will be the suburban developer’s gain.Winner: the how-to-WFH economyRemote and hybrid work will create new problems for workers and employers; and workers and employers will pay lots of money to solve those problems.It’s already happening. According to Bloom, the average worker invested “15 hours of time and $561 in home equipment to facilitate WFH” last year. That’s an astonishing number—amounting to close to 1 percent of annual GDP spent on WFH amenities. And that figure doesn’t even account for all the money companies spent on telecommunications, back-end systems, and other tech to support WFH.We are very likely in the early innings of a technology revolution in the WFH space. The share of new U.S. patent applications related to WFH technologies “more than doubled from January to September 2020,” according to Bloom’s research. Every year, we’re going to get new advances in video communications that make Zoom calls feel more like sharing a physical space. Meanwhile, the market for WFH consultants is going to explode as more remote companies navigate the challenges of efficiency and equity. Precisely because remote and hybrid work will be so challenging, we can expect the rise of a huge sector devoted to solving their numerous problems.Loser: Political comityCollege is already the most important dividing line in politics. It’s also the most important dividing line in remote work. More than half of graduate-degree earners can work from home, compared with less than 25 percent of people with just a high-school degree, according to Bloom. The remote-work revolution, therefore, is principally a revolution for the colleged class, which is disproportionately a Democratic cohort.If the college-graduate workforce evolves toward a certain kind of work that is off-limits to most noncollege grads, the cultural divide between graduates and nongraduates may widen even further, pulling apart a country that is already split by a diploma gap. In 2004, the journalist Bill Bishop coined the term the big sort to describe how Americans moving into like-minded communities were driving political polarization. I've recently been wondering what that might look like online. Well, it might look like white-collar workers migrating to remote work; in perpetual contact with virtual networks of similar workers, they will create a set of online norms and attitudes that pulls them even further away from the rest of the country.Even as remote work makes far-flung colleagues feel closer, then, it could widen the gap between college and noncollege Americans, who are already rapidly sorting into the two major parties.", "Section": "", "Writers": "", "URL": "https://www.theatlantic.com/ideas/archive/2021/06/winners-losers-work-home-remote/619181/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}