{"Type": "", "Time": "2021-06-15", "Headline": "Singapore's home sales fall after Covid-19 restrictions return | The Edge Markets", "Text": "Ways to search theedgemarkets.com contentby Title: @title \"the edge malaysia\"by Author: @author \"lucas wong”by category: @category \"corporate\" \"hot stock” Combine search:  \"high speed rail\" @author \"Bhattacharjee\" @category \"From the Edge\"Searching either words : 1MDB MAS Searching all words : “Genting Berhad”Searching Chinese phrase : “马电讯”(June 15): Singapore home sales fell in May after the government tightened pandemic restrictions.Purchases of new private units declined about 30% to 891 last month from 1,268 in April, Urban Redevelopment Authority figures showed on Tuesday.The drop came amid a Covid-19 outbreak that led authorities to reimpose social distancing measures. While homebuyers have still been able to view apartments, the capacity was reduced from five to two people per group. Sales may pick up again as the government is set to ease restrictions this week following a reduction in local cases.Singapore’s residential property market has been a bright spot for the economy. Before May, monthly sales hovered above 1,200 amid a frenzy that has seen record-breaking prices of private and public homes. Strong demand and rising prices have also fueled talks that the government may impose measures to cool the market.Private home sales may get a boost as residents of public apartments look to upgrade to condominiums, said Christine Sun, senior vice president of research and analytics at OrangeTee & Tie.Residential transactions could remain relatively robust before the government rolls out any new curbs to tighten the market, Bloomberg Intelligence analysts Patrick Wong and Diksha Gera wrote in a report. That’s because buyers may find it more difficult to acquire homes when stamp duties and mortgage hurdles are raised, they said.“The city’s latest partial lockdown could slow its economy, and the government may need to strike a balance between nurturing a recovery and avoiding hitting the brakes too hard on its housing market,” the analysts said.We deliver news to your inbox daily© All rights reserved. 2020. The Edge Communications Sdn. Bhd.  ", "Section": "", "Writers": "", "URL": "https://www.theedgemarkets.com/article/singapores-home-sales-fall-after-covid19-restrictions-return", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}