{"Type": "", "Time": "2021-06-15", "Headline": "Some employers plan to make hybrid work arrangement permanent; office spaces still in demand, Business News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - Some employers plan to make hybrid work arrangements permanent even when Covid-19 restrictions are eased in the future, but this has not led to a spike in office space vacancies.Several major office building owners and co-working spaces said they are continuing to see healthy demand, with little to no drop in occupancy rates.Working from home will remain the default in the coming weeks, even as Singapore gradually loosens Covid-19 curbs that were imposed last month.At the Covid-19 multi-ministry task force press conference on June 10, Minister for Trade and Industry Gan Kim Yong urged employers to exercise flexibility in their employees' work arrangements, even if work from home no longer remains the default.Mr Kong Wan Long, co-founder and chief commercial officer of co-working space JustCo, said the recent Covid-19 curbs did not affect its business as the measures were understood to be temporary.\"Work from home cannot be the permanent solution. Our customers value co-working's flexible model, which is precisely what businesses need in today's volatile environment,\" he said, noting that occupancy rates across its 17 centres are approximately 80 per cent to 90 per cent. Three more centres are opening soon.A spokesman for co-working space WeWork said it is set to launch an on-demand service at the end of this month, which will allow individuals to book workspaces or conference rooms by the hour or the day.There is also demand for office buildings located in the Central Business District (CBD).CapitaLand Integrated Commercial Trust said its office buildings registered an occupancy rate of 94.8 per cent as at March 31, in its first-quarter report released in April.It owns several buildings in the CBD. Of these, Capital Tower, CapitaGreen and Asia Square Tower offer flexible spaces to tenants.A Keppel Reit spokesman said its average office rent in Singapore in the first quarter of this year was $10.64 per sq ft per month (psf pm), which was above the average expiring rents for both this year and the next.The occupancy rate in its office buildings in Singapore, Australia and South Korea is around 96.5 per cent, with an average lease of 6.7 years, he said. These include Marina Bay Financial Centre and One Raffles Quay.The shift towards adopting a hybrid working model is evident even in companies where some staff are unable to work from home.Six companies that The Straits Times spoke to said many of their employees have indicated a preference for a flexible working policy.In a survey last September, nine in 10 staff across technology company Cisco's Asia-Pacific offices said that they favoured a combination of office-based and remote work.Cisco Singapore managing director Andy Lee said: \"Over the past year, employees have grown accustomed to and even prefer a hybrid model. They appreciate the flexibility that working from home offers, although some do miss face-to-face interactions and the informal chats that happen in an office setting.\"Around 90 per cent of the company's 1,000 Singapore-based workforce is currently working from home.At DBS Bank, a spokesman said that a hybrid working model has been made permanent, with all employees given the flexibility to work remotely up to 40 per cent of the time.In April, the bank announced its plans to cut its office space across its markets by 20 per cent in the next four to five years.Other companies interviewed are holding on to office spaces, as many say they see value in having a physical space for staff to meet to foster closer bonds and better collaboration.Mr Lee Chee Meng, co-chief operating officer of on-demand delivery platform Pickupp Singapore, said the company was previously operating out of a co-working space, but moved to a bigger office as it had expanded its headcount by 30 per cent since last year.The majority of its office-based staff is now working from home, and weekly virtual meetings and regular team building activities on video calls have helped to maintain good team rapport, Mr Lee said.At medical technology firm Siemens Healthineers, around 35 per cent of its 250 employees have to work on-site, while the rest can work from home.Before working from home was the default, staff who wished to return to the office could pre-book their workspaces via an app, said the company's head of human resources in South-east Asia Alex Mersch.He said: \"Our employees have the choice to work in a flexible manner in a conducive environment of their choice, even after the pandemic.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/business/some-employers-plan-to-make-hybrid-work-arrangement-permanent-office-spaces-still-in-demand", "Source": "google"}