{"Type": "", "Time": "2021-06-15", "Headline": "Shop owner posts on Facebook to get thief to return $800, Singapore News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.When spice shop owner Jeya Seelan saw security camera footage of a man stealing $800 from the till, he decided that he was not going to tarnish the culprit's reputation.That is why he used a blurry photo that obscured the man's face when he posted on his Facebook account asking the thief to return the money, even though he was upset and angry.In a phone interview with The Straits Times, Mr Jeya said: \"It was just heartbreaking and shocking. If you think about all the hard work that went into earning that money, and one guy suddenly comes in to steal it in a flash, it's devastating.\"Mr Jeya also opted not to make a police report for the same reason - to avoid harming the man's reputation. The decision was not a popular one.He said: \"I was under a lot of pressure. Many people, including my wife, said making a police report was the right thing to do. People on Facebook asked me to report him as well. They said a leopard can never change its spots.\"But times are tough for everybody, and some people could have lost their jobs. Everyone is fighting their own battles.\"Mr Jeya, 31, is the owner of Jeya Spices at Block 294, Yishun Street 22. He also has a stall at the FairPrice Xtra supermarket in Parkway Parade.The theft took place at the Yishun shop at about noon on June 3. At the time, two of Mr Jeya's employees were looking after the shop while he was away on course.One of them had gone to the toilet and the other was attending to a customer. That was when a man walked by and swiped about $800 from a plastic box where the money was kept.This is not the first time someone has stolen money from the shop till.About three years ago, a man who worked part-time at the shop stole about $40. Since it was a small sum, Mr Jeya let the matter go, but he installed a closed-circuit television camera.The shop sells custom-made spice blends and condiments, and Mr Jeya said he started working there in 2014 - two months after graduating from Nanyang Technological University's Wee Kim Wee School of Communication and Information.He was initially indifferent to joining the business, which was started by Mr Jeya's grandfather 60 years ago. When his father asked him if he wanted to work there, he said yes.\"I was just sitting idle at home so I thought, why not give it a go?\"The first two days of work were tough, he said, but soon, he was hooked.He was drawn in particular to custom-blended spices, which are slowly falling out of favour. Mr Jeya is keen to revive their popularity.Mr Jeya, who has no children, lives in Ang Mo Kio with his wife, who works as a relationship manager in Standard Chartered Bank.Yishun is close to Mr Jeya's heart, and he thinks of his customers there as family. That was one reason he was not keen to go to the police when he discovered the theft, choosing instead to rely on Facebook to get the thief to return the money.He said: \"Yishun is a close-knit community where everybody knows each other. A lot of my friends and customers in the neighbourhood helped by sharing the Facebook post. They were also angry and gave me emotional support.\"The day after the theft, on June 4, a friend of the man who took the money sent Mr Jeya a text message at about 6pm. The next day, he came with the thief to return the money.Mr Jeya said: \"We like to say 'bila bila Yishun', which means 'Yishun forever' in Malay. We have a spirit of helping one another. People say the kampung spirit is dying but I don't believe that's true.\"Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/shop-owner-posts-on-facebook-to-get-thief-to-return-800", "Source": "google"}