{"Type": "", "Time": "2021-06-15", "Headline": "Opinion | Biden should use his summit with Putin to demand freedom for Russian political prisoners. - The Washington Post", "Text": "As President Biden prepares for his first summit with Russian leader Vladimir Putin in Geneva, he is emphasizing an issue that has too often taken a back seat in U.S.-Russia relations: human rights. “When we meet, I will again underscore the commitment of the United States, Europe and like-minded democracies to stand up for human rights and dignity,” Biden wrote in The Post.Concern over human rights is not a political whim, a publicity stunt or an exercise in charity. It is a fundamental aspect of international relations, inextricably linked to both economic development and security issues, as has been recognized by world powers ever since the Helsinki process nearly five decades ago. One of the main principles of the Organization for Security and Cooperation in Europe, to which both the U.S. and Russia belong as founding members, holds that “issues relating to human rights, fundamental freedoms, democracy and the rule of law are of international concern … and do not belong exclusively to the internal affairs of the State.” The agreement affirming this position was signed, of all places, in Moscow.It’s difficult to know where to start the conversation with Putin on human rights. Elections have been reduced to prearranged rituals without real competition. Freedom of the media has been stifled as major news outlets were closed or fell under state control. Peaceful demonstrators are routinely beaten and arrested. Recently passed — and vigorously enforced — laws have criminalized political opposition as “extremist” or “undesirable.” State-sponsored assassins operate with impunity, be it with poison (as in the case of anticorruption campaigner Alexei Navalny or the author of this article) or with bullets (as with the murder of Putin’s leading opponent Boris Nemtsov).All these issues should, and hopefully will, be raised by Biden in Geneva — no doubt, without much progress on any of them. But there is one item on the long list of Putin’s human rights abuses where Biden can actually expect a result — as shown by past American presidents in their own meetings with Kremlin leaders.One such meeting took place just seven miles from where Biden will see Putin on Wednesday. In November 1985, President Ronald Reagan met Soviet leader Mikhail Gorbachev in the Fleur d’Eau villa in the Genevan suburb of Versoix. At the top of the agenda were arms control and missile defense — but, as Reagan made clear to Gorbachev before the summit, progress on other issues would depend on addressing human rights violations in the Soviet Union.Chief among these was the issue of political prisoners — who numbered in the hundreds, as the Soviet government would admit just a year later. At his talks with Gorbachev in Geneva, Reagan personally intervened on behalf of three: Andrei Sakharov, the Nobel Prize-winning dissident and physicist confined to internal exile in Gorky; Yuri Orlov, a fellow physicist and founder of the Moscow Helsinki Group sent into exile in eastern Siberia after serving time in a labor camp; and Anatoly (Natan) Sharansky, a human rights activist and Jewish refusenik convicted of “treason.” Pressed personally, Gorbachev promised to examine the cases.All three were freed within just over a year. Sharansky was first, exchanged for captured Eastern Bloc agents on Berlin’s “bridge of spies” in February 1986. Then came Orlov, whose release Reagan made a condition for attending his next summit with Gorbachev in Reykjavik in October 1986 — a condition accepted by the Soviet Politburo. Finally, in December 1986, Sakharov was allowed to leave his place of exile and return to Moscow. In securing their freedom, personal advocacy from the American president was helped by the winds of change that were sweeping the Soviet Union at home.Reagan’s commitment to the issue built on the long-standing and noble tradition of U.S. presidents helping free Soviet prisoners of conscience, even at times of bilateral animosity. Among those who owed their freedom to such advocacy were Red Square protester Vladimir Dremlyuga (whose release was requested by President Richard M. Nixon in the run-up to his 1974 meeting with Leonid Brezhnev); prominent dissident Vladimir Bukovsky (whose dramatic 1976 exchange at Zurich airport was negotiated by President Gerald Ford); and samizdat publisher Alexander Ginzburg (whose release, along with others, was arranged by President Jimmy Carter before his own summit with Brezhnev).Today Russia has nearly 400 political and religious prisoners — a conservative estimate by human rights groups in line with the international definition of the term. They include Navalny, jailed on his return to Russia in January; Andrei Pivovarov, an opposition activist arrested last month onboard a Polish passenger plane; Alexei Pichugin, Russia’s longest-serving political prisoner and the last hostage of the “Yukos Affair”; and Yuri Dmitriev, a historian persecuted for documenting Soviet-era mass executions.Biden is unlikely to return from Geneva with any substantive agreements. But, just as his predecessors, he can make real change for those unjustly imprisoned by the Kremlin with his personal advocacy. “Giving freedom to a human being is a gift of great wonderment,” Secretary of State George Shultz wrote to Reagan after he negotiated for a group of religious dissenters to leave the Soviet Union in 1983. This gift is now within Biden’s power.Read more:Joe Biden: My trip to Europe is about America rallying the world’s democraciesJim Risch: Biden wants Russia’s cooperation. But Putin thrives on chaos.Jennifer Rubin: No, Biden’s summit with Putin doesn’t make the U.S. look ‘weak’Perry Bacon Jr.: We should rethink how we think about Vice President HarrisFred Hiatt: This is the Republicans’ back-up plan in case they can’t suppress enough votesAlexandra Petri: Why have a Swiss Army knife when you could just buy an AR-15?The most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/opinions/2021/06/14/biden-putin-free-russian-political-prisoners/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}