{"Type": "Asia", "Time": "2021-06-15", "Headline": "Former head of Myanmar's COVID-19 vaccination programme arrested", "Text": "The former head of Myanmar's COVID-19 immunisation programme has been arrested and faces charges of high treason for colluding with opponents of the military authorities, state media reported on Monday (Jun 14).Myanmar's healthcare system and coronavirus prevention measures have collapsed since the army seized power on Feb 1 and overthrew elected leader Aung San Suu Kyi, whose government had successfully stopped two waves of the virus.On Sunday, reported cases surged to their highest since shortly after the coup.Doctors and other medical workers have been at the forefront of a Civil Disobedience Movement (CDM), leading strikes that have paralysed official and private business. Dozens have been arrested and hundreds more are wanted.The Global New Light of Myanmar said Htar Htar Lin had been arrested on Jun 10 and she was also accused of working with an underground National Unity Government (NUG).\"According to her confession, she not only joined the CDM and formed the CDM Core Group together with other CDM doctors and staff but also colluded with terrorist NUG,\" it said.Reuters was unable to reach her or any lawyer representing her for comment.The paper said she and 11 other doctors would face charges that included high treason, incitement and colluding with an illegal organisation.The junta has branded the NUG set up by supporters of Suu Kyi and other opponents of military rule as a terrorist group.The arrest of Htar Htar Lin and other doctors was condemned by US-based Physicians for Human Rights.\"Dr Htar Htar Lin’s arbitrary arrest is yet another sign that the military junta will stop at nothing in its war against Myanmar’s health workers,\" said Jennifer Leigh, an epidemiologist serving as the group's Myanmar Researcher.The 373 new cases of COVID-19 reported on Sunday was the highest since Feb 3, just before testing collapsed in the wake of the coup.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,Myanmar,coup,junta", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/former-head-of-myanmar-s-covid-19-vaccination-programme-arrested-15011074", "Source": "google"}