{"Type": "", "Time": "2021-06-15", "Headline": "Man, 26, posed as 'sugar mummy' to lure teen boy for sex", "Text": "SINGAPORE — A 17-year-old boy who wanted to find himself a sugar mummy after being kicked out by his mother, was preyed upon by a 26-year-old man instead.The victim had put up an advertisement on platform Locanto expecting elder women to reply.He instead received a reply from Muhammad AL-Masfuiin Mushin, who pretended to be a woman to lure the victim to his flat.AL-Masfuiin, a Singaporean, was jailed for 10 months on Monday (14 June), after he pleaded guilty to one count of obtaining the sexual service of a minor under 18The victim cannot be named due to a gag order protecting his identity.On 16 June 2019, the teen got into a heated argument with his mother and was kicked out of the house. In need of money, he placed an advertisement on Locanto, which he had downloaded two years ago in order to earn money by providing sexual services.The advertisement was titled \"Toyboy Fantasy Satisfies you- 18”, and stated that he was looking for a “sugar mummy” who could pay him in return for sexual services. He included his mobile phone number and two photographs of himself.The next day, AL-Masfuiin saw the advertisement and decided to chat up the victim while posing as a woman. He told the boy, “I’m looking for a young boy to be my sex slave” and asked the victim for his photographs and body statistics.When the victim asked if he was male or female, AL-Masfuiin said she was female. The victim told him that he was 17 years old and in need of money as he had been chased out of his house.As a “woman”, AL-Masfuiin asked the victim for a threesome with “her” and “her boyfriend”, even though there would be no female involved. The victim agreed and asked for $250 per meet up.At about 10.38pm that day, the victim messaged AL-Masfuiin to ask if they were able to meet up. AL-Masfuiin was aware that the victim had no place to stay.He told the victim that he could stay at “her boyfriend’s place” and that “he’ll send a Grab to let you stay over”. AL-Masfuiin texted that he also expected the boy to service “her boyfriend”.AL-Masfuiin then arranged transport for the victim. At about 1am on 18 June 2019, AL-Masfuiin sent a Grab to the victim, who asked AL-Masfuiin if “she” was joining the sex session. AL-Masfuiin replied “she might not” but that her “boyfriend will tell me if you did a great job at sex”.When the victim asked if the boyfriend knew his age, AL-Masfuiin replied “yes” and “I like my boys young”.After the victim arrived at AL-Masfuiin’s apartment, AL-Masfuiin told him to take a shower while he sat on the sofa bed in the living room masturbating himself. The two engaged in sexual acts, with AL-Masfuiin overpowering the boy when the latter resisted. After the incident, the boy went to sleep.He woke at about 8.30am and asked AL-Masfuiin for money to go to work. AL-Masfuiin took out a $50 note from his wallet and handed it to the victim before the two parted ways.According to court documents, a police officer performing foot patrol came across the victim on 18 June 2019 at Toa Payoh Central. During the course of investigations, the officer discovered messages relating to him providing sexual services, in his phone. AL-Masfuiin was arrested afterwards. Commercial sex with a minor under 18 carries a jail term of up to seven years, with fine, or both. Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:Singapore reports 13 new COVID-19 cases, 10 from the communityCOVID: Social gathering size can increase to 5 per group from 14 June – MTFCOVID: Dine-in at F&B places can resume at max 5 per group from 21 JuneWork-from-home remains default arrangement in Singapore's Phase 3 (HA)4 COVID ART test kits on sale at 3 Singapore pharmacies from 16 June: MTFAn ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.LastPass Protects Every Access Point Through An All-In-One Single Sign-On, Password Management and MFA Solution.Here are three growing businesses that should be cheap enough to add to your investment watchlist. The post 3 Undervalued Gems That You Can Add to Your Watchlist appeared first on The Smart Investor.The Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.Malaysia on Sunday deported a leading figure in conspiracy circles who is wanted in France over the kidnapping of an eight-year-old girl, sources told AFP.Search for private jet membership. The affordable price makes these private jet offers hard to resistAn American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.There’s a reason it’s called Texas tea: 20 of the Lone Star State’s billionaires have fortunes rooted in oil, gas or pipelines.With its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.Spain opened their Euro 2020 campaign with a goalless draw against Sweden in Seville on Monday after their preparations were badly affected by Covid-19, while Patrik Schick scored one of the championship's great goals in the Czech Republic's 2-0 win over Scotland.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.This new car cloth can easily remove all the car scratches and dents from your car.The Philippines will extend a key military pact with the United States for another six months, its foreign minister said Monday, after months-long negotiations between the two countries.Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.Major US indices finished at fresh records Monday as global equity markets began the week cautiously ahead of a much-anticipated Federal Reserve meeting.See why these gadgets are selling out quickly.An American father-son duo accused of orchestrating former Nissan chief Carlos Ghosn's audacious escape from Japan admitted their role Monday as they made their first appearance before a Tokyo court.The death toll from a gas blast that ripped through a residential compound in central China has risen to 25, Beijing's state media reported Monday, as authorities continued a desperate rescue operation.Ukrainian leader Volodymyr Zelensky Monday said US President Joe Biden should have met him before his high-profile summit with Russia's Vladimir Putin as they could resolve nothing on Ukraine without Kiev at the table.Diabetes indicators may be more subtle than you think. Take a look at diabetes warning signs and symptoms.When you want protection that goes beyond just covering your medical costs, critical illness insurance is the logical choice. But with so many options out there, which ones are best for you? We investigate in this article. In a nutshell, critical illness insurance is insurance […] The post Best Critical Illness Insurance Plans In Singapore (2021) appeared first on SingSaver Blog - We Compare, You Save.Two strategies to consider when making investment decisions. The post Getting Started: What is Averaging Up and Averaging Down appeared first on The Smart Investor.Myanmar's ambassador to the United Nations, who has refused to leave his post despite being fired after the February coup, has called for \"effective collective measures\" against the junta, ahead of expected Security Council talks on the situation.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/singaporean-man-26-posed-sugar-mummy-lure-teen-boy-sex-035110137.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}