{"Type": "", "Time": "2021-06-15", "Headline": "Opinion | The U.S. Enables Corporate Tax Avoiders. Can Biden Fix It? - The New York Times", "Text": "AdvertisementSupported byBinyamin AppelbaumBy Binyamin AppelbaumMr. Appelbaum is a member of the editorial board.The decline of corporate taxation in recent decades is generally blamed on pirate states like Luxembourg, Ireland and Bermuda, which offer an alluring combination of very low tax rates and an unembarrassed enthusiasm for allowing companies to play make-believe.But the pirates have a silent partner: the United States.Generations of American policymakers haven’t shown much interest in collecting money from corporations. Regarding corporate taxation as politically necessary but economically suspect, they have responded to tax evasion by making disapproving noises. They have allowed companies to pretend profits are earned in low-tax countries and then cited the loss of tax revenue as the justification for tax cuts. Little wonder the United States collects a smaller share of tax revenue from corporations than any other major economy does.The Biden administration has put forward a plausible plan to break with this pattern and make companies pay more taxes by raising domestic rates and penalizing firms that shift profits to tax havens. It has won the support of other leading economies for an international minimum corporate tax rate. But a familiar obstacle, Congress, stands in the way.The anti-tax radicals in the Republican Party oppose any plan to collect more money from corporations — even money otherwise paid to foreign governments — and an international agreement could require the support of two-thirds of the Senate. The Biden administration could achieve many of its goals without a deal by legislating changes to U.S. tax law. But there’s a lack of enthusiasm among some Senate Democrats, too. Rumblings of discontent already have prompted the White House to pare its plans.The basic case for more corporate taxation is that the government needs the money. The Biden administration plans to use it to rebuild bridges, replace water pipes and increase renewable energy output. Some economists argue higher taxes will slow economic growth, but decades of cutting corporate taxes haven’t exactly produced the promised economic miracles. Even if there is a price, taking money from the rich for the benefit of the many can still be sound policy. The distribution of prosperity matters, as well.The work has to begin at home. The focus on foreign tax havens has obscured the extent to which the United States has become a tax haven for U.S. companies. The statutory tax rate is 21 percent. But American multinationals paid just 7.8 percent of domestic profits in taxes in 2018, according to the congressional Joint Committee on Taxation. While those companies made liberal use of foreign tax havens, too, the total tax rate on their foreign profits was actually a little higher than the tax rate on their domestic profits.The Biden administration has proposed raising the domestic rate to 28 percent and imposing a 21 percent tax rate on profits reported in foreign countries.It is also seeking an international agreement on a 15 percent minimum corporate tax rate. Firms would pay at least that much, irrespective of where they operated or claimed to operate. They would get credit for taxes paid in foreign countries, but if they paid less than 15 percent of profits, the home country would collect the difference.Such a deal would limit the competitive disadvantage of American companies. Janet Yellen, the Treasury secretary, who is leading the negotiations, argues that it would also benefit the global economy by ending tax-rate bidding wars and encouraging countries to compete instead by educating workers and investing in infrastructure.Some pirate states, notably Ireland, have vocally protested, arguing that they use low tax rates to promote legitimate economic development. For Ireland, this is a half-truth. For even smaller tax havens, it’s pure nonsense. Companies that book profits on the Isle of Jersey are playing the same game as freighters that fly the flag of Liberia.Multinationals book about 25 percent of profits in tax havens where, on average, they have 11 percent of assets and 5 percent of their employees, according to the Organization for Economic Cooperation and Development.Ireland’s position is understandable but unacceptable and ultimately not much of an obstacle. If the major economies agree to adopt the American scheme, Ireland can keep on pretending that it’s a major center of corporate activity, but corporations will still have to pay their bills back home. Ireland would lose most of its utility as a tax haven.The U.S. wants a deal for another reason, too. Countries have generally sought to limit tax conflicts by agreeing that corporations should pay taxes in the countries where they create value. But that principle has been strained by the rise of American technology firms like Facebook and Google that make money in countries where they have little or no physical footprint. European countries are moving to tax those firms, arguing that, for example, Google is not just delivering a service to its users in France but also acquiring valuable information from French users. As part of the broader deal, the United States is offering to let those countries tax a portion of the tech companies’ profits in exchange for dropping the new taxes.Excitement about the prospect of an international agreement should be taken with a grain of history. Just a few decades ago, the average corporate tax rate in the developed world was almost 50 percent. Corporations and anti-tax ideologues have taken advantage of globalization to achieve a shift that is likely to endure for the foreseeable future. A 15 percent minimum tax rate would simply arrest their progress. But that’s how change begins: You stop, you turn around, and then you start walking in the other direction.The Times is committed to publishing a diversity of letters to the editor. We’d like to hear what you think about this or any of our articles. Here are some tips. And here’s our email: letters@nytimes.com.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement", "Section": "", "Writers": "", "URL": "https://www.nytimes.com/2021/06/13/opinion/us-corporate-tax-rate-biden.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}