{"Type": "Sport", "Time": "2021-06-15", "Headline": "Football: Sterling gives England opening Euro 2020 win over Croatia", "Text": "LONDON: Raheem Sterling finally found his tournament touch when his 61st-minute goal gave England a deserved 1-0 win over Croatia at Wembley on Sunday (Jun 13) as they began a European Championship with a victory for the first time in nine attempts.Sterling, something of a surprise starter after a flat end to the domestic season but a favourite of manager Gareth Southgate, slid home after great work by Kalvin Phillips to end an individual drought that had run through England’s three previous major tournaments.\"It feels good. I grew up two minutes down the road, so I knew I had to score here, and it was a great feeling to do it,\" said the Wembley-raised forward.Southgate said he was unaware of England's previous run of opening-game failures - despite having played in one of them in 1996 - but, as expected, was not getting carried away by a solid but unexceptional display.\"It's for everybody else to get excited and throw their beer around and do whatever they want,\" he said. \"It's brilliant to give that joy to people. But for us, it's on to the next one and preparing for a really tough game on Friday (against Scotland).\"But I was really pleased with the way we settled so quickly. Big occasion, sweltering hot day, every reason to look nervous at the start, but we didn't. With and without the ball, we were composed. Although it was always going to be a game of few clear chances, we looked the bigger threat throughout.\"The game lacked the jeopardy of the teams’ 2018 World Cup semi-final, won by Croatia, and losing on Sunday was no disaster for them given the way the draw pans out, but it was a morale-boosting victory for England as they set off once again in search of their first title since 1966.PACE FLAGGEDRoared on by a noisy 22,500 crowd - a quarter of Wembley’s capacity - they started full of bright intentions and put huge pressure on the visitors.Phil Foden, his bleached hair channelling Paul Gascoigne from Euro 96, almost gave them a dream start when he cut in from the right and curled a low shot against a post.Phillips, impressive all afternoon, then had a 25-yard shot blocked but, instead of riding the early momentum, England lost their way and, with the sun beating down, the pace and energy seeped out of the game either side of the break.England eventually shook themselves out of the torpor and struck when Phillips drove through the retreating defence, rode two tackles and played the ball expertly into the path of the darting Sterling who, under pressure, just got enough on the ball to steer it home.Sterling had looked lively all day and celebrated his first major tournament goal with gusto, though he should have added a second 13 minutes later but blazed wildly over the bar.Another bright spot for England was the introduction of substitute Jude Bellingham who, at 17 years and 349 days, became the youngest player to appear in the European Championship finals.Croatia also threw on their attacking subs as they tried to show a bit more ambition but though England’s defence looked a little shaky at times there were few chances for an equalizer as, conversely to England, they lost their opening Euro match for the first time in their six tournaments.\"We didn't do enough up front and couldn't engineer our trademark fast-flowing moves, but I am optimistic that we'll improve and get it right in the next two games,\" said coach Zlatko Dalic.They are against Scotland and the Czech Republic, who meet on Monday, with Croatia playing the Czechs in Glasgow on Friday.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Euro 2020,England,Croatia", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/sport/euro-2020-sterling-gives-england-opening-win-croatia-15007068", "Source": "google"}