{"Type": "", "Time": "2021-06-15", "Headline": "Opinion | This may be Israel’s best chance at reconciliation - The Washington Post", "Text": "Israel’s Knessett voted to depose longtime prime minister Benjamin Netanyahu on Sunday, ending (for now) the Bibi era. With the inclusion of a member from the Arab Ra’am party  in the nation’s new governing coalition, the Jewish state now has an opportunity to usher in an era of reconciliation.Arab-Jewish relations in Israel have always been tense. Israel kept Arab areas under martial law from its founding in 1948 until 1966. Most Israeli Arabs are not required to serve in the Israeli Defense Forces and relatively few volunteer, although their participation rose during the pandemic. They compose roughly 21 percent of the population, but nearly all Israeli Arabs still live in nearly monolithically Arab-populated towns. They remain poorer and less-educated than Israeli Jews, even as they have equal political and legal rights.It’s no surprise, then, that Arab voters have rarely supported mainstream Jewish political parties. Arab parties have traditionally received about 80 percent of the vote from Israeli Arabs, and those parties have largely been either extreme leftists, such as the communist-backed Hadash, or been connected to Palestinian nationalism, such as Ahmad Tibi’s Ta’al. The latter is so prominent and so loathed by the Israeli right that Netanyahu’s campaign slogan in the 2020 election was “Bibi or Tibi,” a reference to how Netanyahu’s opponents would have had to likely rely on the votes of Tibi’s party in the Knesset to prevail. Those parties, needless to say, could not be part of any governing coalition.Israeli Arabs who do vote for Jewish parties also tend to vote heavily for those on the left, such as Meretz or Labor. Since there has not been a prime minister from the left since the 1999 election, this means that Israel’s Arabs have largely been politically sidelined for decades. The result is that many Israeli Arabs feel disengaged from the nation in which they live, voting at much lower rates than Jews.Israel’s Jewish politicians are no dummies, so many started to court the Arab sector in this year’s election. They knew that even a small uptick in votes could make the difference in a nation split down the middle. The most shocking volte face came from Netanyahu himself, who actively campaigned in Arab towns pledging to increase funding for Arab priorities. That effort helped him somewhat, as his Likud party’s share of the vote rose in many Arab towns. But the real winner was an Arab himself, Mansour Abbas.Abbas is the leader of the conservative Islamist Ra’am party. Ra’am is the political arm of the southern branch of that country’s Muslim Brotherhood, and its charter strongly condemns Zionism. Abbas, however, put those concerns to the side and ran on a simple platform of bread-and-butter concerns. He went into the election arguing that Israeli Arabs have a lot to gain if they deal with the Jewish majority rather than fight it. He said he was open to supporting either Netanyahu or his opponent, and focused his demands on fighting rampant crime in the Arab community, legalizing Bedouin settlements that Israel has not recognized, and increasing funding for economic development. His party surprised most observers by passing the electoral threshold and entering the Knesset, Israel’s parliament, with four seats. The results confirmed Israel’s roughly even split between pro- and anti-Netanyahu factions, making Abbas the country’s kingmaker.The 47-year-old Abbas exploited his crucial position masterfully. He went on Israeli television in April, giving a prime-time speech in Hebrew declaring that he is a “proud Arab and Muslim, [and] a citizen of the state of Israel.” He negotiated with both sides, and could have easily ended up backing Netanyahu had Ra’am’s participation in a pro-Netanyahu government not been blocked by Bezalel Smotrich, the leader of the Religious Zionist party. He ended up providing the crucial votes for a government led by Israel’s first Orthodox Jewish prime minister, Naftali Bennett. Abbas got everything he wanted, including a promise to spend 53 billion Israeli new shekels — about $16 billion — on fighting crime in Arab towns and “reduc[ing] gaps” between the Jewish and Arab sectors.This unprecedented political involvement heralds the chance for a new understanding between Israel’s Jews and Arabs. Much as the Abraham Accords promise the chance for reconciliation between Jews and Arabs among Arab states, these Abbas Accords promise the chance for domestic reconciliation as well. Ethnic violence erupted within Israel during the recent war with Hamas, starkly demonstrating how important improving relations with Israeli Arabs is to Israeli security. If Abbas can succeed, more Arabs will see that they have a concrete stake in Israel’s future. That can only make Israel’s future even brighter.Israel shall always be, as its Basic Law says, a Jewish and democratic state. Sunday’s historic vote will help Israeli Arabs to see themselves as an honored part of that state.Sign up to receive my columns in your inbox as soon as they’re published.Read more:Fareed Zakaria: The only way to solve the Israeli-Palestinian problemJennifer Rubin: Like the U.S., Israel bids goodbye to an unhinged leaderHenry Olsen: The latest bipartisan infrastructure deal is likely dead on arrival. Biden should reconsider.David Ignatius: What the U.S. should learn from Israel’s odd-couple proposed governmentThe Post’s View: After a bloody weekend, Israel needs a cease-fire as much as HamasThe latest: Israeli security chief issues rare warning over potential for Jan. 6-style mob violence ahead of Netanyahu departureAnalysis: The era of Netanyahu is over — or is it?Naftali Bennett, set to be Israel’s next leader, represents a break with its more secular pastWhat to know about Naftali Bennett, the Israeli politician poised to succeed Benjamin NetanyahuThe most important news stories of the day, curated by Post editors and delivered every morning.By signing up you agree to our Terms of Use and Privacy Policy", "Section": "", "Writers": "", "URL": "https://www.washingtonpost.com/opinions/2021/06/14/this-may-be-israels-best-chance-reconciliation/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}