{"Type": "", "Time": "2021-06-15", "Headline": "How hybrid should we go when restrictions ease? - Personnel Today", "Text": " With timings on the easing of pandemic restrictions in England set to drift again, what do employers need to consider when deciding on where employees should work over the coming months?The Prime Minister is likely to confirm today that lockdown easing will be delayed for another four weeks in England, meaning employers face even more soul-searching about the extent to which they open offices and welcome employees back to work – and when.Staying operational during the pandemic has undoubtedly provided a catalyst for many UK businesses to rapidly change how they work. The end of lockdown restrictions – and potentially also social distancing rules – seemed to offer an opportunity for employers to reinvent ways of working on a more permanent basis.Podcast: Summer of ’21- the unique challenges for HR Summer issues for HR: resource round-upWhen considering how far to go with hybrid working, while continuing to drive profits and promote employee wellbeing, thorough planning is essential. So, what key changes should business leaders and HR professionals be considering and how can they ensure teams stay connected in a hybrid working environment?While new approaches bring challenges, businesses are keen to take them on and generate fresh opportunities for employees and employers alike.Before the pandemic, many organisations suffered from issues such as presenteeism and poor productivity, but the pandemic showed that employees could be just as productive remotely as in the office.To ensure productivity levels remain high as ways of working begin to transition to a hybrid format, managers should be managing outputs rather than inputs and incentivising staff with clear targets and rewards – it’s all about equipping employees to work smarter, not necessarily harder.Ben Gillham, owner of office design business Thirdway, referred to there being four business types: “the business as usual; the temporary pivoter; the shape shifter, and the re-inventor”. These categories can help to establish a starting position; hybrid working needs to be applied differently to each of the four categories, and the outcomes should be different as a result.Most importantly, it is vital for businesses to seek feedback from employees on the sort of flexibility and approach they wish to adopt moving forward; this may push business owners out of their comfort zones and challenge their preconceptions.However, employers should also bear in mind that trust is key, so if they promise to take the views of workers into account, they must respond constructively to the results.Traditionally, working from home was viewed as a luxury, or something only available to senior members of staff. However, the past year has demonstrated that many employees can work just as effectively from home.Processes around online meetings, file sharing and daily check-ins were swiftly put in place at the start of the pandemic and many organisations have become more agile than ever. Most employers believe it would be counterproductive to revert to how things were.Instead, organisations should view this time as an opportunity to adopt new practices and support employees to drive the business forward in a more inclusive and collaborative way.However, it’s important to remember that, while many businesses have reported a short-term productivity increase attached to home working, research suggests that this is limited to routine tasks. The drivers of long-term productivity – creativity and innovation – appear to be best approached by teams coming together in person within collaborative spaces.Workspace design can also influence productivity levels and improve concentration – as many of us working from home offices have found. Employers can play a role in this by making sure that individuals have access to the advice, equipment, and technology to meet their needs at home. In the office, allocated desks are being replaced with a smaller number of ‘bookable’ ones, for those coming to the office on any specific day.Employers will also want to consider how to use time in the office to best effect. For example, marketing agencies may wish to use office time for mind-mapping or pitch development activity. Other employers may wish to bring employees together for interactive training sessions or other knowledge-sharing activities.To recreate those all-important ‘water cooler moments’, managers should continue to encourage employees to socialise as a team online, regardless of where they’re working. It is also vital for managers to make time for one-to-one discussions with remote workers to ensure they remain connected with the business in general, and that they aren’t indirectly discriminated against in any way as a result of their non-attendance.Employers have a responsibility to ensure each employee has a safe working environment. Whether staff are working in the office or in their garden shed, all the usual rules apply when it comes to protecting their health and safety.Organisations should view this time as an opportunity to adopt new practices and support employees to drive the business forward in a more inclusive and collaborative way”To help establish a safe hybrid working environment, employers should discuss with their staff whether home working is suitable and look to carry out the necessary risk and workstation assessments, to ensure that suitable arrangements are put in place. This may include covering additional costs for equipment or a WiFi upgrade, if necessary.There could be contractual issues to consider too. Where contracts of employment do not provide for the place of work to be ‘home’, employers should consider what changes to terms should be agreed with hybrid and home workers to protect them against any liability.For example, it may be wise to establish a ‘homeworking policy’, where the employer’s standards and expectations are set out clearly. Employers liability and individual employee home insurance policies should also be checked to ensure there is cover for home working.There may also be provisions in the employment contract dealing with benefits and expenses; employers may consider contributing to increasing electricity bills or to providing an ergonomic desk and chair to make homeworking more comfortable and safer. Some of the company’s savings in running their offices should be reinvested to ensure staff at home are safe, happy, and productive.Due to the nature of remote working, it can be more difficult for managers to see when someone needs support, unless they actively ask for it. So, in order to protect workforce wellbeing when hybrid working is in place, employers need to adopt processes that allow them to check in on employees regularly.This may include reminding employees to take proper breaks and encouraging all staff to properly disconnect outside of working hours as well as when they are on annual leave.The challenges of the past year have put mental health at the top of the HR agenda and as workplaces move into the ‘new normal’, this is something that should remain a priority. In order to build a culture that lends itself to hybrid working, managers need to listen to employees and take their individual needs into account. A one-size-fits-all approach is unlikely to work.Regardless of how far they choose to go with the re-introduction of office-based working, employers and HR professionals have a responsibility to ensure each worker’s needs are met. This will require considerable focus and care in the months ahead.Comment Name (required) Email (will not be published) (required) Website \n\nOrganisations that fail to execute hybrid working well could end up asking for all employees to return to the office.Businesses are having to play a deeper role in the personal lives of staff – and they are having a positive impact, writes Brian Kropp.Almost three-quarters of workers in the UK would feel more comfortable returning to work if others around them are vaccinated...Personnel Today has launched a new email newsletter focusing on all aspects of diversity and inclusion.Sign up herePost a job\nWhy advertise with us?Change Management\nCompensation & Benefits\nDiversity & Inclusion\nEmployee Relations\nEmployment Law\nHealth & Safety\nHR (General)\nHR Business Partner\nHR Director\nHR Consultant\nHR Shared Services\nHR Systems\nPeople Analytics\nLearning & Development\nTraining\nOccupational Health\nOrganisational Development\nPayroll\nPerformance & Engagement\nRecruitment & Resourcing\nTalent Management\nWellbeing\nWorkforce Planning• About Personnel Today\nContact us\nFeatures list 2021\nThe Personnel Today Awards\nRSS feeds\nAdvertising specifications\nEmail Newsletters\nCookies policy\nPrivacy policy\nTerms and conditions• Employee Benefits\nEmployee Benefits Awards\nEmployee Benefits Connect\nEmployee Benefits Live• Forum for Expatriate Management• Occupational Health & Wellbeing\nOH&W subscriptions\nOH&W subscription terms• The RAD Awards• Whatmedia\n© 2011 - 2021 DVV Media International Limited.", "Section": "", "Writers": "", "URL": "https://www.personneltoday.com/hr/how-hybrid-should-we-go-when-restrictions-ease/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}