{"Type": "", "Time": "2021-06-15", "Headline": "Opinion: Russia wants Biden to dance the tango with Putin. What to expect from their summit", "Text": "In less than a week, President Biden and Russian President Vladimir Putin are slated to meet in Geneva. Defending the summit, which is scheduled for Wednesday, U.S. national security advisor Jake Sullivan pointed out that there can be no substitute for a face-to-face meeting, especially considering that Putin \"has a highly personalized style of decision-making.\"The last time Biden spoke to Putin in person was 10 years ago in Moscow, and it was unforgettable. The media like to recount the moment when then-Vice President Biden looked into the eyes of then-Prime Minister Putin and said: \"I don't think you have a soul.\" It was a reference to the remarks made by former President George W. Bush in 2001, who said after meeting Putin that he was \"able to get a sense of his soul.\"It was even harder to believe when Biden, after becoming a president, called the Russian leader a \"killer.\" The decision of the American president to look again into the eyes of the man he views as a soulless killer raised questions in the U.S. Critics are concerned that Biden, who was the one who proposed a face-to-face meeting, is rewarding Putin with a prize he doesn't deserve in light of ongoing Russian aggression.\"A summit tends to reinforce the idea that Russia is still a superpower that can force the U.S. to make concessions. Inside Russia, this will create an impression that the U.S. tries to isolate Russia, but in the end, they can't do it; they are still afraid of Russia and still need it,\" said David Satter, a Foreign Policy Research Institute senior fellow and a Russia expert, in an interview.So far, the summit does appear to benefit Putin's interests. Recently, Biden seems to be more accommodating toward Russia than expected for a person who promised \"to stand up to autocrats like Putin\" while running for president. In May, he decided to waive sanctions on Russia's Nord Stream 2 gas pipeline, allowing the country to complete construction of the pipeline by the end of the year. Biden's decision disappointed Ukraine, a vulnerable U.S. ally, as Nord Stream 2 will allow Russia to ship gas directly to Europe, bypassing Ukraine and depriving it of significant revenue.Since taking office, Biden has added to an already long list of U.S. sanctions against Russia. He punished around 30 companies and individuals over alleged interference in the 2020 election and the SolarWinds cyberattack, which hit the State Department, Pentagon and many other government agencies. It evidently didn't deter hackers in Russia; the FBI blames Russian-linked groups for the recent ransomware attacks against Colonial Pipeline and food producer JBS.Though there is no evidence that the Russian government was involved in the incidents, Biden promised to raise the problem of cyberattacks in Geneva. It looks like the current American leader is not going to accept Putin's word on the issue as easily as his predecessor, President Trump. \"Responsible states do not harbor ransomware criminals,\" said White House Press Secretary Jen Psaki on June 2.Putin will most likely answer Biden by saying that it is the U.S. that doesn't want to cooperate on cybersecurity. Last year the Russian president offered a \"reset\" in the U.S.–Russia cyber relationship by signing an agreement not to use cyberweapons first. It will be up to Biden to decide if he wants to collaborate with a partner he doesn't trust.Ariel Cohen, a nonresident senior fellow at the Atlantic Council's Eurasia Center, thinks that it is important for the U.S. to bring the tension between Russia and the U.S. down. \"At the same time, Biden should not show weakness, and it is challenging,\" Cohen added in an interview. So far, Biden has made some concessions, and now it's Putin's turn. Cohen thinks that the meeting will be successful if the leaders present a joint statement afterward on cyberattacks, nuclear arms or hypersonic missiles. However, he is not optimistic about that.Nuclear arms control is one of the few issues where the countries have been able to find common ground. In February, the U.S. and Russia extended their New Strategic Arms Reduction Treaty until 2026. Yuri Rogulyov, director of the Franklin D. Roosevelt Foundation for United States Studies at Moscow State University, suggested in an interview that further cooperation in this sphere will be the priority on the summit's agenda. \"Russia and the U.S. are countries with the biggest nuclear arsenals in the world; they can destroy not only each other but many other countries. There can be no winners or losers when it comes to the nuclear arms agreement; it is beneficial to all,\" Rogulyov concluded.What Putin made clear is that he doesn't want to discuss with Biden what Putin considers to be the internal affairs of Russia. Biden promised to bring up human rights abuses. He will likely ask Putin to order the release of Alexei Navalny, a leading critic of the Russian president. But the Kremlin continues to show its determination to restrict the political opposition, regardless of U.S. opinion. On Wednesday, the Russian court outlawed the organizations founded by Navalny, calling them \"extremist.\"Biden is in a difficult situation. He is expected to be tough on the Kremlin, but at the same time he wants to have a more \"stable and predictable relationship\" with Russia. Russian Foreign Minister Sergei Lavrov pointed out that if that phrase means \"stable and predictable sanctions,\" it won't work out. \"It is not realistic to expect this summit to produce any grand bargains or breakthroughs that might transform the bilateral relationship,\" said George Beebe, vice president at the Center for the National Interest, who added in an interview, \"But I believe we must talk with our competitors and rivals as well as our friends and partners.\"On Wednesday, Lavrov said that Russia is interested in a positive outcome of the summit, but \"it takes two to tango.\"Given the pressure, it looks like Biden has more to lose than to gain from the meeting. But considering that the U.S.-Russian relationship has achieved the lowest point since Cold War (both ambassadors were called back to their home countries this spring), it can be worth it for Biden to look into Putin's eyes again after 10 years and give it a try.This story originally appeared in Los Angeles Times.NATO was founded as a political and military alliance to counter Soviet influence and militant nationalism in Europe following WWII.Flowers were laid on rusty railway tracks Monday as Lithuania marked the start of a mass deportation 80 years ago by the Soviet Union that was occupying the Baltic nation.  People who were considered opposed to Moscow or deemed counter-revolutionary elements were sent to Siberia from Lithuania and few returned.  “Two evil forces — Nazi Germany and the Soviet Communist regime — had entered a secret agreement to divide Europe,” President Gitanas Nauseda said during a solemn ceremony in Vilnius, on a day considered one of the darkest pages in the Baltic nation’s recent history.Have you considered how you'll withdraw your retirement income? These simple mistakes could cost you thousands of dollars.Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyIt was a cold winter morning in Moscow in the late 2000s. At the southern end of the Slavyanskaya Square, in front of the giant windows of the six-story neoclassical edifice of the Presidential Administration, once home to the Central Committee of the Communist Party, stood a short stocky man in his early sixties, with a black mustache.Konstantin Kapitonov was waiting for me at the steps of the monument to Cyril and Methodius, inventoPresident Joe Biden is seeking to tamp down trade tensions with European allies as he spends one last day consulting with western democracies ahead of his highly anticipated meeting with Russian President Vladimir Putin.  The president has sought to marshal widespread European support for his efforts to counter Russia prior to his Wednesday meeting in Geneva with Putin.Central and Eastern European nations are anxious about the coming summit meeting between U.S. President Joe Biden and Russian President Vladimir Putin, wary of what they see as hostile intentions from the Kremlin.  “I think there have been doubts as to the resoluteness of the present administration to face Russian aggressive actions in a decisive manner,” said Witold Rodkiewicz, chief specialist on Russian politics at Warsaw's Center of Eastern Studies, a state-funded think tank that advises the Polish government.Get a $200 checking bonus when you apply for an eligible checking account online in minutes with qualifying direct deposits. Learn more.Sending a bearish signal for Wednesday's summit, Russian President Vladimir Putin gave an aggressive preview interview to NBC News, denying cyber-hacking and portraying suspects in the Capitol riot as political prisoners.Why it matters: This is looking like the rare head of state sit-down where no amount of diplomatic fluff can paper over the gulf between the two countries.Stay on top of the latest market trends and economic insights with Axios Markets. Subscribe for freeZoom out: Both PresidentDuring last Friday's \"Mad Money\" host Jim Cramer outlined his game plan for this week.  Cramer reminded viewers there's one thing he has learned over his career, and that's to never sell a bull market.  There's bound to be a lot of chatter on Monday about \"growth versus value,\" Cramer said, but individuals should ignore it.Former CIA analyst and member of the House Armed Services Committee, Rep. Elissa Slotkin (D-MI), discussed President Biden's first NATO summit as commander in chief and his upcoming meeting with Russian President Vladimir Putin. She also responds to NBC’s exclusive interview with the Russian President, telling Stephanie Ruhle that the U.S. should respond to Russian cyberattacks with “some sort of arms control regime\" or \"big strategic plan.\"Cut your monthly payment while rates are low. Free Quotes. Wont affect your credit. Calculate New Payment. (1.97% APR)In the first public accounting of its kind in decades, an Associated Press investigation has found that at least 1,900 U.S. military firearms were lost or stolen during the 2010s, with some resurfacing in violent crimes.  Government records covering the Army, Marine Corps, Navy and Air Force show pistols, machine guns, shotguns and automatic assault rifles have vanished from armories, supply warehouses, Navy warships and elsewhere.  In one case, authorities linked an Army pistol stolen from Fort Bragg, North Carolina, to four shootings in New York before it was recovered.China's mission to the European Union urged NATO on Tuesday to stop exaggerating the \"China threat theory\" after the group's leaders warned that the country presents \"systemic challenges\".  NATO leaders on Monday had taken a forceful stance towards Beijing in a communique at United States President Joe Biden's first summit with the alliance.  \"China's stated ambitions and assertive behaviour present systemic challenges to the rules-based international order and to areas relevant to alliance security,\" NATO leaders had said.TAIPEI (Reuters) -A U.S. aircraft carrier group led by the USS Ronald Reagan has entered the South China Sea as part of a routine mission, the U.S. Navy said on Tuesday, at a time of rising tensions between Washington and Beijing, which claims most the disputed waterway.  China frequently objects to U.S. military missions in the South China Sea saying they do not help promote peace or stability, and the announcement follows China blasting the Group of Seven nations for a statement scolding Beijing over a range of issues.Many people may be suffering from psoriatic arthritis and not know. Look for psoriatic arthritis signs.Dan Riffle's tweet was in response to a letter, led by Ocasio-Cortez, calling for a budget increase among House offices in order to pay staffers more.Grainy new photos show Jennifer Lopez and Ben Affleck, who've recently reunited, locking lips at Nobu in Malibu during a birthday celebration.Demonstrators were protesting the death of Winston Smith, a Black man who police killed under suspicious circumstances earlier this monthIowa homeowners are frantic to secure super low mortgage rates. If you own a home, you better read this now.President Biden said Monday that the Republican Party is now \"vastly diminished in numbers,\" and that the wing led by former President Donald Trump represents \"a significant minority of the American people.\"Princess Amalia, the heir to the Dutch throne, announced she would waive her $1.9 million allowance in a letter to the Dutch prime minister.Erika Jayne's husband Tom Girardi, 82, has been accused of embezzling millions of dollars from the widows and orphans of plane crash victims.Top Surgeon and Author of the Best Selling Book \"Dr. Gundry's Diet Evolution\" Discovers Link Between Gut Health and the Rising Number on the Scale.Barbara Starr has called on the Biden administration to introduce new protections for journalistsCriminal ComplaintA Virginia woman who stormed the Capitol alongside her realtor husband while holding a sign protesting COVID vaccines wanted to set the record straight as she pleaded guilty on Monday, telling the judge that her angry Facebook messages about the insurrection also included “kind” words like “pray for America.”Jessica Bustle and her husband, Joshua, pleaded guilty on Monday to a misdemeanor charge of parading, demonstrating, or picketing in a Capitol building after participating‘Too bad he can’t read this’", "Section": "", "Writers": "", "URL": "https://news.yahoo.com/opinion-russia-wants-biden-dance-100039428.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}