{"Type": "", "Time": "2021-06-15", "Headline": "Not so sunny in Seville for new-look Spain, Football News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SEVILLE • After a week without training and three years of upheaval, Spain head into their Euro 2020 Group E opener against Sweden today determined to leave the past behind but unsure about what comes next.Luis Enrique was appointed to ring the changes in the aftermath of their 2018 World Cup disappointment - the third straight time La Roja had failed to reach the last eight of a major tournament.The conclusion in the wake of Russia was clear - the historic crop of 2008 to 2012 that won two successive Euros and the World Cup had grown old and the tiki-taka style that placed Barcelona and Spain at the vanguard of football had to be revamped.At La Cartuja Stadium in Seville today, only Jordi Alba remains from the Euro success nine years ago, with Sergio Ramos cut from the team and captain Sergio Busquets self-isolating after testing positive for Covid-19 last weekend.Since the last World Cup, 61 players have played for Spain with the desire for a clean slate meaning several positions on the team remain up for grabs.Enrique has refused to confirm if Unai Simon will play in goal, ahead of David de Gea and Robert Sanchez, while Gerard Moreno and Alvaro Morata, who was booed by the home fans in last week's 0-0 friendly draw with Portugal, are vying for the central striker role.The other areas of the pitch appear to more clear cut as Pau Torres is set to play alongside Aymeric Laporte, who has switched allegiance from France to Spain, in defence.Koke, Rodri and Thiago Alcantara are likely to form the midfield trio, although Fabian Ruiz and Dani Olmo are also in contention.Like the team's line-up, results have been no easier to predict, with elation often quickly followed by disappointment in recent Nations League matches and 2022 World Cup qualifiers.If Spain can deliver the peaks when they need them and eliminate the troughs, they will be among the cluster of teams ready to capitalise if Euro favourites France fail to live up to expectations.But due to midfielder Busquets testing positive for Covid-19 and a false positive test for defender Diego Llorente, the players have had to train individually for most of the past week and Spain's Under-21s had to play last week's friendly with Lithuania instead.LOOK ON THE BRIGHT SIDEI've rarely seen such a great atmosphere between the staff and players. That's why I only expect positive and beautiful things and can say we're going to come out fighting.Still, Enrique is hoping their chaotic lead-up to the Euro has brought the team closer. \"When something of this magnitude happens, it obviously has an effect. There's uncertainty and that generates restlessness,\" he said.\"I've rarely seen such a great atmosphere between the staff and players. That's why I only expect positive and beautiful things and can say we're going to come out fighting.\"Spain may not have had the best preparation but neither have the Swedes. Janne Andersson's side, who lost veteran star striker Zlatan Ibrahimovic to injury last month, have also been rocked by Covid-19 positives, ruling midfield pair Dejan Kulusevski and Mattias Svanberg out of the game.The heat in Seville, where a temperature of 27 deg C is expected for the kick-off in front of 16,000 fans, will also not favour Sweden as they have been based in Gothenburg, where it has been around 18 deg C.AGENCE FRANCE-PRESSE, REUTERSSingtel TV Ch141 & StarHub LiveNow app, tomorrow, 2.50amJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/sport/football/not-so-sunny-in-seville-for-new-look-spain", "Source": "google"}