{"Type": "CommentaryCommentary", "Time": "2021-06-15", "Headline": "Commentary: Will Malaysian king take PM Muhyiddin’s government to task for huge COVID-19 mess?", "Text": "All eyes are on the Conference of Rulers’ decisions this Wednesday. The royals are likely to strike a middle path to put the ball back in Muhyiddin Yassin’s court, says Professor James Chin.HOBART: The Conference of Rulers (COR), is expected to meet in Kuala Lumpur on Wednesday (Jun 16).This is made up of the king, the remaining eight hereditary sultans and governors of the other four states. The nation's prime minister, although not a member, attends these too.But it’s the nine sultans who constitute the core of the COR. Royalty draws legitimacy from being an influential symbol of identity and established institution of Malay heritage in the country.In theory, the COR’s main role is ceremonial – in overseeing Islamic matters, key judicial and political appointments including the Auditor-General, superior court judges and Public Service Commission members, and in electing Malaysia’s unique five-year rotational king.In practice, however, the COR is much more powerful. It is an independent body that can provide a check-and-balance role against the government and Parliament under Article 38 of Malaysia’s Constitution.The excitement over this coming Wednesday’s meeting is fuelled in part by public expectation that under Malaysia’s state of emergency with Parliament suspended, only the king and the COR can hold the Muhyiddin administration to account.Many are hoping this meeting will provide a reset of Malaysian politics after six months of stasis.GROWING RUMOURSSince the middle of last week, the king has summoned leaders of all major political parties to meet him. Many Malaysians have been hoping these meetings would be a precursor to the king intervening directly to replace the government in forcing a change at the top the current administration.The biggest rumour in Kuala Lumpur now is that Hishammuddin Hussein, the current foreign minister, will take over or at least be made deputy prime minister.Hishammuddin is widely seen as one of the more acceptable faces to both the opposition and UMNO. If he is appointed DPM, then this will go a long way in placating UMNO’s unhappiness with Muhyiddin for sidelining it in government. In effect this means Bersatu is giving the number two position to UMNO.Speculation of regime change has been fanned by reports of three complaints brought up by most opposition leaders in their meetings with the king: First, the emergency, which will only expire on Aug 1. Second, the poor government response to the pandemic thus far. Third, the suspension of Parliament for six months.All major parties, excluding Muhyiddin’s Bersatu, want the state of emergency lifted.It looks like the email address you entered is not valid.They want Parliament to sit so that they can take the government to task. And why not when all MPs should have had at least one dose of the vaccine by now, after being prioritised for vaccination under Phase 1?At worst, a hybrid parliamentary sitting can be held, where some MPs sit in person while others take part via video-conferencing, like how most countries have carried out Parliament sessions.WORRIES OF A NO-CONFIDENCE MOTION?There is widespread speculation that Muhyiddin is not in favour of a parliamentary sitting because he fears a vote of no confidence.But Parliament protocols give Muhyiddin’s coalition the chance to deny such votes.Any potential vote of no-confidence must have the endorsement of the Speaker. However, the Speaker Art Harun, who was nominated by Muhyiddin to his role, has indicated that a vote is possible only after all government bills are dealt with first.So even if a confidence motion is accepted, it may never make it to a vote as time will run out.Art has also said last year he will not advance a no-confidence motion unless it is requested by a minister. He is unlikely to change his stand when Parliament is reconvened.A COLOSSAL MESSThe real reason why Muhyiddin does not want Parliament to sit has more to do with the colossal mess in the way his government has dealt with the pandemic.The top twitter tag for Malaysia for most of this year is #KerajaanGagal, or failed government. A significant portion of the political class thinks the Muhyiddin administration has failed to deal with the pandemic and abused the powers of the emergency to stay in power.This is the reason there is so much buzz on social media against the government. Many political groups are using ClubHouse to vent their frustrations.The string of sudden lockdowns that came with little warning and mixed messaging since the start of the year has only succeeded in providing fodder for more Internet memes and jokes, as frustration and fatigue turned into cynicism.Most worryingly, the number of daily cases remain high above 5,000 for most of June with the total number of deaths reaching 4,000.Malaysia's vaccine rollout has also been problematic. The target of vaccinating 75,000 a day announced back in March has barely been achieved.The app for booking vaccination slots did not let users choose their dates and vaccination sites at first. The website later became inundated with demand.Despite widespread complaints that older people, the most vulnerable, do not have access to the app and cannot even try to book a slot, little has been done to assist them.Many ordinary Malaysians are angry the lockdown has become the subject of petty elite infighting, in particular, a political tussle between Defence Minister Ismail Sabri and International Trade and Industry Minister Azmin Ali.The trouble is a “full lockdown” in Malaysia does not really mean a “full lockdown” as factories and business can get an exemption to operate if deemed “essential” yet the criteria is sketchy at best and troubling at worst. People just this week have asked why luxury brands like Louis Vuitton could continue to open some stores.To make matters worse, both ministries want to control who grants these exemptions. There was reportedly a heated argument when MITI wanted to grant some 95,000 businesses exemptions in early June.Meanwhile, media celebrities and political leaders flagrantly flout rules on social distancing.Many Malaysians are also not confident the government can get on top of the pandemic when a large number of residents cannot be traced nor vaccinated. This includes the more than three million undocumented migrants from the surrounding countries working and living illegally in Malaysia.These workers are stuck – on the one hand, they are running out money because they cannot work, and on the other, they cannot leave Malaysia to return to their home countries when their stay here has been illegal.Muhyiddin is afraid that if Parliament is reconvened, opposition MPs will have a field day attacking the ministers on key decisions taken during the emergency and using parliamentary immunity to drag his Cabinet through the mud on allegations swirling on social media accusing the government of unfairness in administering the vaccines.ENTER THE KINGSo where does this leave the king?The emergency was proclaimed in the name of the Agong, who had received strong public backlash in agreeing to the emergency back in January.Since then, there has been at least a dozen petitions and representations made to the king to lift it or at least, decline to extend it when it expires.This time, I suspect he will play it differently. Obviously, the government wants to buy time so that Muhyiddin’s coalition is in better shape if snap polls have to be called.But with the state of emergency becoming a highly politicised issue, the king and the COR will now have to balance the need to control the pandemic against calls for this government to be replaced.The most likely outcome is for the king to take the middle road. This means no immediate decision on the extension of the emergency (a decision best left to July when the situation is clearer) while urging the government that Parliament must be reconvened.The royals can therefore transfer the political heat back squarely on Muhyiddin’s shoulders and let the politicians fight it out in the parliamentary arena.This will also allow the king and the royals to reclaim their position as one “above politics” and restore some of the reputation damaged by agreeing to the January emergency and picking Muhyiddin to fill the prime minister role back in March 2020.(Listen to Malaysians share how they have been coping fighting a new wave of COVID-19 infections in Heart of the Matter podcast.)Professor James Chin is Professor of Asian Studies at the University of Tasmania and Senior Fellow at the Jeffrey Cheah Institute on Southeast Asia.", "Section": "", "Writers": "", "MainKeyWord": "Malaysia,Muhyiddin Yassin,UMNO,Bersatu,Agong", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/commentary/malaysia-king-agong-state-emergency-muhyiddin-lift-15010974", "Source": "google"}