{"Type": "", "Time": "2021-06-15", "Headline": "Hong Kong singer Karen Mok is sorry about donning racist D&G, which she says was an ‘oversight’ on her part – SupChina", "Text": "\nChinese internet users branded D&G racist in 2018, and they have not forgotten or forgiven the fashion house, as Karen Mok discovered this past weekend.  \nCopy this linkCopied!Something went wrong.Hong Kong singer and actress Karen Mok (莫文蔚 Mò Wénwèi), who just wrapped up a world tour in celebration of her 50th birthday, has apologized after a backlash on Chinese social media over her new music video, in which she wears Dolce & Gabbana, a luxury fashion brand that has drawn ire from Chinese consumers in the past over racist advertising and offensive messages from its co-founder.“I am truly sorry for being reckless this time. I have no excuse. My team and myself are definitely in the wrong here,” Mok said in Mandarin (in Chinese), in response to a question asked by a journalist in Cantonese in a post-concert interview in Hong Kong over the weekend. “I didn’t mean to offend people and there was no ill intention behind my action.”The singer added that because her latest tour and album required “a lot of preparation” in the past few months, she wasn’t able to pay attention to every detail, including choices of outfits. “I will be more careful in the future,” she repeatedly apologized.The controversy unfolded last week after the release of Mok’s latest album, The Voyage, which contained a song called “Woman for All Seasons.” In its music video, the artist can be seen striking poses in a D&G robe, swimsuit, and hair accessories. Upon the release of the album, Mok also updated her profile picture on Weibo, where she has more than 15 million followers, with a photo of her in the robe.The backlash was swift and scathing. On Chinese social media, critics accused Mok of publicly endorsing D&G, while others called for a boycott of the artist. The furor gained more momentum later last week after a few fashion bloggers and entertainment journalists pointed out that Mok was the first Chinese celebrity to wear clothes by D&G to public events since a major fallout in 2018.Subscribe to The China Vibe, our society and culture newsletter, to get a free weekly roundup of the most interesting stories from China.About three years ago, the Italian fashion house got in trouble in China over a video campaign promoting a runway presentation in Shanghai, dubbed “The Greatest Show.” In three different clips, a Chinese model was filmed clumsily attempting to eat a variety of Italian foods as a Chinese male narrator made suggestive comments and intentionally mispronounced many of the non-Chinese words. The videos, seen by many as “culturally insensitive” and “racist,” ignited a firestorm of fury on the Chinese internet. Although D&G removed the videos from Chinese social media within 24 hours of posting them, the criticism only intensified after a fashion blogger shared a screenshot of an alleged chat between the brand’s co-founder Stefano Gabbana and an Instagram user, in which the designer appeared to refer to China as a “country of [five poop emojis]” and “ignorant dirty smelling mafia.”The luxury brand issued an apology, blaming the offensive messages on a hack. But the damage was already done. D&G was forced to cancel the fashion show in Shanghai and a string of Chinese ecommerce platforms decided to remove its products. Although the brand continues to remain a physical presence in several Chinese cities, its sales suffered in a major way. Fearing that associations with the brand will result in a backlash, Chinese models won’t walk its runways, and Chinese celebrities and influencers have cut ties with the company. Following Mok’s apology, the singer’s agency and stylist also asked for forgiveness, in respective statements released over the weekend. The agency wrote (in Chinese) that it had asked that the video be taken down from all platforms and promised that the outfit in question wouldn’t appear in future promotional events. As of today, the backlash has mostly died down. Internet users appeared to have taken a forgiving view of Mok’s mistake, given that the artist regularly posts pro-China messages on social media, especially on special patriotic occasions like Chinese National Day. “I have no doubt that she is pro-China. The apology sounds genuine and she really owned up to her mistake,” a Weibo user wrote (in Chinese). Others said that the controversy was blown out of proportion by nationalists, arguing that the anger was misdirected considering that there were still a few D&G stores in the country. “If you really hate D&G, why don’t you protest on the streets or loot its stores?” another person commented (in Chinese).Jiayun Feng was born in Shanghai, where she spent her first 20 years and earned a bachelor’s degree in journalism at Fudan University. Interested in writing for a global audience, she attended the NYU Graduate School of Journalism for its Global & Joint Program Studies, which allowed her to pursue a journalism career along with her interest in international relations. She has previously interned for Sixth Tone and Shanghai Daily. Read moreMax BaucusFormer U.S. Ambassador to ChinaGet Premium AccessNecessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.Performance cookies are key in allowing web site screens and content to load quickly on all types of devices.Preference cookies are used to store user preferences to provide them with content that is customized accordingly. These cookies also allow for the viewing of embedded content, such as videos.Analytics cookies help us understand how our visitors interact with the website. It helps us understand the number of visitors, where the visitors are coming from, and the pages they navigate. The cookies collect this data and report it anonymously.Advertisement cookies help us provide our visitors with the most relevant ads and marketing campaigns.", "Section": "", "Writers": "", "URL": "https://supchina.com/2021/06/14/hong-kong-singer-karen-mok-is-sorry-about-donning-racist-dg-which-she-says-was-an-oversight-on-her-part/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}