{"Type": "", "Time": "2021-06-15", "Headline": "New Israeli government is just as bad as the last, says Palestinian PM | Israel | The Guardian", "Text": "Mohammad Shtayyeh condemns Naftali Bennett’s announcements in support of Israeli settlements First published on Mon 14 Jun 2021 01.20 EDTBenjamin Netanyahu’s ousting closes one of the “worst periods” of the Israeli-Palestinian conflict but the new government headed by a settler advocate, Naftali Bennett, is just as bad as the last, the Palestinian prime minister has said.“We do not see this new government as any less bad than the previous one, and we condemn the announcements of the new prime minister Naftali Bennett in support of Israeli settlements,” Mohammad Shtayyeh said, referring to hundreds of thousands of Jewish Israelis who have taken land in the occupied West Bank.“The new government has no future if it does not take into consideration the future of the Palestinian people and their legitimate rights,” Shtayyeh added. A far-right former settler leader, Bennett addressed his newly sworn-in cabinet late on Sunday night, saying the country was “at the outset of new days”. The new prime minister has ruled out a Palestinian state and wants Israel to maintain ultimate control over all the lands it occupies. He has previously called for Israel to be more forceful in its attacks on Gaza.Bennett was once Netanyahu’s chief of staff and a member of his Likud party, but they have become fierce rivals. On Monday, Bennett and Netanyahu held a 30-minute meeting to formally transfer power. However, they skipped the photo op and public well-wishes of previous handovers.Israel's new prime minister is a far-right former settler leader, who once served as a senior aide and adviser to Benjamin Netanyahu and ran Israel's education and defence ministries in his governments.Bennett, who wants to annex most of the occupied West Bank, is ideologically close to Netanyahu and was once a member of his ruling Likud party. However, the 49-year-old fell foul of his old boss, who has vowed to work in opposition to topple Bennett's \"dangerous government” and return to power.A stalwart of Israel’s religious right, Bennett is a former leader of Yesha, the main Jewish settler movement in the West Bank. He has made settlement expansion, the annexation of Palestinian land and the rejection of a Palestinian state a feature of his political platform.“I would not give another centimetre to the Arabs,” he said in 2018. “We have to drop the idea that if we give them more territory the world will love us.”The son of immigrants from San Francisco, Bennett became a hi-tech millionaire after selling an anti-fraud software company to a US security firm. On some issues, the former commando is less conservative than his colleagues on the hard right, including gay rights and the relationship between religion and state. Oliver HolmesSeveral world leaders publicly congratulated Bennett. And despite the fact that the new leader’s government has explicitly pledged not to make efforts to end the Israeli occupation, some figures abroad highlighted the need to pursue peace in their messages of congratulation. The Canadian prime minister, Justin Trudeau, said Ottawa “remains steadfast in its commitment to a two-state solution, with Israelis and Palestinians living in peace, security, and dignity – without fear and with their human rights respected”.The White House said in a statement that Joe Biden had, in a phone call with Bennett, “conveyed that his administration intends to work closely with the Israeli government on efforts to advance peace, security, and prosperity for Israelis and Palestinians”.An earlier statement said the US president looked forward to working with Bennett, adding: “Israel has no better friend than the United States.” The European Council president, Charles Michel, said he was looking forward to strengthening the EU-Israel partnership “for common prosperity and towards lasting regional peace and stability”. The UK foreign secretary, Dominic Raab, said: “I look forward to continued cooperation on security, trade and climate change, and working together to secure peace in the region.”Bennett, 49, was sworn in on Sunday evening after the opposition leader, Yair Lapid, a centrist former TV news anchor, won a confidence vote in the Knesset by a razor-thin advantage of 60-59 seats. Under a power-sharing agreement, Bennett will hand the reins to Lapid after two years.The new administration breaks a political deadlock that has resulted in four snap elections since 2019. During that time, Netanyahu, who is famed for his political skills, managed to keep his rivals bickering and divided while he clung to power, even after he was indicted in three criminal corruption cases on charges he denies.Bennett leads a self-described “government of change” that is a mix of ideologically opposed politicians from hardline Jewish religious nationalists and a small Arab Islamist party, whose leader, Mansour Abbas, is seen as a pragmatist. Published coalition agreements showed the new government would focus mostly on economic and social issues, such as passing a state budget and building new hospitals, rather than risk an internal fight by trying to address the Israeli-Palestinian crisis. However, Bennett will have executive powers as prime minister to further solidify the occupation.In joining the coalition, Bennett has been branded a traitor by some politicians on the religious right, who accused him of abandoning his ideology in order to join Jewish “leftists” and Arab politicians.Bennett told the parliament before the Sunday vote that Israel had been thrown “into a maelstrom of hatred and infighting”. “The time has come for different leaders, from all parts of the population, to stop, to stop this madness”, he said, to angry shouts of “liar” and “criminal” from rightwing opponents.On Sunday night, after Netanyahu was removed from high office, thousands of Israelis waving the country’s blue and white flag packed a square near the Knesset in Jerusalem. Netanyahu’s opponents waved “Bye bye Bibi” placards as they celebrated in central Tel Aviv. Netanyahu has been in power for so long that – after Sunday’s confidence vote dethroned him – he automatically returned to sit in a seat reserved for the prime minister. After being discreetly prompted by a lawmaker in his party, he moved to a seat designated for the opposition.The new government’s first major test will be on Tuesday when a parade attended by far-right Jewish nationalists is set to march through Palestinian neighbourhoods of Jerusalem.Israeli police had changed the route to avoid the Muslim quarter of the Old City after a similar march last month played a key role in building the tensions that led to the latest Gaza conflict. However, the planned march will still pass through Arab areas and is seen as deeply provocative.", "Section": "", "Writers": "", "URL": "https://www.theguardian.com/world/2021/jun/14/naftali-bennett-israel-world-leaders-welcome", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}