{"Type": "", "Time": "2021-06-15", "Headline": "Bukit Merah View market Covid-19 cluster grows to 16 cases, one unlinked case in the community, Health News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.SINGAPORE - The Bukit Merah View market and food centre Covid-19 cluster has grown by 10 cases, said the Ministry of Health (MOH) on Monday night (June 14).This brings the total number of those infected in the cluster to 16.The Ministry of Health (MOH) said a total of 25 new coronavirus cases were confirmed as at Monday, including 19 locally transmitted cases.Of the 19 locally transmitted cases, 18 are in the community and one is from a workers' dormitory.This is the highest number of community cases in Singapore since June 3. It is also the first time a dormitory case has been reported since June 8.The ministry said that of the 18 community cases, 17 are linked - 12 were already under quarantine and five were detected through surveillance - while one is unlinked. Among the 10 new cases in the Bukit Merah View market and food centre cluster is a 17-year-old male student at ITE College Central, a household contact of another case confirmed on Monday. He developed a fever and cough on June 11 and went to a GP clinic, where he was given both an antigen rapid test (ART) and a polymerase chain reaction (PCR) test.His ART test was negative for Covid-19, but his PCR test came back positive. His serology test - which looks for antibodies that indicate a past infection - is pending results.A 94-year-old Singaporean man who regularly goes to Telok Blangah Parcview Active Ageing Care Hub was also among the new cases added to the cluster.The retiree developed a runny nose on June 6 and fever six days later on June 12 but did not seek medical attention. As he is the family member of another case, he was quarantined on June 13. He tested positive that same day.A 21-year-old Singaporean woman, who works as an IT engineer at IBM in Changi Business Park, is another new case.A family member of two other Covid-19 cases and a household contact of a third, she developed a runny nose and fever on June 12 but also did not seek medical attention.She was quarantined on June 13 and reported her symptoms on the same day. She also tested positive that day.A 16-year-old Singaporean male student at Anglo Chinese School (Independent) is among the other community cases confirmed on Monday. A family member of an earlier case, he was asymptomatic and was detected when he was tested on June 12 while under quarantine. There is one unlinked case on Monday. He is a male Singaporean, 79, employed by AO ServicePro as a cleaner at Block 375 and 376 Clementi Avenue 4. He developed symptoms on June 12 and sought treatment the next day.He received his first vaccination dose on June 5.One linked case in the dormitories was also reported. The 26-year-old Indian national works as an electrician at GT ENGRG and lives at Westlite Juniper dormitory in Mandai. He was added to a cluster linked to an engineer at Ecoxplore.There are also six imported cases, all of whom have been placed on stay-home notice upon arrival in Singapore. Three of the six are returning Singaporeans or Singapore permanent residents.The 25 new cases on Monday take Singapore's total tally to 62,301.The weekly total number of cases is 91 this week, down from 159 the previous week.There are 46 active clusters, down from 48 on Sunday.As at Monday night, 138 patients remain hospitalised, including two in critical condition in the intensive care unit, while 235 are recovering in community facilities.Singapore has had 34 deaths from Covid-19 complications, while 15 who tested positive have died of other causes.Read the full MOH press release here.Join ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/health/bukit-merah-view-market-cluster-grows-to-16-cases-one-unlinked-case-in-the", "Source": "google"}