{"Type": "Asia", "Time": "2021-06-15", "Headline": "China nuclear plant operators release gas in bid to fix issue", "Text": "BEIJING: Gas was deliberately released from a nuclear power plant in southern China as operators work to fix an issue at the facility, its French part-owner said on Monday (Jun 14) following a US media report of a potential leak.CNN said the US government is assessing a report of a leak at the Taishan Nuclear Power Plant in populous Guangdong province after Framatome, a French firm that partly owns it, warned of an \"imminent radiological threat\".EDF, the majority owner of Framatome, said the plant's number one reactor experienced a build-up of noble gases in its primary circuit, which is part of the cooling system.The gas leaked after the coating on some fuel rods had deteriorated, said an EDF spokesman, who asked not to be named.Noble gases are elements which have low chemical reactivity - in this case it was xenon and krypton.The gases were collected and treated as part of a process to remove any radiocativity before their release, which was normal and \"in accordance with regulations\", the spokesman said.\"We are not in a scenario of an accident with a melting core,\" he said.\"We are not talking about contamination, we are talking about controlled emissions.\"Framatome said in a statement that the plant was operating \"within the safety parameters\" despite the\"performance issue\". EDF called an extraordinary meeting of the plant's board over the matter.David Fishman, manager at energy-focused consulting group The Lantau Group, said a cracked fuel road can potentially cause a small release of fission materials into the cooling loop, \"where it wouldn't normally be\".\"Failed fuel or cracked fuel is a fairly normal and common - undesirably certainly - but not uncommon phenomenon in the nuclear fuel industry,\" Fishman told AFP.NOT AT 'CRISIS LEVEL'Citing a letter from Framatome to the US energy department, CNN said the warning included an accusation that the Chinese safety authority was raising the acceptable limits for radiation outside the facility in order to avoid having to shut it down.But a US official told the broadcaster that the administration of President Joe Biden believes the facility is not yet at \"crisis level\".The operator of the station, state-owned China General Nuclear Power Group (CGN), said in a statement on Sunday evening that \"the environmental indicators of Taishan Nuclear Power Plant and its surroundings are normal\".It did not reference any leak or incident at the power station, which it said meets \"the requirements of nuclear safety regulations and power plant technical specifications.\"The International Atomic Energy Agency, a UN body, said it had contacted its counterpart in China regarding the issue.\"At this stage, the Agency has no indication that a radiological incident occurred,\" the IAEA said in a statement.AFP did not get an immediate response to a request for comment from either the Chinese foreign ministry or the Chinese nuclear power group.A problem with a cracked fuel rod would have to be logged by the Chinese nuclear safety administration with a mitigation report to fix the problem, Fishman said.Fishman said Framatome possibly reached out to the US to seek approval for their work at Taishan because CGN is on a US entity blacklist.\"If (Framatome) were going to transfer over any information that they have gotten from working in the US, they would have to apply for an exemption ... because CGN is on the US entity list,\" he said.\"It is a no-fly zone for any US information, any information or data or technology or IP to go to China.\"EPR REACTORSPowered up in 2018, the Taishan plant was the first worldwide to operate a next-generation EPR nuclear reactor, a pressurised water design that has been subject to years of delays in similar European projects in Britain, France and Finland.EPR reactors have been touted as promising advances in safety and efficiency over conventional reactors while producing less waste.Nuclear plants supplied less than five per cent of China's annual electricity needs in 2019, according to the National Energy Administration, but this share is expected to grow as Beijing attempts to become carbon neutral by 2060.China has 47 nuclear plants with a total generation capacity of 48.75 gigawatts - the world's third highest after the United States and France - and has invested billions of dollars to develop its nuclear energy sector.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "business and finance,China,David Fishman,Framatome,operator,US", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/china-nuclear-plant-operators-release-gas-in-bid-to-fix-issue-15014122", "Source": "google"}