{"Type": "", "Time": "2021-06-15", "Headline": "Luis Enrique defends Alvaro Morata after missing chances as Spain held by Sweden | Football News | Sky Sports", "Text": "\n\n\n\nFootball\n                          \nSpain boss Luis Enrique on Alvaro Morata: \"I think Alvaro had a great game. Of course we all want to take our chances, but other players had chances too. I think he's used to it, but of course we want to see that support from the fans\"By  PA Media  Tuesday 15 June 2021 00:06, UKLuis Enrique has defended Alvaro Morata following the Spain striker's two costly misses in Monday night's goalless Euro 2020 draw with Sweden.Spain boss Enrique insisted on-loan Juventus hitman Morata had a \"great game\" despite spurning two gilt-edged chances in Seville.Marcus Berg missed a major opening for Sweden too, but Spain dominated throughout, attempting 954 passes to the Swedes' 174.Enrique would not be drawn on Sweden's containment tactics, before insisting Spain have no need to worry about their chances of progressing from Group E.\"I think Alvaro had a great game,\" said Enrique. \"Of course we all want to take our chances, but other players had chances too.\"I think he's used to it, but of course we want to see that support from the fans.\"That's football though, it would have been nice to dedicate a win to the fans because they were fantastic for most of the game today.17 - Spain had 17 shots in tonight's draw against Sweden, their highest tally in a major tournament game (European Championships + World Cup) without scoring since having 25 attempts against Switzerland in a group stage match at the 2010 World Cup. Stalemate. #EURO2020 #ESP #SWE pic.twitter.com/BbvT0vopUn\"We are going to analyse this game in detail as we always do. But in this case I think it's really clear, we've all seen what happened this evening so there's really not too much to go into.\"We were by far the better team. The opposition tried to hang back, we completely controlled the game and tried to create as many chances as possible.\"We had sufficient chances to win the game. What went wrong? It's the fact we didn't take those chances.\"It's very clear and we all saw it.\"Asked about Sweden's defensive approach, Enrique continued: \"I don't have much of an opinion.\"The coach decided how he wanted to play, and that's completely right of course. At times you can make that decision and the other team can outdo you.\"They played the way they usually do against us with two strikers.1 - Spain completed 419 passes in the first half against Sweden, the highest figure in the opening 45 minutes of a European Championship game since we have this data available (1980). Control. #EURO2020 #ESP #SWE\"We only allowed them to have one or two chances, whereas we made the sufficient number of chances to win the game.\"But I really don't have an opinion on that, that's a question for Mr Andersson not me.\"I think we were unlucky to draw tonight. We had far more chances - that's football and we're aware of that.\"We still aspire to winning the group. If not we'll aim for second and if we can't do that we'll try to be one of the best third-placed teams.\"Sweden boss Janne Andersson was left frustrated to discover striker Marcus Berg had been abused on social media for his big missed opportunity in front of goal.Asked for his opinion on Berg receiving online criticism, Andersson replied: \"Are you joking? You're joking when you're telling me this.\"You're saying that because he missed a big chance that people are sending him threats?\"Are people being negative? Well I don't think you can be negative towards a player who worked his socks off on the pitch.\"Marcus Berg probably had the most dangerous chance of the match.\"But overall I cannot be anything other than satisfied, because we played really well and we are developing good tactical flexibility.\"I think we could certainly have lost the game but we could also have won the game. We had some chances also.\"Away from home in Spain I think they put in a fantastic performance. Spain are brutal with the ball.\"Super 6 is back for Euro 2020. Could you land the £100,000 on Sunday? Play for free, entries by 2pm.\n\n\n\n                © 2021 Sky UK\n            ", "Section": "", "Writers": "", "URL": "https://www.skysports.com/football/news/11095/12332807/luis-enrique-defends-alvaro-morata-after-missing-chances-as-spain-held-by-sweden", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}