{"Type": "", "Time": "2021-06-15", "Headline": "HK singer Karen Mok slammed by Chinese netizens for wearing Dolce & Gabbana | The Star", "Text": "\n                    Sunday, 13 Jun 2021\n                In her new music video, Karen Mok is seen wearing a bathrobe from Italian luxury brand Dolce & Gabbana. Photo: Karen Mok/VevoHong Kong singer Karen Mok has apologised after an outfit she wore in a new music video caused a backlash in China.Mok, 51, held her Karen Mok The Ultimate Grand Slam Show concert in Hong Kong over the weekend.She launched her new album The Voyage last week, which contained Woman For All Seasons, a reissue of her 2001 song of the same name.In the music video for the new song, Mok was seen wearing a bathrobe from Italian luxury brand Dolce & Gabbana (D&G).She also used the photo of her in the robe as her profile picture on Weibo, the Chinese micro-blogging site.ALSO READ: HK screen legend Kara Hui says she begged for money on the streets from age 3 to 13The move caused a backlash in China, where many had been angered by a 2018 D&G campaign they viewed as culturally insensitive.Several Chinese netizens demanded to know why Mok was promoting such a brand, while others even called for a boycott of the singer.The topic trended on Weibo for several hours on Saturday (June 12).Mok has since removed photos of her wearing the D&G outfit from her social media accounts and the music video from all platforms.Her agency and the designer involved in the outfit also apologised on Weibo.D&G caused outrage in China in late 2018 when clips from its advertising campaign showed a Chinese model in a red D&G dress struggling to eat Italian foods such as spaghetti and cannoli pastry with chopsticks.The backlash escalated after screenshots of messages sent from D&G co-founder Stefano Gabbana's Instagram account were leaked, in which he allegedly said negative things about China.Several celebrities such as singer Karry Wang and actress Dilraba Dilmurat then ended their ties with the brand. – The Straits Times/Asia News NetworkRelated stories:HK screen legend Kara Hui says she begged for money on the streets from age 3 to 13Angelababy takes legal action against netizen for saying she's dating younger singerHong Kong TVB actress Nancy Sit welcomes first grandchildBiopic on Anita Mui wraps production, lead actress still a mystery\n\nTags / Keywords:\nKaren Mok\n\n\n\nReport it to us.Thank you for your report!Copyright © 1995-\n            \n\n Star Media Group Berhad (10894D)Best viewed on Chrome browsers.{{item['V1 Header']}}\n   {{item['V1 Body']}}\n\n  {{item['V2 Header']}}\n\nWe would love to keep you posted on the latest promotion. Kindly fill the form belowWe hope you enjoy this feature!", "Section": "", "Writers": "", "URL": "https://www.thestar.com.my/lifestyle/entertainment/2021/06/13/hk-singer-karen-mok-slammed-by-chinese-netizens-for-wearing-dolce--gabbana", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}