{"Type": "World", "Time": "2021-06-15", "Headline": "US father-son duo admit helping ex-Nissan chief Ghosn flee Japan", "Text": "TOKYO: An American father-son duo admitted their role in orchestrating former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday (Jun 14).Former special forces operative Michael Taylor, 60, and his 28-year-old son Peter were extradited by United States authorities over claims that they smuggled Ghosn out of the country in a music equipment case as he awaited trial.At the Tokyo district court, the pair said that they did not contest the facts laid out by prosecutors in an indictment, effectively conceding their role in the saga.\"Is there any mistake in what the prosecutor just read?\" the judge asked each man in turn. Both replied no.Michael Taylor was led in first to the courtroom, with his hands cuffed in front of him. He wore plastic slippers, dark trousers and a white shirt with no tie.His son was brought in after, with both men wearing face masks.The pair face up to three years in prison if convicted of helping Ghosn - currently an international fugitive living in Lebanon, which has no extradition treaty with Japan.Ghosn was out on bail while awaiting trial on four counts of financial misconduct, which he denies, when he managed to slip past authorities onto a private jet, transit in Turkey and land in Lebanon.On Monday, prosecutors laid out again the almost cinematic details of the December 2019 escape, including that the Taylors hid Ghosn in a case to slip him past security at an airport.\"You helped him escape,\" said one prosecutor to the two men, who listened to proceedings through a translation earpiece.Ghosn's flight was hugely embarrassing for Japanese authorities, with US prosecutors calling it \"one of the most brazen and well-orchestrated escape acts in recent history\".US$1.3 MILLIONThe Taylors fought their extradition to Tokyo, claiming that they could face torture-like conditions, and have not commented on their case since arriving in early March.Local prosecutors declined to comment on their arraignment before the trial, but Japanese media said that both men admitted wrongdoing during questioning.Public broadcaster NHK has said that Peter received 144 million yen (US$1.3 million) from the Ghosns for their help.The Asahi Shimbun daily said that the pair spent most of the money on preparations for the escape, including the costs of chartering a private jet, claiming that they were not paid for their help.Ghosn remains at large in Lebanon, where he was questioned last month by French investigators over a series of alleged financial improprieties.Among the allegations are improper financial interactions with Renault-Nissan's distributor in Oman, payments by a Dutch subsidiary to consultants, and lavish parties organised at the Palace of Versailles.The questioning took place with his defence team and a Lebanese prosecutor present. Ghosn was heard as a witness as he would need to be in France to be formally indicted.Others involved in the Ghosn case have faced legal proceedings, including his former aide at Nissan, Greg Kelly, who is also on trial in Tokyo for his alleged role in underreporting the tycoon's income.And a Turkish court has sentenced two pilots and another employee of a small private airline to four years and two months in prison for their role in Ghosn's escape.Ghosn switched planes in Turkey on his way to Lebanon, and the three Turks were charged with involvement in a conspiracy to smuggle a migrant.A Lebanese national still at large is also suspected of orchestrating Ghosn's escape from Japan.It looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Tokyo,Japan,Carlos Ghosn,US,Nissan", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/world/carlos-ghosn-americans-accused-helping-flee-japan-15010288", "Source": "google"}