{"Type": "", "Time": "2021-06-15", "Headline": "How employee expectations of the workplace have evolved in the new normal, Jobs News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.As the Covid-19 situation in Singapore and globally continues to evolve, workplace restrictions and arrangements have to be revised accordingly to curb the spread of the virus. With more people working from home for prolonged periods of time and more organisations adopting a hybrid approach to work, expectations of physical workspaces have also changed in light of the pandemic.For one, employees now place greater emphasis on having a safe and clean working environment that mitigates the spread of viruses. While they look forward to in-person social interaction and greater collaboration with colleagues, they have tasted the benefits of remote working, including greater autonomy and work-life balance.Mr Mark Dixon, founder and CEO of IWG Plc said: “One of the lasting legacies of the pandemic will be the ability to work in different ways, in different places and more companies will have distributed workforces empowering their teams to work closer to or from home. Research has shown time and again that hybrid work is very popular with employees. They enjoy being able to work a mix of from home, at an office closer to home and occasionally from a corporate HQ.”Microsoft’s Work Trend Index also found that employees’ work-from-home (WFH) experience has changed their expectations of their workplace. The report noted that greater flexibility and understanding of employees’ needs will be key to success in a hybrid work future; Singaporean business leaders will need to focus on transforming employee experiences and their workspaces with technology in order to attract and retain talent.“Our world of hybrid work dispels long-held assumptions of how workplaces should function. It’s no longer just about getting the job done, but about creating an inclusive culture that brings together people, space and technology to foster collaboration and extreme flexibility,” said Mr Shyamol Bansal, business group lead for Surface, Microsoft Singapore.“By creating a seamless experience across offices and remote workspaces, business leaders can now build the right foundations for creating a collaborative, extremely flexible workplace that speaks to the needs of their people and inspires them to achieve more for themselves and their work.”Work is not going back to what it was – and neither should the workplace.Some companies have started to tweak office layout and design to meet evolving employee expectations – from using ultraviolet light in air-conditioning systems, to creating communal spaces that look like an extension of the living room – while some are still hesitating in the face of uncertainties.According to a recent report released by furniture maker Steelcase, employees want to return to the office but they need a workplace that’s both safe and compelling. The research found that there are five overarching categories of employee needs companies should focus on when redesigning the office experience for returning staff: safety, belonging, productivity, comfort and control.Steelcase believes that workspaces that meet these five categories of needs will sustain staff engagement, and boost productivity, innovation and social capitals. They will drive macro shifts in the overall work experience, and lead to new ways of planning and designing offices.Multiple studies involving more than 32,000 people across 10 countries were conducted to produce the report, titled Steelcase Global Report: Changing Expectations and the Future of Work.\nBusinesses will need to think about more options for individual spaces with a range of privacy and control measures such as movable screens and enclaves. PHOTO: STEELCASE\nIn a world changed by Covid-19, employees not only wish to be safe and feel safe, but they also recognise the need for comfort in all areas, from physical to cognitive and emotional. This includes wanting an office that fosters a sense of belonging and community through opportunities to socialise and work collaboratively, aspects of the workplace sorely missed in a WFH era.However, working from home has also given employees a greater degree of flexibility, autonomy and work-life balance. Being able to control where, when and how to work is something they have enjoyed, and many want such control even as they return to the office.A study participant puts it succinctly: “The thought of sitting in another beige cubicle staring at a grey wall is like a gut punch. When you do that for eight or nine hours a day, five days a week, it’s really dreary.”\nDesigners will need to look beyond the four walls and a door for collaboration spaces. PHOTO: STEELCASE\nThe good news is that decision-makers are interested in, and have embraced the mindset shift in workplace redesign.“Organisations were already rethinking the choice of furniture pre-Covid in order to create a more agile space with more mobile furniture, offering employees more control over where and how they work by allowing them to reconfigure the office on demand. The pandemic has accelerated this trend,” says Mr Uli Gwinner, president of Steelcase Asia Pacific.“This may require reinventing their workspace, but in the meantime, they can make changes to retrofit with what they have, and reconfigure it with accessible technology and products for their immediate needs.”To meet the demands of this trend, companies such as Steelcase have adapted the designs of its furniture solutions accordingly, to incorporate the latest developments in personal mobility, privacy and technology.Me + We: The needs of the individual and team have to be equally supported as both are critical to the creative process. While there are employees whose homes are conducive for working from, many are not – due to limited space or childcare distractions – and an inclusive organisation needs to provide for this group. Designers need to create spaces where both collaboration and focused work can ebb and flow seamlessly.Fixed to Fluid: Office designs of the past tended to be more formulaic and permanent. Today, the opposite is necessary and important. They need to be flexible, mobile and agile to allow the spaces to regularly morph and change as needed.Open + Enclosed: New patterns have emerged from those who returned earlier to the office. Employees who did individual work in densely packed, open-plan offices now desire more enclosure or shielding to control privacy and safety. Conversely, teams which worked in conference rooms now want to be seated in the open in the interest of safety and flexibility. Four walls and a door are no longer the default solution.Braiding Digital + Physical: Technology is now intricately connected to the work experience, especially as the hybrid work model gets rolled out. Designers have to be mindful in accommodating this to help teams avoid laptop or phone constraints. Smart, sensing technologies need to be integrated to support increasing data-driven or AI-guided experiences.Recognising the need to create spaces where collaboration and individual focused work can ebb and flow seamlessly, Steelcase has increased mobility in its designs so that workspaces can regularly morph and change as needed. This includes movable furniture, power chargers and screens, as well as modular walls and pods in place of doors and walls, that allow for a quick reconfiguration of spaces.“Technology is also now intricately connected to the work experience, especially with the rollout of hybrid work models. For Steelcase, this means offering products that help braid digital and physical, such as large-scale collaboration tools in partnership with Microsoft, as well as data-driven space management solutions,” says Mr Gwinner.To help companies see the value of reconfiguring workspaces, Steelcase also provides organisations with Workplace Advisor Study. Using software programmes and hardware devices, such as RoomWizard, its advisers help track occupancy and utilisation of office spaces before offering leaders and decision-makers insight into space usage patterns over time.“According to our research findings, the hybrid working model is an emerging trend [...] Ultimately this will lead to a change in the purpose of the office in the long-term,” says Mr Gwinner.Read the Steelcase Global Report here.Click here to explore Steelcase’s solutions to reinvent your workspace.\nMultiple studies involving more than 32,000 people across 10 countries were conducted to produce the Steelcase Global Report: Changing Expectations and the Future of Work. PHOTO: STEELCASE\nJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/singapore/jobs/hybrid-model-workplace-redesign", "Source": "google"}