{"Type": "Asia", "Time": "2021-06-15", "Headline": "Masks off, mortarboards on: Wuhan graduates celebrate 18 months after COVID-19 outbreak in city", "Text": "BEIJING: A huge red banner welcomed more than 11,000 students in Wuhan for a massive graduation ceremony more than a year after the city was battered by the first global outbreak of COVID-19.Students in navy gowns and mortarboards sat in crowded rows, without social distancing or face masks, beneath the sign that read: \"Welcoming the graduates of 2020 back home. We wish you all a great future.\"COVID-19 first emerged in late 2019 in Wuhan, capital of central China's Hubei province, sending the city of 11 million into one of the world's strictest lockdowns.Restrictions were not eased until April when the city started to re-open after 76 days of it being closed off, although schools remained shut for longer.The city held limited graduation ceremonies last year, with Wuhan University hosting a mostly online event in June last year, with the students and teachers who did attend all in masks.More than 2,200 people at Sunday's (Jun 13) ceremony were graduates who could not attend their graduation last year due to tight virus restrictions.China has since largely contained the outbreak while keeping precautions high, including tight border controls, quarantines, mandatory online \"health codes\" and varying restrictions on domestic travel.There were 20 new cases on Tuesday, including 18 imported from overseas and two in a local outbreak in southern Guangdong province.There have been 4,636 deaths officially reported, the majority in Wuhan.Quoting a line of ancient Chinese poetry, the banner offered students advice for the future: \"The ocean is boundless for leaping fish.\"Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,China,Wuhan", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/asia/covid-19-china-wuhan-mass-graduation-11000-students-crowd-15017774", "Source": "google"}