{"Type": "", "Time": "2021-06-15", "Headline": "Malaysia’s daily Covid-19 cases fall below 5,000-mark, Latest World News - The New Paper", "Text": "PETALING JAYA Malaysia's new Covid-19 cases dipped below 5,000 yesterday.The country recorded 4,949, cases, bringing the total to 662,457 cases.There were 60 deaths, taking the toll to 3,968.Senior Minister Ismail Sabri Yaakob said there has been a 20 per cent drop in cases in the last seven days compared with previous weeks.He said: \"This is a relief for the people, following the surge in cases before this. Hopefully, the people will not be complacent and will continue to adhere to standard operating procedures (curbs), to ensure that we can flatten the curve.\"Meanwhile, Indonesia said it expects a new wave of coronavirus infections to peak early next month as the highly transmissible Delta variant becomes more dominant in some areas.Covid-19 infections have been on the rise in recent weeks since holidays at the end of the Muslim fasting month, when millions flouted restrictions to travel across the archipelago.The Delta variant was now \"more dominant\" in areas such as Jakarta and other parts of Java, Health Minister Budi Gunadi Sadikin said yesterday.On Sunday, Jakarta Governor Anies Baswedan said hospital occupancy rates in the city of 10 million had hit 75 per cent and infections jumped by 50 per cent in the past week, and if the situation gets worse, the authorities may have to consider reimposing coronavirus restrictions.\"The capital is in need of extra attention,\" Mr Anies said in a statement posted on Facebook.\"If the condition gets out of control, we will enter an acute phase.\"Indonesia has reported more than 1.9 million virus infections and 53,116 deaths.On Sunday, Indonesia reported almost 10,000 cases, the highest since February.In Bangkok, inoculation appointments set for this week were postponed due to delays in vaccine deliveries to various hospitals.Officials sought to reassure the public over vaccine supplies.\"There may have been confusion because private hospitals did not check with the Bangkok administration,\" Public Health Minister Anutin Charnvirakul said yesterday, adding that more doses were being delivered to Bangkok.Thailand has recorded 199,264 cases and 1,466 deaths since the pandemic began. - THE STAR, REUTERSGet The New Paper on your phone with the free TNP app. Download from the Apple App Store or Google Play Store now", "Section": "", "Writers": "", "URL": "https://www.tnp.sg/news/world/malaysias-daily-covid-19-cases-fall-below-5000-mark", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}