{"Type": "", "Time": "2021-06-15", "Headline": "New Covid cluster at Bukit Merah View Hawker Market and Food Centre formed by elderly working there - The Online Citizen Asia", "Text": "Image from Google MapsIt was reported in the media today (14 Jun) that a new COVID-19 cluster has been formed at 115 Bukit Merah View Market and Food Centre. Mandatory testing has started for all the stallholders at the hawker centre and market.A concerned Bukit Merah resident, Mdm Lim, 60, who visited the market yesterday (13 Jun) told the media, “I’m not worried about getting Covid-19. I feel fine, I don’t have any symptoms, but testing would give me some assurance because my job requires me to visit clients.”Tanjong Pagar GRC MP Joan Pereira said, “There are many elderly living in the area, and their children have also written to me as they are worried.”“I have asked them to continue monitoring their health closely and see a doctor immediately if unwell, and minimise physical interactions,” she added. They are also offered free testing by MOH, she said.All staff and tenants who had been working at the market from May 25 have already been quarantined and will be swabbed. The cluster now has six cases, after four cases were linked to it yesterday.MOH said, “Our epidemiological investigations have found that there is likely ongoing transmission among individuals who work at the location.”The four new cases comprise a 50-year-old man who is a conservancy worker, a 72-year-old man who works at a sundry shop, a 67-year-old woman who works as a food stall vendor, and a 65-year-old male food stall vendor.All four are close contacts of a 74-year-old man who also works at a sundry store in the market. Earlier, an 82-year-old Singaporean elderly woman who works at the market has already been detected with COVID-19.Affected self-employed individuals can tap MOH’s Quarantine Order Allowance Scheme, which provides a $100 per day assistance to them.In any case, it is unfortunate to see numerous elderly still working in their twilight years to support themselves.Some elderly has resorted to seeking the Commissioner for the Maintenance of Parents (CMP) to force their children to pay up so that they can get by.The Commissioner for the Maintenance of Parents (CMP), Mr Khoo Oon Soo, was reported to have attended to 98 seniors last year – down from 143 the year before and almost a third of the 286 in 2011.Among those who sought the commissioner’s help last year was a 68-year-old man. While he had CPF savings and Silver Support payouts, among other things, it was insufficient for him to survive in Singapore with the cost of living inching up.The Commissioner located his son, who said his father did not support him when he was young. Still, the son decided to give his father $200 a month and did not resent his father for his past failings.A Ministry of Social and Family Development (MSF) spokesman was quoted by Straits Times saying that the drop in numbers of elders seeking help is due to more of the younger seniors are “financially able” and better prepared for retirement through the use of their Central Provident Fund and personal savings.But according to what TOC understands in some cases, the children broke ties with the parents after being forced to pay a token sum due to the poor financial standing of the children.Furthermore, according to a study from the Lee Kuan Yew School of Public Policy (LKYSPP), an older Singaporean above 65 years old would need $1,379 a month in 2018 to meet his or her basic needs.In December 2018, there were about 268,000 CPF members aged 65 and above who received retirement payouts from either the CPF LIFE or Retirement Sum Scheme.According to data as of June 2020, there were 229,400 residents who are aged 65-69. The number of CPF Members who received payouts in Dec 2018, seems to be rather low in comparison.What about the other 113,400 residents who are not receiving payouts? If they are not receiving any, is it because their CPF has been exhausted?Similarly there were 261,000 residents aged 70-79,  however, there were only 130,000 who are receiving CPF payouts.Even with the payouts, one will find it hard to meet the sum of $1,379 for their basic needs. © 2006 - 2021 The Online Citizen© 2006 - 2021 The Online Citizen", "Section": "", "Writers": "", "URL": "https://www.theonlinecitizen.com/2021/06/14/new-covid-cluster-at-bukit-merah-view-hawker-market-and-food-centre-formed-by-elderly-working-there/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}