{"Type": "", "Time": "2021-06-15", "Headline": "China hits out at G-7 'manipulation' following Xinjiang, HK criticism, East Asia News & Top Stories - The Straits Times", "Text": "Read 3 articles daily and stand to win ST rewards, including the ST News Tablet worth $398.Spin the wheel for ST Read and Win now.BEIJING • China has accused the Group of Seven (G-7) of \"political manipulation\" after it criticised Beijing over its human rights record in Xinjiang and Hong Kong.In a communique after their summit, G-7 leaders slammed China over abuses against minorities in Xinjiang and pro-democracy activists in Hong Kong, while United States President Joe Biden called for Beijing to \"start acting more responsibly in terms of international norms on human rights\".The Chinese embassy in Britain responded angrily yesterday, and accused the G-7 of \"interfering\".\"The G-7 takes advantage of Xinjiang-related issues to engage in political manipulation and interfere in China's internal affairs, which we firmly oppose,\" an embassy spokesman said in a statement.It also accused the G-7 of \"lies, rumours and baseless accusations\".Human rights groups have criticised China's human rights record in the treatment of Uighurs, a Muslim ethnic minority in Xinjiang.China has denied allegations that it is waging \"genocide\" by forcing Uighurs and people from other ethnic-Turkic minorities into internment camps in Xinjiang.At the summit, leaders of the seven wealthy nations announced a number of pledges on Covid-19 vaccinations, climate change, rights and trade.They also called for a new investigation in China into the origins of Covid-19 - prompting a response from the Chinese embassy saying the work needs to be done in a \"scientific, objective and fair manner\", without agreeing to a new probe.\"The current epidemic is still raging around the world, and the traceability work should be carried out by global scientists and should not be politicised,\" the embassy said.The coronavirus was first reported in central China in late 2019, and the World Health Organisation sent a team of international experts in January to probe its origins.But their long-delayed report published in March drew no firm conclusions, and the investigation has since faced criticism for lacking transparency and access.The G-7 also announced a new infrastructure fund that Mr Biden said would be \"much more equitable\" than China's Belt and Road Initiative.The Chinese embassy said in response that the \"accusations against China on economic and trade issues in the communique are inconsistent with the facts and are unreasonable\".AGENCE FRANCE-PRESSEJoin ST's Telegram channel here and get the latest breaking news delivered to you.SPH Digital News / Copyright © 2021 Singapore Press Holdings Ltd. Co. Regn. No. 198402868E. All rights reservedWe have been experiencing some problems with subscriber log-ins and apologise for the inconvenience caused. Until we resolve the issues, subscribers need not log in to access ST Digital articles. But a log-in is still required for our PDFs.", "Section": "", "Writers": "", "MainKeyWord": "", "AdditionalKeyWord": "", "URL": "https://www.straitstimes.com/asia/east-asia/china-hits-out-at-g-7-manipulation-following-xinjiang-hk-criticism", "Source": "google"}