{"Type": "", "Time": "2021-06-15", "Headline": "Karen Mok suffers backlash for wearing Dolce and Gabbana - The Independent Singapore News", "Text": "Anger against the Italian brand in ChinaAuthorDateCategoryHong Kong — Hong Kong singer Karen Mok suffered a backlash in China because of an outfit she wore in a new music video. She has since apologised for her actions. Over the weekend, the 51-year-old singer held her Karen Mok The Ultimate Grand Slam Show concert in Hong Kong. Last week, Mok launched her latest album, The Voyage, which contained Woman For All Seasons, a reissue of her 2001 song of the same name.Mok was seen wearing a bathrobe from the Italian luxury brand Dolce & Gabbana (D&G) in the music video for the new song. She also used the photo of her in the robe as her profile picture on Weibo, the Chinese micro-blogging site. This caused a backlash in China, where many had been angered by a 2018 D&G campaign they viewed as culturally insensitive.Karen Mok removed photos of her wearing the outfit from her socials and all platforms. Picture: InstagramSome Chinese netizens demanded to know why the singer was promoting the brand while others even called for a boycott of Mok. On Saturday (June 12), the topic trended on Weibo for several hours. The singer has since removed photos of her wearing the Dolce & Gabbana outfit from her social media accounts and the music video from all platforms, reported The Straits Times. Mok’s agency and designer, who were involved in the choice of the outfit, have also apologised on Weibo.In late 2018, D&G caused an uproar in China when footage from its advertising campaign showed a Chinese model in a red D&G dress struggling to eat Italian foods such as spaghetti and cannoli pastry with chopsticks.The issue escalated after screenshots of messages sent from D&G co-founder Stefano Gabbana’s Instagram account were leaked, in which he allegedly said negative things about China. Following that incident, several celebrities such as singer Karry Wang and actress Dilraba Dilmurat ended their ties with the brand.Born on June 2, 1970, Karen Joy Morris, known popularly as Karen Mok is a leading Asian pop singer and actress with a career spanning three decades. She was the first female Hong Kong singer to win the Golden Melody Award and has won it a total of three times. She has released 17 solo studio albums, starred in over 40 movies, has over 15 million followers on leading Chinese social media site Weibo and holds the Guinness World Record for the Highest Altitude Music Concert./TISGFollow us on Social MediaSend in your scoops to news@theindependent.sg Send in your scoops to news@theindependent.sg ", "Section": "", "Writers": "", "URL": "https://theindependent.sg/karen-mok-suffers-backlash-for-wearing-dolce-and-gabbana/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}