{"Type": "", "Time": "2021-06-15", "Headline": "COVID-19: N.B. nears its first-dose vaccination target, 2nd dose eligibility expands - New Brunswick | Globalnews.ca", "Text": "Want to discuss? Please read our Commenting Policy first.New Brunswick announced that the province is close to the 75 per cent first-dose vaccination target necessary in order to begin loosening pandemic restrictions.The rate currently stands at 74.8 per cent.According to the province, another 1,345 people need to receive their first dose to reach the vaccination target for Phase 1 of the reopening plan.In the meantime, beginning Monday, anyone who received their first dose of a vaccine prior to May 1 can book an appointment for their second dose through a participating pharmacy or at a Vitalité or Horizon health network clinic.READ MORE: COVID-19: N.B. ‘closing in’ on vaccination goal to begin loosening restrictionsThe province said eligibility for second-dose vaccinations will be extended to everyone on June 21, the, as long as at least 28 days has passed since their first dose.To receive their second vaccine dose, New Brunswickers are asked to bring a signed consent form, their Medicare card and a copy of the record of immunization provided after receiving their first dose.“If possible, residents are asked to book an appointment at the same pharmacy or clinic at which they received their first dose,” the province said in a news release.Public Health has also declared that an outbreak is over at Villa Maria, a nursing home in Saint-Louis de Kent in Zone 1 (Moncton region).There was some confusion that caused a stir at Monday’s clinic at the Moncton Coliseum.Dr. Karen Melanson of Vitalité Health Network, who was working at the clinic, said several people arrived for second doses anticipating a Pfizer vaccine, but only Moderna was available.Melanson said that meant taking some time to educate some about the two vaccines, which are considered interchangeable.“I think it’s a situation where education is very important,” Melanson said. “I believe I had one person who refused vaccination and wanted to have the exact same one.”Department of Health spokesperson Gail Harding said the province updated its booking system Friday to allow people to see which vaccine they are scheduled to receive when booking appointments.Public Health reported one new case of COVID-19 on Monday.The one case in Zone 6 (Bathurst region) is a person in their 50s and is a contact of a previous case.The number of confirmed cases in New Brunswick is 2,299. Since Sunday, eight people have recovered for a total of 2,163 recoveries.There have been 45 deaths, and the number of active cases is 90.Seven patients in total are hospitalized. Six patients are hospitalized in New Brunswick, including two in an intensive care unit. One patient is hospitalized out of province in an intensive care unit.On Sunday, 620 tests were conducted for a total of 351,388.— With a file from Tim Roszell Get a roundup of the most important and intriguing stories, delivered to your inboxGet a roundup of the most important and intriguing stories, delivered to your inbox", "Section": "", "Writers": "", "URL": "https://globalnews.ca/news/7948310/nb-covid-19-update-june-14/", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}