{"Type": "Singapore", "Time": "2021-06-15", "Headline": "Cleaner at ION Orchard among 9 new COVID-19 community cases; tugboat cluster identified", "Text": "SINGAPORE: Singapore reported nine new COVID-19 infections in the community as of noon on Saturday (Jun 12), including five with no links to previous cases.Four were linked to previous cases, with three already in quarantine and one detected through surveillance, said the Ministry of Health (MOH).The ministry had earlier reported 12 community infections, but it said in its latest update that three cases were negative for COVID-19 upon further tests.ION ORCHARD CLEANER TESTS POSITIVEA cleaner at ION Orchard, which has beenshut for four days for deep cleaning, is among the five unlinked cases.The 45-year-old Chinese national is employed by Hong Ye Group.She is asymptomatic and her infection was detected when she went for a COVID-19 test directed by her employer.MOH had announced on Friday that all staff and tenants who worked at the ION Orchard from May 28 to Jun 11 must be tested after three cases were linked to the mall.OTHER UNLINKED CASESThe remaining four unlinked cases are a student at SIM Global Education, a foreign domestic worker from Myanmar, a land rigger at Jurong Port and a landscape gardener.The SIM Global Education student, an 18-year-old Singaporean, was last in school on May 24.She developed a runny nose and fever on Thursday and sought medical treatment at a clinic on Friday when she was tested.The Myanmar maid, 27, had a fever on Thursday and went to a clinic on Friday.The land rigger at Jurong Port is a 57-year-old Malaysian man who is fully vaccinated. He is asymptomatic and his infection was detected on Thursday through rostered routine testing.He was immediately isolated when his antigen rapid test (ART) result was positive. His PCR test came back positive for COVID-19 on Friday.His Ct value was very high, which is indicative of a low viral load. Another test taken on Saturday came back negative, said MOH.\"He is likely to be shedding minute fragments of the virus RNA, which are no longer transmissible and infective to others, but we have taken all necessary public health actions,\" the ministry added.The remaining unlinked infection involves a 68-year-old Singaporean man who works as a landscape gardener at Amozonia Landscape.He developed a runny nose and cough on Tuesday and sought treatment at a clinic on Friday. He has also been vaccinated against COVID-19.NEW TUGBOAT CLUSTERA new cluster has been identified after two more workers on board tugboat Marina Ariel tested positive for COVID-19. They were both identified as a workplace contact of Case 64149, whotested positive on Friday.The two new cases - 64180 and 64181 - are Indonesian men aged 40 and 38, respectively.Both developed a cough and fever before they were quarantined but did not seek medical attention.They were placed on quarantine on Friday, after being identified as a workplace contact of the first case. They reported their symptoms on the same day and were taken to a hospital to be tested.OTHER LINKED CASESOne case was linked to a cluster involving household contacts of Case 63399, a kitchen crew member at Kota Zheng Zong Bak Kut Teh (Serangoon Gardens). Case 63399 tested positive for COVID-19 on May 17.The latest case in this cluster is a 35-year-old Malaysian woman who works as an administrative staff member at Ces Lamination. She was placed on quarantine on May 17.She developed a runny nose on Thursday during quarantine but did not report it until Friday.Another new case was detected through surveillance. She is an 82-year-old Singaporean woman who regularly helps out at a sundry store at 115 Bukit Merah View Market & Hawker Centre.She developed a fever and shortness of breath on Thursday and sought treatment at a polyclinic on Friday. She has been vaccinated against COVID-19.IMPORTED CASESThere were also nine imported cases, taking Singapore's daily count on Saturday to 18.They comprise six Singaporeans and three permanent residents who returned from India, Portugal, Russia, Thailand, the UK and the US.All of them were placed on stay-home notice upon arrival in Singapore.Thirty-nine more COVID-19 cases have been discharged from hospitals or community isolation facilities, taking the total recoveries to 61,838.There are 125 cases who are still in hospital, most of whom are stable or improving, with one in critical condition in the intensive care unit.Another 266 cases are isolated and cared for at community facilities.Overall, the number of new cases in the community has decreased from 129 cases in the week before to 32 in the past week, said MOH. Unlinked community cases have also decreased from 20 cases in the week before to 14 in the past week.Among the 87 confirmed cases reported from Jun 6 to Saturday, 46 cases have tested positive for their serology tests, 25 tested negative, while 16 are pending.As of Saturday, Singapore has reported 62,263 COVID-19 cases and 34 fatalities.Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "Coronavirus,COVID-19,MOH", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/covid-19-community-cases-singapore-moh-jun-12-14999480", "Source": "google"}