{"Type": "", "Time": "2021-06-15", "Headline": "COVID-19: Singapore reports 13 new cases, 10 from community", "Text": "SINGAPORE — The Ministry of Health (MOH) on Sunday (13 June) confirmed 13 new cases of COVID-19 infection in Singapore, taking the country's total case count to 62,276.Of the new cases, 10 are community transmissions with eight linked to past cases, said MOH in a news release. Five of the community cases have already been placed on quarantine, while three were detected through surveillance. The remaining two community cases are unlinked. There are no new cases from the migrant worker dormitories.MOH also reported three imported cases, all of whom have been placed on Stay-Home Notice since their arrival in Singapore.Of the 13 new cases, seven are asymptomatic, and were detected from screening and surveillance, while six were symptomatic.Overall, the number of new cases in the community has decreased from 116 cases in the week before to 36 cases in the past week. The number of unlinked cases in the community has also fallen from 17 cases in the week before to 15 cases in the past week.The two unlinked cases are a 23-year-old fully vaccinated male India national who works as a nursing aide at All Saints Home (Hougang) and a 27-year-old male India national who works as an engineer at Ecoxplore. The latter case is the source of a new cluster named after his case number.There are four cases linked to the new cluster. They are:a 50-year-old Bangladeshi man who is employed by Theng Liang Lee Services as a conservancy worker at 115 Bukit Merah View Market & Food Centre.a 72-year-old Singaporean man who is fully vaccinated and works at a sundry shop at the location.a 67-year-old Singaporean woman who is fully vaccinated and a food stall vendor at the location.a 65-year-old Singaporean man who is fully vaccinated and a food stall vendor at the location.The food centre is closed to all members of the public for three days from Sunday to 15 June, as MOH's epidemiological investigations have found that there is likely ongoing transmission among individuals who work at the location.All staff and tenants who have been working at the location from 25 May have been placed on quarantine, and will be tested during quarantine. In order to disrupt any wider, undetected community transmission, MOH will conduct special testing operations for all staff and tenants who have been working in 116 Bukit Merah View from 25 May. MOH will also extend free COVID-19 testing to members of the public who had visited the shops at 115 and 116 Bukit Merah View between 25 May and 12 June.There are two new cases linked to the cluster, named after the case number of the 27-year-old male India national who works at Ecoxplore.They are a 19-year-old Singaporean woman who works as a warehouse assistant at DHL Express (Singapore) and a 39-year-old Singaporean woman who is employed by Cleen First Services as a cleaner at Emerald Park condominium. Both are household contacts and family members to each another. They are household contacts of the male India national.Two cases are linked and not part of a cluster. One of them is a 59-year-old Singaporean woman who works as a part-time cleaner at Crystal Lodge and is a close contact of a previous case. The other is a 66-year-old Singaporean man who is a retiree, and a family member of a previous case. Of the three imported cases, two are Singapore permanent residents who returned from India, and one is a work permit holder who arrived from Indonesia and is a foreign domestic worker.With 31 more patients discharged from hospitals or community isolation facilities on Sunday, 61,869 cases – or 99.3 per cent of the total – have fully recovered from the infection.Most of the 130 hospitalised cases are stable or improving, while one of them is in critical condition in the intensive care unit.A total of 243 patients – with mild symptoms or are clinically well but still test positive – are isolated and cared for at community facilities.Apart from the 34 patients who have died from COVID-19 complications, 15 others who tested positive for the virus were determined to have died from unrelated causes, including three whose deaths were attributed to a heart attack and another four, whose deaths were attributed to coronary heart disease.Among the 80 confirmed cases reported from 7 to 13 June, 44 cases have tested positive for their serology tests, 27 have tested negative, and nine serology test results are pending.Stay in the know on-the-go: Join Yahoo Singapore's Telegram channel at http://t.me/YahooSingaporeMore Singapore stories:COVID: Social gathering size can increase to 5 per group from 14 June – MTFCOVID: Dine-in at F&B places can resume at max 5 per group from 21 JuneWork-from-home remains default arrangement in Singapore's Phase 3 (HA)4 COVID ART test kits on sale at 3 Singapore pharmacies from 16 June: MTFDickson Yeo, the Singaporean man who was jailed in the US for spying for China and was arrested by the Internal Security Department upon his return to Singapore in December will be continue to be detained under the Internal Security Act.Reigning champions Portugal begin their defence of the trophy against Hungary at Euro 2020 in Budapest on Tuesday as World Cup holders France take on Germany in a hotly-anticipated clash between two of the continent's heavyweights.An ex-naval officer charged for not wearing a mask in numerous places returned to court again on Tuesday (15 June) claiming that it was not possible for her to have a fair hearing due to previous cases involving the Singapore Armed Forces.Singtel GOMO and StarHub giga are pulling out all the stops in their clash for young mobile users, but which telco offers better value? With their bright colours and cartoonish aesthetics, you might think that GOMO and giga are trendy new start-ups in the popular […] The post Singtel GOMO vs StarHub giga: Cost Comparison Guide 2021 appeared first on SingSaver Blog - We Compare, You Save.A nurse accused of neglect in Diego Maradona's death told Argentine prosecutors on Monday that he was following orders \"not to disturb\" the football icon while he slept.US President Joe Biden will seek the EU's backing on Tuesday to face the rise of China, but Brussels wants a swift end to lingering trade rows and a clean break from Donald Trump.Spain opened their Euro 2020 campaign with a goalless draw against Sweden in Seville on Monday after their preparations were badly affected by Covid-19, while Patrik Schick scored one of the championship's great goals in the Czech Republic's 2-0 win over Scotland.The Ministry of Health (MOH) on Monday (14 June) confirmed 25 new COVID-19 cases in Singapore, taking the country's total case count to 62,301.Here are three growing businesses that should be cheap enough to add to your investment watchlist. The post 3 Undervalued Gems That You Can Add to Your Watchlist appeared first on The Smart Investor.Elon Musk tweeted that he’s decided to sell his last remaining house a week after a report said he and others billionaires paid little or no income taxes for several years.Beijing on Tuesday accused NATO of exaggerating the threat from China and \"creating confrontation\", after a vow from the Western allies to work together to counter the \"systemic challenges\" posed by its policies.The Copa America that almost never was opened Sunday in Brazil, overshadowed by the desperate search for a last-minute host, sponsor withdrawals and Covid-19 -- including outbreaks on three teams.Anti-junta protesters flooded Myanmar's social media with pictures of themselves wearing black on Sunday in a show of solidarity with the Rohingya, a minority group that is among the most persecuted in the country.With its property development arm now privatised, CapitaLand is seeking new grounds with a sharpened focus on investment management. Here’s what investors should know about the move. In March this year, CapitaLand, known for putting a shopping mall in every possible neighbourhood estate (and somehow […] The post CapitaLand Dividends & Share Price Guide: Is It Worth Buying? appeared first on SingSaver Blog - We Compare, You Save.At least 12 people were killed and nearly 140 others injured when a gas line exploded in a residential compound in central China's Hubei province on Sunday, local officials said.The first crew for China's new space station prepared to blast off this week for the latest step in Beijing's ambitious programme to establish itself as a space power.Switzerland on Sunday rejected proposals that would have made it the first European country to ban synthetic pesticides following a bitterly fought campaign.Major US indices finished at fresh records Monday as global equity markets began the week cautiously ahead of a much-anticipated Federal Reserve meeting.Owner-occupiers, landlords and tenants, a heads up: These are some of the hottest home insurance promotions in the house right now. Are you an owner-occupier, landlord, or tenant? Regardless which one you are, you will benefit from home insurance. As we’ve discussed in our comprehensive […] The post Home Insurance Promotions And Discounts To Protect Your Home appeared first on SingSaver Blog - We Compare, You Save.An American father-son duo admitted to helping orchestrate former Nissan chief Carlos Ghosn's audacious escape from Japan as they made their first appearance before a Tokyo court on Monday.", "Section": "", "Writers": "", "URL": "https://sg.news.yahoo.com/singapore-13-new-covid-19-cases-10-community-073830216.html", "MainKeyWord": "", "AdditionalKeyWord": "", "Source": "google"}