{"Type": "Singapore", "Time": "2021-06-15", "Headline": "Lower primary, lower secondary students to continue with home-based learning after June holidays", "Text": "Primary 1 to 3 students will stay home for one week when Term 3 begins on Jun 28 while Secondary 1 to 2 students will have lessons from home for the first three days.SINGAPORE: All Primary 1 to 3 students will continue with full home-based learning for the first week of Term 3 from Jun 28, the Ministry of Education (MOE) announced on Monday (Jun 14).Secondary 1 and 2 students will also be on home-based learning for three days, until Jun 30, and will return to school from Jul 1, the Education Ministry said in a press release.Primary 4 to 6 and Secondary 3 to 5 students, as well as all junior college and Millennia Institute students will return to school from Jun 28, the press release read.Following that, all students from all levels will return to school from Jul 6, which is a Tuesday. Monday, Jul 5 is Youth Day, a school holiday.These arrangements have been made to “ease into full resumption of school” when Term 3 begins on Jun 28, MOE said in the release.\"Due to the increase in COVID19 community cases, we made the transition to full Home-Based Learning (HBL) at the end of Term 2,\" wrote Education Minister Chan Chun Sing on Facebook following Monday's announcement.\"However, I know for most teachers and students, nothing beats going back to school – having learning take place face-to-face and being able to interact and share experiences with fellow classmates.\"Adding that MOE is \"making good progress\" with thestudent vaccination programme, he said one in three students has already received the first dose of the COVID-19 vaccine.\"Going forward, we must combine vaccination with increased testing and rapid isolation of potential infection clusters to keep our schools open and safe,\" he wrote in the post.For students in special education schools, their return to school will be staggered from Jun 28 “based on students’ needs”. All students will also be back in school from Jul 6.MOE kindergartens and school-based student care centres will be fully open from Jun 28 to “facilitate care arrangements”, said MOE.In-person co-curricular activities (CCAs) will gradually resume from the second week of Term 3, starting with “low-risk activities”, said MOE in the press release.“Given the need to minimise intermingling of students from different schools in line with the gradual resumption of student activities, the National School Games for Junior and C Divisions as well as the remaining games for A Division will be cancelled.”As for centre-based classes like those for third languages as well as art and music elective programmes, graduating students will resume in-person lessons from the first week of Term 3, said MOE.Non-graduating students will continue with home-based learning until centre-based classes resume in-person lessons for all students from Week 2.Institutes of higher learning will “progressively increase” the number of students allowed back on campus for in-person learning.From Jun 21, classes in small groups or consultations that were previously conducted online can resume on campus, said MOE in the press release.Essential in-person sessions like labs and practicals can continue to be held on campus, and in-person examinations will also continue with no more than 50 people per venue. Classes and lectures with more than 50 people will continue online, said MOE in the release.All private education institutions are “strongly encouraged” to refer to the measures for schools and institutes of higher learning and decide if they wish to adopt measures that are tighter than those in place at the national level, said MOE.All tuition and enrichment classes for children 18 and below can resume in-person lessons from Jun 21. These centres, as well as sports, arts and culture classes should adhere to the latest guidelines from MOE as well as SportSG and the National Arts Council respectively, the press release read.“MOE strongly urges all parents and students to play their part by continuing to be socially responsible, to minimise the risk of COVID-19 infection in our educational institutions. It is crucial that all students and staff continue to adhere to screening measures and practise good personal hygiene,” said the Education Ministry in the press release.Adding that students and staff should see a doctor and not come to school if they feel unwell, MOE noted that parents should keep children at home if there are other household members who have flu-like symptoms.Children can return to school if their household members test negative for COVID-19, said MOE.“MOE will continue to monitor the situation closely and make adjustments in accordance with the national posture.”Downloadour appor subscribe to our Telegram channel for the latest updates on the coronavirus outbreak:https://cna.asia/telegramIt looks like the email address you entered is not valid.", "Section": "", "Writers": "", "MainKeyWord": "COVID-19,coronavirus,education,MOE,Ministry of Education", "AdditionalKeyWord": "", "URL": "https://www.channelnewsasia.com/news/singapore/covid-19-term-3-hbl-p1-to-p3-secondary-school-jc-students-15011504", "Source": "google"}